#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНаОснованииИзмененияЦен(ИзменениеЦен, МассивТиповЦен, ПроводитьДокументы, Статистика = Неопределено, Параметры = Неопределено) Экспорт 
	БезПараметров = Ложь;
	
	Если Статистика = Неопределено Тогда 
		Статистика = Новый Структура;
	КонецЕсли;	
	Статистика.Вставить("Создано", 0);
	Статистика.Вставить("СОшибками", 0);
	
	Если Не Параметры = Неопределено Тогда
		БезПараметров = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивТиповЦен", МассивТиповЦен);

	Если ТипЗнч(ИзменениеЦен) = Тип("ДокументСсылка.ИзменениеЦен") Тогда
		Запрос.УстановитьПараметр("Ссылка", ИзменениеЦен);
		Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеЦен.Ссылка КАК ДокументОснование,
	               |	ИзменениеЦен.Организация КАК Организация,
	               |	ИзменениеЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ИзменениеЦен.КурсДокумента КАК КурсДокумента,
	               |	ИзменениеЦен.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		НоваяЦена КАК ЦенаБазовая
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ИзменениеЦен КАК ИзменениеЦен
	               |ГДЕ
	               |	ИзменениеЦен.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТипыЦен.Ссылка КАК ТипЦен,
	               |	ТипыЦен.БазовыйТипЦен КАК БазовыйТипЦен,
	               |	ТипыЦен.ВалютаЦены КАК ВалютаДокумента,
	               |	ТипыЦен.ВариантОкругления КАК ВариантОкругления,
	               |	ТипыЦен.Точность КАК Точность,
	               |	ТипыЦен.ПравилоРасчета КАК ПравилоРасчета
	               |ИЗ
	               |	Справочник.ТипыЦен КАК ТипыЦен
	               |ГДЕ
	               |	ТипыЦен.Ссылка В(&МассивТиповЦен)";

	Иначе 
	Запрос.УстановитьПараметр("Ссылка", ИзменениеЦен);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколСогласованияЦен.Ссылка КАК ДокументОснование,
	               |	ПротоколСогласованияЦен.Организация КАК Организация,
	               |	ПротоколСогласованияЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ПротоколСогласованияЦен.КурсДокумента КАК КурсДокумента,
	               |	ПротоколСогласованияЦен.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		Цена КАК ЦенаБазовая
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ПротоколСогласованияЦен КАК ПротоколСогласованияЦен
	               |ГДЕ
	               |	ПротоколСогласованияЦен.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТипыЦен.Ссылка КАК ТипЦен,
	               |	ТипыЦен.БазовыйТипЦен КАК БазовыйТипЦен,
	               |	ТипыЦен.ВалютаЦены КАК ВалютаДокумента,
	               |	ТипыЦен.ВариантОкругления КАК ВариантОкругления,
	               |	ТипыЦен.Точность КАК Точность,
	               |	ТипыЦен.ПравилоРасчета КАК ПравилоРасчета
	               |ИЗ
	               |	Справочник.ТипыЦен КАК ТипыЦен
	               |ГДЕ
	               |	ТипыЦен.Ссылка В(&МассивТиповЦен)";
	КонецЕсли;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РеквизитыИзменениеЦен = МассивРезультатов[0].Выбрать();
	
	СтруктураРеквизитов = Новый Структура("ДокументОснование, Организация, ПодразделениеКомпании, КурсДокумента");	
	
	РеквизитыИзменениеЦен.Следующий();	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, РеквизитыИзменениеЦен);
	
	СтруктураРеквизитов.Вставить("Дата", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ДатаНачалаДействия", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ХозОперация", ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен"));
	
	ТаблицаТовары = РеквизитыИзменениеЦен.Товары.Выгрузить();
	
	Если ТаблицаТовары.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	РежимЗаписи = ?(ПроводитьДокументы, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	
	ВыборкаТипыЦен = МассивРезультатов[1].Выбрать();
	Пока ВыборкаТипыЦен.Следующий() Цикл 
		
		СтруктураТипаЦен = Новый Структура("ТипЦен, БазовыйТипЦен, ВалютаДокумента");
		ЗаполнитьЗначенияСвойств(СтруктураТипаЦен, ВыборкаТипыЦен);
		
		Если БезПараметров Тогда
			ОкруглятьДо = Параметры.ОкруглятьДо;
		Иначе
			ОкруглятьДо =  1 / Pow(10, ВыборкаТипыЦен.Точность);
		КонецЕсли;
				
		СтруктураТипаЦен.Вставить("ОкруглятьДо",ОкруглятьДо);
		
		
		ПараметрыОкргуления = Новый Структура;
		Если НЕ ОкруглятьДо = 0 Тогда
			Если ОкруглятьДо = 0.9 Тогда
				ПараметрыОкргуления.Вставить("ОкруглятьДо", 1);
			Иначе
				ПараметрыОкргуления.Вставить("ОкруглятьДо", ОкруглятьДо);
			КонецЕсли;
		КонецЕсли;
		ПараметрыОкргуления.Вставить("ВариантОкругления", ВыборкаТипыЦен.ВариантОкругления);
		ПараметрыОкргуления.Вставить("Точность",  ВыборкаТипыЦен.Точность);

		
		
		ДокИЦ = Документы.ИзменениеЦен.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураТипаЦен);
		
		Если БезПараметров Тогда
		   	ДокИц.ДатаНачалаДействия = Параметры.ДатаНачалаДействия;
		КонецЕсли;
		
		//ДокИЦ.УстановитьНовыйНомер();
		
		ДокИЦ.Товары.Загрузить(ТаблицаТовары);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьРекомендованныеНаценки", Новый Структура("ТипЦен", ДокИЦ.ТипЦен));
		СтруктураДействий.Вставить("ЗаполнитьПроцентНаценкиИзРекомендованных");
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуПоПроцентуНаценки",ВыборкаТипыЦен.ПравилоРасчета);	
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуСУчетомОкругления", ПараметрыОкргуления);
		СтруктураДействий.Вставить("ПересчитатьПроцентНаценкиИзНовойЦены");

		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокИЦ.Товары, СтруктураДействий, КэшированныеЗначения);
		
		//Начало Задача от Баффет Svat 18.08.23
		Если ОкруглятьДо = 0.9 Тогда
			Для Каждого тСтр Из ДокИЦ.Товары Цикл
				тСтр.НоваяЦена = тСтр.НоваяЦена-0.1;				
			КонецЦикла;
		КонецЕсли;
		//Конец Задача от Баффет Svat 18.08.23
		
		Попытка
			ДокИЦ.Записать(РежимЗаписи);
			Статистика.Вставить("Создано", Статистика.Создано + 1);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Статистика.Вставить("СОшибками", Статистика.СОшибками + 1);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти	



#КонецЕсли