#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваров") Тогда 
		ЗаполнитьДокументНаОснованииРеализацияТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ТК_НалоговаяНакладная") Тогда 
		ЗаполнитьДокументНаОснованииНалоговойНакладной(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда 
		ЗаполнитьДокументНаОснованииРезерва(ДанныеЗаполнения);
	Иначе
		ИнициализироватьДокумент(ДанныеЗаполнения);	
	КонецЕсли;	

	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииРеализацияТоваров(Знач РеализацияОснование)
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.Хозоперации.СчетНаОплату) КАК ХозОперация,
		               |	РеализацияТоваров.Организация КАК Организация,
		               |	РеализацияТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
		               |	РеализацияТоваров.ТорговаяПлощадка КАК ТорговаяПлощадка,
		               |	РеализацияТоваров.ВалютаДокумента КАК ВалютаДокумента,
		               |	РеализацияТоваров.КурсДокумента КАК КурсДокумента,
		               |	РеализацияТоваров.Ссылка КАК ДокументОснование,
		               |	РеализацияТоваров.Товары.(
		               |		Номенклатура КАК Номенклатура,
		               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |		Количество КАК Количество,
		               |		Коэффициент КАК Коэффициент,
		               |		КоличествоБазовое КАК КоличествоБазовое,
		               |		СтавкаНДС КАК СтавкаНДС,
		               |		ЦенаБезНалогов КАК ЦенаБезНалогов,
		               |		Цена КАК Цена,
		               |		Сумма КАК Сумма,
		               |		СуммаВсего КАК СуммаВсего,
		               |		СуммаНДС КАК СуммаНДС,
		               |		Содержание КАК Содержание
		               |	) КАК Товары,
		               |	РеализацияТоваров.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	РеализацияТоваров.Контрагент КАК Контрагент,
		               |	РеализацияТоваров.ТипЦен КАК ТипЦен,
		               |	ВложенныйЗапрос.Ссылка КАК РасчетныйСчетОрганизации
		               |ИЗ
		               |	Документ.РеализацияТоваров КАК РеализацияТоваров,
		               |	(ВЫБРАТЬ ПЕРВЫЕ 1
		               |		БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка
		               |	ИЗ
		               |		Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		               |	ГДЕ
		               |		БанковскиеСчетаОрганизаций.ВидСчета = ""Услуги""
		               |		И БанковскиеСчетаОрганизаций.Владелец = &Владелец
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		БанковскиеСчетаОрганизаций.Ссылка
		               |	ИЗ
		               |		Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		               |	ГДЕ
		               |		БанковскиеСчетаОрганизаций.ВидСчета = ""Текущий""
		               |		И БанковскиеСчетаОрганизаций.Владелец = &Владелец) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	РеализацияТоваров.Ссылка = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", РеализацияОснование);
		Запрос.УстановитьПараметр("Владелец", РеализацияОснование.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			
			Товары.Очистить();
			
			ВыборкаТовары = Выборка.Товары.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл 
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТовары);
			КонецЦикла;
		КонецЕсли;	
		
		Автор =  Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииНалоговойНакладной(Знач НалоговаяОснование)
	
			Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.Хозоперации.СчетНаОплату) КАК ХозОперация,
		               |	НалоговаяНакладная.Организация КАК Организация,
		               |	НалоговаяНакладная.ПодразделениеКомпании КАК ПодразделениеКомпании,
		               |	НалоговаяНакладная.ТорговаяПлощадка КАК ТорговаяПлощадка,
		               |	НалоговаяНакладная.ВалютаДокумента КАК ВалютаДокумента,
		               |	НалоговаяНакладная.КурсДокумента КАК КурсДокумента,
		               |	НалоговаяНакладная.Ссылка КАК ДокументОснование,
		               |	НалоговаяНакладная.Товары.(
		               |		Номенклатура КАК Номенклатура,
		               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |		Количество КАК Количество,
		               |		Коэффициент КАК Коэффициент,
		               |		КоличествоБазовое КАК КоличествоБазовое,
		               |		СтавкаНДС КАК СтавкаНДС,
		               |		ЦенаБезНалогов КАК ЦенаБезНалогов,
		               |		Цена КАК Цена,
		               |		Сумма КАК Сумма,
		               |		СуммаВсего КАК СуммаВсего,
		               |		СуммаНДС КАК СуммаНДС
		               |	) КАК Товары,
		               |	НалоговаяНакладная.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	НалоговаяНакладная.Контрагент КАК Контрагент,
		               |	БанковскиеСчетаОрганизаций.Ссылка КАК РасчетныйСчетОрганизации,
		               |	НалоговаяНакладная.ТипЦен КАК ТипЦен
		               |ИЗ
		               |	Документ.ТК_НалоговаяНакладная КАК НалоговаяНакладная
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		               |		ПО НалоговаяНакладная.Организация = БанковскиеСчетаОрганизаций.Владелец
		               |			И (БанковскиеСчетаОрганизаций.ВидСчета = ""Текущий"")
		               |ГДЕ
		               |	НалоговаяНакладная.Ссылка = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", НалоговаяОснование);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			
			Товары.Очистить();
			
			ВыборкаТовары = Выборка.Товары.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл 
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТовары);
			КонецЦикла;
		КонецЕсли;	
		
		Автор =  Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииРезерва(Знач РезервОснование)
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.Хозоперации.СчетНаОплату) КАК ХозОперация,
		               |	БанковскиеСчетаОрганизаций.Ссылка КАК РасчетныйСчетОрганизации,
		               |	РезервированиеЗаказовПокупателя.Организация КАК Организация,
		               |	РезервированиеЗаказовПокупателя.ПодразделениеКомпании КАК ПодразделениеКомпании,
		               |	РезервированиеЗаказовПокупателя.ТорговаяПлощадка КАК ТорговаяПлощадка,
		               |	РезервированиеЗаказовПокупателя.ВалютаДокумента КАК ВалютаДокумента,
		               |	РезервированиеЗаказовПокупателя.КурсДокумента КАК КурсДокумента,
		               |	РезервированиеЗаказовПокупателя.Контрагент КАК Контрагент,
		               |	РезервированиеЗаказовПокупателя.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	РезервированиеЗаказовПокупателя.Ссылка КАК ДокументОснование,
		               |	ВложенныйЗапрос.РегламентированныйУчет КАК РегламентированныйУчет
		               |ИЗ
		               |	Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		               |		ПО РезервированиеЗаказовПокупателя.Организация = БанковскиеСчетаОрганизаций.Владелец
		               |			И (БанковскиеСчетаОрганизаций.ВидСчета = ""Текущий""),
		               |	(ВЫБРАТЬ
		               |		ВложенныйЗапрос.РегламентированныйУчет КАК РегламентированныйУчет,
		               |		ВложенныйЗапрос.Резерв КАК Резерв
		               |	ИЗ
		               |		(ВЫБРАТЬ
		               |			РезервированиеЗаказовПокупателя.ДокументОснование.РегламентированныйУчет КАК РегламентированныйУчет,
		               |			РезервированиеЗаказовПокупателя.Ссылка КАК Резерв
		               |		ИЗ
		               |			Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
		               |		ГДЕ
		               |			РезервированиеЗаказовПокупателя.Ссылка = &ДокументОснование
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			РезервированиеЗаказовПокупателя.ДокументОснование.РегламентированныйУчет,
		               |			РезервированиеЗаказовПокупателя.Ссылка
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |			РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя.РегламентированныйУчет,
		               |			РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка
		               |		ИЗ
		               |			Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателяРаспределениеОтгрузки
		               |		ГДЕ
		               |			РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка = &ДокументОснование
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя.РегламентированныйУчет,
		               |			РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка) КАК ВложенныйЗапрос
		               |	ГДЕ
		               |		НЕ ВложенныйЗапрос.РегламентированныйУчет ЕСТЬ NULL
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ВложенныйЗапрос.РегламентированныйУчет,
		               |		ВложенныйЗапрос.Резерв) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	РезервированиеЗаказовПокупателя.Ссылка = &ДокументОснование
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РезервированиеЗаказовПокупателяТовары.Ссылка КАК Ссылка,
		               |	РезервированиеЗаказовПокупателяТовары.НомерСтроки КАК НомерСтроки,
		               |	РезервированиеЗаказовПокупателяТовары.Номенклатура КАК Номенклатура,
		               |	РезервированиеЗаказовПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	РезервированиеЗаказовПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	РезервированиеЗаказовПокупателяТовары.Коэффициент КАК Коэффициент,
		               |	РезервированиеЗаказовПокупателяТовары.Количество КАК Количество,
		               |	0 КАК КоличествоБазовое,
		               |	0 КАК Цена,
		               |	0 КАК ЦенаБезНалогов,
		               |	0 КАК Сумма,
		               |	0 КАК СуммаВсего,
		               |	РезервированиеЗаказовПокупателяТовары.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		               |	0 КАК СуммаНДС,
		               |	0 КАК СуммаБезНалогов,
		               |	0 КАК ПроцентСкидки,
		               |	0 КАК СуммаСкидки,
		               |	РезервированиеЗаказовПокупателяТовары.Номенклатура.ГруппаЦенообразования КАК ГруппаЦенообразования
		               |ИЗ
		               |	Документ.РезервированиеЗаказовПокупателя.Товары КАК РезервированиеЗаказовПокупателяТовары
		               |ГДЕ
		               |	РезервированиеЗаказовПокупателяТовары.Ссылка = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", РезервОснование);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		ВыборкаШапка = МассивРезультатов[0].Выбрать();	
		ТаблицаТоваров = МассивРезультатов[1].Выгрузить();
		Автор =  Пользователи.ТекущийПользователь();
		
		Если ВыборкаШапка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
		КонецЕсли;
		
		ТаблицаТоваров.Колонки.Добавить("ТипЦен");
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЦеныИзДоговора",ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровТипаЦенПоДоговору(ЭтотОбъект,ВыборкаШапка.РегламентированныйУчет));
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ЭтотОбъект,"Цены"));
		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		//СтруктураДействий.Вставить("ЗаполнитьГруппуЦенообразования",	Новый Структура("Номенклатура","ГруппаЦенообразования"));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Организация,ТорговаяПлощадка,ТипСтавкиНДС",ЭтотОбъект.Организация,ЭтотОбъект.ТорговаяПлощадка,"Реализация"));
		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");	
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));	
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваров, СтруктураДействий, Неопределено);
		
		Товары.Загрузить(ТаблицаТоваров);
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор =  Пользователи.ТекущийПользователь(); 
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	

КонецПроцедуры
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("СуммаВсего");
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ЭтоНовый() И Проведен И НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ.СчетНаОплату КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДополнительныеСвойства.Вставить("СтараяДатаДокумента", Выборка.Дата);
		
	Иначе
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);		
	КонецЕсли;

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли
