
&НаСервере
Процедура СброситьКэшРасчетов()
	
	Если Не (ОбновитьКэшРасчетовОбщий ИЛИ ОбновитьКэшРасчетовОтбор) Тогда
		Возврат;
	КонецЕсли;
	
	КэшРасчетов = ПолучитьИзВременногоХранилища(АдресКэшаРасчетов);
	
	Для каждого КлючЗначение Из КэшРасчетов Цикл
		
		Раздел = КлючЗначение.Ключ;
		Макеты = КлючЗначение.Значение;
		
		Если ОбновитьКэшРасчетовОбщий Тогда
			Макеты.Общий = Неопределено;
		КонецЕсли;
		Если ОбновитьКэшРасчетовОтбор Тогда
			Макеты.Отбор = Неопределено;
		КонецЕсли;
		
		КэшРасчетов.Вставить(Раздел, Макеты);
		
	КонецЦикла;
	
	ОбновитьКэшРасчетовОбщий = Ложь;
	ОбновитьКэшРасчетовОтбор = Ложь;
	
	ПоместитьВоВременноеХранилище(КэшРасчетов, АдресКэшаРасчетов);
	
КонецПроцедуры

&НаСервере 
Функция НастройкиОтображенияРазделов() 
	
	СписокПользователей = Новый Массив;
	СписокПользователей.Добавить(ПользователиКлиентСервер.АвторизованныйПользователь());
	Если РежимОтображения <> "МоиДокументы" Тогда
		СписокПользователей.Добавить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	КонецЕсли;
	
	НастройкиОтображения = Новый Структура;
	НастройкиОтображения.Вставить("РежимОтображения", РежимОтображения);
	НастройкиОтображения.Вставить("СписокПользователей", СписокПользователей);
	
	Возврат НастройкиОтображения;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция СписокРаздела(Знач Раздел)
	
	СпискиРазделов = Новый Соответствие;
	СпискиРазделов.Вставить("Входящие", "ВходящиеEDI");
	
	СпискиРазделов.Вставить("Исходящие", "ИсходящиеEDI");
	СпискиРазделов.Вставить("ПодписатьИсх", "ИсходящиеEDI");
	СпискиРазделов.Вставить("Сформировать", "Сформировать");

	Список = СпискиРазделов.Получить(Раздел);
	
	Возврат Список;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтраницаРаздела(Знач Раздел)
	
	Страница = Неопределено;
	
	СтраницыРазделов = Новый Соответствие;
	СтраницыРазделов.Вставить("Входящие", "ВходящиеEDI");
	
	СтраницыРазделов.Вставить("Исходящие", "ИсходящиеEDI");
	СтраницыРазделов.Вставить("ПодписатьИсх", "ИсходящиеEDI");
	
	СтраницыРазделов.Вставить("Сформировать", "СформироватьEDI");

	
	Страница = СтраницыРазделов.Получить(Раздел);

	Если ЗначениеЗаполнено(Страница) Тогда
		Страница = "Страница" + СтраницыРазделов.Получить(Раздел);
	КонецЕсли;
	
	Возврат Страница;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТаблицаРаздела(Знач Раздел)
	
	ТаблицыРазделов = Новый Соответствие;
	//ТаблицыРазделов.Вставить("Входящие", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("Обработать", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("Утвердить", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("Подписать", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("Исправить", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("Аннулировать", "ВходящиеЭД");
	//ТаблицыРазделов.Вставить("НаКонтроле", "ВходящиеЭД");
	//
	//ТаблицыРазделов.Вставить("Исходящие", "ИсходящиеЭД");
	//ТаблицыРазделов.Вставить("ПодписатьИсх", "ИсходящиеЭД");
	//ТаблицыРазделов.Вставить("ИсправитьИсх", "ИсходящиеЭД");
	//ТаблицыРазделов.Вставить("АннулироватьИсх", "ИсходящиеЭД");
	//ТаблицыРазделов.Вставить("НаКонтролеИсх", "ИсходящиеЭД");
	//
	//ТаблицыРазделов.Вставить("Сформировать", "СформироватьЭД");
	//
	//ТаблицыРазделов.Вставить("Ознакомиться", "ОзнакомитьсяЭД");
	//
	//ТаблицыРазделов.Вставить("Отправить", "ПакетыЭД");
	//ТаблицыРазделов.Вставить("Распаковать", "ПакетыЭД");
	//
	//ТаблицыРазделов.Вставить("Приглашения", "ПриглашенияЭД");
	//ТаблицыРазделов.Вставить("ТребуетсяПригласить", "ПриглашенияЭД");
	//ТаблицыРазделов.Вставить("ЖдемСогласия", "ПриглашенияЭД");
	//ТаблицыРазделов.Вставить("ТребуетсяСогласие", "ПриглашенияЭД");
	
	Таблица = ТаблицыРазделов.Получить(Раздел);
	
	Возврат Таблица;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПоляРаздела(Знач Раздел)
	
	//ПоляТаблицыВходящие = "ВидСообщения, Дата, Номер, Отправитель, Получатель,Подразделение, ТекущийСтатус";
	//ПоляТаблицыИсходящие = "ВидСообщения, Дата, Номер,Получатель, Отправитель, Подписи, СостояниеЭДО, НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание";
	//
	//ПоляТаблицы = "";
	//ПоляРаздела = "";
	//
	//Если Раздел = "Входящие" Тогда
	//	
	//	ПоляТаблицы = ПоляТаблицыВходящие;
	//	ПоляРаздела = "ВидЭД, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО, НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание";
	//	
	//ИначеЕсли Раздел = "Исходящие" Тогда
	//	
	//	ПоляТаблицы = ПоляТаблицыИсходящие;
	//	ПоляРаздела = "ВидЭД, Дата, Номер, СуммаДокумента, Контрагент, Организация, СостояниеЭДО, НаправлениеЭД, Ответственный, ДополнительнаяИнформация, ПричинаОтклонения, Описание";
	//	
	//ИначеЕсли Раздел = "ПодписатьИсх" Тогда
	//	
	//	ПоляТаблицы = ПоляТаблицыИсходящие;
	//	ПоляРаздела = "ВидЭД, Дата, Номер, СуммаДокумента, Контрагент, Организация, Подписи, НаправлениеЭД, Ответственный, ДополнительнаяИнформация, Описание";
	//КонецЕсли;
	//
	//ПоляТаблицы = СтрЗаменить(ПоляТаблицы, " ", "");
	//ПоляРаздела = СтрЗаменить(ПоляРаздела, " ", "");
	//
	//МассивПолеТаблицы = СтрРазделить(ПоляТаблицы, ",", Ложь);
	//МассивПолейРаздела = СтрРазделить(ПоляРаздела, ",", Ложь);
	//
	//ВидимостьПолей = Новый Соответствие;
	//Для каждого Поле Из МассивПолеТаблицы Цикл
	//	
	//	Видимость = (МассивПолейРаздела.Найти(Поле) <> Неопределено);
	//	ВидимостьПолей.Вставить(Поле, Видимость);
	//	
	//КонецЦикла;
	//
	//Возврат ВидимостьПолей;
	
КонецФункции




&НаСервереБезКонтекста 
Функция ПользовательскийОтборСписка(Знач Список) 
	
	ИдентификаторНастройки = Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторНастройки);
	
	Возврат ПользовательскийОтбор;
	
КонецФункции


&НаСервере
Функция ЕстьПользовательскийОтборПоРазделу(Знач Раздел) 
	
	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];
	
	Отбор = ПользовательскийОтборСписка(Список);
	ЕстьПользовательскийОтбор = (Отбор.Элементы.Количество() > 0);
	
	ЕстьБыстрыйОтбор = Ложь;
	Для каждого СтрокаОтбора Из БыстрыеОтборы Цикл
		
		Если ЗначениеЗаполнено(СтрокаОтбора.Значение) 
			ИЛИ (СтрокаОтбора.Тип = "Число" И СтрокаОтбора.Значение <> Неопределено) Тогда
			
			ЕстьБыстрыйОтбор = Истина;
			Прервать;
	
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ЕстьПользовательскийОтбор ИЛИ ЕстьБыстрыйОтбор;
	
КонецФункции


&НаСервере
Процедура РассчитатьКоличествоЭлементовВРазделах(Знач ПересчитатьКоличество = Истина, Знач ПересчитатьКоличествоОтбор = Истина)
	
	Если Не (ПересчитатьКоличество ИЛИ ПересчитатьКоличествоОтбор) Тогда
		Возврат;
	КонецЕсли;
	
	СброситьКэшРасчетов();
	
	КэшРасчетов = ПолучитьИзВременногоХранилища(АдресКэшаРасчетов);
	
	Форма = ЭтотОбъект;
	
	ДанныеДляРасчета = Новый Массив;
	
	Для каждого Раздел Из ОписаниеРазделов Цикл
		
		Если Не (Раздел.РассчитыватьКоличество И Раздел.Видимость) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПересчитатьКоличество Тогда
			ЭлементРасчета = Новый Структура("Раздел, УчитыватьОтбор, Количество", Раздел.Имя, Ложь, 0);
			ДанныеДляРасчета.Добавить(ЭлементРасчета);
		КонецЕсли;
		
		Если ПересчитатьКоличествоОтбор И ЕстьПользовательскийОтборПоРазделу(Раздел.Имя) Тогда
			ЭлементРасчета = Новый Структура("Раздел, УчитыватьОтбор, Количество", Раздел.Имя, Истина, 0);
			ДанныеДляРасчета.Добавить(ЭлементРасчета);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеДляРасчета, КэшРасчетов);
	
	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл
		
		ОтборРаздела = Новый Структура("Имя", ЭлементРасчета.Раздел);
		ВсеСтрокиРаздела = ОписаниеРазделов.НайтиСтроки(ОтборРаздела);
		
		Для каждого СтрокаРаздела Из ВсеСтрокиРаздела Цикл
			
			Если ЭлементРасчета.УчитыватьОтбор Тогда
				СтрокаРаздела.КоличествоОтбор = ЭлементРасчета.Количество;
			Иначе
				СтрокаРаздела.Количество = ЭлементРасчета.Количество;
				СтрокаРаздела.КоличествоОтбор = ЭлементРасчета.Количество;
			КонецЕсли;
			
			СтрокаРаздела.КоличествоРассчитано = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(КэшРасчетов, АдресКэшаРасчетов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора(Знач Раздел) 
	
	// Изменения в тексты запросов вносить согласовано с отборами по разделу.
	// См. метод СоздатьОтборПоРазделу.
	
	ТекстЗапроса = Неопределено;
	
	Если Раздел = "Обработать" Тогда
		
	ИначеЕсли Раздел = "Утвердить" Тогда
		
		
	ИначеЕсли Раздел = "Подписать" Тогда
			
	ИначеЕсли Раздел = "Исправить" Тогда
		
			
	ИначеЕсли Раздел = "Аннулировать" Тогда
		
			
	ИначеЕсли Раздел = "НаКонтроле" Тогда
		
			
	ИначеЕсли Раздел = "Сформировать" Тогда
		
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(1) КАК _Счетчик
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1000
		|		1 КАК _Счетчик
		|	ИЗ
		|		РегистрСведений.ТК_СостояниеEDI КАК СостоянияЭД
		|	ГДЕ
		|		СостоянияЭД.СостояниеВерсии = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.НеСформирован)) КАК ВложенныйЗапрос";
		

		
		
	ИначеЕсли Раздел = "ПодписатьИсх" Тогда
		
		ТекстЗапроса =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                |	КОЛИЧЕСТВО(ВложенныйЗапрос._Счетчик) КАК _Счетчик
		                |ИЗ
		                |	(ВЫБРАТЬ ПЕРВЫЕ 1000
		                |		1 КАК _Счетчик
		                |	ИЗ
		                |		Документ.ТК_СообщениеEDIИсходящие КАК ТК_СообщениеEDIИсходящие
		                |	ГДЕ
		                |		ТК_СообщениеEDIИсходящие.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.НаПодписи)
		                |		И (ТК_СообщениеEDIИсходящие.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыСообщенийEDI.COMDOC006)
		                |				ИЛИ ТК_СообщениеEDIИсходящие.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыСообщенийEDI.COMDOC007))) КАК ВложенныйЗапрос";

		
	ИначеЕсли Раздел = "ИсправитьИсх" Тогда
		
		
	ИначеЕсли Раздел = "АннулироватьИсх" Тогда
		
	ИначеЕсли Раздел = "НаКонтролеИсх" Тогда
		
	ИначеЕсли Раздел = "Отправить" Тогда
		
			
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ДобавитьУничтожениеВременныхТаблицВЗапрос(ТекстЗапроса) 
	
	ВременныеТаблицы = Новый Массив;
	КоличествоВременныхТаблиц = 0;
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Для каждого ТекущийЗапрос Из Схема.ПакетЗапросов Цикл
		Если ТипЗнч(ТекущийЗапрос) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
			// Добавляем временную таблицу на уничтожение.
			Если ЗначениеЗаполнено(ТекущийЗапрос.ТаблицаДляПомещения) Тогда
				ВременныеТаблицы.Добавить(ТекущийЗапрос.ТаблицаДляПомещения);
				КоличествоВременныхТаблиц = КоличествоВременныхТаблиц + 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекущийЗапрос) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			Индекс = ВременныеТаблицы.Найти(ТекущийЗапрос.ИмяТаблицы);
			// Уже есть уничтожение временной таблицы.
			Если Индекс <> Неопределено Тогда
				ВременныеТаблицы.Удалить(Индекс);
				КоличествоВременныхТаблиц = КоличествоВременныхТаблиц - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяТаблицы Из ВременныеТаблицы Цикл
		
		ЗапросУничтоженияВТ = Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
		ЗапросУничтоженияВТ.ИмяТаблицы = ИмяТаблицы;
		
	КонецЦикла;
	
	ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
	
	Возврат КоличествоВременныхТаблиц;
	
КонецФункции

&НаСервере
Процедура ВыполнитьРасчетКоличестваЭлементовВРазделах(ДанныеДляРасчета, КэшРасчетов)
	
	Если Не ЗначениеЗаполнено(ДанныеДляРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЧастиТекстаЗапроса = Новый Массив;
	
	НастройкиОтображения = НастройкиОтображенияРазделов();
	
	Запрос.УстановитьПараметр("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Запрос.УстановитьПараметр("СписокПользователей", НастройкиОтображения.СписокПользователей);
	
	ПоложениеРезультатовВПакете = Новый ТаблицаЗначений;
	ПоложениеРезультатовВПакете.Колонки.Добавить("Раздел");
	ПоложениеРезультатовВПакете.Колонки.Добавить("УчитыватьОтбор");
	ПоложениеРезультатовВПакете.Колонки.Добавить("Индекс");
	
	КоличествоЗапросовВПакете = 0;
	РазделительЗапросовВПакете = 
		"
		|;
		|";
	
	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл
		
		//Если ЭлементРасчета.УчитыватьОтбор Тогда
		//	
		//	Макет = МакетРасчетаПоРазделу(ЭлементРасчета.Раздел, ЭлементРасчета.УчитыватьОтбор, КэшРасчетов);
		//	ТекстЗапроса = Макет.НаборыДанных[0].Запрос;
		//	
		//	// Обернем запрос в выборку количества
		//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		//	Шаблон = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//	|	КОЛИЧЕСТВО(1) КАК _Счетчик
		//	|ИЗ
		//	|	(%1) КАК _ВложенныйЗапрос";
		//	ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса);
		//	
		//	// Переименовываем и устанавливаем параметры запроса.
		//	
		//	Префикс = СтрШаблон("%1_%2_", ЭлементРасчета.Раздел, Формат(ЭлементРасчета.УчитыватьОтбор, "БЛ=Ложь; БИ=Истина"));
		//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&", "&" + Префикс);
		//	
		//	Для каждого Параметр Из Макет.ЗначенияПараметров Цикл
		//		Запрос.УстановитьПараметр(Префикс + Параметр.Имя, Параметр.Значение);
		//	КонецЦикла;
		//	
		//Иначе
			
			ТекстЗапроса = ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора(ЭлементРасчета.Раздел);
			Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
				Продолжить;
			КонецЕсли;
			
		//КонецЕсли;
		
		// Добавляем уничтожение временных таблиц, чтобы избежать конфликта имен.
		
		КоличествоВТ = ДобавитьУничтожениеВременныхТаблицВЗапрос(ТекстЗапроса);
		
		Если ЗначениеЗаполнено(ЧастиТекстаЗапроса) Тогда
			ЧастиТекстаЗапроса.Добавить(РазделительЗапросовВПакете);
		КонецЕсли;
		
		ТекстЗапросаВПакете = СтрШаблон(
			"////////////////////////////////////////////////////////////////////////////
			|// %1 (%2)
			|
			|%3", ЭлементРасчета.Раздел, ЭлементРасчета.УчитыватьОтбор, ТекстЗапроса);
		ЧастиТекстаЗапроса.Добавить(ТекстЗапросаВПакете);
		
		// Вычисляем положение результата по разделу в пакете.
			
		КоличествоЗапросовВПакете = КоличествоЗапросовВПакете + 1 + КоличествоВТ * 2;
		
		СтрокаПоложения = ПоложениеРезультатовВПакете.Добавить();
		СтрокаПоложения.Раздел = ЭлементРасчета.Раздел;
		СтрокаПоложения.УчитыватьОтбор = ЭлементРасчета.УчитыватьОтбор;
		СтрокаПоложения.Индекс = КоличествоЗапросовВПакете - КоличествоВТ - 1;
		
	КонецЦикла;
	
	// Заполняем результаты по разделам по данным пакета.
	Запрос.Текст = СтрСоединить(ЧастиТекстаЗапроса);
	Результаты = Запрос.ВыполнитьПакет();
	
	Для каждого ЭлементРасчета Из ДанныеДляРасчета Цикл
		
		ОтборСтрок = Новый Структура("Раздел,УчитыватьОтбор");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ЭлементРасчета);
		
		НайденныеСтроки = ПоложениеРезультатовВПакете.НайтиСтроки(ОтборСтрок);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексРезультата = НайденныеСтроки[0].Индекс;
		
		Результат = Результаты[ИндексРезультата];
		
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		КоличествоЭлементов = 0;
		Пока Выборка.Следующий() Цикл
			КоличествоЭлементов = КоличествоЭлементов + Выборка._Счетчик;
		КонецЦикла;
		ЭлементРасчета.Количество = КоличествоЭлементов;
		
	КонецЦикла;
	
КонецПроцедуры




&НаСервере
Функция ДобавитьОписаниеРаздела(Знач Имя, Знач Представление = "", Знач Видимость = Истина, Знач РассчитыватьКоличество = Истина) 
	
	НовыйРаздел = ОписаниеРазделов.Добавить();
	НовыйРаздел.Имя = Имя;
	НовыйРаздел.Представление = Представление;
	НовыйРаздел.Видимость = Видимость;
	НовыйРаздел.РассчитыватьКоличество = РассчитыватьКоличество;
	НовыйРаздел.КоличествоРассчитано = Ложь;
	
	Возврат НовыйРаздел;
	
КонецФункции

&НаСервере 
Процедура ИнициализироватьРазделы()
	
	ДобавитьОписаниеРаздела("Входящие", НСтр("ru = 'Входящие'"), , Ложь);
	
	ДобавитьОписаниеРаздела("Исходящие", НСтр("ru = 'Исходящие'"), , Ложь);
	ДобавитьОписаниеРаздела("Сформировать", НСтр("ru = 'Создать'"));
	ДобавитьОписаниеРаздела("ПодписатьИсх", НСтр("ru = 'Подписать'"));
	
КонецПроцедуры



&НаСервере
Процедура ИнициализироватьДерево()

	Дерево = РеквизитФормыВЗначение("ДеревоДействий");
	
	СтрокаВходящие = Дерево.Строки.Добавить();
	СтрокаВходящие.Значение = "Входящие";
	//НовЗапись = СтрокаВходящие.Строки.Добавить();
	//НовЗапись.Значение = "Обработать";
	//НовЗапись = СтрокаВходящие.Строки.Добавить();
	//НовЗапись.Значение = "Утвердить";
	//Если ИспользоватьЭП Тогда
		//НовЗапись = СтрокаВходящие.Строки.Добавить();
		//НовЗапись.Значение = "Подписать";
	//КонецЕсли;
	//НовЗапись = СтрокаВходящие.Строки.Добавить();
	//НовЗапись.Значение = "Исправить";
	//НовЗапись = СтрокаВходящие.Строки.Добавить();
	//НовЗапись.Значение = "Аннулировать";
	//НовЗапись = СтрокаВходящие.Строки.Добавить();
	//НовЗапись.Значение = "НаКонтроле";

	СтрокаИсходящие = Дерево.Строки.Добавить();
	СтрокаИсходящие.Значение = "Исходящие";
	НовЗапись = СтрокаИсходящие.Строки.Добавить();
	НовЗапись.Значение = "Сформировать";
//	Если ИспользоватьЭП Тогда
		НовЗапись = СтрокаИсходящие.Строки.Добавить();
		НовЗапись.Значение = "ПодписатьИсх";
//	КонецЕсли;
	//НовЗапись = СтрокаИсходящие.Строки.Добавить();
	//НовЗапись.Значение = "ИсправитьИсх";
	//
	//НовЗапись = СтрокаИсходящие.Строки.Добавить();
	//НовЗапись.Значение = "АннулироватьИсх";
	//НовЗапись = СтрокаИсходящие.Строки.Добавить();
	//НовЗапись.Значение = "НаКонтролеИсх";
	//
	//НовЗапись = Дерево.Строки.Добавить();
	//НовЗапись.Значение = "Ознакомиться";
	//НовЗапись = Дерево.Строки.Добавить();
	//НовЗапись.Значение = "Отправить";
	//НовЗапись = Дерево.Строки.Добавить();
	//НовЗапись.Значение = "Распаковать";
	//
	//СтрокаПриглашения = Дерево.Строки.Добавить();
	//СтрокаПриглашения.Значение = "Приглашения";
	//НовЗапись = СтрокаПриглашения.Строки.Добавить();
	//НовЗапись.Значение = "ТребуетсяПригласить";
	//НовЗапись = СтрокаПриглашения.Строки.Добавить();
	//НовЗапись.Значение = "ЖдемСогласия";
	//НовЗапись = СтрокаПриглашения.Строки.Добавить();
	//НовЗапись.Значение = "ТребуетсяСогласие";
	//
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДействий");
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДеревоНавигации(ЭлементыДереваНавигации) 
	
	КОбработке = 0;
	
	Для каждого СтрокаНавигации Из ЭлементыДереваНавигации Цикл
		
		ОтборРаздела = Новый Структура("Имя", СтрокаНавигации.Значение);
		НайденныеСтроки = ОписаниеРазделов.НайтиСтроки(ОтборРаздела);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		Раздел = НайденныеСтроки[0];
		
		СтрокаНавигации.Представление = Раздел.Представление;
		
		ВложенныеЭлементы = СтрокаНавигации.ПолучитьЭлементы();
		ЕстьВложенныеЭлементы = (ВложенныеЭлементы.Количество() > 0);
		
		Если ЕстьВложенныеЭлементы Тогда
			
			КОбработкеВложенные = ОбновитьДеревоНавигации(ВложенныеЭлементы);
			КОбработке = КОбработке + КОбработкеВложенные;
			СтрокаНавигации.ТребуетсяОбработка = КОбработкеВложенные;
			
		Иначе
			
			Если Раздел.РассчитыватьКоличество И Раздел.КоличествоРассчитано И Раздел.Количество > 0 Тогда
				
				КоличествоОтборСтрокой = ?(Раздел.КоличествоОтбор >= 1000, "999+", Формат(Раздел.КоличествоОтбор, "ЧН=0; ЧГ=0"));
				СтрокаНавигации.Представление = СтрокаНавигации.Представление + " (" + КоличествоОтборСтрокой;
				
				Если Раздел.Количество <> Раздел.КоличествоОтбор Тогда
					
					КоличествоСтрокой = ?(Раздел.Количество >= 1000, "999+", Формат(Раздел.Количество, "ЧН=0; ЧГ=0"));
					СтрокаНавигации.Представление = СтрокаНавигации.Представление + "/" + КоличествоСтрокой;
					
				КонецЕсли;
				
				СтрокаНавигации.Представление = СтрокаНавигации.Представление + ")";
					
			КонецЕсли;
			
			КОбработке = КОбработке + Раздел.Количество;
			
			СтрокаНавигации.ТребуетсяОбработка = (Раздел.Количество > 0);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КОбработке;
	
КонецФункции


&НаСервере
Процедура ПерейтиВТекущийРазделНаСервере() 
	
	ИдентификаторСтроки = 0;
	ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля(
		"Значение", ИдентификаторСтроки, ДеревоДействий.ПолучитьЭлементы(), ТекущийРаздел, Ложь);
	
	Если Элементы.ДеревоДействий.ТекущаяСтрока <> ИдентификаторСтроки Тогда
		Элементы.ДеревоДействий.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДинамическиеСписки(ПеречитыватьДанные = Истина)
	
	ИмяСписка = СтрЗаменить(Элементы.ПанельСписков.ТекущаяСтраница.Имя, "Страница", "");
	
	Если ПеречитыватьДанные Тогда
		Элементы[ИмяСписка].Обновить();
	Иначе
		Элементы[ИмяСписка].ТекущаяСтрока = Элементы[ИмяСписка].ТекущаяСтрока;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере 
Процедура ОбновитьНавигациюПоРазделамНаСервере(Знач ПересчитатьКоличество = Истина, Знач ПересчитатьКоличествоОтбор = Истина)
	
	РассчитатьКоличествоЭлементовВРазделах(ПересчитатьКоличество, ПересчитатьКоличествоОтбор);
	
	ОбновитьДеревоНавигации(ДеревоДействий.ПолучитьЭлементы());
	
	ПерейтиВТекущийРазделНаСервере();
	ОбновитьДинамическиеСписки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьОтборы(Знач ИмяФормы, Знач Ключ, Знач Значение)

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, Ключ, Значение.Выгрузить());
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьЗаголовокФормы()

	Если РежимОтображения = "КИсполнению" Тогда
		СуффиксЗаголовка = НСтр("ru = 'к исполнению'");
	ИначеЕсли РежимОтображения = "МоиДокументы" Тогда 
		СуффиксЗаголовка = НСтр("ru = 'мои документы'");
	ИначеЕсли РежимОтображения = "ВсеДокументы" Тогда 
		СуффиксЗаголовка = НСтр("ru = 'весь документооборот'");
	Иначе
		СуффиксЗаголовка = "";
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Текущие дела EDI (%1)'"), СуффиксЗаголовка);

КонецПроцедуры

&НаСервере 
Процедура ПоказатьСтраницуРаздела(Знач Раздел) 
	
	ИмяСтраницы = СтраницаРаздела(Раздел);
	
	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
		Элементы.ПанельСписков.ТекущаяСтраница = Элементы[ИмяСтраницы];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура ПоказатьПоляРаздела(Знач Раздел)
	
	ИмяТаблицы = ТаблицаРаздела(Раздел);
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	ПоляТаблицы = ПоляРаздела(Раздел);
	
	Для каждого Поле Из ПоляТаблицы Цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, ИмяТаблицы + Поле.Ключ, "Видимость", Поле.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьОтборыКСпискуРаздела(Знач Раздел, Список)
	
	УстановитьОтборПоРазделу(Раздел, Список);
	
	//УстановитьБыстрыеОтборыПоРазделу(Раздел, БыстрыеОтборы, Список);
	
	ОбработатьПересечениеПользовательскихОтборовИОтбораПоРазделу(Раздел, Список);
	
	//ОбработатьПересечениеПользовательскихОтборовИБыстрыхОтборов(Раздел, Список);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьОтборПоРазделу(Знач Раздел, Список)
	
	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "ОтборПоРазделам");
	Если ГруппаОтборПоРазделам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Включаем использование группы отбора, соответствующей разделу.
	РазделНайден = Ложь;
	Для каждого ГруппаРаздела Из ГруппаОтборПоРазделам.Элементы Цикл
		
		Если ГруппаРаздела.Представление = "Раздел" + Раздел Тогда
			ГруппаРаздела.Использование = Истина;
			РазделНайден = Истина;
		Иначе
			ГруппаРаздела.Использование = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	// Если не удалось найти группу раздела, то включаем все разделы.
	Если Не РазделНайден Тогда
		Для каждого ГруппаРаздела Из ГруппаОтборПоРазделам.Элементы Цикл
			ГруппаРаздела.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста 
Функция ЭлементыОтбора(Знач Отбор)
	
	НайденныеЭлементы = Новый Массив;
	
	Для каждого Элемент Из Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			НайденныеЭлементыГруппы = ЭлементыОтбора(Элемент);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеЭлементы, НайденныеЭлементыГруппы);
			
		Иначе
			
			НайденныеЭлементы.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныеЭлементы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьПересечениеПользовательскихОтборовИОтбораПоРазделу(Знач Раздел, Список)
	
	ПользовательскийОтбор = ПользовательскийОтборСписка(Список);
	ВсеЭлементыПО = ЭлементыОтбора(ПользовательскийОтбор);
	
	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "ОтборПоРазделам");
	Если ГруппаОтборПоРазделам = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВсеЭлементыОР = ЭлементыОтбора(ГруппаОтборПоРазделам);
	
	Для каждого ЭлементПО Из ВсеЭлементыПО Цикл
		
		Если Не ЭлементПО.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ЭлементОР Из ВсеЭлементыОР Цикл
			
			Если ЭлементПО.ЛевоеЗначение = ЭлементОР.ЛевоеЗначение Тогда
				
				ЭлементПО.Использование = Ложь;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПрименитьОтборыКРазделу(Знач Раздел)
	
	ИмяСписка = СписокРаздела(Раздел);
	Список = ЭтотОбъект[ИмяСписка];
	
	ПрименитьОтборыКСпискуРаздела(Раздел, Список);
	
	//УстановитьТекстКнопкиБыстрыхОтборов(Раздел);
	
	//УстановитьДоступностьСбросаОтбора(Раздел);
	
КонецПроцедуры



&НаСервере
Процедура ПоказатьСписокРаздела(Знач Раздел)
	
	ПоказатьСтраницуРаздела(Раздел);
	
	ПоказатьПоляРаздела(Раздел);
	
	ПрименитьОтборыКРазделу(Раздел);
	
КонецПроцедуры


&НаСервере
Процедура ПоказатьРаздел(Знач Раздел)
	
	ТекущийРаздел = Раздел;
	
	//ПоказатьКомандыРаздела(Раздел);
	ПоказатьСписокРаздела(Раздел);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииРаздела(Знач НовыйРаздел)
	
	//// &ЗамерПроизводительности
	//ИмяОперации = СтрШаблон("Обработка.ТекущиеДелаПоЭДО.Форма.ТекущиеДела.ПоказатьРаздел.%1", НовыйРаздел);
	//ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, ИмяОперации);
	
	ПоказатьРаздел(НовыйРаздел);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоДействийДействие.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоДействий.ТребуетсяОбработка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина, Ложь, Ложь, Ложь, ));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();	
	ИнициализироватьДерево();
	

	ИнициализироватьРазделы();
	Элементы.ПанельСписков.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	АдресКэшаРасчетов = ПоместитьВоВременноеХранилище(Новый Соответствие, УникальныйИдентификатор);
	
	РежимОтображения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормы, "РежимОтображения", "ВсеДокументы");
	
	ОбновитьЗаголовокФормы();

	
	НастроитьСпискиРазделов();

	ОбновитьНавигациюПоРазделамНаСервере(Истина, Ложь);
	ПоказатьРаздел("Сформировать");

	
КонецПроцедуры

&НаСервере
Процедура НастроитьСпискиРазделов()
	
	НастройкиОтображения = НастройкиОтображенияРазделов();
	
	УстановитьПараметрыСписковРазделов(НастройкиОтображения);
	
	СоздатьОтборПоРазделамВСпискахРазделов(НастройкиОтображения);
	
	//СоздатьБыстрыйОтборВСпискахРазделов();
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьПараметрыСписковРазделов(Знач НастройкиОтображения)
	
	Форма = ЭтотОбъект;
	
	ОграничениеОтбора = Новый Массив;
	ОграничениеОтбора.Добавить("СписокПользователей");
	
	ИмяСписка = СписокРаздела("Входящие");
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Список.Параметры.УстановитьЗначениеПараметра("СписокПользователей", НастройкиОтображения.СписокПользователей);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
	ИмяСписка = СписокРаздела("Исходящие");
	Список = Форма[ИмяСписка];
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображения", НастройкиОтображения.РежимОтображения);
	Список.Параметры.УстановитьЗначениеПараметра("СписокПользователей", НастройкиОтображения.СписокПользователей);
	Список.УстановитьОграниченияИспользованияВОтборе(ОграничениеОтбора);
	
КонецПроцедуры


&НаСервере 
Процедура СоздатьОтборПоРазделамВСпискахРазделов(Знач НастройкиОтображения)
	
	// Исходящие
	Список = ИсходящиеEDI;
	
	Разделы = Новый Массив;
	Разделы.Добавить("ПодписатьИсх");
	//Разделы.Добавить("ИсправитьИсх");
	//Разделы.Добавить("АннулироватьИсх");
	//Разделы.Добавить("НаКонтролеИсх");
	
	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);
	
	// Входящие
	Список = ВходящиеEDI;
	
	Разделы = Новый Массив;
	//Разделы.Добавить("Обработать");
	//Разделы.Добавить("Утвердить");
	//Разделы.Добавить("Подписать");
	//Разделы.Добавить("Исправить");
	//Разделы.Добавить("Аннулировать");
	//Разделы.Добавить("НаКонтроле");
	
	СоздатьГруппуОтбораПоРазделам(Разделы, НастройкиОтображения, Список.Отбор);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьГруппуОтбораПоРазделам(Знач Разделы, Знач НастройкиОтображения, Отбор)
	
	ГруппаОтборПоРазделам = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Отбор.Элементы, "ОтборПоРазделам", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Для каждого Раздел Из Разделы Цикл
		
		ГруппаРаздел = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ГруппаОтборПоРазделам, "Раздел" + Раздел, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
			
		СоздатьОтборПоРазделу(Раздел, НастройкиОтображения, ГруппаРаздел);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура СоздатьОтборПоРазделу(Знач Раздел, Знач НастройкиОтображения, ГруппаОтбора)
	
	// Изменения в отборы вносить согласовано с текстами запросов количества элементов в разделе.
	// См. метод ТекстЗапросаКоличестваЭлементовПоРазделуБезОтбора.
	
	РежимОтображения = НастройкиОтображения.РежимОтображения;
	СписокПользователей = НастройкиОтображения.СписокПользователей;
	Если Раздел = "ПодписатьИсх" Тогда
		Если РежимОтображения = "МоиДокументы" Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,
			"Ответственный", СписокПользователей, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
			
		КонецЕсли;

		Значение =  ПредопределенноеЗначение("Перечисление.СтатусыДокументовEDI.НаПодписи");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,
			"ТекущийСтатус", Значение, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
		Значение = Новый Массив;
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщенийEDI.COMDOC006"));
		Значение.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщенийEDI.COMDOC007"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,
			"ВидСообщения", Значение, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		
			
		
	КонецЕсли;
	
		
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	СохранитьОтборы(ИмяФормы, "Отборы", БыстрыеОтборы);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормы, "РежимОтображения", РежимОтображения);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОбновитьНавигациюПоРазделамНаСервере(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДействийПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйРаздел = Элемент.ТекущиеДанные.Значение;
	Если НовыйРаздел <> ТекущийРаздел Тогда
		ПриИзмененииРаздела(НовыйРаздел);
	КонецЕсли;
	

КонецПроцедуры


