#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда




Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаРегистрации = ТекущаяДата();
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаРегистрации = ТекущаяДата();
	ДополнительныеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаОткрытия) И ЗначениеЗаполнено(ДатаЗакрытия)
		И ДатаОткрытия > ДатаЗакрытия Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Дата закрытия не может быть раньше даты открытия!",,"ДатаЗакрытия","Объект");
	КонецЕсли;
КонецПроцедуры

#КонецЕсли


