


Функция НайтиАдресДоставкиПоGLN(Контрагент,АдресДоставкиGLN)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТочкиДоставки.Ссылка Как АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Контрагент
	|	И ТочкиДоставки.GLN = &GLN";
	
	Запрос.УстановитьПараметр("GLN", АдресДоставкиGLN);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресДоставки;

КонецФункции

Функция НайтиАдресДоставкиПоGlobal_ID(Global_ID)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Global_ID = &Global_ID";
	
	Запрос.УстановитьПараметр("Global_ID", Global_ID);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.ТочкиДоставки.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресДоставки;

КонецФункции
