


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


Функция ЭтоБаффит(Подразделение)Экспорт
	

	
	УстановитьПривилегированныйРежим(Истина);
	Если Подразделение = Неопределено тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Подразделение =   Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0ba-d29a-11e6-80d2-0050569272d9"));//Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008");
	
КонецФункции

Функция ЭтоАттика(Подразделение)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если Подразделение = Неопределено тогда
		Возврат Ложь;
	КонецЕсли;

	АТТ = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0b4-d29a-11e6-80d2-0050569272d9"));
	ТабакДигма = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("41d2629d-0305-11eb-a2dc-0050568e6e8c"));
	КурКума = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("d8eefaa0-4b51-11ee-bbc4-005056bc658e"));
	
	Если Подразделение = АТТ Или Подразделение = ТабакДигма Или Подразделение = КурКума Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

Функция ЭтоФабрикаСыра(Подразделение) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Если Подразделение = Неопределено тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФСПр = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0b8-d29a-11e6-80d2-0050569272d9"));
	ТСФС = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("b6315344-cb1a-11ee-a5ab-005056bf2a5e"));
	
	Если Подразделение = ФСПр Или Подразделение = ТСФС Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоФабрикаСпеций(Подразделение) Экспорт 
		
	УстановитьПривилегированныйРежим(Истина);
	Если Подразделение = Неопределено тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Подразделение = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("9ad5f0d0-6281-11ee-a5a1-005056bf2a5e"));	
	
КонецФункции

Функция НайтиПодразделениеПоКоду(Знач ИД)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Код = &ИД";
	
	Запрос.УстановитьПараметр("ИД", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	 
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ ЗначениеРазрешено(Ссылка)";

	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;	

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Код");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

#КонецОбласти

#КонецЕсли
