
&НаСервере
Процедура ЗагрузитьНаСервере()
	ПоследняяСтрока = ТабДок.ВысотаТаблицы;
	ПоследняяКолонка = ТабДок.ШиринаТаблицы;
	ОбластьЯчеек = ТабДок.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	// Создаем объект для интеллектуального построения отчетов,
	// указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	// Результат выгружаем в таблицу значений.
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ГруппаНаименование100 КАК Группа,
	|	ТЗ.Наименование100 КАК Наименование,
	|	ТЗ.Формулировка300 КАК Формулировка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Группа КАК Группа,
	|	ВТ.Наименование КАК Наименование,
	|	ВТ.Формулировка КАК Формулировка
	|ИЗ
	|	ВТ КАК ВТ
	|ИТОГИ ПО
	|	Группа";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапроса.Выгрузить();
	
	ВыборкаГруппа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл
		Группа = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьГруппу();
		Группа.Родитель = Корень;
		Группа.Наименование = СокрЛП(ВыборкаГруппа.Группа);
		Группа.ВидРасчетаИтогов = Перечисления.ТК_ВидРасчетаИтогаГруппыАнкетирования.Сумма;
		Группа.Коэффициент = 1;
		Группа.Записать();
		
		ВыборкаДетальныеЗаписи = ВыборкаГруппа.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
			Вопрос.Родитель = Группа.Ссылка;
			Вопрос.Наименование = СокрЛП(ВыборкаДетальныеЗаписи.Наименование);
			Вопрос.Формулировка = СокрЛП(ВыборкаДетальныеЗаписи.Формулировка);
			Вопрос.ТипЗначения = Перечисления.ТипыОтветовНаВопрос.Булево;
			Вопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево;
			Вопрос.ТребуетсяКомментарий = Истина;
			Вопрос.ВидПереключателя = Перечисления.ВидыПереключателяВАнкетах.Переключатель;
			Вопрос.ВидФлажка = Перечисления.ВидыФлажкаВАнкетах.Флажок;
			Вопрос.Коэффициент = 1;
			Вопрос.ВидРасчетаИтогов = Перечисления.ТК_ВидРасчетаИтогаГруппыАнкетирования.Сумма;
			Вопрос.Записать();
		КонецЦикла;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
