#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	//
	//Ограничение.Текст =
	//"РазрешитьЧтениеИзменение
	//|	ГДЕ
	//|	 ЗначениеРазрешено(ТорговаяПлощадка)";
	//
	//Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ЗаписатьСостояниеДокумента(Документ,СтруктураСостояния,ВключаяПодчиненный = Ложь)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если СтруктураСостояния.Свойство("ДатаПоследнегоИзменения") Тогда
		ДатаИзменения = СтруктураСостояния.ДатаПоследнегоИзменения;
	Иначе
		ДатаИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.ТК_СостояниеДокументовИзменения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Документ);
	НаборЗаписей.Отбор.Период.Установить(ДатаИзменения);

	нЗапись = НаборЗаписей.Добавить();
	нЗапись.СсылкаНаОбъект = Документ;
	нЗапись.Период = ДатаИзменения;
	нЗапись.Состояние = СтруктураСостояния.Состояние;
	нЗапись.АвторИзменения = СтруктураСостояния.АвторИзменения;
	нЗапись.ТорговаяПлощадка = СтруктураСостояния.ТорговаяПлощадка;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;

	НаборЗаписей.Записать();
	
	
	Если ВключаяПодчиненный Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров";
		
		Запрос.УстановитьПараметр("ДокументОснование", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ВыборкаДетальныеЗаписи.Ссылка,СтруктураСостояния,Ложь);	
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры



#КонецОбласти
	
	
	
	
	
#КонецЕсли