

// Рассчитывает сумму акцизного налога исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            	- число, сумма от которой надо рассчитывать налоги, 
//  СуммаВключаетНалоги - булево, признак учета НДС и акциза в сумме, 
//  СтавкаНДС
//
// Возвращаемое значение:
//  Число, полученная сумма акцизного налога
//
Функция РассчитатьСуммуАкцизногоНалога(Сумма, СуммаВключаетАкциз, СтавкаНДС) Экспорт

	СтавкаАкцизногоНалога = УчетАкцизногоНалогаПовтИсп.ПолучитьСтавкуАкцизногоНалога(СтавкаНДС);
	Если СуммаВключаетАкциз Тогда
		СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога/(1+СтавкаАкцизногоНалога);
	Иначе
		СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога;
	КонецЕсли;
		
	Возврат СуммаАкцизногоНалога;

КонецФункции // РассчитатьСуммуАкцизногоНалога()
