#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЭтоГруппа Тогда
		
		// Обработка реквизита для РЛС
		Если Не ЭтоНовый() Тогда
			ГруппаДоступа = Ссылка;
		ИначеЕсли ЗначениеЗаполнено(ПолучитьСсылкуНового()) Тогда
			ГруппаДоступа = ПолучитьСсылкуНового();
		Иначе
			ГруппаДоступа = Справочники.ГруппыДоступаФизическихЛиц.ПолучитьСсылку();
			УстановитьСсылкуНового(ГруппаДоступа);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли