

Функция ПараметрыКонтрагента(Контрагент)Экспорт
	СтруктураОтвет =  Новый Структура("УчетнаяЗаписьEDI,ПолучательGLN");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТК_ПараметрыОбменаEDI.УчетнаяЗаписьEDI КАК УчетнаяЗаписьEDI,
		|	ТК_ПараметрыОбменаEDI.GLN КАК ПолучательGLN
		|ИЗ
		|	РегистрСведений.ТК_ПараметрыОбменаEDI КАК ТК_ПараметрыОбменаEDI
		|ГДЕ
		|	ТК_ПараметрыОбменаEDI.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураОтвет,Выборка);
	
	Возврат СтруктураОтвет;
	
КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	//Ограничение.Текст =
	//"РазрешитьЧтениеИзменение
	//|ГДЕ
	//|	ЗначениеРазрешено(Подразделение)";
	//
	//Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом
