


Процедура ЗаписатьОбъектСкубис(Ссылка)Экспорт
	
	Набор = РегистрыСведений.ТК_СправочникиСкубис.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Ссылка);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.Объект = Ссылка;
		НоваяЗапись.ИД = Строка(Ссылка.УникальныйИдентификатор());
		НоваяЗапись.Статус = 0;
	Иначе
		НоваяЗапись = Набор[0];
		Если НоваяЗапись.Статус = 0 ИЛИ НоваяЗапись.Статус = 1 Тогда
			Возврат;
		КонецЕсли;
		
		НоваяЗапись.Статус = 1;

	КонецЕсли;
	
	Набор.Записать();

КонецПроцедуры
