
&НаСервере
Процедура ЗагрузитьНаСервере()
	ТипЦены = Объект.ТипЦен;
	
	Для Каждого Стр Из Объект.Загрузка Цикл
			НаборЗаписей = РегистрыСведений.Наценки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Стр.Номенклатура);
			НаборЗаписей.Отбор.ТипЦен.Установить(ТипЦены);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество()=0 Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Объект = Стр.Номенклатура;
				НоваяЗапись.ТипЦен = ТипЦены;
			ИначеЕсли  НаборЗаписей.Количество()=1 Тогда
				НоваяЗапись = НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.ПроцентНаценки = Стр.ПроцентНаценки;
			НаборЗаписей.Записать();
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю("Загрузка завершена!!!");
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если Объект.Загрузка.Количество() = 0 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для загрузки'; uk = 'Немає даних для завантаження'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнены основные реквизиты'; uk = 'Немає даних для завантаження'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.Загрузка.Количество() > 0 Тогда 
		ЗагрузитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = КонецДня(Объект.КонецПериода);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВТаблицуНаСервере()
	ВсеОк = Истина;
	
	кАртикул = 1;
	кШтрихкод = 2;
	кПроцентНаценки = 3;
	
	ТаблицаЗагрузки = Новый ТаблицаЗначений;
	ТаблицаЗагрузки.Колонки.Добавить("Артикул");
	ТаблицаЗагрузки.Колонки.Добавить("Номенклатура");
	ТаблицаЗагрузки.Колонки.Добавить("ПроцентНаценки");
	
	//ПереборТаблицы
	Для Стр = 2 По ТабДок.ВысотаТаблицы Цикл 
		
		тАртикул = СокрЛП(ТабДок.Область(Стр, кАртикул).Текст);
		тШтрихкод = СокрЛП(ТабДок.Область(Стр, кШтрихкод).Текст);
		тПроцентНаценки = СокрЛП(ТабДок.Область(Стр, кПроцентНаценки).Текст);
		
		Если НЕ ПустаяСтрока(тАртикул) Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", тАртикул);
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() И НЕ ПустаяСтрока(тШтрихкод) Тогда
		
			Номенклатура = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиТоварПоШтрихКоду(тШтрихкод);
			Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
				ОбщегоНазначения.СообщитьПользователю("Обработка прервана!!!! Номер строки "+стр+". Не найдена номеклатура с артикулом " + тАртикул+". Проверьте правильность написания артикула и повторите загрузку.");
				ВсеОк = Ложь;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗагрузки.Добавить();
		НоваяСтрока.Артикул = Номенклатура.Артикул;
		НоваяСтрока.Номенклатура = Номенклатура;
		Если тПроцентНаценки = "" Тогда
			НоваяСтрока.ПроцентНаценки = 0;	
		Иначе
			НоваяСтрока.ПроцентНаценки = тПроцентНаценки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВсеОк ТОгда
		Возврат;
	КонецЕсли;
	
	Объект.Загрузка.Загрузить(ТаблицаЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВТаблицу(Команда)
	ЗагрузитьВТаблицуНаСервере();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.сЗагрузка;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.ЗагрузкаСЭкселя;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Объект.Загрузка.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаЗагрузки(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.сЗагрузка;
КонецПроцедуры
