
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого ТТН ИЗ ПараметрКоманды Цикл
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.ТК_ТТН", "МаршрутныйЛист,ТТН_Аттика", ТТН, Новый Структура());
		
		МассивДляПечати = ПечатьПакетаДокументов(ПараметрКоманды);
		
		Для Каждого строка Из МассивДляПечати Цикл
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(строка.ИмяМенеджерПечати, строка.ИменаМакетов, строка.Доки, Новый Структура("Порядок,СсылкаТТН","ПакетДокументов",ТТН));
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПечатьПакетаДокументов(МассивОбъектов)
	
	СоответствиеПечФормРН = Новый Соответствие;		
	СоответствиеПечФормРН.Вставить(Ложь		,"РасходнаяНакладнаяУКТВЭД,РасходнаяНакладнаяБезШапкиОтгрузка");
	СоответствиеПечФормРН.Вставить(Истина	,"РасходнаяНакладнаяУКТВЭД,РасходнаяНакладнаяУКТВЭД");
	
	СтруктураПечатиВозврата = Новый Структура;
	СтруктураПечатиВозврата.Вставить("ИмяМенеджерПечати", "Документ.ВозвратПоставщику");
	СтруктураПечатиВозврата.Вставить("ИменаМакетов", "ВозвратПоставщикуСПартиями,ВозвратПоставщикуСПартиями");
	
	СтруктураПечатиПеремещение = Новый Структура;
	СтруктураПечатиПеремещение.Вставить("ИмяМенеджерПечати", "Документ.ПеремещениеТоваров");
	СтруктураПечатиПеремещение.Вставить("ИменаМакетов", "ПеремещениеТоваров,ПеремещениеТоваров");
	
	СтруктураПечатиРеализация = Новый Структура;
	СтруктураПечатиРеализация.Вставить("ИмяМенеджерПечати", "Документ.РеализацияТоваров");
	СтруктураПечатиРеализация.Вставить("ИменаМакетов", СоответствиеПечФормРН);
	
	СоответствиеТиповПечати = Новый Соответствие;
	СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.ВозвратПоставщику"), СтруктураПечатиВозврата);
	СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.ПеремещениеТоваров"), СтруктураПечатиПеремещение);
	СоответствиеТиповПечати.Вставить(Тип("ДокументСсылка.РеализацияТоваров"), СтруктураПечатиРеализация);
	
	Для Каждого ТТН Из МассивОбъектов Цикл
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Порядок");
		ТЗ.Колонки.Добавить("Реглам");
		ТЗ.Колонки.Добавить("ТипДок");
		ТЗ.Колонки.Добавить("Документ");
		
		Порядок	= 0;
		ТипДок	= "";
		Реглам	= "";
		
		Для Каждого строка Из ТТН.Источники Цикл
			Если ЗначениеЗаполнено(строка.Документ) И ТипЗнч(строка.Документ) = ТИП("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
				Документ = строка.Отгрузка;
			Иначе
				Документ = строка.Документ;
			КонецЕсли;
			Если ЗначениеЗаполнено(Документ) И Документ.Проведен Тогда
				РегламТек = ?(ТипЗнч(Документ) = ТИП("ДокументСсылка.ТК_НалоговаяНакладная"),Истина,Документ.РегламентированныйУчет);
				ТипДокТек = ТипЗнч(Документ);
				стрТЗ = ТЗ.Добавить();
				стрТЗ.Документ	= Документ;
				стрТЗ.Реглам	= РегламТек;
				стрТЗ.ТипДОк	= ТипДокТек;
				Если ТипДокТек	= ТИП("ДокументСсылка.РеализацияТоваров") Тогда
					Если РегламТек <> Реглам ИЛИ ТипДокТек <> ТипДок Тогда
						Порядок	= 1 + Порядок;
						Реглам	= РегламТек;
						ТипДок	= ТипДокТек;
					КонецЕсли;
				Иначе
					Если ТипДокТек <> ТипДок Тогда
						Порядок	= 1 + Порядок;
						ТипДок	= ТипДокТек;
					КонецЕсли;
				КонецЕсли;
				стрТЗ.Порядок = Порядок;
			КонецЕсли;
		КонецЦикла;
		
		МассивДляПечати = Новый Массив;
		
		Для н = 1 По Порядок Цикл
			СтруктураДляПечати = Новый Структура;	
			ВТ = ТЗ.Скопировать(Новый Структура("Порядок",н));
			//Доки = ВТ.ВыгрузитьКолонку("Документ");
			ТипДокВТ =ВТ[0].ТипДОк; 
			РегламВТ =ВТ[0].Реглам; 
			СтруктураПечати = СоответствиеТиповПечати.Получить(ТипДокВТ);
			Если СтруктураПечати <> Неопределено Тогда
				ИменаМакетов = ?(ТипДокВТ = ТИП("ДокументСсылка.РеализацияТоваров"),СтруктураПечати.ИменаМакетов.Получить(РегламВТ),СтруктураПечати.ИменаМакетов);
				СтруктураДляПечати.Вставить("ИмяМенеджерПечати",СтруктураПечати.ИмяМенеджерПечати);
				СтруктураДляПечати.Вставить("ИменаМакетов",ИменаМакетов);
				СтруктураДляПечати.Вставить("Доки",ВТ.ВыгрузитьКолонку("Документ"));
				МассивДляПечати.Добавить(СтруктураДляПечати);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивДляПечати;
	
КонецФункции