
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ПараметрКоманды);
	
	СтандартнаяДата = Новый СтандартнаяДатаНачала;
	СтандартнаяДата.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Дата", СтандартнаяДата);
	ПараметрыФормы.Отбор.Вставить("Склад", МассивСсылок);
	
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "ПродажиПоЧекам");
	
	ОткрытьФорму(
		"Отчет.ПродажиПоЧекам.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
