#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Получает массив узлов обмена, используемых в настройках обмена.
//
Функция ПолучитьМассивУзловПланаОбмена() Экспорт
		
	ТекстЗапроса = 	"ВЫБРАТЬ
	               	|	ОбменZUP.Ссылка КАК Ссылка
	               	|ИЗ
	               	|	ПланОбмена.ОбменZUP КАК ОбменZUP
	               	|ГДЕ
	               	|	НЕ ОбменZUP.ПометкаУдаления
	               	|	И ОбменZUP.Ссылка <> &ЭтотУзел";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменZUP.ЭтотУзел());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивУзлов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		МассивУзлов.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат МассивУзлов;
	
КонецФункции


#КонецЕсли