
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", НачалоДня(ТекущаяДата()));
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	ОтборыСписковКлиентСервер.ЗаполнитьСписокВыбораОтбораПоАктуальности(Элементы.ОтборСрокДействия.СписокВыбора);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Менеджер", Менеджер, СтруктураБыстрогоОтбора);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Организация", Организация, СтруктураБыстрогоОтбора);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Контрагент", Контрагент, СтруктураБыстрогоОтбора);
	ОтборыСписковКлиентСервер.ОтборПоАктуальностиПриСозданииНаСервере(Список, Актуальность, ДатаСобытия, СтруктураБыстрогоОтбора);
	
	
	
	Если ОтборыСписковКлиентСервер.НеобходимОтборПоСостояниюПриСозданииНаСервере(Состояние, СтруктураБыстрогоОтбора) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Контрагент") Тогда
		
		Элементы.ОтборКонтрагент.Видимость = Ложь;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "Менеджер", Менеджер, СтруктураБыстрогоОтбора, Настройки);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "Организация", Организация, СтруктураБыстрогоОтбора, Настройки);
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(Список, "Контрагент", Контрагент, СтруктураБыстрогоОтбора, Настройки);
	ОтборыСписковКлиентСервер.ОтборПоАктуальностиПриЗагрузкеИзНастроек(Список, Актуальность, ДатаСобытия, СтруктураБыстрогоОтбора, Настройки);
	Если ОтборыСписковКлиентСервер.НеобходимОтборПоСостояниюПриЗагрузкеИзНастроек(Состояние, СтруктураБыстрогоОтбора, Настройки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние", Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокДействияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ПриИзмененииОтбораПоАктуальности(Список, Актуальность, ДатаСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокДействияОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборыСписковКлиентСервер.ПриОчисткеОтбораПоАктуальности(Список, Актуальность, ДатаСобытия, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДиалогамиКлиент.ПриВыбореОтбораПоАктуальности(
	ВыбранноеЗначение, 
	СтандартнаяОбработка, 
	ЭтаФорма,
	Список, 
	"Актуальность", 
	"ДатаСобытия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"Организация", 
	Организация, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(Организация));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"Контрагент", 
	Контрагент, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"Менеджер", 
	Менеджер, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(Менеджер));
	
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ФормаКлонироватьАттика.Доступность = ЭтоСБС(Элемент.ТекущиеДанные.Организация);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаСервере
Процедура КлонироватьАттикаНаСервере(ДоговорОригинал)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	ДатаНачалаДействия = Дата('20230102');
	ДоговорКлон = ДоговорОригинал.Скопировать();
	ДоговорКлон.УстановитьНовыйКод();
	ДоговорКлон.Дата = ДатаНачалаДействия;
	ДоговорКлон.Номер = "А"+ДоговорОригинал.Номер;
	ДоговорКлон.ДатаНачалаДействия = ДатаНачалаДействия;
	ДоговорКлон.ДатаОкончанияДействия = КонецГода(ДатаНачалаДействия);
	ДоговорКлон.Организация = Справочники.Организации.НайтиПоКоду("D109");
	
	СформироватьРабочееНаименованиеДоговора(ДоговорКлон);
	СформироватьРабочееНаименованиеДоговораДляПечати(ДоговорКлон);
	
	ДоговорКлон.Записать();
	
	ЗаписатьУсловияЦенообразования(ДоговорКлон.Ссылка,ДоговорОригинал,ДатаНачалаДействия);
	ЗаписатьСрокиОплатПоДоговорам(ДоговорКлон.Ссылка,ДоговорОригинал,ДатаНачалаДействия);
	
	ЗафиксироватьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
&НаСервере
Процедура КлонироватьСБСНаТосканаТрейдинг(ДоговорОригинал)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	ДатаНачалаДействия = Дата('20240301');
	ДоговорКлон = ДоговорОригинал.Скопировать();
	ДоговорКлон.УстановитьНовыйКод();
	ДоговорКлон.Дата = ДатаНачалаДействия;
	ДоговорКлон.Номер = ДоговорОригинал.Номер + "Т";
	ДоговорКлон.ДатаНачалаДействия = ДатаНачалаДействия;
	ДоговорКлон.ДатаОкончанияДействия = КонецГода(ДатаНачалаДействия);
	ДоговорКлон.Организация = Справочники.Организации.НайтиПоКоду("CON000249");	//	ТОСКАНА ТРЕЙДІНГ ТОВ
	ДоговорКлон.Подразделение = Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000010");	//	Аттика Дистрибуция+Опт
	ДоговорКлон.ВариантПродления = Перечисления.ВариантыПродленияДоговоров.КаждыйГод;
	
	СформироватьРабочееНаименованиеДоговора(ДоговорКлон);
	СформироватьРабочееНаименованиеДоговораДляПечати(ДоговорКлон);
	
	ДоговорКлон.Записать();
	
	ЗаписатьУсловияЦенообразования(ДоговорКлон.Ссылка,ДоговорОригинал,ДатаНачалаДействия);
	ЗаписатьСрокиОплатПоДоговорам(ДоговорКлон.Ссылка,ДоговорОригинал,ДатаНачалаДействия);
	
	ЗафиксироватьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьРабочееНаименованиеДоговора(ДоговорКлон)
	
	текВидДоговора = ?(ЗначениеЗаполнено(ДоговорКлон.ВидДоговора), НРег(СокрЛП(ДоговорКлон.ВидДоговора)), НСтр("ru = 'Договор'; uk = 'Договір'"));	
	текНомер = СокрЛП(ДоговорКлон.Номер);
	
	текПериод = "";
	Если ЗначениеЗаполнено(ДоговорКлон.ДатаНачалаДействия) Тогда 
		текПериод = НСтр("ru = 'от'; uk = 'від'") + " " + Формат(ДоговорКлон.ДатаНачалаДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДоговорКлон.ДатаОкончанияДействия) Тогда 
		текПериод = текПериод + ?(Не ПустаяСтрока(текПериод), " ", "") + НСтр("ru = 'по'; uk = 'до'") + " " + Формат(ДоговорКлон.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ДоговорКлон.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"%1 %2 %3",
	текВидДоговора,
	текНомер,
	текПериод);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьРабочееНаименованиеДоговораДляПечати(ДоговорКлон)
	
	текВидДоговора = ?(ЗначениеЗаполнено(ДоговорКлон.ВидДоговора), НРег(СокрЛП(ДоговорКлон.ВидДоговора)), НСтр("ru = 'Договор'; uk = 'Договір'"));	
	текНомер = СокрЛП(ДоговорКлон.Номер);
	
	текПериод = "";
	Если ЗначениеЗаполнено(ДоговорКлон.ДатаНачалаДействия) Тогда 
		текПериод = НСтр("ru = 'от'; uk = 'від'") + " " + Формат(ДоговорКлон.ДатаНачалаДействия, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ДоговорКлон.НаименованиеДляПечати = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Договор %1 %2 %3",
	текВидДоговора,
	текНомер,
	текПериод);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьУсловияЦенообразования(ДоговорНовый,Договор,ДатаНачалаДействия)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТК_УсловияЦенообразования.Период КАК Период,
	                      |	ТК_УсловияЦенообразования.Объект КАК Объект,
	                      |	ТК_УсловияЦенообразования.ГруппаЦенообразования КАК ГруппаЦенообразования,
	                      |	ТК_УсловияЦенообразования.ВидУчета КАК ВидУчета,
	                      |	ТК_УсловияЦенообразования.НачалоДействия КАК НачалоДействия,
	                      |	ТК_УсловияЦенообразования.КонецДействия КАК КонецДействия,
	                      |	ТК_УсловияЦенообразования.Действует КАК Действует,
	                      |	ТК_УсловияЦенообразования.ТипЦены КАК ТипЦены
	                      |ИЗ
	                      |	РегистрСведений.ТК_УсловияЦенообразования КАК ТК_УсловияЦенообразования
	                      |ГДЕ
	                      |	ТК_УсловияЦенообразования.Объект = &Договор
	                      |	И ТК_УсловияЦенообразования.Действует
	                      |	И &ТекДата МЕЖДУ ТК_УсловияЦенообразования.НачалоДействия И ТК_УсловияЦенообразования.КонецДействия
	                      |	И (ТК_УсловияЦенообразования.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ОбщийУчет)
	                      |			ИЛИ ТК_УсловияЦенообразования.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НеРегламентированныйУчет))");
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	тзРез = Запрос.Выполнить().Выгрузить();
	Если тзРез.Количество()>0 тогда
		
		тзРез.ЗаполнитьЗначения(ДоговорНовый, "Объект");
		//тзРез.ЗаполнитьЗначения(ДатаНачалаДействия, "НачалоДействия");
		//тзРез.ЗаполнитьЗначения(КонецГода(ДатаНачалаДействия), "КонецДействия");
		////тзРез.ЗаполнитьЗначения(ДатаНачалаДействия, "Период");
		
		нзУсловия = РегистрыСведений.ТК_УсловияЦенообразования.СоздатьНаборЗаписей();
		нзУсловия.Отбор.Объект.Установить(ДоговорНовый);
		нзУсловия.Загрузить(тзРез);
		нзУсловия.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьСрокиОплатПоДоговорам(ДоговорНовый,Договор,ДатаНачалаДействия)
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.СрокиОплатПоДоговорам ГДЕ ДоговорКонтрагента=&Договор");
	Запрос.УстановитьПараметр("Договор", Договор);
	тзРез = Запрос.Выполнить().Выгрузить();
	Если тзРез.Количество()>0 тогда
		
		тзРез.ЗаполнитьЗначения(ДоговорНовый, "ДоговорКонтрагента");
		//тзРез.ЗаполнитьЗначения(ДатаНачалаДействия, "Период");
		
		нзУсловия = РегистрыСведений.СрокиОплатПоДоговорам.СоздатьНаборЗаписей();
		нзУсловия.Отбор.ДоговорКонтрагента.Установить(ДоговорНовый);
		нзУсловия.Загрузить(тзРез);
		нзУсловия.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КлонироватьДоговора(Команда)
	Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		//КлонироватьАттикаНаСервере(Элементы.Список.ТекущаяСтрока);
		КлонироватьСБСНаТосканаТрейдинг(Элементы.Список.ТекущаяСтрока);
		ОповеститьОбИзменении(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСБС(Организация)
	ЭтоСБС = Организация = Справочники.Организации.ПолучитьОрганизациюПоЕДРПО("38397793");
	Возврат ЭтоСБС;
КонецФункции




#КонецОбласти