#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем



Процедура УстановитьОтборРезерва(ТорговаяПлощадка,Резерв,Пользователь)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ТК_АктивныеЗапросыНаОтборРезерваТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадка);
	нЗапись = НаборЗаписей.Добавить();
	нЗапись.ТорговаяПлощадка = ТорговаяПлощадка;
	нЗапись.Резерв = Резерв;
	нЗапись.Пользователь = Пользователь;
	нЗапись.Дата = ТекущаяДатаСеанса();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры




#КонецОбласти
	
#КонецОбласти

	
#КонецЕсли