

#Область СлужебныеПроцедурыИФункции


Процедура ТК_КазначействоУстановкаУчередиОбработкиЭлектронныхПисемПриЗаписи(Источник, Отказ) Экспорт
	
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.СтатусНовый = Истина Тогда 
		УстановитьОчередьОбновления(Источник);
	    Источник.ДополнительныеСвойства.СтатусНовый = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура УстановитьОчередьОбновления(ВходящееПисьмо)
	
	УстановитьПривилегированныйРежим(Истина);

	
	Если НЕ ТК_НастройкиСерверПовтИсп.УчетнаяЗаписьЭлектроннойПочтыКазанчейство(ВходящееПисьмо.УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаписи = РегистрыСведений.ТК_КазначействоОчередьЭлектронныхПисем.СформироватьСтруктуруЗаписи();
	СтруктураЗаписи.ЭлектронноеПисьмоВходящее = ВходящееПисьмо.Ссылка;
	
	
	РегистрыСведений.ТК_КазначействоОчередьЭлектронныхПисем.ЗаписатьОчередьЭлектронныхПисем(СтруктураЗаписи);
	
	
КонецПроцедуры


Процедура ТК_КазначействоУстановкаПроверкаНовыйПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("СтатусНовый", Ложь);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("СтатусНовый", Истина);

КонецПроцедуры

	

#КонецОбласти