

#Область ПроцедурыЗаписиДвиженийВРегистр


// Процедура формирует движения по РС "ОграничениеАссортимента"
// Параметры: 
// 		ДополнительныеСвойства - Структура
//   	Движения - Коллекция движений
//   	Отказ - Булево
Процедура ОтразитьАссортимент(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОграничениеАссортимента;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияАссортимент = Движения.ОграничениеАссортимента;
	ДвиженияАссортимент.Записывать = Истина;
	//
	ДвиженияАссортимент.Загрузить(Таблица);
	
КонецПроцедуры // ОтразитьЦеныНоменклатуры()

Процедура ОтразитьГрафикиЗаказов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_ГрафикиЗаказов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Движения = Движения.ТК_ГрафикиЗаказов;
	Движения.ТК_ГрафикиЗаказов.Записывать = Истина;
	Движения.ТК_ГрафикиЗаказов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОптимальноеКоличествоНоменклатуры(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_ОптимальноеКоличествоНоменклатуры;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Движения = Движения.ТК_ОптимальноеКоличествоНоменклатуры;
	Движения.ТК_ОптимальноеКоличествоНоменклатуры.Записывать = Истина;
	Движения.ТК_ОптимальноеКоличествоНоменклатуры.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти
