
Функция МожетСогласовывать(ТипЦен, Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласователиПротоколов.Согласователь КАК Согласователь
		|ИЗ
		|	РегистрСведений.СогласователиПротоколов КАК СогласователиПротоколов
		|ГДЕ
		|	СогласователиПротоколов.ТипЦен = &ТипЦен
		|	И СогласователиПротоколов.Согласователь = &Согласователь";
	
	Запрос.УстановитьПараметр("Согласователь", Пользователь);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции