
Функция НайтиКатегориюПоКоду(Знач Код)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_КатегорииЗаявок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТК_КатегорииЗаявок КАК ТК_КатегорииЗаявок
		|ГДЕ
		|	ТК_КатегорииЗаявок.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 

	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции
