

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистемы ЗапретРедактированияРеквизитовОбъектов.

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.Организации.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.ПодразделенияКомпании.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Документы.ТорговыеПлощадки.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.ПланыСчетов.СкладыКомпании.ПолноеИмя(), "");
	
КонецПроцедуры
