
Функция Наименование(Объект)	Экспорт
	Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = '%1: %2 - %3, Сб - Вс: %4 - %5%6'; uk = '%1: %2 - %3, Сб - Вс: %4 - %5%6'"),
	?(Объект.Выходной=1,"Вт - Пт","Пн - Пт"),
	Формат(Объект.Будни.Начало,"ДФ=ЧЧ:мм; ДП=00:00"),
	Формат(Объект.Будни.Окончание,"ДФ=ЧЧ:мм; ДП=24:00"),
	Формат(Объект.Выходные.Начало,"ДФ=ЧЧ:мм; ДП=00:00"),
	Формат(Объект.Выходные.Окончание,"ДФ=ЧЧ:мм; ДП=24:00"),
	?(ЗначениеЗаполнено(Объект.Выходной),", "+Выходной(Объект.Выходной)+НСтр("ru = ' - выходной'; uk = '- вихідний'"),""));
	
	Возврат Наименование;
КонецФункции

Функция Выходной(День)
	ДниНедели = Новый Соответствие;
	ДниНедели.Вставить(1,"Пн");
	ДниНедели.Вставить(2,"Вт");
	ДниНедели.Вставить(3,"Ср");
	ДниНедели.Вставить(4,"Чт");
	ДниНедели.Вставить(5,"Пт");
	ДниНедели.Вставить(6,"Сб");
	ДниНедели.Вставить(7,"Вс");
	
	ДеньНедели = ДниНедели.Получить(День);
	
	Возврат ДеньНедели;
КонецФункции

Функция ЧасыПриемаТовара(РежимРаботы)	Экспорт
	Если ЗначениеЗаполнено(РежимРаботы) Тогда
		ЧасыПриемаТовара = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1: %2 - %3, Сб - Вс: %4 - %5%6'; uk = '%1: %2 - %3, Сб - Вс: %4 - %5%6'"),
		?(РежимРаботы.Выходной=1,"Вт - Пт","Пн - Пт"),
		Формат(РежимРаботы.Будни.Начало+60*60,"ДФ=ЧЧ:мм; ДП=00:00"),
		Формат(РежимРаботы.Будни.Окончание-60*60*2,"ДФ=ЧЧ:мм; ДП=24:00"),
		Формат(РежимРаботы.Выходные.Начало+60*60,"ДФ=ЧЧ:мм; ДП=00:00"),
		Формат(РежимРаботы.Выходные.Окончание-60*60*2,"ДФ=ЧЧ:мм; ДП=24:00"),
		?(ЗначениеЗаполнено(РежимРаботы.Выходной),", "+Выходной(РежимРаботы.Выходной)+НСтр("ru = ' - выходной'; uk = '- вихідний'"),""));
		
		Возврат ЧасыПриемаТовара;
	КонецЕсли;
КонецФункции

