
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Дата = ТекущаяДата();
	
	Отчет.Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AT000003"));	//	Аттика 2007 ООО
	Отчет.Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("DG000003"));	//	Современные бизнес-системы ООО
	Отчет.Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("GL000104"));	//	Основа Инфо ООО
	Отчет.Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("GL000440"));	//	Табачная компания Слобожанщины ООО
	
	//Отчет.Товар.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0009000"));		//	Табачные изделия
	//Отчет.Товар.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0074400"));		//	Снеки
	Отчет.Товар.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0009900"));		//	Тара и упаковка
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьПредупреждение(,"Отчет очень ресурсоёмкий, не стоит запускать ВСЁ по ВСЕМУ!!!");
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	ПараметрыОтчета = Новый Структура;
	Для Каждого реквизит ИЗ Метаданные.Отчеты.ПродажиВНоль.Реквизиты Цикл
		ПараметрыОтчета.Вставить(реквизит.Имя,Отчет[реквизит.Имя]);	
	КонецЦикла;
	Возврат Отчеты.ПродажиВНоль.ОтчетВывести(ПараметрыОтчета);
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Отчет.Склады) Тогда
		Отчет.ИсключитьСклады = НЕ ЗначениеЗаполнено(Отчет.Склады);
	КонецЕсли;
	СформироватьНаСервере().Показать("НулевыеПродажи "+Формат(Отчет.Дата,"ДФ=yyyy-MM-dd"));
КонецПроцедуры