
Процедура Обмен_PowerBi_ПриЗаписиОбъектаСправочника(Источник, Отказ) Экспорт
	
	//Если Отказ Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//ТипОбъекта = ТипЗнч(Источник);
	////МассивУзлов = Новый Массив;
	//
	//Если ТипОбъекта = Тип("СправочникОбъект.ТорговыеПлощадки") Тогда 			
	//	ПодразделениеКомпании = Источник.ПодразделениеКомпании;
	//	
	//	УзелОбменаPowerBi = ОбменPowerBi_ПовтИсп.УзелОбмена();
	//    МассивПодразделений = ОбменPowerBi_ПовтИсп.ПолучитьПодразделенияУзлаОбмена(УзелОбменаPowerBi);
	//	
	//	Если МассивПодразделений.Найти(ПодразделениеКомпании) <> Неопределено Тогда 
	//		//МассивУзлов.Добавить(УзелОбменаPowerBi);
	//		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменаPowerBi, Источник);	
	//	КонецЕсли;		
	//КонецЕсли;
	
КонецПроцедуры


Процедура Обмен_PowerBi_ПриЗаписиРегистраНакопленияПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	//Если Отказ Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//УзелОбменаPowerBi = ОбменPowerBi_ПовтИсп.УзелОбмена();
	//МассивПодразделений = ОбменPowerBi_ПовтИсп.ПолучитьПодразделенияУзлаОбмена(УзелОбменаPowerBi);
	//
	//ОтборРегистратор = Источник.Отбор.Найти("Регистратор");
	//Если ОтборРегистратор = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//Если ОтборРегистратор.Использование И ОтборРегистратор.ВидСравнения = ВидСравнения.Равно Тогда 
	//	Регистратор = ОтборРегистратор.Значение;
	//Иначе
	//	Возврат;
	//КонецЕсли;
	//
	//Если Источник.ДополнительныеСвойства.Свойство("ДляПроведения") И Источник.ДополнительныеСвойства.ДляПроведения.Свойство("ПодразделениеКомпании") Тогда
	//	ПодразделениеКомпании = Источник.ДополнительныеСвойства.ДляПроведения.ПодразделениеКомпании;
	//ИначеЕсли Источник.Количество() > 0 Тогда 
	//	ПодразделениеКомпании = Источник[0].ПодразделениеКомпании;
	//ИначеЕсли Регистратор <> Неопределено И Регистратор.Метаданные().Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено Тогда
	//	ПодразделениеКомпании = Регистратор.ПодразделениеКомпании;
	//Иначе
	//	ПодразделениеКомпании = Неопределено;	
	//КонецЕсли;
	//
	//Если МассивПодразделений.Найти(ПодразделениеКомпании) <> Неопределено Тогда 
	//	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбменаPowerBi, Источник);
	//КонецЕсли;
	
КонецПроцедуры
