


&НаСервере
Функция ДанныеСканировки(МассивСтрок)
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		ТекстовыйДокумент.ДобавитьСтроку(Строка(Стр.РезервированиеЗаказовПокупателя));
		
		Очередь = РегистрыСведений.ДанныеДляБАТ.СоздатьМенеджерЗаписи();
		Очередь.РезервированиеЗаказовПокупателя = Стр.РезервированиеЗаказовПокупателя;
		Очередь.Статус  = Стр.Статус;
		Очередь.ДатаСканирования  = Стр.ДатаСканирования;
		Очередь.Пользователь  = Стр.Пользователь;
		Очередь.ИД_Сообщения  = Стр.ИД_Сообщения;
		Очередь.ИД_Передачи  = Стр.ИД_Передачи;
		Очередь.ИД_События  = Стр.ИД_События;
		Очередь.Организация  = Стр.Организация;

		
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текСтрока = Очередь.ДанныеСканирования.Получить();
			Если текСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТекстовыйДокумент.ДобавитьСтроку(текСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	ТекстовыйДокумент;
	
КонецФункции


&НаКлиенте
Процедура СохранитьДанныеСканирования(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = ДанныеСканировки(МассивСтрок);
	ТекстовыйДокумент.Показать();
	
КонецПроцедуры

