
Функция ReportGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяОтчета = Запрос.ПараметрыURL["Report"];
	Параметры = Запрос.ПараметрыURL["Param"];

	ДанныеОтвета = Неопределено;
	
	Если ИмяОтчета = "DailyReportFC" Тогда
		Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(Параметры);		
		ДанныеОтвета = ТК_PowerBi_РаботаHTTP_Сервис.ПолучитьЕжедневныйОтчетФабрикаСыра(Параметры);
	КонецЕсли;
	
	Если ДанныеОтвета <> Неопределено Тогда 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Ответ.Заголовки.Вставить("content-type", "application/json");
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
