

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем

#КонецОбласти



Функция ПолучитьСрокиВозврата(Подразделение,Номенклатура)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиВозвратаТовара.СрокПодачи + СрокиВозвратаТовара.СрокВозврата КАК резСрок
		|ИЗ
		|	РегистрСведений.СрокиВозвратаТовара КАК СрокиВозвратаТовара
		|ГДЕ
		|	СрокиВозвратаТовара.Подразделение = &Подразделение
		|	И СрокиВозвратаТовара.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.резСрок;

КонецФункции


#КонецОбласти



#КонецЕсли
