#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка рецептур
	ТаблицаРецептур = Товары.Выгрузить(, "НомерСтроки, Номенклатура, Рецептура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тчТовары.НомерСтроки КАК НомерСтроки,
	               |	тчТовары.Номенклатура КАК Номенклатура,
	               |	тчТовары.Рецептура КАК Рецептура
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	&ТаблицаРецептур КАК тчТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.НомерСтроки КАК НомерСтроки,
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.Рецептура КАК Рецептура,
	               |	втТовары.Рецептура.Проведен КАК РецептураПроведен,
	               |	втТовары.Рецептура.Продукция КАК РецептураПродукция
	               |ИЗ
	               |	втТовары КАК втТовары
	               |ГДЕ
	               |	втТовары.Рецептура <> ЗНАЧЕНИЕ(Документ.Рецептура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТаблицаРецептур", ТаблицаРецептур);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НомерСтроки = Выборка.НомерСтроки;
		ТекстСообщения = "";
		
		Если Выборка.Рецептура = Ссылка Тогда 
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Обнаружена рекурсивная ссылка на записываему рецептуру в строке %1 списка ""Товары""'; uk = 'Виявлене рекурсивне посилання на записувану рецептуру в рядку %1 списку ""Товари""'"),
					НомерСтроки);
					
		ИначеЕсли Выборка.Номенклатура <> Выборка.РецептураПродукция Тогда 
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Отличается продукция рецептуры ''%2'' и ингридиента ''%3'' в строке %1 списка ""Товары""'; uk = 'Відрізняється продукція рецептури ''%2'' і інгрідієнта ''%3'' в рядку %1 списку ""Товари""'"),
					НомерСтроки,
					Выборка.РецептураПродукция,
					Выборка.Номенклатура);
					
		ИначеЕсли Не Выборка.РецептураПроведен Тогда 
					
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Обнаружена непроведенная рецептура ''%2'' в строке %1 списка ""Товары""'; uk = 'Виявлене непроведена рецептура ''%2'' в рядку% 1 списку ""Товари""'"),
					НомерСтроки,
					Выборка.Рецептура);					
					
		Иначе			
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Ссылка, 
				"Товары["+ (НомерСтроки -1) +"].Рецептура",
				,
				Отказ);		
		КонецЕсли;		
	КонецЦикла;
	
	
	//Если ОбщегоНазначенияТК.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект,ПроверяемыеРеквизиты) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры




Процедура СообщитьОбОшибках(ТаблицаОшибок,МенеджерВременныхТаблиц)
	
	//Если ТаблицаОшибок.Количество()> 0 Тогда
	//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	НСтр("ru='Перемещение превышает остаток товара компании на складе %1 %2 %3';uk='Переміщення перевищує залишок товару компанії на складі %1 %2 %3'"),
	//	СкладКомпании);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//	ТекстСообщения,
	//	ЭтотОбъект);	
	//	
	//	Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл 
	//		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru='Номенклатура: %1, недостаточно %2 %3';uk='Номенклатура: %1, недостатньо %2 %3'"),
	//		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.ХарактеристикаНоменклатуры),
	//		СтрокаТаблицы.Количество,
	//		СтрокаТаблицы.ЕдиницаИзмерения);
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		ТекстСообщения,
	//		Ссылка);
	//		
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	
КонецПроцедуры



#Область ИнициализацияИЗаполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор =  Пользователи.ТекущийПользователь();
	//Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	Актуальная = Истина;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
КонецПроцедуры // ИнициализироватьДокумент()


#КонецОбласти

	



#КонецЕсли
