
&НаСервере
Функция ДанныеСканировки(МассивСтрок)
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		Очередь = РегистрыСведений.ТК_ТСД_ДанныеДляОтправкиТабак.СоздатьМенеджерЗаписи();
		Очередь.ДокументСсылка = Стр.ДокументСсылка;
		Очередь.Производитель  = Стр.Производитель;
		Очередь.Статус  = Стр.Статус;
		Очередь.ДатаСканирования  = Стр.ДатаСканирования;
		
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текСтрока = Очередь.ДанныеСканирования.Получить();
			Если текСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстовыйДокумент.ДобавитьСтроку(текСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат	ТекстовыйДокумент;
	
КонецФункции


&НаКлиенте
Процедура ПоказатьДанныеСканировки(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = ДанныеСканировки(МассивСтрок);
	ТекстовыйДокумент.Показать();
КонецПроцедуры
