#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для передачи в параметрах вспомогательных методов (см. ниже).
//       Соответствует 1 параметру процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь);
//
// Примеры:
//
//  1. Установка описания варианта.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Описание = НСтр("ru = '<Описание>'");
//
//  2. Отключение варианта отчета.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Включен = Ложь;
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиОтчета.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Продажи.Подсистемы.ПродажиДистрибуции);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализПродажСлавянск");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ продаж Славянск'; uk = 'Аналіз продажу Слав''янськ'");
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Продажи.Подсистемы.ПродажиДистрибуции);
			
КонецПроцедуры

Функция ПодключениеКВнешнемуИсточнику(ТекстСообщения) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = ПредопределенноеЗначение("СостояниеВнешнегоИсточникаДанных.Подключен") Тогда
		Возврат Истина;
	КонецЕсли;	

	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
	Иначе
		ТекстСообщения = ТекстСообщения + НСтр("ru='Операционная система "+СистемнаяИнформация.ТипПлатформы +" не поддерживается.';uk='Операційна система "+ СистемнаяИнформация.ТипПлатформы +" не підтримується'")+Символы.ПС;
		
		Возврат Ложь
	КонецЕсли;
			
	ПараметрыПодключенияВИ = ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьОбщиеПараметрыСоединения();
	ПараметрыПодключенияВИ.АутентификацияСтандартная = Истина;
	ПараметрыПодключенияВИ.АутентификацияОС = Ложь;
	ПараметрыПодключенияВИ.ИмяПользователя = "1cuser"; 
	ПараметрыПодключенияВИ.Пароль = "fCG2eSvVd5mtqBpe";
	ПараметрыПодключенияВИ.СтрокаСоединения = СтрокаПодключения +";SERVER=NIELSENBIS;DATABASE=Attika_Tranzit;LANGUAGE=русский";
	
	ПараметрыПодключенияВИ.СУБД = "MSSQLServer";
	
	ВнешниеИсточникиДанных.NIELSENBIS.УстановитьОбщиеПараметрыСоединения(ПараметрыПодключенияВИ);

	Попытка
		ВнешниеИсточникиДанных.NIELSENBIS.УстановитьСоединение();
	Исключение
		ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
	КонецПопытки;
		
	Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = СостояниеВнешнегоИсточникаДанных.Подключен Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции



#КонецОбласти
	
	
	
	
	
	
	
	
	
	
#КонецЕсли