
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	МассивФайлов = ОбработатьНаСервере(ПараметрКоманды);	
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов();
	ПараметрыДиалога.ВыборКаталога = Истина;

	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите каталог сохранения .XML файлов'; uk = 'Оберіть каталог збереження .XML файлів'");
	
	НачатьПолучениеФайловССервера(МассивФайлов,ПараметрыДиалога);
	
	
КонецПроцедуры





&НаСервере
Функция ОбработатьНаСервере(ПараметрКоманды)
	
	МассивВыгрузки = Документы.Антимонопольный.СформироватьАнтимонопольный(ПараметрКоманды);
	УИД = Новый УникальныйИдентификатор;
	МассивФайлов = Новый Массив;
	
	Для Каждого СтруктураДокумента Из МассивВыгрузки Цикл 
			МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(СтруктураДокумента.Выгрузка.ИмяФайла, ПоместитьВоВременноеХранилище(СтруктураДокумента.Выгрузка.ДанныеXML,УИД)));
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции
