

Функция ПолучитьПараметрыПодключения(УчЗапись,Выгружать = Истина) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",УчЗапись);
	Запрос.УстановитьПараметр("Выгружать",Выгружать);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_УчетныеЗаписиEDI.СоединениеССервером КАК ИмяСервераFTP,
		|	ТК_УчетныеЗаписиEDI.ИмяПользователяНаСервере КАК ИмяПользователяFTP,
		|	ТК_УчетныеЗаписиEDI.ПарольПользователяНаСервере КАК ПарольFTP,
		|	ТК_УчетныеЗаписиEDI.ПортСервера КАК ПортFTP,
		|	ВЫБОР
		|		КОГДА &Выгружать
		|			ТОГДА ТК_УчетныеЗаписиEDI.КаталогВыгрузки
		|		ИНАЧЕ ТК_УчетныеЗаписиEDI.КаталогЗагрузки
		|	КОНЕЦ КАК ТекущийКаталогFTP,
		|	ТК_УчетныеЗаписиEDI.ШифрованиеSSL КАК ИспользоватьSSL,
		|	ТК_УчетныеЗаписиEDI.ПассивныйРежим КАК ПассивныйРежим,
		|	ТК_УчетныеЗаписиEDI.ПоставщикEDI КАК ПоставщикEDI,
		|	ТК_УчетныеЗаписиEDI.ИмяФайлаВНРег КАК ИмяФайлаВНРег
		|ИЗ
		|	Справочник.ТК_УчетныеЗаписиEDI КАК ТК_УчетныеЗаписиEDI
		|ГДЕ
		|	ТК_УчетныеЗаписиEDI.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыFTP = Новый Структура("ПоставщикEDI,ИмяСервераFTP,ИмяПользователяFTP,ПарольFTP,ПортFTP,ТекущийКаталогFTP,ИспользоватьSSL,ПассивныйРежим,КаталогНахожденияФайла,ИмяФайлаСообщения,Удалять,ИмяФайлаВНРег");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 	
	ЗаполнитьЗначенияСвойств(ПараметрыFTP,ВыборкаДетальныеЗаписи);
	
	Возврат ПараметрыFTP;
		
	
КонецФункции


Функция ПолучитьМассивУчетныхЗаписейEDI(Выгружать = Истина)Экспорт
	
	Массив = Новый  Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_УчетныеЗаписиEDI.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение
	|ИЗ
	|	Справочник.ТК_УчетныеЗаписиEDI КАК ТК_УчетныеЗаписиEDI
	|ГДЕ
	|	ТК_УчетныеЗаписиEDI.ПометкаУдаления = ЛОЖЬ
	|	И ТК_УчетныеЗаписиEDI.Отключен = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТК_УчетныеЗаписиEDIПодразделения.Ссылка,
	|	ТК_УчетныеЗаписиEDIПодразделения.ПодразделениеКомпании
	|ИЗ
	|	Справочник.ТК_УчетныеЗаписиEDI.Подразделения КАК ТК_УчетныеЗаписиEDIПодразделения
	|ГДЕ
	|	ТК_УчетныеЗаписиEDIПодразделения.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТК_УчетныеЗаписиEDIПодразделения.Ссылка.Отключен = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыУчЗаписи = ПолучитьПараметрыПодключения(ВыборкаДетальныеЗаписи.Ссылка,Выгружать);
		
		Массив.Добавить(Новый Структура("Учетка,Подразделение,Параметры",ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Подразделение,ПараметрыУчЗаписи));
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
