
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МожноСоздатьЗаявку = ПравоДоступа("Использование", Метаданные.Обработки.СервисДеск);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаявку(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ДополнительныеПараметры = Новый Структура("НоваяЗаявка, ДанныеЗаявки", Истина, Новый Структура("Услуга, Плановая", ТекущиеДанные.Ссылка, ТекущиеДанные.Плановая));
	ОткрытьФорму("Обработка.СервисДеск.Форма.ФормаЗаявки", ДополнительныеПараметры, ЭтотОбъект,ЭтотОбъект,,,Новый ОписаниеОповещения("ВыполнитьПослеЗакрытия", ЭтотОбъект, "доппар"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПослеЗакрытия(Обновить, ДополнительныеПараметры)	Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Элементы.ФормаКомандаСоздатьЗаявку.Видимость = МожноСоздатьЗаявку И НЕ Элемент.ТекущиеДанные.ЭтоГруппа;
	КонецЕсли;
КонецПроцедуры


