
#Область Партии


Процедура ТекстЗапросаВтТекущиеДвиженияПартииТоваров(ТекстыЗапроса) Экспорт
	
	ИмяРегистра = "ВтТекущиеДвиженияПартииТоваров";

	ТекстЗапроса = "ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.ВидДвижения КАК ВидДвижения,
	|	Движения.СкладКомпании КАК СкладКомпании,
	|	Движения.Номенклатура КАК Номенклатура,
	|	Движения.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Движения.Партия КАК Партия,
	|	Движения.СтатусПартии КАК СтатусПартии,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.Количество
	|		ИНАЧЕ -Движения.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.Сумма
	|		ИНАЧЕ -Движения.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.СуммаБаз
	|		ИНАЧЕ -Движения.СуммаБаз
	|	КОНЕЦ КАК СуммаБаз,
	|	ВЫБОР
	|		КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Движения.СуммаНДС
	|		ИНАЧЕ -Движения.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ ВтТекущиеДвиженияПартииТоваров
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК Движения
	|ГДЕ
	|	Движения.Регистратор = &Ссылка";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ДвиженияПартииТоваровИзменение(ДополнительныеСвойства, ТаблицаДвижения)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("тзДвиженияПартииТоваров",ТаблицаДвижения);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВтТекущиеДвиженияПартииТоваров.Период КАК Период,
	|	ВтТекущиеДвиженияПартииТоваров.ВидДвижения КАК ВидДвижения,
	|	ВтТекущиеДвиженияПартииТоваров.СкладКомпании КАК СкладКомпании,
	|	ВтТекущиеДвиженияПартииТоваров.Номенклатура КАК Номенклатура,
	|	ВтТекущиеДвиженияПартииТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВтТекущиеДвиженияПартииТоваров.Партия КАК Партия,
	|	ВтТекущиеДвиженияПартииТоваров.СтатусПартии КАК СтатусПартии,
	|	ВтТекущиеДвиженияПартииТоваров.Количество КАК Количество,
	|	ВтТекущиеДвиженияПартииТоваров.Сумма КАК Сумма,
	|	ВтТекущиеДвиженияПартииТоваров.СуммаБаз КАК СуммаБаз,
	|	ВтТекущиеДвиженияПартииТоваров.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ втНовыеДвиженияПартийТоваров
	|ИЗ
	|	&тзДвиженияПартииТоваров КАК ВтТекущиеДвиженияПартииТоваров";
	Запрос.Выполнить();
	
	
КонецПроцедуры

Процедура СравнитьДвиженияПартийТоваров(ДополнительныеСвойства)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст ="ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ВидДвижения КАК ВидДвижения,
	|	ВложенныйЗапрос.СкладКомпании КАК СкладКомпании,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Партия КАК Партия,
	|	ВложенныйЗапрос.СтатусПартии КАК СтатусПартии,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаБаз) КАК СуммаБаз,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтТекущиеДвиженияПартииТоваров.Период КАК Период,
	|		ВтТекущиеДвиженияПартииТоваров.ВидДвижения КАК ВидДвижения,
	|		ВтТекущиеДвиженияПартииТоваров.СкладКомпании КАК СкладКомпании,
	|		ВтТекущиеДвиженияПартииТоваров.Номенклатура КАК Номенклатура,
	|		ВтТекущиеДвиженияПартииТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ВтТекущиеДвиженияПартииТоваров.Партия КАК Партия,
	|		ВтТекущиеДвиженияПартииТоваров.СтатусПартии КАК СтатусПартии,
	|		ВтТекущиеДвиженияПартииТоваров.Количество КАК Количество,
	|		ВтТекущиеДвиженияПартииТоваров.Сумма КАК Сумма,
	|		ВтТекущиеДвиженияПартииТоваров.СуммаБаз КАК СуммаБаз,
	|		ВтТекущиеДвиженияПартииТоваров.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		ВтТекущиеДвиженияПартииТоваров КАК ВтТекущиеДвиженияПартииТоваров
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втНовыеДвиженияПартийТоваров.Период,
	|		втНовыеДвиженияПартийТоваров.ВидДвижения,
	|		втНовыеДвиженияПартийТоваров.СкладКомпании,
	|		втНовыеДвиженияПартийТоваров.Номенклатура,
	|		втНовыеДвиженияПартийТоваров.ХарактеристикаНоменклатуры,
	|		втНовыеДвиженияПартийТоваров.Партия,
	|		втНовыеДвиженияПартийТоваров.СтатусПартии,
	|		ВЫБОР
	|			КОГДА втНовыеДвиженияПартийТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -втНовыеДвиженияПартийТоваров.Количество
	|			ИНАЧЕ втНовыеДвиженияПартийТоваров.Количество
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА втНовыеДвиженияПартийТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -втНовыеДвиженияПартийТоваров.Сумма
	|			ИНАЧЕ втНовыеДвиженияПартийТоваров.Сумма
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА втНовыеДвиженияПартийТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -втНовыеДвиженияПартийТоваров.СуммаБаз
	|			ИНАЧЕ втНовыеДвиженияПартийТоваров.СуммаБаз
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА втНовыеДвиженияПартийТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -втНовыеДвиженияПартийТоваров.СуммаНДС
	|			ИНАЧЕ втНовыеДвиженияПартийТоваров.СуммаНДС
	|		КОНЕЦ
	|	ИЗ
	|		втНовыеДвиженияПартийТоваров КАК втНовыеДвиженияПартийТоваров) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ВидДвижения,
	|	ВложенныйЗапрос.СкладКомпании,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Партия,
	|	ВложенныйЗапрос.СтатусПартии
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВложенныйЗапрос.Количество) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.Сумма) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаБаз) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДС) <> 0)";
	РезультатЗапроса = Запрос.Выполнить();
			
	ДополнительныеСвойства.Вставить("ДвиженияПартииТоваровИзменение", НЕ РезультатЗапроса.Пустой());

КонецПроцедуры


Процедура ЗаполнитьТаблицуСписанияПартий(ДляПроведения, РезультатЗапроса, ТаблицаДвижения, МассивДляРасчетаСебестоимости, ОтрицательныеОстаткиРазрешены, ЕстьПродажи = Ложь, ХозОперация = Неопределено)
	
	Если ХозОперация = Неопределено Тогда 
		ХозОперация = ДляПроведения.ХозОперация;
	КонецЕсли;
	
	ВыборкаНоменклатура =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	

	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		
		ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаХарактеристики.Следующий() Цикл 
			
			ОсталосьСписать = ВыборкаХарактеристики.Количество;
			ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
			
			Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
				
				Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
					Продолжить; 
				КонецЕсли;
				
				КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
				СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
				СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
				СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
				
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
				НоваяЗапись.СкладКомпании = ДляПроведения.СкладКомпании;
				НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
				НоваяЗапись.Партия = ВыборкаПартия.Партия;
				НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;
				
				Если ЕстьПродажи Тогда
					НоваяЗапись.Контрагент = ВыборкаПартия.ПартияКонтрагент;
				КонецЕсли;
				
				НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
				НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоОстаток);
				НоваяЗапись.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.СуммаНДС     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.СуммаБаз     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.ХозОперация  = ХозОперация;
				
				ОсталосьСписать = ОсталосьСписать - НоваяЗапись.Количество;
				КоличествоОстаток = КоличествоОстаток - НоваяЗапись.Количество;
				СуммаОстаток    = СуммаОстаток - НоваяЗапись.Сумма;
				СуммаНДСОстаток = СуммаНДСОстаток - НоваяЗапись.СуммаНДС;
				СуммаБазОстаток = СуммаБазОстаток - НоваяЗапись.СуммаБаз;
				
			КонецЦикла;
			
			Если ОсталосьСписать <> 0 И ОтрицательныеОстаткиРазрешены Тогда
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Партия        = ДляПроведения.Ссылка;
				НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				НоваяЗапись.СкладКомпании = ДляПроведения.СкладКомпании;
				НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное");
				НоваяЗапись.Количество    = ОсталосьСписать;
				
				ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
				,ДляПроведения.Дата,ВыборкаНоменклатура.Номенклатура,ВыборкаХарактеристики.ХарактеристикаНоменклатуры,ДляПроведения.ТипЦенСебестоимости,ДляПроведения.СкладКомпании,Истина));
				СуммаСебестоимость  = ЦенаСебестоимости * ОсталосьСписать;

				
				НоваяЗапись.СуммаНДС = 0;
				НоваяЗапись.Сумма         = СуммаСебестоимость;
				НоваяЗапись.СуммаБаз      = СуммаСебестоимость;

				//МассивДляРасчетаСебестоимости.Добавить(НоваяЗапись);
				
				// расход
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
				НоваяЗапись.Партия        = ДляПроведения.Ссылка;
				НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				НоваяЗапись.СкладКомпании = ДляПроведения.СкладКомпании;
				НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры; 
				НоваяЗапись.ХозОперация   = ХозОперация;
				НоваяЗапись.Количество    = ОсталосьСписать;
				НоваяЗапись.СуммаНДС = 0;
				НоваяЗапись.Сумма         = СуммаСебестоимость;
				НоваяЗапись.СуммаБаз      = СуммаСебестоимость;

				//МассивДляРасчетаСебестоимости.Добавить(НоваяЗапись);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	
КонецПроцедуры

//Регистр накопления "Партии товаров компании"
Процедура ПодготовитьТаблицуСписанияПартийТоваров(Запрос, ДополнительныеСвойства) Экспорт
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ХозОперацияТара = Справочники.ХозОперации.ВзаиморасчетыПоТаре;
	ТипЦенСебестоимости = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	ТипЗнчДокумента   = ТипЗнч(ДокументСсылка);	
	
	//Подготовим таблицу для списания партий товаров
	Если ТипЗнчДокумента = Тип("ДокументСсылка.РеализацияТоваров") Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ВтТаблицаТовары.Количество КАК Количество,
		               |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		               |	ЛОЖЬ КАК ЭтоТара
		               |ПОМЕСТИТЬ втТоварыДляСписанияПартий
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВтТаблицаТара.Номенклатура,
		               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		               |	ВтТаблицаТара.Количество,
		               |	ВтТаблицаТара.Номенклатура.СтавкаНДС,
		               |	ИСТИНА
		               |ИЗ
		               |	ВтТаблицаТара КАК ВтТаблицаТара";	
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ВтТаблицаТовары.Количество КАК Количество,
		               |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		               |	ЛОЖЬ КАК ЭтоТара
		               |ПОМЕСТИТЬ втТоварыДляСписанияПартий
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";	
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
		
	Запрос.Текст = "ВЫБРАТЬ
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	втТоварыДляСписанияПартий КАК ВтТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВтТаблицаТовары.Номенклатура";
	
	
	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;

	ПорядокСписанияПартий = "Возр";
	
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	              |	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |	ВложенныйЗапрос.Количество КАК Количество,
	              |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	              |	ВложенныйЗапрос.ЭтоТара КАК ЭтоТара
	              |ПОМЕСТИТЬ вт_Товары
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	              |		ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |		СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	              |		МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС,
	              |		МАКСИМУМ(ВтТаблицаТовары.ЭтоТара) КАК ЭтоТара
	              |	ИЗ
	              |		втТоварыДляСписанияПартий КАК ВтТаблицаТовары
	              |	
	              |	СГРУППИРОВАТЬ ПО
	              |		ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	              |		ВтТаблицаТовары.Номенклатура) КАК ВложенныйЗапрос
	              |ГДЕ
	              |	ВложенныйЗапрос.Количество > 0
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Номенклатура,
	              |	ХарактеристикаНоменклатуры
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	              |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	              |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	              |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	              |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	              |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	              |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК ПорядокСтатуса,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	              |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	              |	КОНЕЦ КАК МоментВремени
	              |ПОМЕСТИТЬ ВТ_ОстаткиПартий
	              |ИЗ
	              |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	              |			&МоментВремени,
	              |			СкладКомпании = &СкладКомпании
	              |				И Номенклатура В
	              |					(ВЫБРАТЬ
	              |						вт_Товары.Номенклатура КАК Номенклатура
	              |					ИЗ
	              |						вт_Товары КАК вт_Товары)) КАК ПартииТоваровКомпанииОстатки
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Номенклатура,
	              |	ХарактеристикаНоменклатуры
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	вт_Товары.Номенклатура КАК Номенклатура,
	              |	вт_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |	вт_Товары.Количество КАК Количество,
	              |	ВТ_ОстаткиПартий.СтатусПартии КАК СтатусПартии,
	              |	ВТ_ОстаткиПартий.Партия КАК Партия,
	              |	ВЫБОР
	              |		КОГДА ВТ_ОстаткиПартий.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ВТ_ОстаткиПартий.Партия КАК Документ.ПоступлениеТоваров).Контрагент
	              |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	              |	КОНЕЦ КАК ПартияКонтрагент,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	              |	ВТ_ОстаткиПартий.ПорядокСтатуса КАК ПорядокСтатуса,
	              |	вт_Товары.СтавкаНДС КАК СтавкаНДС,
	              |	вт_Товары.ЭтоТара КАК ЭтоТара
	              |ИЗ
	              |	вт_Товары КАК вт_Товары
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПартий КАК ВТ_ОстаткиПартий
	              |		ПО вт_Товары.Номенклатура = ВТ_ОстаткиПартий.Номенклатура
	              |			И вт_Товары.ХарактеристикаНоменклатуры = ВТ_ОстаткиПартий.ХарактеристикаНоменклатуры
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ЭтоТара,
	              |	ПорядокСтатуса УБЫВ,
	              |	ВТ_ОстаткиПартий.МоментВремени
	              |ИТОГИ
	              |	МАКСИМУМ(Количество),
	              |	СУММА(КоличествоОстаток),
	              |	СУММА(СуммаОстаток),
	              |	СУММА(СуммаБазОстаток),
	              |	СУММА(СуммаНДСОстаток),
	              |	МИНИМУМ(СтавкаНДС)
	              |ПО
	              |	ЭтоТара,
	              |	Номенклатура,
	              |	ХарактеристикаНоменклатуры";
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыПартий"));
	ТаблицаДвижения.Колонки.Добавить("Партия",Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипыПартий.Тип));
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));

	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));
	

	
	
	ОтрицательныеОстаткиРазрешены = Истина;
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	Пока Выборка.Следующий() Цикл 
		
		ВыборкаНоменклатура =  Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока ВыборкаНоменклатура.Следующий() Цикл 
			
			ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаХарактеристики.Следующий() Цикл 
				
				ОсталосьСписать = ВыборкаХарактеристики.Количество;
				ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
				
				Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
					
					Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
						Продолжить; 
					КонецЕсли;
					
					КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
					СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
					СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
					СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
	
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					НоваяЗапись.Партия = ВыборкаПартия.Партия;
					НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.Контрагент = ВыборкаПартия.ПартияКонтрагент;
					
					НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
					НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоОстаток);
					НоваяЗапись.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаНДС     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаБаз     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.ХозОперация  = ?(Выборка.ЭтоТара, ХозОперацияТара, ХозОперация);
					
					ОсталосьСписать = ОсталосьСписать - НоваяЗапись.Количество;
					КоличествоОстаток = КоличествоОстаток - НоваяЗапись.Количество;
					СуммаОстаток    = СуммаОстаток - НоваяЗапись.Сумма;
					СуммаНДСОстаток = СуммаНДСОстаток - НоваяЗапись.СуммаНДС;
					СуммаБазОстаток = СуммаБазОстаток - НоваяЗапись.СуммаБаз;

				КонецЦикла;
				
				Если ОсталосьСписать <> 0 И  ОтрицательныеОстаткиРазрешены Тогда
					
					                      
					ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
					,Период,ВыборкаНоменклатура.Номенклатура,ВыборкаХарактеристики.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
					СуммаСебестоимость  = ЦенаСебестоимости * ОсталосьСписать;
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Партия        = ДокументСсылка;
					НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное");
					НоваяЗапись.Количество    = ОсталосьСписать;
					НоваяЗапись.Сумма         = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз      = СуммаСебестоимость;
					
					НоваяЗапись.СуммаНДС = 0;
					
					
					// расход
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Партия        = ДокументСсылка;
					НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры; 
					НоваяЗапись.ХозОперация   = ?(Выборка.ЭтоТара, ХозОперацияТара, ХозОперация);
					НоваяЗапись.Количество    = ОсталосьСписать;
					НоваяЗапись.Сумма         = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз      = СуммаСебестоимость;

					НоваяЗапись.СуммаНДС = 0;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
		
		Запрос.Текст ="ВЫБРАТЬ
		              |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		              |	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		              |	ВложенныйЗапрос.Количество КАК Количество,
		              |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС
		              |ИЗ
		              |	(ВЫБРАТЬ
		              |		ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		              |		ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		              |		СУММА(ВтТаблицаТовары.Количество) КАК Количество,
		              |		ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС
		              |	ИЗ
		              |		ВтТаблицаТовары КАК ВтТаблицаТовары
		              |	                                                            
		              |	СГРУППИРОВАТЬ ПО
		              |		ВтТаблицаТовары.ХарактеристикаНоменклатуры,
		              |		ВтТаблицаТовары.Номенклатура,
		              |		ВтТаблицаТовары.СтавкаНДС) КАК ВложенныйЗапрос
		              |ГДЕ
		              |	ВложенныйЗапрос.Количество < 0";
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			мстзДвиженияПартии = ТаблицаДвижения.НайтиСтроки(Новый Структура("ВидДвижения,Номенклатура,ХарактеристикаНоменклатуры",ВидДвиженияНакопления.Расход, Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры));
			
			НужноВернуть = -Выборка.Количество;

			Если мстзДвиженияПартии.Количество() > 0 Тогда
				
//				мстзДвиженияПартииПриходДоприход = ТаблицаДвижения.НайтиСтроки(Новый Структура("ВидДвижения,Номенклатура,ХарактеристикаНоменклатуры",ВидДвиженияНакопления.Приход, Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры));

				
				Для Каждого  спПартия Из мстзДвиженияПартии Цикл 
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Партия        = спПартия.Партия;
					НоваяЗапись.СтавкаНДС     = спПартия.СтавкаНДС;
					
					НоваяЗапись.Контрагент    = спПартия.Контрагент;
					
					НоваяЗапись.СтатусПартии  = спПартия.СтатусПартии;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = Выборка.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры  = Выборка.ХарактеристикаНоменклатуры;
					НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ЗакрытиеСменыВозврат");
					КолВо                     = Мин(НужноВернуть, спПартия.Количество);
					НоваяЗапись.Количество    = - КолВо;
					НоваяЗапись.Сумма    = (спПартия.Сумма/спПартия.Количество) * НоваяЗапись.Количество;
					НоваяЗапись.СуммаБаз = (спПартия.СуммаБаз/спПартия.Количество) * НоваяЗапись.Количество;
					НоваяЗапись.СуммаНДС = (спПартия.СуммаНДС/спПартия.Количество) * НоваяЗапись.Количество;
					НоваяЗапись.Возврат  = Истина;
					НужноВернуть = НужноВернуть - КолВо;
					
					
					//Проверка на излишки для расчета себестоимости
					Если НоваяЗапись.Сумма = 0 И спПартия.Партия = ДокументСсылка Тогда
						
						ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
						,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
						СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;
						
						НоваяЗапись.Сумма    = СуммаСебестоимость;
						НоваяЗапись.СуммаБаз = СуммаСебестоимость;

						
					КонецЕсли;
					
					Если НужноВернуть = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если НужноВернуть <> 0 Тогда
					
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Партия        = спПартия.Партия;
					НоваяЗапись.СтавкаНДС     = Выборка.СтавкаНДС;
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = Выборка.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры  = Выборка.ХарактеристикаНоменклатуры;
					НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ЗакрытиеСменыВозврат");
					НоваяЗапись.Количество    = -НужноВернуть;
					НоваяЗапись.Возврат       = Истина;
					
					ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
					,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
					СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;
					
					НоваяЗапись.Сумма    = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз = СуммаСебестоимость;
					
					
				КонецЕсли;
				
				
			Иначе
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
				НоваяЗапись.Партия        = ДокументСсылка;
				НоваяЗапись.СтавкаНДС     = Выборка.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура  = Выборка.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры  = Выборка.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ЗакрытиеСменыВозврат");
				НоваяЗапись.Количество    = -НужноВернуть;
				НоваяЗапись.Возврат       = Истина;
				
				ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
				,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
				СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;
				
				НоваяЗапись.Сумма    = СуммаСебестоимость;
				НоваяЗапись.СуммаБаз = СуммаСебестоимость;

				
			КонецЕсли;	
			
			
		КонецЦикла;
		
	//КонецЕсли;
	
	/////если есть излишки необходимо получить и расчитать себестоимость,
	////себестоимость будем брать по закупочной цене
	//Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество() > 0 Тогда

	//	ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
	//	ЦенообразованиеСервер.ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
	//	
	//	//Пересчитаем суммы 
	//	Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
	//		ЦенаПересчета = Строка.Сумма;
	//		Строка.Сумма = Строка.Количество * ЦенаПересчета;
	//		Строка.СуммаБаз = Строка.Сумма;
	//		Строка.СуммаНДС = 0;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	Если  ТипЗнчДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") 
		И ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
		
		ТаблицаПрихода = ТаблицаДвижения.СкопироватьКолонки();
		
		Для Каждого СтрДвижения Из ТаблицаДвижения Цикл 
			
			Если СтрДвижения.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = ТаблицаПрихода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрДвижения,,"ВидДвижения, СкладКомпании"); 
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.СкладКомпании = ДополнительныеСвойства.ДляПроведения.СкладКомпанииПолучатель;
		КонецЦикла;
		
		Для Каждого стрПриход Из ТаблицаПрихода Цикл 
			НоваяЗапись = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, стрПриход); 
			
		КонецЦикла;
		
		
	Конецесли;
	
	
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании",ТаблицаДвижения);	
	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаВтТекущиеДвиженияПартииТоваров") Тогда
		ДвиженияПартииТоваровИзменение(ДополнительныеСвойства, ТаблицаДвижения);
		СравнитьДвиженияПартийТоваров(ДополнительныеСвойства);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуТоваровТМП(Запрос,ДополнительныеСвойства)Экспорт
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;

	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("НомерСтроки",ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаДвижения.Колонки.Добавить("Период",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаДвижения.Колонки.Добавить("АналитикаУчетаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ТК_КлючиАналитикиОстаткиТНП"));
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("Статья",Новый ОписаниеТипов("СправочникСсылка.СтатьиВозврата"));

	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
//	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация",Новый ОписаниеТипов("СправочникСсылка.ХозОперации"));

	
	//ТаблицаПартий = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровКомпании;
	сч = 1;
	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров 
			Или ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал 
			Или ХозОперация = Справочники.ХозОперации.СписаниеТоваров Тогда
			
		Если ДополнительныеСвойства.ДляПроведения.ПолучательТНП Тогда
			
			
			СтатьяВозврата = ДополнительныеСвойства.ДляПроведения.СтатьяВозврата;
			СкладКомпанииПолучатель  = ДополнительныеСвойства.ДляПроведения.СкладКомпанииПолучатель;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
			|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВтТаблицаТовары.Количество КАК Количество
			|ИЗ
			|	ВтТаблицаТовары КАК ВтТаблицаТовары";
			
			
			РезультЗапроса = Запрос.Выполнить();
			Выборка = РезультЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл

			
			//Для Каждого СтрокаПартии Из ТаблицаПартий Цикл 
			//	Если СтрокаПартии.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
					СтрокаДвижения = ТаблицаДвижения.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДвижения,Выборка,"Номенклатура,ХарактеристикаНоменклатуры,Количество"); 
					СтрокаДвижения.ХозОперация  = ХозОперация;
					СтрокаДвижения.СкладКомпании  = СкладКомпанииПолучатель;
					СтрокаДвижения.Статья  = СтатьяВозврата;
					СтрокаДвижения.ВидДвижения  = ВидДвиженияНакопления.Приход;
					СтрокаДвижения.НомерСтроки = сч;
					
					сч = сч + 1;
				//КонецЕсли;
			КонецЦикла;
			
			Если ТаблицаДвижения.Количество() > 0 Тогда
				РегистрыСведений.ТК_АналитикаУчетаОстаткиТНП.ЗаполнитьВКоллекции(ТаблицаДвижения);
			КонецЕсли;
						
		ИначеЕсли ДополнительныеСвойства.ДляПроведения.ОтправительТНП Тогда	
			
			
			
			
			ДатаДокументаСдвинутаВперед = Ложь;
			Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
				Набор = РегистрыНакопления.ОстаткиТоваровТМП.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
				Набор.Записать();
			КонецЕсли;

			
			Запрос.Текст = "ВЫБРАТЬ
			|	ТК_АналитикаУчетаОстаткиТНП.КлючАналитики КАК КлючАналитики
			|ПОМЕСТИТЬ Вт_Ключи
			|ИЗ
			|	ВтТаблицаТовары КАК ВтТаблицаТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТК_АналитикаУчетаОстаткиТНП КАК ТК_АналитикаУчетаОстаткиТНП
			|		ПО ВтТаблицаТовары.Номенклатура = ТК_АналитикаУчетаОстаткиТНП.Номенклатура
			|			И ВтТаблицаТовары.СкладКомпании = ТК_АналитикаУчетаОстаткиТНП.СкладКомпании
			|			И ВтТаблицаТовары.ХарактеристикаНоменклатуры = ТК_АналитикаУчетаОстаткиТНП.ХарактеристикаНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстаткиТоваровТМПОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваровТМПОстатки.АналитикаУчетаНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ОстаткиТоваровТМПОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	ОстаткиТоваровТМПОстатки.КоличествоОстаток КАК КоличествоОстаток//,
		//	|	ОстаткиТоваровТМПОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровТМП.Остатки(
			|			&МоментВремени,
			|			АналитикаУчетаНоменклатуры В
			|				(ВЫБРАТЬ
			|					Вт_Ключи.КлючАналитики КАК КлючАналитики
			|				ИЗ
			|					Вт_Ключи КАК Вт_Ключи)) КАК ОстаткиТоваровТМПОстатки";
			
			
			
			РезультЗапроса = Запрос.Выполнить();
			тзОстатки = РезультЗапроса.Выгрузить();
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
			|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВтТаблицаТовары.Количество КАК Количество
			|ИЗ
			|	ВтТаблицаТовары КАК ВтТаблицаТовары";
			
			
			РезультЗапроса = Запрос.Выполнить();
			Выборка = РезультЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОсталосьСписать = Выборка.Количество;
				
				Если ОсталосьСписать <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры);
				МассивНайденныхСтрок = тзОстатки.НайтиСтроки(Отбор);	
				
				Для Каждого ТекСтрока Из МассивНайденныхСтрок Цикл
					КоличествоОстаток = ТекСтрока.КоличествоОстаток;
					//СуммаОстаток      = ТекСтрока.СуммаОстаток;
					
					Количество = Мин(ОсталосьСписать, КоличествоОстаток);
					
					НоваяЗаписьДвижения = ТаблицаДвижения.Добавить();
					НоваяЗаписьДвижения.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяЗаписьДвижения.АналитикаУчетаНоменклатуры = ТекСтрока.АналитикаУчетаНоменклатуры;
					НоваяЗаписьДвижения.ХозОперация = ХозОперация;
	
					
					НоваяЗаписьДвижения.Количество   = Количество;
			//		НоваяЗаписьДвижения.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
					
					
					ТекСтрока.КоличествоОстаток = КоличествоОстаток - Количество;
					//ТекСтрока.СуммаОстаток      = СуммаОстаток - НоваяЗаписьДвижения.Сумма;
					Если ТекСтрока.КоличествоОстаток <= 0 Тогда
						тзОстатки.Удалить(ТекСтрока);	
					КонецЕсли;
					
					
				КонецЦикла;
				
				
				
			КонецЦикла;
			
			
		КонецЕсли;
		
	
		
	КонецЕсли;
	
	ТаблицаДвижения.ЗаполнитьЗначения(ДополнительныеСвойства.ДляПроведения.Дата,"Период");

	ТаблицаДвижения.Свернуть("Период,ВидДвижения,АналитикаУчетаНоменклатуры,ХозОперация","Количество");
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиТоваровТМП",ТаблицаДвижения);	

	
КонецПроцедуры


Процедура ПодготовитьТаблицуСписанияПартийТоваровПеремещение(Запрос, ДополнительныеСвойства) Экспорт
	
	СкладКомпании  	= ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка 	= ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         	= ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    	= ДополнительныеСвойства.ДляПроведения.ХозОперация;
	СтрокВДокументе =  ДополнительныеСвойства.ДляПроведения.СтрокВДокументе;
	ТипЦенСебестоимости = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	
	ХарактеристикиОтклПолучатель  = ДополнительныеСвойства.ДляПроведения.ХарактеристикиОтклПолучатель;
	ХарактеристикиОтклОтправитель = ДополнительныеСвойства.ДляПроведения.ХарактеристикиОтклОтправитель;
	
	ПорядокСписанияПартий = "Возр";

	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения",Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии",Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыПартий"));
	ТаблицаДвижения.Колонки.Добавить("Партия",Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.ТипыПартий.Тип));
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));

	
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда
		ХарактеристикиОткл = ХарактеристикиОтклПолучатель;
	Иначе
		ХарактеристикиОткл = ХарактеристикиОтклОтправитель;
	КонецЕсли;
	

	
	
		
	Запрос.Текст = "ВЫБРАТЬ
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура, "+ ?(ХарактеристикиОткл," ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры","ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры")+"
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВтТаблицаТовары.Номенклатура";
	
	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;

	
	ТекстЗапроса ="ВЫБРАТЬ
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура, ";
	Если   ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал") И ХарактеристикиОткл Тогда
		ТекстЗапроса = ТекстЗапроса +  " ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,";
	Иначе
		ТекстЗапроса = ТекстЗапроса +  " ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,";
	КонецЕсли;
	

	ТекстЗапроса = ТекстЗапроса +" 
	|	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	|	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ вт_Товары
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.СтавкаНДС
	|;
	|";

	
	
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда
		Если  ЗначениеЗаполнено(ДополнительныеСвойства.ДляПроведения.ДокументОтгрузки) И НЕ ДополнительныеСвойства.ДляПроведения.БратьСтоимостьИзДокумента Тогда
			
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
			                              |	вт_Товары.Номенклатура КАК Номенклатура,
			                              |	вт_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			                              |	вт_Товары.Количество КАК Количество,
			                              |	ПартииТоваровКомпании.СтатусПартии КАК СтатусПартии,
			                              |	ПартииТоваровКомпании.Партия КАК Партия,
			                              |	ВЫБОР
			                              |		КОГДА ПартииТоваровКомпании.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
			                              |			ТОГДА 1
			                              |		ИНАЧЕ 0
			                              |	КОНЕЦ КАК ПорядокСтатуса,
			                              |	вт_Товары.СтавкаНДС КАК СтавкаНДС,
			                              |	ЕСТЬNULL(ПартииТоваровКомпании.Количество, 0) КАК КоличествоОстаток,
			                              |	ЕСТЬNULL(ПартииТоваровКомпании.Сумма, 0) КАК СуммаОстаток,
			                              |	ЕСТЬNULL(ПартииТоваровКомпании.СуммаБаз, 0) КАК СуммаБазОстаток,
			                              |	ЕСТЬNULL(ПартииТоваровКомпании.СуммаНДС, 0) КАК СуммаНДСОстаток
			                              |ИЗ
			                              |	вт_Товары КАК вт_Товары
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
			                              |		ПО вт_Товары.Номенклатура = ПартииТоваровКомпании.Номенклатура
			                              |			И (ВЫБОР
			                              |				КОГДА &ХарактеристикиОтклОтправитель
			                              |					ТОГДА ИСТИНА
			                              |				ИНАЧЕ вт_Товары.ХарактеристикаНоменклатуры = ПартииТоваровКомпании.ХарактеристикаНоменклатуры
			                              |			КОНЕЦ)
			                              |ГДЕ
			                              |	ПартииТоваровКомпании.Регистратор = &ДокументОтгрузки
			                              |
			                              |УПОРЯДОЧИТЬ ПО
			                              |	ПорядокСтатуса УБЫВ,
			                              |	Партия
			                              |ИТОГИ
			                              |	МАКСИМУМ(Количество),
			                              |	МАКСИМУМ(СтавкаНДС),
			                              |	СУММА(КоличествоОстаток),
			                              |	СУММА(СуммаОстаток),
			                              |	СУММА(СуммаБазОстаток),
			                              |	СУММА(СуммаНДСОстаток)
			                              |ПО
			                              |	Номенклатура,
			                              |	ХарактеристикаНоменклатуры";
		Иначе
			
			ТекстЗапроса ="ВЫБРАТЬ
			              |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
			              |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			              |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
			              |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
			              |	СУММА(ВтТаблицаТовары.СуммаВсего) КАК Сумма,
			              |	СУММА(ВтТаблицаТовары.СуммаВсего) КАК СуммаБаз,
			              |	СУММА(ВтТаблицаТовары.СуммаНДС) КАК СуммаНДС
			              |ИЗ
			              |	ВтТаблицаТовары КАК ВтТаблицаТовары
			              |
			              |СГРУППИРОВАТЬ ПО
			              |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
			              |	ВтТаблицаТовары.Номенклатура,
			              |	ВтТаблицаТовары.СтавкаНДС";
			Запрос.Текст = ТекстЗапроса;
			РезультатЗапроса = 	Запрос.Выполнить();

			Выборка = РезультатЗапроса.Выбрать();
			
			
			Пока Выборка.Следующий() Цикл 
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка);
			КонецЦикла;
			
			ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
			ТаблицаДвижения.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход,"ВидДвижения");	
			ТаблицаДвижения.ЗаполнитьЗначения(СкладКомпании,"СкладКомпании");
			ТаблицаДвижения.ЗаполнитьЗначения(ДокументСсылка,"Партия");
			ТаблицаДвижения.ЗаполнитьЗначения(ХозОперация,"ХозОперация");
			ТаблицаДвижения.ЗаполнитьЗначения(Перечисления.СтатусыПартий.ТоварКупленный,"СтатусПартии");
			
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании",ТаблицаДвижения);
			
			Возврат;
			
		КонецЕсли;
		
			
	Иначе
		
		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		                              |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		                              |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		                              |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
		                              |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
		                              |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		                              |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
		                              |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
		                              |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		                              |ПОМЕСТИТЬ ОстаткиПартий
		                              |ИЗ
		                              |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		                              |			&МоментВремени,
									  |			СкладКомпании = &СкладКомпании"+?(СтрокВДокументе<1000,"
									  |				И Номенклатура В
		                              |					(ВЫБРАТЬ
		                              |						втТовары.Номенклатура КАК Номенклатура
		                              |					ИЗ
		                              |						ВтТаблицаТовары КАК втТовары)","")+"
									  | ) КАК ПартииТоваровКомпанииОстатки
		                              |;
		                              |
		                              |////////////////////////////////////////////////////////////////////////////////
		                              |ВЫБРАТЬ
		                              |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		                              |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		                              |	ВтТаблицаТовары.Количество КАК Количество,
		                              |	ОстаткиПартий.СтатусПартии КАК СтатусПартии,
		                              |	ОстаткиПартий.Партия КАК Партия,
		                              |	ЕСТЬNULL(ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
		                              |	ЕСТЬNULL(ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
		                              |	ЕСТЬNULL(ОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
		                              |	ЕСТЬNULL(ОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
		                              |	ВЫБОР
									  |		КОГДА ОстаткиПартий.Партия = &ДокументОснование
									  |			ТОГДА 2
		                              |		КОГДА ОстаткиПартий.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
		                              |			ТОГДА 1
		                              |		ИНАЧЕ 0
		                              |	КОНЕЦ КАК ПорядокСтатуса,
		                              |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС
		                              |ИЗ
		                              |	вт_Товары КАК ВтТаблицаТовары
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПартий КАК ОстаткиПартий
		                              |		ПО ВтТаблицаТовары.Номенклатура = ОстаткиПартий.Номенклатура
		                              |			И ВтТаблицаТовары.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	ПорядокСтатуса УБЫВ,
		                              |	Партия
		                              |ИТОГИ
		                              |	МАКСИМУМ(Количество),
		                              |	СУММА(КоличествоОстаток),
		                              |	СУММА(СуммаОстаток),
		                              |	СУММА(СуммаБазОстаток),
		                              |	СУММА(СуммаНДСОстаток),
		                              |	МАКСИМУМ(СтавкаНДС)
		                              |ПО
		                              |	Номенклатура,
		                              |	ХарактеристикаНоменклатуры";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	
	ВыборкаНоменклатура =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	
	ОтрицательныеОстаткиРазрешены = Истина;
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда
		
		Пока ВыборкаНоменклатура.Следующий() Цикл 
			
			ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаХарактеристики.Следующий()  Цикл 
				
				ОсталосьСписать = ВыборкаХарактеристики.Количество;
				
				ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
				
				Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
					
					Если ВыборкаПартия.КоличествоОстаток = 0 Тогда      
						Продолжить; 
					КонецЕсли;
					
					КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
					СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
					СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
					СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					Если НЕ ХарактеристикиОткл Тогда
						НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					КонецЕсли;
					НоваяЗапись.Партия = ВыборкаПартия.Партия;
					НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;
					
					//НоваяЗапись.Контрагент = ВыборкаПартия.ПартияКонтрагент;
					
					НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
					НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоОстаток);
					НоваяЗапись.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаНДС     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаБаз     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.ХозОперация  = ХозОперация;
					
					ОсталосьСписать = ОсталосьСписать - НоваяЗапись.Количество;
					КоличествоОстаток = КоличествоОстаток - НоваяЗапись.Количество;
					СуммаОстаток    = СуммаОстаток - НоваяЗапись.Сумма;
					СуммаНДСОстаток = СуммаНДСОстаток - НоваяЗапись.СуммаНДС;
					СуммаБазОстаток = СуммаБазОстаток - НоваяЗапись.СуммаБаз;
				КонецЦикла;
				
				Если ОсталосьСписать <> 0 И  ОтрицательныеОстаткиРазрешены Тогда
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Партия        = ДокументСсылка;
					НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					Если НЕ ХарактеристикиОткл Тогда
						НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					КонецЕсли;
					НоваяЗапись.ХозОперация   = ХозОперация;
					НоваяЗапись.Количество    = ОсталосьСписать;
					
					ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
					,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
					СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;


					
					НоваяЗапись.СуммаНДС = 0;
					НоваяЗапись.Сумма    = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз = СуммаСебестоимость;

			
					
					//МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Добавить(НоваяЗапись);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Пока ВыборкаНоменклатура.Следующий() Цикл 
			
			
			ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаХарактеристики.Следующий() Цикл 
				
				ОсталосьСписать = ВыборкаХарактеристики.Количество;
				ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
				
				Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
					
					Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
						Продолжить; 
					КонецЕсли;
					
					КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
					СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
					СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
					СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
	
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					
					Если НЕ ХарактеристикиОткл Тогда
						НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					КонецЕсли;

					//НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					НоваяЗапись.Партия = ВыборкаПартия.Партия;
					НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;
					
					//НоваяЗапись.Контрагент = ВыборкаПартия.ПартияКонтрагент;
					
					НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
					НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоОстаток);
					НоваяЗапись.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаНДС     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаБаз     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.ХозОперация  = ХозОперация;
					
					ОсталосьСписать = ОсталосьСписать - НоваяЗапись.Количество;
					КоличествоОстаток = КоличествоОстаток - НоваяЗапись.Количество;
					СуммаОстаток    = СуммаОстаток - НоваяЗапись.Сумма;
					СуммаНДСОстаток = СуммаНДСОстаток - НоваяЗапись.СуммаНДС;
					СуммаБазОстаток = СуммаБазОстаток - НоваяЗапись.СуммаБаз;

				КонецЦикла;
				
				Если ОсталосьСписать <> 0 И  ОтрицательныеОстаткиРазрешены Тогда
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Партия        = ДокументСсылка;
					НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					
					Если НЕ ХарактеристикиОткл Тогда
						НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					КонецЕсли;

					//НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное");
					НоваяЗапись.Количество    = ОсталосьСписать;
					
					НоваяЗапись.СуммаНДС = 0;
					
					
					ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
					,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенСебестоимости,СкладКомпании,Истина));
					СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;
					
					НоваяЗапись.Сумма    = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз = СуммаСебестоимость;

					
					
					//МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Добавить(НоваяЗапись);
					
					// расход
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Партия        = ДокументСсылка;
					НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
					
					Если НЕ ХарактеристикиОткл Тогда
						НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					КонецЕсли;

					//НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры; 
					НоваяЗапись.ХозОперация   = ХозОперация;
					НоваяЗапись.Количество    = ОсталосьСписать;
					НоваяЗапись.СуммаНДС = 0;
					
					НоваяЗапись.Сумма    = СуммаСебестоимость;
					НоваяЗапись.СуммаБаз = СуммаСебестоимость;

					//МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Добавить(НоваяЗапись);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	
	///если есть излишки необходимо получить и расчитать себестоимость,
	//себестоимость будем брать по закупочной цене
	Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество() > 0 Тогда

		ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
		ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		
		//Пересчитаем суммы 
		Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
			ЦенаПересчета = Строка.Сумма;
			Строка.Сумма = Строка.Количество * ЦенаПересчета;
			Строка.СуммаБаз = Строка.Сумма;
			Строка.СуммаНДС = 0;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
		
		ТаблицаПрихода = ТаблицаДвижения.СкопироватьКолонки();
				
		Для Каждого СтрДвижения Из ТаблицаДвижения Цикл 
			
			Если СтрДвижения.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = ТаблицаПрихода.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрДвижения,,"ВидДвижения, СкладКомпании" + ?(ХарактеристикиОтклПолучатель, ", ХарактеристикаНоменклатуры", "")); 
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.СкладКомпании = ДополнительныеСвойства.ДляПроведения.СкладКомпанииПолучатель;
		КонецЦикла;
		
		Если ХарактеристикиОтклПолучатель Тогда 			
			ТаблицаПрихода.Свернуть("Период,ВидДвижения,СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры,СтатусПартии,Партия,Контрагент,ХозОперация,СтавкаНДС,Возврат","Количество,Сумма,СуммаБаз,СуммаНДС");
		КонецЕсли;		
		
		Для Каждого стрПриход Из ТаблицаПрихода Цикл 
			НоваяЗапись = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, стрПриход); 
			
		КонецЦикла;		
		
	Конецесли;
	
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании",ТаблицаДвижения);	
	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаВтТекущиеДвиженияПартииТоваров") Тогда
		ДвиженияПартииТоваровИзменение(ДополнительныеСвойства, ТаблицаДвижения);
		СравнитьДвиженияПартийТоваров(ДополнительныеСвойства);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровСписаниеТоваров(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	//МассивСтрокПриходованияТоваров = Новый Массив;
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	КурсДокумента  = ДополнительныеСвойства.ДляПроведения.КурсДокумента;
	ТипЦенСебестоимости    = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	Расход 		   = 0;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	
	РезультатБлокировки = Запрос.Выполнить();
	
	//Установим блокировку 		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");	
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании", СкладКомпании);
	Блокировка.Заблокировать();	

	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
		
	ОтрицательныеОстаткиРазрешены = Истина;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.Партия КАК Партия,
	               |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	               |	МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС
	               |ПОМЕСТИТЬ втТаблица
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.Партия,
	               |	ВтТаблицаТовары.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблица.Номенклатура КАК Номенклатура,
	               |	втТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	СУММА(втТаблица.Количество) КАК Количество,
	               |	МАКСИМУМ(втТаблица.СтавкаНДС) КАК СтавкаНДС
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	втТаблица КАК втТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТаблица.ХарактеристикаНоменклатуры,
	               |	втТаблица.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА НЕ втТаблица.Партия ЕСТЬ NULL
	               |			ТОГДА 1
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени
	               |ПОМЕСТИТЬ втОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ
	               |						втТовары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						втТовары КАК втТовары)
	               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТаблица КАК втТаблица
	               |		ПО ПартииТоваровКомпанииОстатки.Номенклатура = втТаблица.Номенклатура
	               |			И ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = втТаблица.ХарактеристикаНоменклатуры
	               |			И ПартииТоваровКомпанииОстатки.Партия = втТаблица.Партия
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	втТовары.Количество КАК Количество,
	               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	втОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
	               |		ПО втТовары.Номенклатура = втОстаткиПартий.Номенклатура
	               |			И втТовары.ХарактеристикаНоменклатуры = втОстаткиПартий.ХарактеристикаНоменклатуры
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втОстаткиПартий.Порядок,
	               |	втОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаБазОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры";	
	
	РезультЗапроса = Запрос.Выполнить();
	
	Если Не РезультЗапроса.Пустой() Тогда
		
		ЗаполнитьТаблицуСписанияПартий(ДополнительныеСвойства.ДляПроведения, РезультЗапроса,ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,ОтрицательныеОстаткиРазрешены, Ложь, ХозОперация);
		
	КонецЕсли;
	
	Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество()>0 Тогда
		ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
		
		ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период))); //Vov41k 20.05.2021
		
		//ИспользоватьПротоколыЦен = Ложь;
		//Если ДополнительныеСвойства.ДляПроведения.Свойство("ИспользоватьПротоколыЦен", ИспользоватьПротоколыЦен) И ИспользоватьПротоколыЦен = Истина  Тогда
		//	ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		//Иначе
		//	ЦенообразованиеСервер.ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		//КонецЕсли;
		
		//Пересчитаем суммы 
		Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
			ЦенаПересчета = Строка.Сумма;
			Строка.Сумма = Строка.Количество * ЦенаПересчета;
			Строка.СуммаБаз = Строка.Сумма;
			Строка.СуммаНДС = 0;			
		КонецЦикла;	
	КонецЕсли;		
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
	//
	
КонецПроцедуры


Процедура ПодготовитьТаблицуСписанияПартийТоваровВозвратПоставщику(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	//МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	//МассивСтрокПриходованияТоваров = Новый Массив;
	
	Контрагент	   = ДополнительныеСвойства.ДляПроведения.Контрагент;
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	КурсДокумента  = ДополнительныеСвойства.ДляПроведения.КурсДокумента;
	ТипЦенСебестоимости    = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	Расход 		   = 0;
	                                                 
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	
	РезультатБлокировки = Запрос.Выполнить();
	
	//Установим блокировку 		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");	
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании", СкладКомпании);
	Блокировка.Заблокировать();	

	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
		
	ОтрицательныеОстаткиРазрешены = Истина;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.Партия КАК Партия,
	               |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	               |	МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС,
	               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ втТаблица
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.Партия,
	               |	ВтТаблицаТовары.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблица.Номенклатура КАК Номенклатура,
	               |	втТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	СУММА(втТаблица.Количество) КАК Количество,
	               |	МАКСИМУМ(втТаблица.СтавкаНДС) КАК СтавкаНДС,
	               |	СУММА(втТаблица.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	втТаблица КАК втТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТаблица.ХарактеристикаНоменклатуры,
	               |	втТаблица.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА НЕ втТаблица.Партия ЕСТЬ NULL
	               |			ТОГДА 1
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ВозвратОтПокупателя
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ВозвратОтПокупателя).Контрагент
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ КАК ПартияКонтрагент
	               |ПОМЕСТИТЬ втОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ
	               |						втТовары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						втТовары КАК втТовары)
	               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТаблица КАК втТаблица
	               |		ПО ПартииТоваровКомпанииОстатки.Номенклатура = втТаблица.Номенклатура
	               |			И ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = втТаблица.ХарактеристикаНоменклатуры
	               |			И ПартииТоваровКомпанииОстатки.Партия = втТаблица.Партия
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	втТовары.Количество КАК Количество,
	               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	втОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС,
	               |	втОстаткиПартий.ПартияКонтрагент КАК ПартияКонтрагент,
	               |	втТовары.Сумма КАК Сумма
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
	               |		ПО втТовары.Номенклатура = втОстаткиПартий.Номенклатура
	               |			И втТовары.ХарактеристикаНоменклатуры = втОстаткиПартий.ХарактеристикаНоменклатуры
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втОстаткиПартий.Порядок,
	               |	втОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаБазОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС),
	               |	МАКСИМУМ(Сумма)
	               |ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры";	
	
	МассивДляРасчетаСебестоимости = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		
		ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаХарактеристики.Следующий() Цикл 
			
			ОсталосьСписать = ВыборкаХарактеристики.Количество;

			ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
			
			Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
				
				Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
					Продолжить; 
				КонецЕсли;
				
				КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
				
				
				СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
				СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
				СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
				
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения = ПредопределенноеЗначение("ВидДвиженияНакопления.Приход");
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
				НоваяЗапись.Партия = ВыборкаПартия.Партия;
				НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;				
				Если ЗначениеЗаполнено(ВыборкаПартия.ПартияКонтрагент) Тогда 
					НоваяЗапись.Контрагент 	= ВыборкаПартия.ПартияКонтрагент;
				КонецЕсли;				
				
				КоличествоСписать =  Мин(ОсталосьСписать, КоличествоОстаток);
				НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
				НоваяЗапись.Количество   = -1 * КоличествоСписать;
				НоваяЗапись.Сумма        = Окр(-?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.СуммаНДС     = Окр(-?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.СуммаБаз     = Окр(-?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
				НоваяЗапись.ХозОперация  = ХозОперация;
				НоваяЗапись.Возврат		 = Истина;
				
				ОсталосьСписать = ОсталосьСписать - КоличествоСписать;
				КоличествоОстаток = КоличествоОстаток - КоличествоСписать;
				СуммаОстаток    = СуммаОстаток - 	-НоваяЗапись.Сумма;
				СуммаНДСОстаток = СуммаНДСОстаток - -НоваяЗапись.СуммаНДС;
				СуммаБазОстаток = СуммаБазОстаток - -НоваяЗапись.СуммаБаз;
			
			КонецЦикла;
			
			Если ОсталосьСписать <> 0 И ОтрицательныеОстаткиРазрешены Тогда
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения   = ПредопределенноеЗначение("ВидДвиженияНакопления.Приход");
				НоваяЗапись.Партия        = ДокументСсылка;
				НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация   = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное");
				НоваяЗапись.Количество    = ОсталосьСписать;
				
				НоваяЗапись.СуммаНДС = 0;
				
				МассивДляРасчетаСебестоимости.Добавить(НоваяЗапись);
				
				// расход
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения   = ПредопределенноеЗначение("ВидДвиженияНакопления.Приход");
				НоваяЗапись.Партия        = ДокументСсылка;
				НоваяЗапись.СтавкаНДС     = ВыборкаНоменклатура.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии  = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура  = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры; 
				НоваяЗапись.ХозОперация   = ХозОперация;
				НоваяЗапись.Количество    = -ОсталосьСписать;
				НоваяЗапись.СуммаНДС = 0;
				МассивДляРасчетаСебестоимости.Добавить(НоваяЗапись);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если МассивДляРасчетаСебестоимости.Количество()>0 Тогда
		ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
		
		ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивДляРасчетаСебестоимости,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период))); //Vov41k 20.05.2021
		
		//ИспользоватьПротоколыЦен = Ложь;
		//Если ДополнительныеСвойства.ДляПроведения.Свойство("ИспользоватьПротоколыЦен", ИспользоватьПротоколыЦен) И ИспользоватьПротоколыЦен = Истина  Тогда
		//	ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивДляРасчетаСебестоимости,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		//Иначе
		//	ЦенообразованиеСервер.ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивДляРасчетаСебестоимости,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		//КонецЕсли;
		
		//Пересчитаем суммы 
		Для Каждого Строка Из МассивДляРасчетаСебестоимости Цикл 
			ЦенаПересчета = Строка.Сумма;
			Строка.Сумма = Строка.Количество * ЦенаПересчета;
			Строка.СуммаБаз = Строка.Сумма;
			Строка.СуммаНДС = 0;
			
		КонецЦикла;	
	КонецЕсли;		
	
	
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
	
	СуммаПартий = -ТаблицаДвижения.Итог("Сумма");
	
	Если СуммаПартий <> ДополнительныеСвойства.ДляПроведения.СуммаДокумента Тогда
		
		
		
		ТаблицаДвиженияПродажи = Новый ТаблицаЗначений;
		ТаблицаДвиженияПродажи.Колонки.Добавить("Период");
		ТаблицаДвиженияПродажи.Колонки.Добавить("ПодразделениеКомпании", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("ТорговаяПлощадка", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("ХозОперация",Новый ОписаниеТипов("СправочникСсылка.ХозОперации"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("КлассификаторПродажи",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("Покупатель",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("ДоговорВзаиморасчетов",Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СтатусПартии");
		ТаблицаДвиженияПродажи.Колонки.Добавить("Партия");
		ТаблицаДвиженияПродажи.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СуммаСкидки",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СуммаУпр",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("Себестоимость",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СуммаНДСВходящий",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СебестоимостьУпр",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		ТаблицаДвиженияПродажи.Колонки.Добавить("СуммаАкциза",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ВтТаблицаТовары.Партия КАК Партия,
		               |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма,
		               |	ВЫБОР
		               |		КОГДА ВтТаблицаТовары.Количество = 0
		               |			ТОГДА ВтТаблицаТовары.Сумма
		               |		ИНАЧЕ ВтТаблицаТовары.Сумма / ВтТаблицаТовары.Количество
		               |	КОНЕЦ КАК Цена,
		               |	МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
		               |	ВтТаблицаТовары.Партия,
		               |	ВтТаблицаТовары.Номенклатура,
		               |	ВЫБОР
		               |		КОГДА ВтТаблицаТовары.Количество = 0
		               |			ТОГДА ВтТаблицаТовары.Сумма
		               |		ИНАЧЕ ВтТаблицаТовары.Сумма / ВтТаблицаТовары.Количество
		               |	КОНЕЦ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			СтруктураОтбора = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры", Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры);
			
			Если  ЗначениеЗаполнено(Выборка.Партия) Тогда
				СтруктураОтбора.Вставить("Партия",Выборка.Партия);
			КонецЕсли;
			Сумма=0; Количество=0;
			МассивНайденныхСтрок=ТаблицаДвижения.НайтиСтроки(СтруктураОтбора);
			Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
				стзПартии = МассивНайденныхСтрок[Сч];
				Сумма = Сумма +	стзПартии.Сумма;
				Количество = Количество + стзПартии.Количество;
			КонецЦикла;
			СуммаПоПартиям = -Сумма;
			
			 Если СуммаПоПартиям<>Выборка.Сумма тогда
				 Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл 
					стзПартии = МассивНайденныхСтрок[Сч];
					СуммаДоход = -Окр((Выборка.Цена*стзПартии.Количество - стзПартии.Сумма), 2);
					
					Если СуммаДоход<>0 тогда
						
						НоваяЗапись = ТаблицаДвиженияПродажи.Добавить();
						НоваяЗапись.Период = Период;

						НоваяЗапись.ПодразделениеКомпании = ДополнительныеСвойства.ДляПроведения.ПодразделениеКомпании;
						НоваяЗапись.ТорговаяПлощадка      = ДополнительныеСвойства.ДляПроведения.ТорговаяПлощадка;
						НоваяЗапись.СкладКомпании         = СкладКомпании;
						НоваяЗапись.ХозОперация           = ХозОперация;
						НоваяЗапись.Номенклатура = Выборка.Номенклатура;
						НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
						НоваяЗапись.СтавкаНДС   = стзПартии.СтавкаНДС;
						НоваяЗапись.Партия 		= стзПартии.Партия;
						НоваяЗапись.Поставщик   = стзПартии.Контрагент;
						НоваяЗапись.Покупатель  = Контрагент;
						НоваяЗапись.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДляПроведения.ДоговорВзаиморасчетов;
						НоваяЗапись.СтатусПартии = стзПартии.СтатусПартии;												
						
						НоваяЗапись.СтавкаНДС = Выборка.СтавкаНДС;
						НоваяЗапись.Сумма = СуммаДоход;
						НоваяЗапись.СуммаУпр = СуммаДоход;
						
						
					КонецЕсли;
					
					 
				 КонецЦикла;
			КонецЕсли;	 
		КонецЦикла;
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиТоваровКомпании",ТаблицаДвиженияПродажи);	

	КонецЕсли;
	

		
	
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровВозвратОтПокупателя(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ХозОперацияТара = Справочники.ХозОперации.ВзаиморасчетыПоТаре;
	Контрагент	   = ДополнительныеСвойства.ДляПроведения.Контрагент;
	Расход 		   = 0;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.ДокументПродажи КАК ДокументПродажи,
	               |	ВтТаблицаТовары.Партия КАК Партия,
	               |	СУММА(ВтТаблицаТовары.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	               |	МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС,
	               |	МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС.Ставка) КАК Ставка,
	               |	ЛОЖЬ КАК ЭтоТара
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	               |	ВтТаблицаТовары.Партия,
	               |	ВтТаблицаТовары.Номенклатура,
	               |	ВтТаблицаТовары.ДокументПродажи,
	               |	ВтТаблицаТовары.СтавкаНДС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВтТаблицаТара.Номенклатура,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	               |	ВтТаблицаТара.ДокументПродажи,
	               |	НЕОПРЕДЕЛЕНО,
	               |	СУММА(0),
	               |	СУММА(ВтТаблицаТара.Количество),
	               |	МАКСИМУМ(ВтТаблицаТара.Номенклатура.СтавкаНДС),
	               |	МАКСИМУМ(ВтТаблицаТара.Номенклатура.СтавкаНДС.Ставка),
	               |	ИСТИНА
	               |ИЗ
	               |	ВтТаблицаТара КАК ВтТаблицаТара
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТара.ДокументПродажи,
	               |	ВтТаблицаТара.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	втТовары.ДокументПродажи КАК ДокументПродажи,
	               |	втТовары.Партия КАК Партия,
	               |	втТовары.Себестоимость КАК Себестоимость,
	               |	втТовары.Количество КАК Количество,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС,
	               |	втТовары.Ставка КАК Ставка,
	               |	втТовары.ЭтоТара КАК ЭтоТара
	               |ИЗ
	               |	втТовары КАК втТовары
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоТара
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпании.Период КАК Период,
	               |	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпании.Регистратор КАК ДокументОтгрузки,
	               |	ПартииТоваровКомпании.Партия КАК Партия,
	               |	ПартииТоваровКомпании.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпании.Количество КАК Количество,
	               |	ПартииТоваровКомпании.Сумма КАК Сумма,
	               |	ПартииТоваровКомпании.СуммаБаз КАК СуммаБаз,
	               |	ПартииТоваровКомпании.СуммаНДС КАК СуммаНДС,
	               |	ВЫРАЗИТЬ(ПартииТоваровКомпании.Партия.Контрагент КАК Справочник.Контрагенты) КАК ПартияКонтрагент
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	               |ГДЕ
	               |	ПартииТоваровКомпании.Период <= &Период
	               |	И ПартииТоваровКомпании.Активность
	               |	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	И (ПартииТоваровКомпании.Номенклатура, ПартииТоваровКомпании.ХарактеристикаНоменклатуры, ПартииТоваровКомпании.Регистратор) В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				втТовары.Номенклатура КАК Номенклатура,
	               |				втТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |				втТовары.ДокументПродажи КАК Регистратор
	               |			ИЗ
	               |				втТовары КАК втТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период,
	               |	ДокументОтгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&МоментВремени, ТипЦен = &ТипЦенСебестоимости) КАК ЦеныСрезПоследних
	               |		ПО втТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	               |			И втТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	               |ГДЕ
	               |	втТовары.Себестоимость = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втТовары";	
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	РезультатТовары 	= МассивРезультатов[1];
	РезультатОтгрузки 	= МассивРезультатов[2];	
	РезультатЦены 		= МассивРезультатов[3];
	
	ТаблицаОтгрузки = РезультатОтгрузки.Выгрузить();
	ТаблицаОтгрузки.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры, ДокументОтгрузки, Партия");
	
	ТаблицаЦен = РезультатЦены.Выгрузить();
	ТаблицаЦен.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры");
	
	//Установим блокировку 		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатТовары;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	ВыборкаТовары = РезультатТовары.Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		ТекПартия = ВыборкаТовары.Партия;
		
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ДокументОтгрузки", ВыборкаТовары.Номенклатура, ВыборкаТовары.ХарактеристикаНоменклатуры, ВыборкаТовары.ДокументПродажи);		
		Если ТекПартия <> Неопределено И Не ТекПартия.Пустая() Тогда 
			Отбор.Вставить("Партия", ТекПартия);
		КонецЕсли;
		
		МассивНайденныхСтрок = ТаблицаОтгрузки.НайтиСтроки(Отбор);	
		
		НадоВернуть = ВыборкаТовары.Количество;
		
		Для Каждого ТекСтрока Из МассивНайденныхСтрок Цикл
			Возвращаем = Мин(НадоВернуть, ТекСтрока.Количество);
			
			НоваяЗапись = ТаблицаДвижения.Добавить();
			
			НоваяЗапись.Период = Период;
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Партия = ТекСтрока.Партия;
			НоваяЗапись.СтатусПартии = ТекСтрока.СтатусПартии;
			НоваяЗапись.СкладКомпании = СкладКомпании;									
			НоваяЗапись.Номенклатура = ТекСтрока.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
			НоваяЗапись.ХозОперация = ?(ВыборкаТовары.ЭтоТара, ХозОперацияТара, ХозОперация);			
			НоваяЗапись.Контрагент = ТекСтрока.ПартияКонтрагент;
			
			НоваяЗапись.Количество = -Возвращаем;
			
			НоваяЗапись.Сумма 		= Окр(-?(ТекСтрока.Количество<=НадоВернуть, ТекСтрока.Сумма, ТекСтрока.Сумма/ТекСтрока.Количество*НадоВернуть),2);
			НоваяЗапись.СуммаБаз	= Окр(-?(ТекСтрока.Количество<=НадоВернуть, ТекСтрока.СуммаБаз, ТекСтрока.СуммаБаз/ТекСтрока.Количество*НадоВернуть),2);
			НоваяЗапись.СуммаНДС	= Окр(-?(ТекСтрока.Количество<=НадоВернуть, ТекСтрока.СуммаНДС, ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоВернуть),2);
						
			НоваяЗапись.Возврат = Истина;
			
			Расход = Расход + (-НоваяЗапись.Сумма);
			
			Если ТекСтрока.Количество > НадоВернуть Тогда 
				ТекСтрока.Количество = ТекСтрока.Количество-НадоВернуть;
			Иначе
				ТаблицаОтгрузки.Удалить(ТекСтрока);
			КонецЕсли;
			
			НадоВернуть = НадоВернуть - (-НоваяЗапись.Количество);
			Если НадоВернуть <= 0 Тогда  Прервать; КонецЕсли;
		КонецЦикла;
		
		Если НадоВернуть > 0 И ВыборкаТовары.Себестоимость <> 0 Тогда 
			НоваяЗапись = ТаблицаДвижения.Добавить();
			
			НоваяЗапись.Период = Период;
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Партия = ДокументСсылка;
			НоваяЗапись.СтатусПартии = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
			НоваяЗапись.СкладКомпании = СкладКомпании;									
			НоваяЗапись.Номенклатура = ВыборкаТовары.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
			НоваяЗапись.ХозОперация = ?(ВыборкаТовары.ЭтоТара, ХозОперацияТара, ХозОперация);			
			НоваяЗапись.Контрагент = Контрагент;			
			НоваяЗапись.Количество = НадоВернуть;
			
			СуммаВсего = ВыборкаТовары.Себестоимость;
			
			НоваяЗапись.Сумма 		= Окр(СуммаВсего, 2);
			НоваяЗапись.СуммаБаз	= Окр(СуммаВсего, 2);
			НоваяЗапись.СуммаНДС	= СуммаВсего * ВыборкаТовары.Ставка/100;
						
			НоваяЗапись.Возврат = Истина;
			
			Расход = Расход + (НоваяЗапись.Сумма);			
		КонецЕсли;
		
		Если НадоВернуть > 0 И ВыборкаТовары.Себестоимость = 0 Тогда
			НоваяЗапись = ТаблицаДвижения.Добавить();
			
			НоваяЗапись.Период = Период;
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Партия = ДокументСсылка;
			НоваяЗапись.СтатусПартии = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
			НоваяЗапись.СкладКомпании = СкладКомпании;									
			НоваяЗапись.Номенклатура = ВыборкаТовары.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтавкаНДС = ВыборкаТовары.СтавкаНДС;
			НоваяЗапись.ХозОперация = ?(ВыборкаТовары.ЭтоТара, ХозОперацияТара, ХозОперация);			
			НоваяЗапись.Контрагент = Контрагент;			
			НоваяЗапись.Количество = НадоВернуть;
			
			ЦенаЗакупки = 0;			
			МассивЦен = ТаблицаЦен.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаТовары.Номенклатура, ВыборкаТовары.ХарактеристикаНоменклатуры));
			Если МассивЦен.Количество() > 0 Тогда 
				ЦенаЗакупки = МассивЦен[0].Цена;
			КонецЕсли;
			
			СуммаВсего = НадоВернуть * ЦенаЗакупки;
			
			НоваяЗапись.Сумма 		= Окр(СуммаВсего, 2);
			НоваяЗапись.СуммаБаз	= Окр(СуммаВсего, 2);
			НоваяЗапись.СуммаНДС	= 0;
						
			НоваяЗапись.Возврат = Истина;
			
			Расход = Расход + (НоваяЗапись.Сумма);	
		КонецЕсли;
	КонецЦикла;	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровИнвентаризация(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	ОтрицательныеОстаткиРазрешены = Истина;
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	ТипЦенЗакупки  = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;


	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	
	
	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВтТаблицатовары.Номенклатура КАК Номенклатура,
	|	ВтТаблицатовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВтТаблицатовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВтТаблицатовары.Количествофакт) КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВтТаблицатовары КАК ВтТаблицатовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицатовары.ХарактеристикаНоменклатуры,
	|	ВтТаблицатовары.СтавкаНДС,
	|	ВтТаблицатовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	|	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокСтатуса,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МоментВремени
	|ПОМЕСТИТЬ ВТ_ОстаткиПартий
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&МоментВремени,
	|			СкладКомпании = &СкладКомпании
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары)) КАК ПартииТоваровКомпанииОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ОстаткиПартий.СтатусПартии КАК СтатусПартии,
	|	ВТ_ОстаткиПартий.Партия КАК Партия,
	|	ВТ_Товары.Количество КАК Количество,
	|	ЕСТЬNULL(ВТ_ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	|	ВТ_Товары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПартий КАК ВТ_ОстаткиПартий
	|		ПО ВТ_Товары.Номенклатура = ВТ_ОстаткиПартий.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ВТ_ОстаткиПартий.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОстаткиПартий.ПорядокСтатуса УБЫВ,
	|	ВТ_ОстаткиПартий.МоментВремени
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаБазОстаток),
	|	СУММА(СуммаНДСОстаток),
	|	МАКСИМУМ(СтавкаНДС)
	|ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры";
	
	РезультЗапроса = Запрос.Выполнить();

	ВыборкаНоменклатура =  РезультЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		
			
		
		ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаХарактеристики.Следующий() Цикл 
			
			ОсталосьСписать = ВыборкаХарактеристики.КоличествоОстаток - ВыборкаХарактеристики.Количество;
			
			Если ОсталосьСписать > 0 Тогда 
				
				ВыборкаПартия = ВыборкаХарактеристики.Выбрать();
				
				
				Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
					
					Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
						Продолжить; 
					КонецЕсли;
					
					КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
					СуммаОстаток    = ВыборкаПартия.СуммаОстаток;
					СуммаНДСОстаток = ВыборкаПартия.СуммаНДСОстаток;
					СуммаБазОстаток = ВыборкаПартия.СуммаБазОстаток;
					
					
					НоваяЗапись = ТаблицаДвижения.Добавить();
					НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
					НоваяЗапись.Партия = ВыборкаПартия.Партия;
					НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;
					
					НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
					НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоОстаток);
					НоваяЗапись.Сумма        = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаНДС     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.СуммаБаз     = Окр(?(КоличествоОстаток<=ОсталосьСписать, СуммаБазОстаток,СуммаБазОстаток/КоличествоОстаток*ОсталосьСписать),2);
					НоваяЗапись.ХозОперация  = ХозОперация;
					
					ОсталосьСписать = ОсталосьСписать - НоваяЗапись.Количество;
					КоличествоОстаток = КоличествоОстаток - НоваяЗапись.Количество;
					СуммаОстаток    = СуммаОстаток - НоваяЗапись.Сумма;
					СуммаНДСОстаток = СуммаНДСОстаток - НоваяЗапись.СуммаНДС;
					СуммаБазОстаток = СуммаБазОстаток - НоваяЗапись.СуммаБаз;
					
				КонецЦикла;
				

			ИначеЕсли  ОсталосьСписать < 0 Тогда 
				
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Партия = ДокументСсылка;
				НоваяЗапись.СтатусПартии = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
				НоваяЗапись.СкладКомпании = СкладКомпании;									
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаХарактеристики.ХарактеристикаНоменклатуры;
				НоваяЗапись.СтавкаНДС = ВыборкаНоменклатура.СтавкаНДС;

				НоваяЗапись.Количество   =  -ОсталосьСписать;
				
				ЦенаСебестоимости = 0;
				Если ВыборкаХарактеристики.КоличествоОстаток>0 Тогда
					ЦенаСебестоимости =   ВыборкаХарактеристики.СуммаОстаток / ВыборкаХарактеристики.КоличествоОстаток;
				КонецЕсли;
				Если ЦенаСебестоимости = 0 Тогда	
					ЦенаСебестоимости 	= ЦенообразованиеСервер.ПолучитьЗакупочнуюЦену(Новый Структура("Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен,СкладКомпании,ТипЦенЗакупки"
					,Период,НоваяЗапись.Номенклатура,НоваяЗапись.ХарактеристикаНоменклатуры,ТипЦенЗакупки,СкладКомпании,Истина));
				КонецЕсли;
				СуммаСебестоимость  = ЦенаСебестоимости * НоваяЗапись.Количество;
				НоваяЗапись.Сумма   = СуммаСебестоимость;
				НоваяЗапись.СуммаБаз= СуммаСебестоимость;			

				
				
				
				
			КонецЕсли;
			

			
		КонецЦикла;
		
		
	КонецЦикла;
	
	
	Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество()>0 Тогда
		ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
		Если ДополнительныеСвойства.ДляПроведения.ИспользоватьПротоколыЦен  Тогда
			ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		Иначе
			ЦенообразованиеСервер.ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
		КонецЕсли;
	
		//Пересчитаем суммы 
		Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
			ЦенаПересчета = Строка.Сумма;
			Строка.Сумма = Строка.Количество * ЦенаПересчета;
			Строка.СуммаБаз = Строка.Сумма;
			Строка.СуммаНДС = 0;
		КонецЦикла;
	КонецЕсли;

		
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровПересортицаТоваров(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	
	ОтрицательныеОстаткиРазрешены = Истина;
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;
	МассивДляПересчетаПодчиненныхЗаписей = Новый Массив;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпании.Партия КАК Партия
	               |ПОМЕСТИТЬ втПартииДокументаОснования
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	               |ГДЕ
	               |	ПартииТоваровКомпании.Регистратор = &ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПартииТоваровКомпании.Партия,
	               |	ПартииТоваровКомпании.Номенклатура,
	               |	ПартииТоваровКомпании.ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ВозвратОтПокупателя
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ВозвратОтПокупателя).Контрагент
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ВыпускПродукции
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ВыпускПродукции).Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ КАК ПартияКонтрагент,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ВЫБОР
	               |		КОГДА НЕ втПартииДокументаОснования.Партия ЕСТЬ NULL
	               |			ТОГДА 1
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК ПорядокСписания,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК Количество,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК Сумма,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБаз,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДС,
	               |	ПартииТоваровКомпанииОстатки.Партия.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			СкладКомпании = &СкладКомпании
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВтТаблицаТовары.НоменклатураРасход КАК Номенклатура
	               |					ИЗ
	               |						ВтТаблицаТовары КАК ВтТаблицаТовары)) КАК ПартииТоваровКомпанииОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПартииДокументаОснования КАК втПартииДокументаОснования
	               |		ПО ПартииТоваровКомпанииОстатки.Номенклатура = втПартииДокументаОснования.Номенклатура
	               |			И ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = втПартииДокументаОснования.ХарактеристикаНоменклатуры
	               |			И ПартииТоваровКомпанииОстатки.Партия = втПартииДокументаОснования.Партия
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ПорядокСписания,
	               |	МоментВремени
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВтТаблицаТовары.НоменклатураРасход КАК Номенклатура,
	               |		ВтТаблицаТовары.ХарактеристикаНоменклатурыРасход КАК ХарактеристикаНоменклатуры
	               |	ИЗ
	               |		ВтТаблицаТовары КАК ВтТаблицаТовары
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВтТаблицаТовары.НоменклатураПриход,
	               |		ВтТаблицаТовары.ХарактеристикаНоменклатурыПриход
	               |	ИЗ
	               |		ВтТаблицаТовары КАК ВтТаблицаТовары) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтТаблицаТовары.НоменклатураРасход КАК НоменклатураРасход,
	               |	ВтТаблицаТовары.НоменклатураПриход КАК НоменклатураПриход,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатурыРасход КАК ХарактеристикаНоменклатурыРасход,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатурыПриход КАК ХарактеристикаНоменклатурыПриход,
	               |	ВтТаблицаТовары.КоличествоБазовоеРасход КАК КоличествоРасход,
	               |	ВтТаблицаТовары.КоличествоБазовоеПриход КАК КоличествоПриход,
	               |	ВЫРАЗИТЬ(ВтТаблицаТовары.НоменклатураРасход КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДСРасход,
	               |	ВЫРАЗИТЬ(ВтТаблицаТовары.НоменклатураПриход КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДСПриход,
	               |	ВтТаблицаТовары.Партия КАК Партия
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВтТаблицаТовары.НомерСтроки";	
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	РезультатПартии 	= МассивРезультатов[1];	
	РезультатТовары 	= МассивРезультатов[2];	
	РезультатПересорт	= МассивРезультатов[3];
	
	ТаблицаПартий = РезультатПартии.Выгрузить();
	ТаблицаПартий.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры");
	
	//ТаблицаЦен = РезультатЦены.Выгрузить();
	//ТаблицаЦен.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры");
	
	//Установим блокировку 	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатТовары;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	ВыборкаТовары = РезультатПересорт.Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		
		ТекПартия = ВыборкаТовары.Партия;
		
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ВыборкаТовары.НоменклатураРасход, ВыборкаТовары.ХарактеристикаНоменклатурыРасход);		
		Если ТекПартия <> Неопределено И Не ТекПартия.Пустая() Тогда 
			Отбор.Вставить("Партия", ТекПартия);
		КонецЕсли;
		
		МассивНайденныхСтрок = ТаблицаПартий.НайтиСтроки(Отбор);	
		
		НадоСписать = ВыборкаТовары.КоличествоРасход;
		КоэфициентПересортицы = ВыборкаТовары.КоличествоПриход / ВыборкаТовары.КоличествоРасход;
		
		Для Каждого ТекСтрока Из МассивНайденныхСтрок Цикл
			
			//Расход по пересортице
			Списываем = Мин(НадоСписать, ТекСтрока.Количество);
			
			НоваяЗаписьРасход = ТаблицаДвижения.Добавить();
			
			НоваяЗаписьРасход.Период = Период;
			НоваяЗаписьРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗаписьРасход.Партия = ТекСтрока.Партия;
			НоваяЗаписьРасход.СтатусПартии = ТекСтрока.СтатусПартии;
			НоваяЗаписьРасход.СкладКомпании = СкладКомпании;									
			НоваяЗаписьРасход.Номенклатура = ТекСтрока.Номенклатура;
			НоваяЗаписьРасход.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяЗаписьРасход.СтавкаНДС = ВыборкаТовары.СтавкаНДСРасход;
			НоваяЗаписьРасход.ХозОперация = ХозОперация;			
			НоваяЗаписьРасход.Контрагент = ТекСтрока.ПартияКонтрагент;
			
			НоваяЗаписьРасход.Количество = Списываем;
			
			НоваяЗаписьРасход.Сумма 	= Окр(?(ТекСтрока.Количество<=НадоСписать, ТекСтрока.Сумма, ТекСтрока.Сумма/ТекСтрока.Количество*НадоСписать),2);
			НоваяЗаписьРасход.СуммаБаз	= Окр(?(ТекСтрока.Количество<=НадоСписать, ТекСтрока.СуммаБаз, ТекСтрока.СуммаБаз/ТекСтрока.Количество*НадоСписать),2);
			НоваяЗаписьРасход.СуммаНДС	= Окр(?(ТекСтрока.Количество<=НадоСписать, ТекСтрока.СуммаНДС, ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоСписать),2);
						
			//НоваяЗаписьРасход.Возврат = Ложь;						
			
			Если ТекСтрока.Количество > НадоСписать Тогда 
				ТекСтрока.Количество = ТекСтрока.Количество-НадоСписать;
				
				ТекСтрока.Сумма      = ТекСтрока.Сумма-НоваяЗаписьРасход.Сумма;
				ТекСтрока.СуммаБаз   = ТекСтрока.СуммаБаз-НоваяЗаписьРасход.СуммаБаз;
				ТекСтрока.СуммаНДС   = ТекСтрока.СуммаНДС-НоваяЗаписьРасход.СуммаНДС;
				
			Иначе
				ТаблицаПартий.Удалить(ТекСтрока);
			КонецЕсли;
						
			//Приход по пересортице
			НоваяЗаписьПриход = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаписьПриход, НоваяЗаписьРасход, "Период, Партия, СтатусПартии, СкладКомпании, ХозОперация, Контрагент, Сумма, СуммаБаз, СуммаНДС");
			НоваяЗаписьПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗаписьПриход.Номенклатура = ВыборкаТовары.НоменклатураПриход;
			НоваяЗаписьПриход.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатурыПриход;
			НоваяЗаписьПриход.СтавкаНДС = ВыборкаТовары.СтавкаНДСПриход;
			
			НоваяЗаписьПриход.Количество = НоваяЗаписьРасход.Количество * КоэфициентПересортицы;
			
			НадоСписать = НадоСписать - НоваяЗаписьРасход.Количество;
			Если НадоСписать <= 0 Тогда  Прервать; КонецЕсли;
		КонецЦикла;
		
		Если НадоСписать <> 0 И ОтрицательныеОстаткиРазрешены Тогда
			
			НоваяЗаписьПартия = ТаблицаДвижения.Добавить();
			
			НоваяЗаписьПартия.Период = Период;
			НоваяЗаписьПартия.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗаписьПартия.Партия = ДокументСсылка;
			НоваяЗаписьПартия.СтатусПартии = ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");
			НоваяЗаписьПартия.СкладКомпании = СкладКомпании;									
			НоваяЗаписьПартия.Номенклатура = ВыборкаТовары.НоменклатураРасход;
			НоваяЗаписьПартия.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатурыРасход;
			НоваяЗаписьПартия.СтавкаНДС = ВыборкаТовары.СтавкаНДСРасход;
			НоваяЗаписьПартия.ХозОперация = ХозОперация;			
			НоваяЗаписьПартия.Количество = НадоСписать;
			
			МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Добавить(НоваяЗаписьПартия);
			
			НоваяЗаписьРасход = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаписьРасход, НоваяЗаписьПартия, "Период, Партия, СтатусПартии, СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры, СтавкаНДС, ХозОперация, Количество");
			НоваяЗаписьРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
			
			НоваяЗаписьПриход = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаписьПриход, НоваяЗаписьПартия, "Период, ВидДвижения, Партия, СтатусПартии, СкладКомпании, ХозОперация");
			НоваяЗаписьПриход.Номенклатура = ВыборкаТовары.НоменклатураПриход;
			НоваяЗаписьПриход.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатурыПриход;
			НоваяЗаписьПриход.СтавкаНДС = ВыборкаТовары.СтавкаНДСПриход;
			НоваяЗаписьПриход.Количество = НадоСписать * КоэфициентПересортицы;
						
			МассивДляПересчетаПодчиненныхЗаписей.Добавить(Новый Структура("ЗаписьПартия, ЗаписьРасход, ЗаписьПриход", НоваяЗаписьПартия, НоваяЗаписьРасход, НоваяЗаписьПриход));
		КонецЕсли;
		
	КонецЦикла;	
	
	//если есть излишки необходимо получить и расчитать себестоимость,
	//себестоимость будем брать по закупочной цене
	Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество() > 0 Тогда

		ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения, "НомерСтроки");
		ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения, МассивСтрокДляРасчетаСебестоимостиПоБазЦене, Новый Структура("Сумма",Новый Структура("ТипЦен, Дата", ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости, Период)));
		
		//Пересчитаем суммы 
		Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
			ЦенаПересчета 	= Строка.Сумма;
			Строка.Сумма 	= Строка.Количество * ЦенаПересчета;
			Строка.СуммаБаз = Строка.Сумма;
			Строка.СуммаНДС = 0;
		КонецЦикла;		
	КонецЕсли;

	Если МассивДляПересчетаПодчиненныхЗаписей.Количество() > 0 Тогда 
		Для Каждого МассивЗаписей ИЗ МассивДляПересчетаПодчиненныхЗаписей Цикл 
			ЗаписьПартия = МассивЗаписей.ЗаписьПартия;
			ЗаписьРасход = МассивЗаписей.ЗаписьРасход;
			ЗаписьПриход = МассивЗаписей.ЗаписьПриход;
			
			ЗаполнитьЗначенияСвойств(ЗаписьРасход, ЗаписьПартия, "Сумма, СуммаБаз, СуммаНДС");
			ЗаполнитьЗначенияСвойств(ЗаписьПриход, ЗаписьПартия, "Сумма, СуммаБаз, СуммаНДС");
		КонецЦикла;
	КонецЕсли;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
	
КонецПроцедуры


Процедура ПодготовитьТаблицуСписанияПартийТоваровВыпускПродукции(Запрос, ДополнительныеСвойства) Экспорт
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	КурсДокумента  = 1;
	ТипЦенСебестоимости    = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	Расход 		   = 0;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Ингредиент
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты";

	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Ингредиент");
	Блокировка.Заблокировать();	


	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
		
	ОтрицательныеОстаткиРазрешены = Истина;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Номенклатура,
	               |	СУММА(ВтТаблицаИнгредиенты.КоличествоИнгредиентаФакт * ВтТаблицаИнгредиенты.КоэффициентИнгредиента) КАК Количество,
	               |	ВтТаблицаИнгредиенты.Номенклатура.СтавкаНДС КАК СтавкаНДС
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Ингредиент,
	               |	ВтТаблицаИнгредиенты.Номенклатура.СтавкаНДС
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени
	               |ПОМЕСТИТЬ втОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						втТовары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						втТовары КАК втТовары)
	               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(втОстаткиПартий.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	               |	втТовары.Количество КАК Количество,
	               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	втОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
	               |		ПО втТовары.Номенклатура = втОстаткиПартий.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втОстаткиПартий.Порядок,
	               |	втОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаБазОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры";
	

	Запрос.Текст = ТекстЗапроса;
	
	РезультЗапроса = Запрос.Выполнить();
	
	Если Не РезультЗапроса.Пустой() Тогда
		
		ЗаполнитьТаблицуСписанияПартий(ДополнительныеСвойства.ДляПроведения, РезультЗапроса,ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,ОтрицательныеОстаткиРазрешены, Ложь);
		
	КонецЕсли;
	
	//Если МассивСтрокДляРасчетаСебестоимостиПоБазЦене.Количество()>0 Тогда
	//	ОбщегоНазначенияТК.ПронумероватьТаблицуЗначений(ТаблицаДвижения,"НомерСтроки");
	//	//ИспользоватьПротоколыЦен = Ложь;
	//	////Если ДополнительныеСвойства.ДляПроведения.Свойство("ИспользоватьПротоколыЦен", ИспользоватьПротоколыЦен) И ИспользоватьПротоколыЦен = Истина  Тогда
	//	////	ЦенообразованиеСервер.ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
	//	////Иначе
	//	////	ЦенообразованиеСервер.ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,Новый Структура("Сумма",Новый Структура("ТипЦен,Дата",ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости,Период)));
	//	////КонецЕсли;
	//	
	//	//Пересчитаем суммы 
	//	Для Каждого Строка Из МассивСтрокДляРасчетаСебестоимостиПоБазЦене Цикл 
	//		ЦенаПересчета = Строка.Сумма;
	//		Строка.Сумма = Строка.Количество * ЦенаПересчета;
	//		Строка.СуммаБаз = Строка.Сумма;
	//		Строка.СуммаНДС = 0;
	//	КонецЦикла;	
	//КонецЕсли;		
	
	//Оприходование выпущенной продукции
	МассивСписанныхСтрок = ТаблицаДвижения.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	ТаблицаСебестоимостиИнгридиентов = ТаблицаДвижения.Скопировать(МассивСписанныхСтрок);
	ТаблицаСебестоимостиИнгридиентов.Свернуть("Номенклатура", "Количество, Сумма, СуммаБаз, СуммаНДС");
	ТаблицаСебестоимостиИнгридиентов.Индексы.Добавить("Номенклатура");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Ингредиент,
	               |	МАКСИМУМ(ВтТаблицаИнгредиенты.КоличествоНоменклатуры) КАК КоличествоНоменклатуры,
	               |	СУММА(ВтТаблицаИнгредиенты.КоличествоИнгредиентаФакт * ВтТаблицаИнгредиенты.КоэффициентИнгредиента) КАК КоличествоИнгридиента,
	               |	ВЫРАЗИТЬ(ВтТаблицаИнгредиенты.Номенклатура КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Ингредиент,
	               |	ВтТаблицаИнгредиенты.Номенклатура,
	               |	ВЫРАЗИТЬ(ВтТаблицаИнгредиенты.Номенклатура КАК Справочник.Номенклатура).СтавкаНДС
	               |ИТОГИ
	               |	МАКСИМУМ(КоличествоНоменклатуры),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	Номенклатура";	
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл 		
		
		КоличествоНоменклатуры = Выборка.КоличествоНоменклатуры;
				
		Сумма = 0;
		СуммаБаз = 0;
		СуммаНДС = 0;
		
		ВыборкаИнгридиенты = Выборка.Выбрать();
		
		Пока ВыборкаИнгридиенты.Следующий() Цикл			
			СтрИнгридиент = ТаблицаСебестоимостиИнгридиентов.Найти(ВыборкаИнгридиенты.Ингредиент, "Номенклатура");			
			Если СтрИнгридиент = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			КолвоИнгридиентаСебестоимость = СтрИнгридиент.Количество;			
			КолвоИнгридиентаСписано = ВыборкаИнгридиенты.КоличествоИнгридиента;
			Если КолвоИнгридиентаСебестоимость > 0 Тогда 
				Сумма = Сумма + СтрИнгридиент.Сумма / КолвоИнгридиентаСебестоимость * КолвоИнгридиентаСписано;
				СуммаБаз = СуммаБаз + СтрИнгридиент.СуммаБаз / КолвоИнгридиентаСебестоимость * КолвоИнгридиентаСписано;
				СуммаНДС = СуммаНДС + СтрИнгридиент.СуммаНДС / КолвоИнгридиентаСебестоимость * КолвоИнгридиентаСписано;
			КонецЕсли;			
		КонецЦикла;
		
		НоваяСтрока = ТаблицаДвижения.Добавить();		
		НоваяСтрока.ВидДвижения 	= ПредопределенноеЗначение("ВидДвиженияНакопления.Приход");
		НоваяСтрока.СкладКомпании 	= СкладКомпании;		
		НоваяСтрока.Номенклатура	= Выборка.Номенклатура;
		НоваяСтрока.Партия 			= ДокументСсылка;		
		НоваяСтрока.СтатусПартии 	= ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");		
		НоваяСтрока.Количество 		= КоличествоНоменклатуры;
		НоваяСтрока.Сумма			= Сумма;
		НоваяСтрока.СуммаБаз		= СуммаБаз;
		НоваяСтрока.СуммаНДС		= СуммаНДС;		
		НоваяСтрока.ХозОперация 	= ХозОперация;		
		НоваяСтрока.СтавкаНДС		= Выборка.СтавкаНДС;
	КонецЦикла;
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);	
	
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровВыпускПродукцииНовый(Запрос, ДополнительныеСвойства) Экспорт
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	КурсДокумента  = 1;
	ТипЦенСебестоимости    = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	Расход 		   = 0;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Ингредиент
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Ингредиент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Номенклатура
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Номенклатура";
	
	Если ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда 
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВтТаблицаТара.Номенклатура
	               |ИЗ
	               |	ВтТаблицаТара КАК ВтТаблицаТара
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТара.Номенклатура";
	КонецЕсли;

	
	Запрос.Текст = ТекстЗапроса;
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Ингредиент");
	Блокировка.Заблокировать();	

	ДатаДокументаСдвинутаВперед = Ложь;	
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
		
	ОтрицательныеОстаткиРазрешены = Истина;	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Номенклатура,
	               |	СУММА(ВтТаблицаИнгредиенты.КоличествоИнгредиентаФакт * ВтТаблицаИнгредиенты.КоэффициентИнгредиента) КАК Количество,
	               |	ВтТаблицаИнгредиенты.Номенклатура.СтавкаНДС КАК СтавкаНДС
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |ГДЕ
	               |	НЕ ВтТаблицаИнгредиенты.ИзАвтопеределов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Ингредиент,
	               |	ВтТаблицаИнгредиенты.Номенклатура.СтавкаНДС
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени
	               |ПОМЕСТИТЬ втОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						втТовары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						втТовары КАК втТовары)
	               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(втОстаткиПартий.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	               |	втТовары.Количество КАК Количество,
	               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	втОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
	               |		ПО втТовары.Номенклатура = втОстаткиПартий.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втОстаткиПартий.Порядок,
	               |	втОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаБазОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втОстаткиПартий";
	

	Запрос.Текст = ТекстЗапроса;
	
	РезультЗапроса = Запрос.Выполнить();
	
	Если Не РезультЗапроса.Пустой() Тогда
		
		ЗаполнитьТаблицуСписанияПартий(ДополнительныеСвойства.ДляПроведения, РезультЗапроса,ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,ОтрицательныеОстаткиРазрешены, Ложь, ХозОперация);
		
	КонецЕсли;
	
	
	// Спишем возвратную тару	
	Если ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТара.Номенклатура КАК Номенклатура,
		               |	СУММА(ВтТаблицаТара.Количество) КАК Количество,
		               |	ВтТаблицаТара.Номенклатура.СтавкаНДС КАК СтавкаНДС
		               |ПОМЕСТИТЬ втТара
		               |ИЗ
		               |	ВтТаблицаТара КАК ВтТаблицаТара
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТара.Номенклатура,
		               |	ВтТаблицаТара.Номенклатура.СтавкаНДС
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
		               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
		               |			ТОГДА 1
		               |		ИНАЧЕ 2
		               |	КОНЕЦ КАК Порядок,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
		               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		               |	КОНЕЦ КАК МоментВремени
		               |ПОМЕСТИТЬ втОстаткиПартий
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		               |			&МоментВремени,
		               |			Номенклатура В
		               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |						втТара.Номенклатура КАК Номенклатура
		               |					ИЗ
		               |						втТара КАК втТара)
		               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
		               |ГДЕ
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Партия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втТара.Номенклатура КАК Номенклатура,
		               |	ЕСТЬNULL(втОстаткиПартий.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
		               |	втТара.Количество КАК Количество,
		               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
		               |	втОстаткиПартий.Партия КАК Партия,
		               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
		               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
		               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
		               |	втТара.СтавкаНДС КАК СтавкаНДС
		               |ИЗ
		               |	втТара КАК втТара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
		               |		ПО втТара.Номенклатура = втОстаткиПартий.Номенклатура
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	втОстаткиПартий.Порядок,
		               |	втОстаткиПартий.МоментВремени
		               |ИТОГИ
		               |	МАКСИМУМ(Количество),
		               |	СУММА(КоличествоОстаток),
		               |	СУММА(СуммаОстаток),
		               |	СУММА(СуммаБазОстаток),
		               |	СУММА(СуммаНДСОстаток),
		               |	МАКСИМУМ(СтавкаНДС)
		               |ПО
		               |	Номенклатура,
		               |	ХарактеристикаНоменклатуры";
		
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультЗапроса = Запрос.Выполнить();
		
		Если Не РезультЗапроса.Пустой() Тогда
			
			ЗаполнитьТаблицуСписанияПартий(ДополнительныеСвойства.ДляПроведения, РезультЗапроса,ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,ОтрицательныеОстаткиРазрешены, Ложь, Справочники.ХозОперации.ВзаиморасчетыПоТаре);
			
		КонецЕсли;

	КонецЕсли;
		
	//Оприходование выпущенной продукции
	МассивСписанныхСтрок = ТаблицаДвижения.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	ТаблицаСебестоимостиИнгридиентов = ТаблицаДвижения.Скопировать(МассивСписанныхСтрок);
	ТаблицаСебестоимостиИнгридиентов.Свернуть("Номенклатура", "Количество, Сумма, СуммаБаз, СуммаНДС");
	ТаблицаСебестоимостиИнгридиентов.Индексы.Добавить("Номенклатура");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.НомерСтроки КАК НомерСтроки,
	               |	ВтТаблицаИнгредиенты.Рецептура КАК Рецептура,
	               |	ВтТаблицаИнгредиенты.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаИнгредиенты.Ингредиент КАК Ингредиент,
	               |	ВтТаблицаИнгредиенты.КоличествоНоменклатуры КАК КоличествоНоменклатуры,
	               |	ВтТаблицаИнгредиенты.ЕдиницаИзмеренияНоменклатуры КАК ЕдиницаИзмеренияНоменклатуры,
	               |	ВтТаблицаИнгредиенты.КоэффициентНоменклатуры КАК КоэффициентНоменклатуры,
	               |	ВтТаблицаИнгредиенты.ЕдиницаИзмеренияИнгредиента КАК ЕдиницаИзмеренияИнгредиента,
	               |	ВтТаблицаИнгредиенты.КоэффициентИнгредиента КАК КоэффициентИнгредиента,
	               |	ВтТаблицаИнгредиенты.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
	               |	ВтТаблицаИнгредиенты.КоличествоИнгредиентаФакт КАК КоличествоИнгредиентаФакт,
	               |	ВтТаблицаИнгредиенты.Автопередел КАК Автопередел,
	               |	ВтТаблицаИнгредиенты.ИзАвтопеределов КАК ИзАвтопеределов,
	               |	ВтТаблицаИнгредиенты.РецептураАвтопередела КАК РецептураАвтопередела,
	               |	ВЫРАЗИТЬ(ВтТаблицаИнгредиенты.Ингредиент КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДСИнгридиента
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтТаблицаИнгредиенты.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаИнгредиенты.Рецептура КАК Рецептура,
	               |	ВЫРАЗИТЬ(ВтТаблицаИнгредиенты.Номенклатура КАК Справочник.Номенклатура).СтавкаНДС КАК СтавкаНДС,
	               |	МАКСИМУМ(ВтТаблицаИнгредиенты.КоличествоНоменклатуры) КАК Количество
	               |ИЗ
	               |	ВтТаблицаИнгредиенты КАК ВтТаблицаИнгредиенты
	               |ГДЕ
	               |	НЕ ВтТаблицаИнгредиенты.Автопередел
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаИнгредиенты.Номенклатура,
	               |	ВтТаблицаИнгредиенты.Рецептура";
	
	Запрос.Текст = ТекстЗапроса;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	МаксИндекс = МассивРезультатов.ВГраница();
	
	ТаблицаИнгридиентов = МассивРезультатов[МаксИндекс-1].Выгрузить();
	
	Выборка = МассивРезультатов[МаксИндекс].Выбрать();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("СкладКомпании",  СкладКомпании);
	Реквизиты.Вставить("ХозОперация", 	 ХозОперация);
	Реквизиты.Вставить("ДокументСсылка", ДокументСсылка);
	
	Если ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСПеремещением Тогда 
		Реквизиты.Вставить("СкладКомпанииПолучатель", ДополнительныеСвойства.ДляПроведения.СкладКомпанииПолучатель); 
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл 
		
		СтруктураПродукции = Новый Структура;
		СтруктураПродукции.Вставить("Номенклатура", Выборка.Номенклатура);
		СтруктураПродукции.Вставить("Рецептура", 	Выборка.Рецептура);
		СтруктураПродукции.Вставить("Количество", 	Выборка.Количество);
		СтруктураПродукции.Вставить("СтавкаНДС",	Выборка.СтавкаНДС);
		СтруктураПродукции.Вставить("Сумма", 		0);
		СтруктураПродукции.Вставить("СуммаНДС",	 	0);
		СтруктураПродукции.Вставить("Автопередел", 	Ложь);
		
		СписатьПродукциюРекурсивно(СтруктураПродукции, ТаблицаИнгридиентов, ТаблицаСебестоимостиИнгридиентов, ТаблицаДвижения, Реквизиты, 1);
		
	КонецЦикла;
		
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);	
	
КонецПроцедуры

Процедура СписатьПродукциюРекурсивно(
				СтруктураПродукции, 
				ТаблицаИнгридиентов, 
				ТаблицаСебестоимостиИнгридиентов, 
				ТаблицаДвижения,
				Реквизиты,
				Знач Уровень)
	
	Если Уровень > 10 Тогда
		Возврат;
	КонецЕсли;
	
	Ингридиенты = ТаблицаИнгридиентов.НайтиСтроки(Новый Структура("Номенклатура,Рецептура", СтруктураПродукции.Номенклатура, СтруктураПродукции.Рецептура));
	
	Для Каждого Стр Из Ингридиенты Цикл 
		Если Стр.ИзАвтопеределов Тогда
			СтруктураАвтопередела = Новый Структура;
			СтруктураАвтопередела.Вставить("Номенклатура", 	Стр.Ингредиент);
			СтруктураАвтопередела.Вставить("Рецептура", 	Стр.РецептураАвтопередела);
			СтруктураАвтопередела.Вставить("Количество", 	Стр.КоличествоИнгредиентаФакт);
			СтруктураАвтопередела.Вставить("СтавкаНДС",		Стр.СтавкаНДСИнгридиента);
			СтруктураАвтопередела.Вставить("Сумма", 		0);
			СтруктураАвтопередела.Вставить("СуммаНДС",	 	0);
			СтруктураАвтопередела.Вставить("Автопередел",	Истина);
			
			СписатьПродукциюРекурсивно(СтруктураАвтопередела, ТаблицаИнгридиентов, ТаблицаСебестоимостиИнгридиентов, ТаблицаДвижения, Реквизиты, Уровень + 1);
			
			СтруктураПродукции.Сумма = СтруктураПродукции.Сумма + СтруктураАвтопередела.Сумма;			
			СтруктураПродукции.СуммаНДС = СтруктураПродукции.СуммаНДС + СтруктураАвтопередела.СуммаНДС;

		Иначе
			СтрИнгридиент = ТаблицаСебестоимостиИнгридиентов.Найти(Стр.Ингредиент, "Номенклатура");			
			Если СтрИнгридиент = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			КолвоИнгридиентаСебестоимость = СтрИнгридиент.Количество;			
			КолвоИнгридиентаСписано = Стр.КоличествоИнгредиентаФакт;
			Если КолвоИнгридиентаСебестоимость > 0 Тогда 
				СтруктураПродукции.Сумма = СтруктураПродукции.Сумма + СтрИнгридиент.Сумма / КолвоИнгридиентаСебестоимость * КолвоИнгридиентаСписано;			
				СтруктураПродукции.СуммаНДС = СтруктураПродукции.СуммаНДС + СтрИнгридиент.СуммаНДС / КолвоИнгридиентаСебестоимость * КолвоИнгридиентаСписано;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаДвижения.Добавить();		
	НоваяСтрока.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	НоваяСтрока.СкладКомпании 	= Реквизиты.СкладКомпании;		
	НоваяСтрока.Номенклатура	= СтруктураПродукции.Номенклатура;
	НоваяСтрока.Партия 			= Реквизиты.ДокументСсылка;		
	НоваяСтрока.СтатусПартии 	= Перечисления.СтатусыПартий.ТоварКупленный;		
	НоваяСтрока.Количество 		= СтруктураПродукции.Количество;
	НоваяСтрока.Сумма			= СтруктураПродукции.Сумма;
	НоваяСтрока.СуммаБаз		= СтруктураПродукции.Сумма;
	НоваяСтрока.СуммаНДС		= СтруктураПродукции.СуммаНДС;		
	НоваяСтрока.ХозОперация 	= Реквизиты.ХозОперация;		
	НоваяСтрока.СтавкаНДС		= СтруктураПродукции.СтавкаНДС;
	
	Если СтруктураПродукции.Автопередел Тогда
		
		НоваяСтрокаСписание = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписание, НоваяСтрока,, "ВидДвижения");
		НоваяСтрокаСписание.ВидДвижения = ВидДвиженияНакопления.Расход;
		
	ИначеЕсли Реквизиты.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда
		
		НоваяСтрокаРеализация = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРеализация, НоваяСтрока,, "ВидДвижения");
		НоваяСтрокаРеализация.ВидДвижения = ВидДвиженияНакопления.Расход;
		
	ИначеЕсли Реквизиты.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСПеремещением Тогда
		
		нсПеремещениеРасход = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(нсПеремещениеРасход, НоваяСтрока,, "ВидДвижения");
		нсПеремещениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;	
		
		нсПеремещениеПриход = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(нсПеремещениеПриход, НоваяСтрока,, "СкладКомпании");
		нсПеремещениеПриход.СкладКомпании = Реквизиты.СкладКомпанииПолучатель;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПодготовитьТаблицуСписанияПартийТоваровКорректировкаПартий(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	ОтрицательныеОстаткиРазрешены = Истина;
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;


	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	
	
	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицатовары.Номенклатура КАК Номенклатура,
		               |	ВтТаблицатовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		               |ПОМЕСТИТЬ ВТ_Товары
		               |ИЗ
		               |	ВтТаблицатовары КАК ВтТаблицатовары
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
		               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		               |ПОМЕСТИТЬ ВТ_ОстаткиПартий
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		               |			&МоментВремени,
		               |			СкладКомпании = &СкладКомпании
		               |				И Партия.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ИнвентаризацияТоваров)
		               |				И Номенклатура В
		               |					(ВЫБРАТЬ
		               |						ВТ_Товары.Номенклатура КАК Номенклатура
		               |					ИЗ
		               |						ВТ_Товары КАК ВТ_Товары)) КАК ПартииТоваровКомпанииОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
		               |	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	МАКСИМУМ(ПартииТоваровКомпании.Регистратор) КАК ДокументПрихода
		               |ПОМЕСТИТЬ ПартииПоступления
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		МАКСИМУМ(ПартииТоваровКомпании.Период) КАК Период,
		               |		ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
		               |		ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		               |	ИЗ
		               |		РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		               |	ГДЕ
		               |		ПартииТоваровКомпании.Период < &ДатаДокумента
		               |		И ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
		               |		И ПартииТоваровКомпании.СкладКомпании = &СкладКомпании
		               |		И ПартииТоваровКомпании.Номенклатура В
		               |				(ВЫБРАТЬ
		               |					ВТ_Товары.Номенклатура КАК Номенклатура
		               |				ИЗ
		               |					ВТ_Товары КАК ВТ_Товары)
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ПартииТоваровКомпании.Номенклатура,
		               |		ПартииТоваровКомпании.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		               |		ПО ВложенныйЗапрос.Период = ПартииТоваровКомпании.Период
		               |			И ВложенныйЗапрос.Номенклатура = ПартииТоваровКомпании.Номенклатура
		               |			И ВложенныйЗапрос.ХарактеристикаНоменклатуры = ПартииТоваровКомпании.ХарактеристикаНоменклатуры
		               |			И (ПартииТоваровКомпании.СкладКомпании = &СкладКомпании)
		               |ГДЕ
		               |	ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПартииТоваровКомпании.Номенклатура,
		               |	ПартииТоваровКомпании.ХарактеристикаНоменклатуры
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОстаткиПартий.СтатусПартии КАК СтатусПартии,
		               |	ВТ_ОстаткиПартий.Партия КАК ПартияРасход,
		               |	ПартииПоступления.ДокументПрихода КАК ПартияПриход,
		               |	ВТ_ОстаткиПартий.КоличествоОстаток КАК Количество,
		               |	ВТ_ОстаткиПартий.СуммаОстаток КАК Сумма,
		               |	ВТ_ОстаткиПартий.СуммаБазОстаток КАК СуммаБаз,
		               |	ВТ_ОстаткиПартий.СуммаНДСОстаток КАК СуммаНДС,
		               |	ВТ_ОстаткиПартий.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		               |	ВТ_ОстаткиПартий.Номенклатура КАК Номенклатура,
		               |	ВТ_ОстаткиПартий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		               |ИЗ
		               |	ВТ_ОстаткиПартий КАК ВТ_ОстаткиПартий
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПоступления КАК ПартииПоступления
		               |		ПО ВТ_ОстаткиПартий.Номенклатура = ПартииПоступления.Номенклатура
		               |			И ВТ_ОстаткиПартий.ХарактеристикаНоменклатуры = ПартииПоступления.ХарактеристикаНоменклатуры";
	
	РезультЗапроса = Запрос.Выполнить();

	Выборка =  РезультЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл 
		Если НЕ ЗначениеЗаполнено(Выборка.ПартияРасход) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = ТаблицаДвижения.Добавить();
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяЗапись.Партия = Выборка.ПартияРасход;
		НоваяЗапись.СтатусПартии = Выборка.СтатусПартии;
		НоваяЗапись.Количество   = -Выборка.Количество;
		НоваяЗапись.Сумма        = -Выборка.Сумма;
		НоваяЗапись.СуммаНДС     = -Выборка.СуммаНДС;
		НоваяЗапись.СуммаБаз     = -Выборка.СуммаБаз;
		НоваяЗапись.СтавкаНДС	 = Выборка.СтавкаНДС;

		НоваяЗапись = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ВидДвижения  = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Партия       = Выборка.ПартияПриход;
		НоваяЗапись.СтавкаНДС 	 = Выборка.СтавкаНДС;
		
	КонецЦикла;
		
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");
	ТаблицаДвижения.ЗаполнитьЗначения(СкладКомпании,"СкладКомпании");
	ТаблицаДвижения.ЗаполнитьЗначения(ХозОперация,"ХозОперация");

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияПартийТоваровПереработка(Запрос, ДополнительныеСвойства) Экспорт
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));	
	
	МассивСтрокДляРасчетаСебестоимостиПоБазЦене = Новый Массив;	
	
	СкладКомпании  = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	КурсДокумента  = 1;
	ТипЦенСебестоимости    = ДополнительныеСвойства.ДляПроведения.ТипЦенСебестоимости;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	Расход 		   = 0;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВтТаблицаМатериалы.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	ВтТаблицаМатериалы КАК ВтТаблицаМатериалы";

	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ПартииТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.УстановитьЗначение("СкладКомпании",СкладКомпании);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	Блокировка.Заблокировать();	


	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
		
	ОтрицательныеОстаткиРазрешены = Истина;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаМатериалы.Номенклатура КАК Номенклатура,
	               |	СУММА(ВтТаблицаМатериалы.КоличествоБазовое) КАК Количество,
	               |	ВтТаблицаМатериалы.Номенклатура.СтавкаНДС КАК СтавкаНДС
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	ВтТаблицаМатериалы КАК ВтТаблицаМатериалы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаМатериалы.Номенклатура,
	               |	ВтТаблицаМатериалы.Номенклатура.СтавкаНДС
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	               |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	               |	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток,
	               |	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени
	               |ПОМЕСТИТЬ втОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	               |			&МоментВремени,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						втТовары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						втТовары КАК втТовары)
	               |				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
	               |ГДЕ
	               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(втОстаткиПартий.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	               |	втТовары.Количество КАК Количество,
	               |	втОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	втОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(втОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаБазОстаток, 0) КАК СуммаБазОстаток,
	               |	ЕСТЬNULL(втОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	втТовары.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	втТовары КАК втТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПартий КАК втОстаткиПартий
	               |		ПО втТовары.Номенклатура = втОстаткиПартий.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втОстаткиПартий.Порядок,
	               |	втОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаБазОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры";
	

	Запрос.Текст = ТекстЗапроса;
	
	РезультЗапроса = Запрос.Выполнить();
	
	Если Не РезультЗапроса.Пустой() Тогда
		
		ЗаполнитьТаблицуСписанияПартий(ДополнительныеСвойства.ДляПроведения, РезультЗапроса,ТаблицаДвижения,МассивСтрокДляРасчетаСебестоимостиПоБазЦене,ОтрицательныеОстаткиРазрешены, Ложь);
		
	КонецЕсли;
	
	//Оприходование продукции из переработки
	МассивСписанныхСтрок = ТаблицаДвижения.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	ТаблицаСебестоимостиИнгридиентов = ТаблицаДвижения.Скопировать(МассивСписанныхСтрок);
	ТаблицаСебестоимостиИнгридиентов.Свернуть("Номенклатура", "Количество, Сумма, СуммаБаз, СуммаНДС");
	ТаблицаСебестоимостиИнгридиентов.Индексы.Добавить("Номенклатура");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВтТаблицаПродукция.Номенклатура КАК Номенклатура,
	               |	СУММА(ВтТаблицаПродукция.КоличествоБазовое) КАК Количество,
	               |	СУММА(ВтТаблицаПродукция.Сумма) КАК Сумма,
	               |	СУММА(ВтТаблицаПродукция.Сумма) КАК СуммаБаз,
	               |	СУММА(ВтТаблицаПродукция.СуммаНДС) КАК СуммаНДС,
	               |	ВтТаблицаПродукция.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	ВтТаблицаПродукция КАК ВтТаблицаПродукция
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаПродукция.СтавкаНДС,
	               |	ВтТаблицаПродукция.Номенклатура";	
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоваяСтрока = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ВидДвижения 	= ПредопределенноеЗначение("ВидДвиженияНакопления.Приход");
		НоваяСтрока.СкладКомпании 	= СкладКомпании;		
		НоваяСтрока.Партия 			= ДокументСсылка;		
		НоваяСтрока.СтатусПартии 	= ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный");		
		НоваяСтрока.ХозОперация 	= ХозОперация;		
		
	КонецЦикла;
	

	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровКомпании", ТаблицаДвижения);	
	
КонецПроцедуры


//Регистр накопления "Продажи"
Процедура ПодготовитьТаблицуПродажТоваров(Запрос, ДополнительныеСвойства) Экспорт	
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ПодразделениеКомпании", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаДвижения.Колонки.Добавить("ТорговаяПлощадка", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
	
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация",Новый ОписаниеТипов("СправочникСсылка.ХозОперации"));
	ТаблицаДвижения.Колонки.Добавить("КлассификаторПродажи",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));
	ТаблицаДвижения.Колонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("Покупатель",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("ДоговорВзаиморасчетов",Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");
	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаСкидки",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаУпр",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Себестоимость",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДСВходящий",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СебестоимостьУпр",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаАкциза",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	ДокументСсылка	 		= ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         			= ДополнительныеСвойства.ДляПроведения.Дата;
	ТорговаяПлощадка 		= ДополнительныеСвойства.ДляПроведения.ТорговаяПлощадка;	
	ПодразделениеКомпании 	= ДополнительныеСвойства.ДляПроведения.ПодразделениеКомпании;	
	СкладКомпании			= ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	ДоговорВзаиморасчетов	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства.ДляПроведения, "ДоговорВзаиморасчетов", Неопределено);
	Покупатель 				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства.ДляПроведения, "Контрагент", Неопределено);
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	                |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                |	ВтТаблицаТовары.КлассификаторПродажи КАК КлассификаторПродажи,
	                |	СУММА(ВЫБОР
	                |			КОГДА ВтТаблицаТовары.Возврат
	                |					И ВтТаблицаТовары.Количество > 0
	                |				ТОГДА -ВтТаблицаТовары.Количество
	                |			ИНАЧЕ ВтТаблицаТовары.Количество
	                |		КОНЕЦ) КАК Количество,
	                |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	                |	СУММА(ВЫБОР
	                |			КОГДА ВтТаблицаТовары.Возврат
	                |					И ВтТаблицаТовары.СуммаНДС > 0
	                |				ТОГДА -ВтТаблицаТовары.СуммаНДС
	                |			ИНАЧЕ ВтТаблицаТовары.СуммаНДС
	                |		КОНЕЦ) КАК СуммаНДС,
	                |	СУММА(ВЫБОР
	                |			КОГДА ВтТаблицаТовары.Возврат
	                |					И ВтТаблицаТовары.СуммаАкцизногоНалога > 0
	                |				ТОГДА -ВтТаблицаТовары.СуммаАкцизногоНалога
	                |			ИНАЧЕ ВтТаблицаТовары.СуммаАкцизногоНалога
	                |		КОНЕЦ) КАК СуммаАкциза,
	                |	СУММА(ВЫБОР
	                |			КОГДА ВтТаблицаТовары.Возврат
	                |					И ВтТаблицаТовары.СуммаВсего > 0
	                |				ТОГДА -ВтТаблицаТовары.СуммаВсего
	                |			ИНАЧЕ ВтТаблицаТовары.СуммаВсего
	                |		КОНЕЦ) КАК СуммаВсего,
	                |	СУММА(ВЫБОР
	                |			КОГДА ВтТаблицаТовары.Возврат
	                |					И ВтТаблицаТовары.СуммаСкидки > 0
	                |				ТОГДА -ВтТаблицаТовары.СуммаСкидки
	                |			ИНАЧЕ ВтТаблицаТовары.СуммаСкидки
	                |		КОНЕЦ) КАК СуммаСкидки,
	                |	ВтТаблицаТовары.Порядок КАК Порядок
	                |ПОМЕСТИТЬ ВТ_Свернуто
	                |ИЗ
	                |	ВтТаблицаТовары КАК ВтТаблицаТовары
	                |ГДЕ
	                |	ВтТаблицаТовары.Количество <> 0
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВтТаблицаТовары.Номенклатура,
	                |	ВтТаблицаТовары.ХарактеристикаНоменклатуры,
	                |	ВтТаблицаТовары.СтавкаНДС,
	                |	ВтТаблицаТовары.КлассификаторПродажи,
	                |	ВтТаблицаТовары.Порядок
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Свернуто.Номенклатура КАК Номенклатура,
	                |	ВТ_Свернуто.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                |	ВТ_Свернуто.КлассификаторПродажи КАК КлассификаторПродажи,
	                |	ВТ_Свернуто.Количество КАК Количество,
	                |	ВТ_Свернуто.СтавкаНДС КАК СтавкаНДС,
	                |	ВТ_Свернуто.СуммаНДС КАК СуммаНДС,
	                |	ВТ_Свернуто.СуммаАкциза КАК СуммаАкциза,
	                |	ВТ_Свернуто.СуммаВсего КАК СуммаВсего,
	                |	ВТ_Свернуто.СуммаСкидки КАК СуммаСкидки,
	                |	ВТ_Свернуто.Порядок КАК Порядок,
	                |	ВЫБОР
	                |		КОГДА ВТ_Свернуто.Количество < 0
	                |				ИЛИ ВТ_Свернуто.СуммаВсего < 0
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ КАК Возврат
	                |ИЗ
	                |	ВТ_Свернуто КАК ВТ_Свернуто
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Возврат,
	                |	Порядок
	                |ИТОГИ ПО
	                |	Возврат";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	тзСписанныеПартии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровКомпании.Скопировать();
	тзСписанныеПартии.Индексы.Добавить("ВидДвижения,Возврат,Номенклатура,ХарактеристикаНоменклатуры");
	
	ВидДвижРасход = ВидДвиженияНакопления.Расход;
	СтрокаОтбора = "Номенклатура,ХарактеристикаНоменклатуры";
	Отбор = Новый Структура(СтрокаОтбора);
	
	Пока ВыборкаЗапроса.Следующий() Цикл 
		ЭтоВозрват = ВыборкаЗапроса.Возврат;
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
			ХозОперация = ДополнительныеСвойства.ДляПроведения.ХозОперация;			
		Иначе
			Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
				ХозОперация = ?(ЭтоВозрват,ПредопределенноеЗначение("Справочник.ХозОперации.ЗакрытиеСменыВозврат"),ПредопределенноеЗначение("Справочник.ХозОперации.ЗакрытиеСмены"));
			Иначе
				ХозОперация = ДополнительныеСвойства.ДляПроведения.ХозОперация;
			КонецЕсли;
			
			Отбор.Вставить("ВидДвижения",ВидДвижРасход);
			Отбор.Вставить("Возврат", ЭтоВозрват);
		КонецЕсли;
		
		ВыборкаТовары = ВыборкаЗапроса.Выбрать();
		
		ПогрешностьОкругления = 0;
		ПогрешностьОкругленияНДС = 0;
		Пока ВыборкаТовары.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(Отбор,ВыборкаТовары,СтрокаОтбора);
			//	Отбор = Новый Структура("ВидДвижения,Возврат,Номенклатура,ХарактеристикаНоменклатуры",ВидДвижРасход,ЭтоВозрват,ВыборкаТовары.Номенклатура,ВыборкаТовары.ХарактеристикаНоменклатуры);
			нСтрокиПартийТоваров = тзСписанныеПартии.НайтиСтроки(Отбор);	
			
			Если ЭтоВозрват Тогда 
				Для Каждого СтрПартия Из нСтрокиПартийТоваров Цикл 
					Если СтрПартия.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
						СтрПартия.Количество = -СтрПартия.Количество;
						СтрПартия.Сумма		 = -СтрПартия.Сумма;
						СтрПартия.СуммаБаз	 = -СтрПартия.СуммаБаз;
						СтрПартия.СуммаНДС	 = -СтрПартия.СуммаНДС;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			СуммаОкруглить = ВыборкаТовары.СуммаВсего;
			СуммаНДСОкруглить = ВыборкаТовары.СуммаНДС;
			СуммаОкр = ОбщегоНазначенияТККлиентСервер.ОкруглитьСУчетомПогрешности(СуммаОкруглить,2,ПогрешностьОкругления);
			СуммаНДСОкр  = ОбщегоНазначенияТККлиентСервер.ОкруглитьСУчетомПогрешности(СуммаНДСОкруглить,2,ПогрешностьОкругленияНДС);
			
			СуммаВсего 		  = СуммаОкр; //Окр(ВыборкаТовары.СуммаВсего,2);
			СуммаНДС          = СуммаНДСОкр;//ВыборкаТовары.СуммаНДС;
			СуммаСкидки       = ВыборкаТовары.СуммаСкидки;
			СуммаУпр          = СуммаОкр;//ВыборкаТовары.СуммаВсего;
			СуммаАкциза       = ВыборкаТовары.СуммаАкциза;
			
			НадоСписать = ОбщегоНазначенияТККлиентСервер.МодульЧисла(ВыборкаТовары.Количество);
			
			Для Сч=0 По нСтрокиПартийТоваров.ВГраница() Цикл
				стзПартии = нСтрокиПартийТоваров[Сч];
				ПартияКоличество = ОбщегоНазначенияТККлиентСервер.МодульЧисла(стзПартии.Количество);
						
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ПодразделениеКомпании =  ПодразделениеКомпании;
				НоваяЗапись.ТорговаяПлощадка      =  ТорговаяПлощадка;
				НоваяЗапись.СкладКомпании		  =  СкладКомпании;
				НоваяЗапись.Номенклатура          =  ВыборкаТовары.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация           =  ХозОперация;
				НоваяЗапись.КлассификаторПродажи  =  ВыборкаТовары.КлассификаторПродажи;
				НоваяЗапись.Поставщик             =  стзПартии.Контрагент;
				НоваяЗапись.Партия                =  стзПартии.Партия;
				НоваяЗапись.СтавкаНДС             =  стзПартии.СтавкаНДС;
				НоваяЗапись.СтатусПартии          =  стзПартии.СтатусПартии;

				НоваяЗапись.Покупатель            =  Покупатель;
				НоваяЗапись.ДоговорВзаиморасчетов =  ДоговорВзаиморасчетов;
								
				Если стзПартии.Количество = 0 Тогда					
					НоваяЗапись.Сумма       = ВыборкаТовары.СуммаВсего;
					НоваяЗапись.СуммаНДС    = ВыборкаТовары.СуммаНДС;
					НоваяЗапись.СуммаСкидки = ВыборкаТовары.СуммаСкидки;
					НоваяЗапись.СуммаУпр    = ВыборкаТовары.СуммаВсего;
					НоваяЗапись.СуммаАкциза = ВыборкаТовары.СуммаАкциза;
					Продолжить;
				КонецЕсли;
									
				КоличествоСписать = Мин(НадоСписать, ПартияКоличество);
				К = КоличествоСписать/?(НадоСписать=0,1,НадоСписать);

				НоваяЗапись.Себестоимость    = Окр(?(ПартияКоличество<=КоличествоСписать, стзПартии.Сумма,стзПартии.Сумма/ПартияКоличество*КоличествоСписать),2);
				НоваяЗапись.СуммаНДСВходящий = Окр(?(ПартияКоличество<=КоличествоСписать, стзПартии.СуммаНДС,стзПартии.СуммаНДС/ПартияКоличество*КоличествоСписать),2);
				НоваяЗапись.СебестоимостьУпр = Окр(?(ПартияКоличество<=КоличествоСписать, стзПартии.СуммаБаз,стзПартии.СуммаБаз/ПартияКоличество*КоличествоСписать),2);
				НоваяЗапись.Количество = ?(ЭтоВозрват, -КоличествоСписать, КоличествоСписать);
				
				Если К = 0 Тогда
					НоваяЗапись.Сумма       = ВыборкаТовары.СуммаВсего;
					НоваяЗапись.СуммаНДС    = ВыборкаТовары.СуммаНДС;
					НоваяЗапись.СуммаСкидки = ВыборкаТовары.СуммаСкидки;
					НоваяЗапись.СуммаУпр    = ВыборкаТовары.СуммаВсего;
					НоваяЗапись.СуммаАкциза = ВыборкаТовары.СуммаАкциза;
				Иначе	
					НоваяЗапись.Сумма       = Окр(СуммаВсего * К,2);
					НоваяЗапись.СуммаНДС    = Окр(СуммаНДС * К,2);
					НоваяЗапись.СуммаСкидки = Окр(СуммаСкидки * К,2);
					НоваяЗапись.СуммаУпр    = Окр(СуммаВсего * К,2);
					НоваяЗапись.СуммаАкциза = Окр(СуммаАкциза * К,2);
				КонецЕсли;	
				
				Если ПартияКоличество > НадоСписать Тогда
					стзПартии.Количество = (ПартияКоличество - НадоСписать) * ?(ЭтоВозрват, -1, 1);
					стзПартии.Сумма 	 = стзПартии.Сумма - НоваяЗапись.Себестоимость;
					стзПартии.СуммаБаз   = стзПартии.СуммаБаз - НоваяЗапись.СебестоимостьУпр;
					стзПартии.СуммаНДС   = стзПартии.СуммаНДС - НоваяЗапись.СуммаНДСВходящий;
				Иначе
					тзСписанныеПартии.Удалить(стзПартии);
				КонецЕсли;
				
				
				СуммаВсего 		  = СуммаВсего   - НоваяЗапись.Сумма;
				СуммаНДС          = СуммаНДС     - НоваяЗапись.СуммаНДС;
				СуммаСкидки       = СуммаСкидки  - НоваяЗапись.СуммаСкидки;
				СуммаУпр          = СуммаУпр     - НоваяЗапись.СуммаУпр;
				СуммаАкциза       = СуммаАкциза  - НоваяЗапись.СуммаАкциза;
				НадоСписать       = НадоСписать  - ПартияКоличество;
				
				Если НадоСписать <= 0 Тогда 
					Прервать; 
				КонецЕсли;				
			КонецЦикла;
						
			
			///возвраты
			Если НадоСписать <> 0 Или  СуммаВсего <> 0 Тогда
								
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ПодразделениеКомпании =  ПодразделениеКомпании;
				НоваяЗапись.ТорговаяПлощадка      =  ТорговаяПлощадка;
				НоваяЗапись.СкладКомпании		  =  СкладКомпании;
				НоваяЗапись.Номенклатура          =  ВыборкаТовары.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаТовары.ХарактеристикаНоменклатуры;
				НоваяЗапись.ХозОперация           =  ХозОперация;
				НоваяЗапись.КлассификаторПродажи  =  ВыборкаТовары.КлассификаторПродажи;
				НоваяЗапись.Поставщик             =  Справочники.Контрагенты.ПустаяСсылка();
				НоваяЗапись.Партия                =  ДокументСсылка;
				НоваяЗапись.СтавкаНДС             =  ВыборкаТовары.СтавкаНДС;
				НоваяЗапись.СтатусПартии          =  Перечисления.СтатусыПартий.ТоварКупленный;
				НоваяЗапись.Покупатель            =  Покупатель;
				НоваяЗапись.ДоговорВзаиморасчетов =  ДоговорВзаиморасчетов;
				
				НоваяЗапись.Сумма       = СуммаВсего;
				НоваяЗапись.СуммаНДС    = СуммаНДС;
				НоваяЗапись.СуммаСкидки = СуммаСкидки;
				НоваяЗапись.СуммаУпр    = СуммаУпр;
				НоваяЗапись.СуммаАкциза = СуммаАкциза;
				НоваяЗапись.Количество  = НадоСписать;
				НоваяЗапись.Себестоимость    = 0;
				НоваяЗапись.СуммаНДСВходящий = 0;
				НоваяЗапись.СебестоимостьУпр = 0;
				
			КонецЕсли;
			
		КонецЦикла;		
	КонецЦикла;
	
	
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажиТоваровКомпании",ТаблицаДвижения);	

	
КонецПроцедуры


//Регистр накопления "ПриходованиеТоваров"
Процедура ПодготовитьТаблицуОприходованияТоваров(Запрос, ДополнительныеСвойства) Экспорт	
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));


	//ДокументСсылка	 		= ДополнительныеСвойства.ДляПроведения.Ссылка;
	//Период         			= ДополнительныеСвойства.ДляПроведения.Дата;
	//СкладКомпании			= ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	//	
	Отбор = Новый Структура("ВидДвижения,ХозОперация",ВидДвиженияНакопления.Приход,Справочники.ХозОперации.ПоступлениеТоваровСреднееОтрицательное);

	нСтрокиПартийТоваров = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровКомпании.НайтиСтроки(Отбор);
	Для Каждого СтрПартия Из нСтрокиПартийТоваров Цикл 
		НоваяЗапись = ТаблицаДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрПартия,"Период,ВидДвижения,СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры,Количество,Сумма");
	КонецЦикла;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПриходованиеТоваров",ТаблицаДвижения);	

	
КонецПроцедуры

Процедура ПодготовитьТаблицуСписанияОприходованияТоваров(Запрос, ДополнительныеСвойства) Экспорт
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("СкладКомпании");
	ТаблицаДвижения.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижения.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДвижения.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));

	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПриходованиеТоваровОстатки.СкладКомпании КАК СкладКомпании,
	              |	ПриходованиеТоваровОстатки.Номенклатура КАК Номенклатура,
	              |	ПриходованиеТоваровОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |	ПриходованиеТоваровОстатки.КоличествоОстаток КАК Количество,
	              |	ПриходованиеТоваровОстатки.СуммаОстаток КАК Сумма
	              |ИЗ
	              |	РегистрНакопления.ПриходованиеТоваров.Остатки(
	              |			&МоментВремени,
	              |			СкладКомпании = &СкладКомпании
	              |				И (Номенклатура, ХарактеристикаНоменклатуры) В
	              |					(ВЫБРАТЬ
	              |						ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	              |						ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	              |					ИЗ
	              |						ВтТаблицаТовары КАК ВтТаблицаТовары)) КАК ПриходованиеТоваровОстатки" ;
	
	
	 
	 РезультЗапроса = Запрос.Выполнить();
	 
	 Если Не РезультЗапроса.Пустой() Тогда
		 
		 Выборка = РезультЗапроса.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл 
			 НоваяЗапись = ТаблицаДвижения.Добавить(); 
			 ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка,"СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры,Количество,Сумма");
		 КонецЦикла;
		 
		 ТаблицаДвижения.ЗаполнитьЗначения(ДополнительныеСвойства.ДляПроведения.Дата,"Период");
		 ТаблицаДвижения.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,"ВидДвижения");

		 
		 
	 КонецЕсли;
	 
	 ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПриходованиеТоваров",ТаблицаДвижения);	
 
	
КонецПроцедуры


#КонецОбласти


#Область Сделки

//Регистр накопления "Расчеты с поставщикамии по документам"
Процедура ПодготовитьТаблицуЗакрытияСделокСПоставщиками(Запрос, ДополнительныеСвойства) Экспорт 
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("ДоговорВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДвижения.Колонки.Добавить("Сделка");
	ТаблицаДвижения.Колонки.Добавить("РегламентированныйУчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("ВидОперации");
	
	Период         	= ДополнительныеСвойства.ДляПроведения.Дата;
	ДокументСсылка 	= ДополнительныеСвойства.ДляПроведения.Ссылка;	
	ТипДокумента 	= ТипЗнч(ДокументСсылка);
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	КурсДокумента	= ДополнительныеСвойства.ДляПроведения.КурсДокумента;
	ХозОперация    	= ДополнительныеСвойства.ДляПроведения.ХозОперация;
	
	Если ТипДокумента = Тип("ДокументСсылка.ТК_Взаимозачет") Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицаСостав.Дт_Контрагент КАК Контрагент,
		               |	ВтТаблицаСостав.Дт_Договор КАК ДоговорВзаиморасчетов
		               |ИЗ
		               |	ВтТаблицаСостав КАК ВтТаблицаСостав
		               |ГДЕ
		               |	ВтТаблицаСостав.Дт_Покупка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаСостав.Дт_Контрагент,
		               |	ВтТаблицаСостав.Дт_Договор
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВтТаблицаСостав.Кт_Контрагент,
		               |	ВтТаблицаСостав.Кт_Договор
		               |ИЗ
		               |	ВтТаблицаСостав КАК ВтТаблицаСостав
		               |ГДЕ
		               |	ВтТаблицаСостав.Кт_Покупка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаСостав.Кт_Контрагент,
		               |	ВтТаблицаСостав.Кт_Договор";

	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	КонецЕсли;

	РезультатБлокировки = Запрос.Выполнить();	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоДокументам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДоговорВзаиморасчетов", "ДоговорВзаиморасчетов");
		
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;	
	
	
	Если ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда 
		ВидДвижения		 = ВидДвиженияНакопления.Расход;
	
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.ДокументОснование КАК Сделка,
		               |	ВтТаблицаТовары.СуммаДокумента КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПоставщиками
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 		
		ВидДвижения		 = ВидДвиженияНакопления.Приход;	
	
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.ДокументОснование КАК Сделка,
		               |	ВтТаблицаТовары.СуммаДокумента КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПоставщиками
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда 		
		ВидДвижения		 = ВидДвиженияНакопления.Расход;
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Сделка КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПоставщиками
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |ГДЕ
		               |	ВтТаблицаТовары.РасчетСПоставщиком
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Контрагент,
		               |	ВтТаблицаТовары.Сделка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда 		
		ВидДвижения		 = ВидДвиженияНакопления.Приход;
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Сделка КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПоставщиками
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |ГДЕ
		               |	ВтТаблицаТовары.РасчетСПоставщиком
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Контрагент,
		               |	ВтТаблицаТовары.Сделка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратПоставщику") Тогда 
		ВидДвижения = ВидДвиженияНакопления.Приход;
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	&Контрагент КАК Контрагент,
		               |	&ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Партия КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПоставщиками
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.Партия
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ТК_Взаимозачет") Тогда 
	
		ЭтоДебитор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "Дебитор", Ложь);
		
		Если ЭтоДебитор Тогда 
			ВидДвижения = ВидДвиженияНакопления.Расход;			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВтТаблицаСостав.Дт_Контрагент КАК Контрагент,
			               |	ВтТаблицаСостав.Дт_Договор КАК ДоговорВзаиморасчетов,
			               |	ВтТаблицаСостав.Дт_Сделка КАК Сделка,
			               |	СУММА(ВтТаблицаСостав.Сумма) КАК Сумма
			               |ПОМЕСТИТЬ втРасчетыСПоставщиками
			               |ИЗ
			               |	ВтТаблицаСостав КАК ВтТаблицаСостав
			               |ГДЕ
			               |	ВтТаблицаСостав.Дт_Покупка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВтТаблицаСостав.Дт_Контрагент,
			               |	ВтТаблицаСостав.Дт_Сделка,
			               |	ВтТаблицаСостав.Дт_Договор";
		Иначе
			ВидДвижения = ВидДвиженияНакопления.Приход;			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВтТаблицаСостав.Кт_Контрагент КАК Контрагент,
			               |	ВтТаблицаСостав.Кт_Договор КАК ДоговорВзаиморасчетов,
			               |	ВтТаблицаСостав.Кт_Сделка КАК Сделка,
			               |	СУММА(ВтТаблицаСостав.Сумма) КАК Сумма
			               |ПОМЕСТИТЬ втРасчетыСПоставщиками
			               |ИЗ
			               |	ВтТаблицаСостав КАК ВтТаблицаСостав
			               |ГДЕ
			               |	ВтТаблицаСостав.Кт_Покупка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВтТаблицаСостав.Кт_Контрагент,
			               |	ВтТаблицаСостав.Кт_Договор,
			               |	ВтТаблицаСостав.Кт_Сделка";			
		КонецЕсли;
		
	КонецЕсли;	
	
	ОснТекстЗапроса = "ВЫБРАТЬ
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.Контрагент КАК Контрагент,
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.Сделка КАК Сделка,
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.Сделка.МоментВремени КАК МоментВремени,
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток КАК Сумма,
	                  |	РасчетыСПоставщикамиПоДокументамОстатки.СуммаБазОстаток КАК СуммаБаз,
	                  |	ВЫБОР
	                  |		КОГДА НЕ втРасчетыСПоставщиками.Сумма ЕСТЬ NULL
	                  |			ТОГДА 0
	                  |		ИНАЧЕ 1
	                  |	КОНЕЦ КАК Порядок
	                  |ПОМЕСТИТЬ СписокСделок
	                  |ИЗ
	                  |	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	                  |			&МоментВремени,
	                  |			РегламентированныйУчет = &РегламентированныйУчет
	                  |				И ДоговорВзаиморасчетов В
	                  |					(ВЫБРАТЬ
	                  |						втРасчетыСПоставщиками.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	                  |					ИЗ
	                  |						втРасчетыСПоставщиками КАК втРасчетыСПоставщиками)) КАК РасчетыСПоставщикамиПоДокументамОстатки
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ втРасчетыСПоставщиками КАК втРасчетыСПоставщиками
	                  |		ПО РасчетыСПоставщикамиПоДокументамОстатки.Контрагент = втРасчетыСПоставщиками.Контрагент
	                  |			И РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов = втРасчетыСПоставщиками.ДоговорВзаиморасчетов
	                  |			И РасчетыСПоставщикамиПоДокументамОстатки.Сделка = втРасчетыСПоставщиками.Сделка
	                  |ГДЕ
	                  |	%ОтборПоОстаткамСделки%
	                  |
	                  |ИНДЕКСИРОВАТЬ ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	втРасчетыСПоставщиками.Контрагент КАК Контрагент,
	                  |	втРасчетыСПоставщиками.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	СУММА(втРасчетыСПоставщиками.Сумма) КАК Сумма
	                  |ПОМЕСТИТЬ ТаблИтоги
	                  |ИЗ
	                  |	втРасчетыСПоставщиками КАК втРасчетыСПоставщиками
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	втРасчетыСПоставщиками.Контрагент,
	                  |	втРасчетыСПоставщиками.ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ТаблИтоги.Контрагент КАК Контрагент,
	                  |	ТаблИтоги.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	СписокСделок.Сделка КАК Сделка,
	                  |	ТаблИтоги.Сумма КАК СуммаСписать,
	                  |	ЕСТЬNULL(СписокСделок.Сумма, 0) КАК Сумма,
	                  |	ЕСТЬNULL(СписокСделок.СуммаБаз, 0) КАК СуммаБаз
	                  |ИЗ
	                  |	ТаблИтоги КАК ТаблИтоги
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ СписокСделок КАК СписокСделок
	                  |		ПО ТаблИтоги.Контрагент = СписокСделок.Контрагент
	                  |			И ТаблИтоги.ДоговорВзаиморасчетов = СписокСделок.ДоговорВзаиморасчетов
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов,
	                  |	СписокСделок.Порядок,
	                  |	СписокСделок.МоментВремени
	                  |ИТОГИ
	                  |	МАКСИМУМ(СуммаСписать)
	                  |ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ втРасчетыСПоставщиками
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ СписокСделок
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ ТаблИтоги";
	
		
	Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности");		
	ИначеЕсли ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности");	
	КонецЕсли;	
	
	Если ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности") Тогда 		
		стрОтборСделок = "РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток < 0";					
	Иначе		
		стрОтборСделок = "РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток > 0";
	КонецЕсли;
	
	ОснТекстЗапроса = СтрЗаменить(ОснТекстЗапроса, "%ОтборПоОстаткамСделки%", стрОтборСделок);	
	ОснТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + ОснТекстЗапроса;
	
	Запрос.Текст = ОснТекстЗапроса;	
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаКонтрагент.Следующий() Цикл 
		текКонтрагент = ВыборкаКонтрагент.Контрагент;	
		ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДоговор.Следующий() Цикл 		
			текДоговор = ВыборкаДоговор.ДоговорВзаиморасчетов;		
			НужноСписать = ВыборкаДоговор.СуммаСписать;
			
			ВыборкаСделок = ВыборкаДоговор.Выбрать();		
			
			Пока ВыборкаСделок.Следующий() И НужноСписать <> 0 Цикл 		
				Если ВыборкаСделок.Сумма = 0 Тогда 
					Продолжить;      
				КонецЕсли;
				
				Списываем = Мин(НужноСписать, Макс(ВыборкаСделок.Сумма, -ВыборкаСделок.Сумма));
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.Период 		= Период;
				НоваяЗапись.ВидДвижения = ВидДвижения;
				НоваяЗапись.Контрагент 	= текКонтрагент;
				НоваяЗапись.ДоговорВзаиморасчетов = текДоговор;
				НоваяЗапись.Сделка		= ВыборкаСделок.Сделка;
				НоваяЗапись.РегламентированныйУчет = РегламентированныйУчет;
				НоваяЗапись.Сумма		= Списываем;
				НоваяЗапись.СуммаБаз 	= Списываем * КурсДокумента;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.ВидОперации = ВОЗакрытиеСделки;
				
				НужноСписать = НужноСписать - Списываем;
				Если НужноСписать <= 0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			
			Если НужноСписать > 0 Тогда 		
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.Период 		= Период;
				НоваяЗапись.ВидДвижения = ВидДвижения;
				НоваяЗапись.Контрагент 	= текКонтрагент;
				НоваяЗапись.ДоговорВзаиморасчетов = текДоговор;
				НоваяЗапись.Сделка		= ДокументСсылка;
				НоваяЗапись.РегламентированныйУчет = РегламентированныйУчет;
				НоваяЗапись.Сумма		= НужноСписать;
				НоваяЗапись.СуммаБаз 	= НужноСписать * КурсДокумента;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.ВидОперации = ВОСозданиеСделки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщикамиПоДокументам", ТаблицаДвижения);
	
КонецПроцедуры

//Регистр накопления "Расчеты с поставщикамии"
Процедура ПодготовитьТаблицуРасчетыСПоставщиками(Запрос, ДополнительныеСвойства) Экспорт 		
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("ДоговорВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДвижения.Колонки.Добавить("РегламентированныйУчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("ВидОперации");
		
	ТаблицаДвиженияПоДокументам = Неопределено;	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаРасчетыСПоставщикамиПоДокументам", ТаблицаДвиженияПоДокументам) Тогда 
		
		Для Каждого Стр Из ТаблицаДвиженияПоДокументам Цикл 
			НоваяСтрока = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТаблицаДвижения.Количество() > 1 Тогда 
		
		ТаблицаДвижения.Свернуть("Период, ВидДвижения, Контрагент, ДоговорВзаиморасчетов, РегламентированныйУчет, ХозОперация, ВидОперации", "Сумма, СуммаБаз");
		
	КонецЕсли;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", ТаблицаДвижения);

КонецПроцедуры


//Регистр накопления "Расчеты с покупателями по документам"
Процедура ПодготовитьТаблицуЗакрытияСделокСПокупателями(Запрос, ДополнительныеСвойства) Экспорт 		
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("ДоговорВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДвижения.Колонки.Добавить("Сделка");
	ТаблицаДвижения.Колонки.Добавить("РегламентированныйУчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("ВидОперации");
	
	Ссылка			= ДополнительныеСвойства.ДляПроведения.Ссылка;
	ТипДокумента	= ТипЗнч(Ссылка);
	Период         	= ДополнительныеСвойства.ДляПроведения.Дата;
	ДокументСсылка 	= ДополнительныеСвойства.ДляПроведения.Ссылка;	
	КурсДокумента	= ДополнительныеСвойства.ДляПроведения.КурсДокумента;
	ХозОперация    	= ДополнительныеСвойства.ДляПроведения.ХозОперация;
	РегламентированныйУчет = ДополнительныеСвойства.ДляПроведения.РегламентированныйУчет;
	
	Если ТипДокумента = Тип("ДокументСсылка.ТК_Взаимозачет") Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВтТаблицаСостав.Дт_Контрагент КАК Контрагент,
		               |	ВтТаблицаСостав.Дт_Договор КАК ДоговорВзаиморасчетов
		               |ИЗ
		               |	ВтТаблицаСостав КАК ВтТаблицаСостав
		               |ГДЕ
		               |	ВтТаблицаСостав.Дт_Покупка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаСостав.Дт_Контрагент,
		               |	ВтТаблицаСостав.Дт_Договор
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВтТаблицаСостав.Кт_Контрагент,
		               |	ВтТаблицаСостав.Кт_Договор
		               |ИЗ
		               |	ВтТаблицаСостав КАК ВтТаблицаСостав
		               |ГДЕ
		               |	ВтТаблицаСостав.Кт_Покупка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаСостав.Кт_Контрагент,
		               |	ВтТаблицаСостав.Кт_Договор";

	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
	КонецЕсли;


	РезультатБлокировки = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателямиПоДокументам");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДоговорВзаиморасчетов", "ДоговорВзаиморасчетов");	
	Блокировка.Заблокировать();	
 
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед Тогда	
		Набор = РегистрыНакопления.РасчетыСПокупателямиПоДокументам.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;	
	
	
	Если ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда 
		
		ВидДвижения		 = ВидДвиженияНакопления.Расход;	
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности");		
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.ДокументОснование КАК Сделка,
		               |	ВтТаблицаТовары.СуммаДокумента КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 
		                
		ВидДвижения		 = ВидДвиженияНакопления.Приход;	
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности");		
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.ДокументОснование КАК Сделка,
		               |	ВтТаблицаТовары.СуммаДокумента КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары";					   
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда 
		
		ВидДвижения		 = ВидДвиженияНакопления.Расход;	
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности");		
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Сделка КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |ГДЕ
		               |	Не ВтТаблицаТовары.РасчетСПоставщиком
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Контрагент,
		               |	ВтТаблицаТовары.Сделка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда 
		
		ВидДвижения		 = ВидДвиженияНакопления.Приход;	
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности");		

		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Сделка КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |ГДЕ
		               |	Не ВтТаблицаТовары.РасчетСПоставщиком
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Контрагент,
		               |	ВтТаблицаТовары.Сделка
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";

		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда 

		ВидДвижения		 = ВидДвиженияНакопления.Расход;
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности");		
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Партия КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов,
		               |	ВтТаблицаТовары.Партия,
		               |	ВтТаблицаТовары.Контрагент
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Контрагент,
		               |	ДоговорВзаиморасчетов,
		               |	Сделка";		
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваров") ИЛИ ТипДокумента = Тип("ДокументСсылка.ВыпускПродукции") Тогда 
				
		ВидДвижения		 = ВидДвиженияНакопления.Приход;	
		ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности");
		ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности");		

		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВтТаблицаТовары.Контрагент КАК Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	НЕОПРЕДЕЛЕНО КАК Сделка,
		               |	СУММА(ВтТаблицаТовары.СуммаВсего) КАК Сумма
		               |ПОМЕСТИТЬ втРасчетыСПокупателями					   
		               |ИЗ
		               |	ВтТаблицаТовары КАК ВтТаблицаТовары
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВтТаблицаТовары.Контрагент,
		               |	ВтТаблицаТовары.ДоговорВзаиморасчетов";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ТК_Взаимозачет") Тогда 
	
		ЭтоДебитор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "Дебитор", Ложь);
		
		Если ЭтоДебитор Тогда 
			ВидДвижения		 = ВидДвиженияНакопления.Расход;
			ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности");
			ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности");		
		
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВтТаблицаСостав.Дт_Контрагент КАК Контрагент,
			               |	ВтТаблицаСостав.Дт_Договор КАК ДоговорВзаиморасчетов,
			               |	ВтТаблицаСостав.Дт_Сделка КАК Сделка,
			               |	СУММА(ВтТаблицаСостав.Сумма) КАК Сумма
			               |ПОМЕСТИТЬ втРасчетыСПокупателями
			               |ИЗ
			               |	ВтТаблицаСостав КАК ВтТаблицаСостав
			               |ГДЕ
			               |	Не ВтТаблицаСостав.Дт_Покупка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВтТаблицаСостав.Дт_Контрагент,
			               |	ВтТаблицаСостав.Дт_Сделка,
			               |	ВтТаблицаСостав.Дт_Договор";
		Иначе
			ВидДвижения		 = ВидДвиженияНакопления.Приход;	
			ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности");
			ВОСозданиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности");		

			ТекстЗапроса = "ВЫБРАТЬ
			               |	ВтТаблицаСостав.Кт_Контрагент КАК Контрагент,
			               |	ВтТаблицаСостав.Кт_Договор КАК ДоговорВзаиморасчетов,
			               |	ВтТаблицаСостав.Кт_Сделка КАК Сделка,
			               |	СУММА(ВтТаблицаСостав.Сумма) КАК Сумма
			               |ПОМЕСТИТЬ втРасчетыСПокупателями
			               |ИЗ
			               |	ВтТаблицаСостав КАК ВтТаблицаСостав
			               |ГДЕ
			               |	Не ВтТаблицаСостав.Кт_Покупка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВтТаблицаСостав.Кт_Контрагент,
			               |	ВтТаблицаСостав.Кт_Договор,
			               |	ВтТаблицаСостав.Кт_Сделка";			
		КонецЕсли;
		
		
	КонецЕсли;
		
	ОснТекстЗапроса = "ВЫБРАТЬ
	                  |	РасчетыСПокупателямиПоДокументамОстатки.Контрагент КАК Контрагент,
	                  |	РасчетыСПокупателямиПоДокументамОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	РасчетыСПокупателямиПоДокументамОстатки.Сделка КАК Сделка,
	                  |	РасчетыСПокупателямиПоДокументамОстатки.Сделка.МоментВремени КАК МоментВремени,
	                  |	РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток КАК Сумма,
	                  |	РасчетыСПокупателямиПоДокументамОстатки.СуммаБазОстаток КАК СуммаБаз,
	                  |	ВЫБОР
	                  |		КОГДА НЕ втРасчетыСПокупателями.Сумма ЕСТЬ NULL
	                  |			ТОГДА 0
	                  |		ИНАЧЕ 1
	                  |	КОНЕЦ КАК Порядок
	                  |ПОМЕСТИТЬ СписокСделок
	                  |ИЗ
	                  |	РегистрНакопления.РасчетыСПокупателямиПоДокументам.Остатки(
	                  |			&МоментВремени,
	                  |			РегламентированныйУчет = &РегламентированныйУчет
	                  |				И ДоговорВзаиморасчетов В
	                  |					(ВЫБРАТЬ
	                  |						
	                  |						втРасчетыСПокупателями.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	                  |					ИЗ
	                  |						втРасчетыСПокупателями КАК втРасчетыСПокупателями)) КАК РасчетыСПокупателямиПоДокументамОстатки
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ втРасчетыСПокупателями КАК втРасчетыСПокупателями
	                  |		ПО РасчетыСПокупателямиПоДокументамОстатки.Контрагент = втРасчетыСПокупателями.Контрагент
	                  |			И РасчетыСПокупателямиПоДокументамОстатки.ДоговорВзаиморасчетов = втРасчетыСПокупателями.ДоговорВзаиморасчетов
	                  |			И РасчетыСПокупателямиПоДокументамОстатки.Сделка = втРасчетыСПокупателями.Сделка
	                  |ГДЕ
	                  |	%ОтборПоОстаткамСделки%
	                  |
	                  |ИНДЕКСИРОВАТЬ ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	втРасчетыСПоставщиками.Контрагент КАК Контрагент,
	                  |	втРасчетыСПоставщиками.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	СУММА(втРасчетыСПоставщиками.Сумма) КАК Сумма
	                  |ПОМЕСТИТЬ ТаблИтоги
	                  |ИЗ
	                  |	втРасчетыСПокупателями КАК втРасчетыСПоставщиками
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	втРасчетыСПоставщиками.Контрагент,
	                  |	втРасчетыСПоставщиками.ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ТаблИтоги.Контрагент КАК Контрагент,
	                  |	ТаблИтоги.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                  |	СписокСделок.Сделка КАК Сделка,
	                  |	ТаблИтоги.Сумма КАК СуммаСписать,
	                  |	ЕСТЬNULL(СписокСделок.Сумма, 0) КАК Сумма,
	                  |	ЕСТЬNULL(СписокСделок.СуммаБаз, 0) КАК СуммаБаз
	                  |ИЗ
	                  |	ТаблИтоги КАК ТаблИтоги
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ СписокСделок КАК СписокСделок
	                  |		ПО ТаблИтоги.Контрагент = СписокСделок.Контрагент
	                  |			И ТаблИтоги.ДоговорВзаиморасчетов = СписокСделок.ДоговорВзаиморасчетов
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов,
	                  |	СписокСделок.Порядок,
	                  |	СписокСделок.МоментВремени
	                  |ИТОГИ
	                  |	МАКСИМУМ(СуммаСписать)
	                  |ПО
	                  |	Контрагент,
	                  |	ДоговорВзаиморасчетов
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ втРасчетыСПокупателями
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ СписокСделок
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |УНИЧТОЖИТЬ ТаблИтоги";
	
	
	
	Если ВОЗакрытиеСделки = ПредопределенноеЗначение("Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности") Тогда 		
		стрОтборСделок = "РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток < 0";					
	Иначе		
		стрОтборСделок = "РасчетыСПокупателямиПоДокументамОстатки.СуммаОстаток > 0";
	КонецЕсли;
	
	ОснТекстЗапроса = СтрЗаменить(ОснТекстЗапроса, "%ОтборПоОстаткамСделки%", стрОтборСделок);	
	ОснТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + ОснТекстЗапроса;
	
	Запрос.Текст = ОснТекстЗапроса;	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл 
		текКонтрагент = ВыборкаКонтрагент.Контрагент;
		ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДоговор.Следующий() Цикл 
			текДоговор = ВыборкаДоговор.ДоговорВзаиморасчетов;
			НужноСписать = Окр(ВыборкаДоговор.СуммаСписать,2);
			
			ВыборкаСделок = ВыборкаДоговор.Выбрать();
			Пока ВыборкаСделок.Следующий() И НужноСписать > 0 Цикл				
				Если ВыборкаСделок.Сумма = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				Списываем = Мин(НужноСписать, Макс(ВыборкаСделок.Сумма, -ВыборкаСделок.Сумма));
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.Период 		= Период;
				НоваяЗапись.ВидДвижения = ВидДвижения;
				НоваяЗапись.Контрагент 	= текКонтрагент;
				НоваяЗапись.ДоговорВзаиморасчетов = текДоговор;
				НоваяЗапись.Сделка		= ВыборкаСделок.Сделка;
				НоваяЗапись.РегламентированныйУчет = РегламентированныйУчет;
				НоваяЗапись.Сумма		= Списываем;
				НоваяЗапись.СуммаБаз 	= Списываем * КурсДокумента;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.ВидОперации = ВОЗакрытиеСделки;
				
				НужноСписать = НужноСписать - Списываем;
			КонецЦикла;
			
			Если НужноСписать > 0 Тогда 		
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.Период 		= Период;
				НоваяЗапись.ВидДвижения = ВидДвижения;
				НоваяЗапись.Контрагент 	= текКонтрагент;
				НоваяЗапись.ДоговорВзаиморасчетов = текДоговор;
				НоваяЗапись.Сделка		= ДокументСсылка;
				НоваяЗапись.РегламентированныйУчет = РегламентированныйУчет;
				НоваяЗапись.Сумма		= НужноСписать;
				НоваяЗапись.СуммаБаз 	= НужноСписать * КурсДокумента;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.ВидОперации = ВОСозданиеСделки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателямиПоДокументам", ТаблицаДвижения);

КонецПроцедуры

//Регистр накопления "Расчеты с покупателями"
Процедура ПодготовитьТаблицуРасчетыСПокупателями(Запрос, ДополнительныеСвойства) Экспорт 		
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДвижения.Колонки.Добавить("ДоговорВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДвижения.Колонки.Добавить("РегламентированныйУчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаБаз",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("ВидОперации");
	
	ТаблицаДвиженияПоДокументам = Неопределено;	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаРасчетыСПокупателямиПоДокументам", ТаблицаДвиженияПоДокументам) Тогда 
		
		Для Каждого Стр Из ТаблицаДвиженияПоДокументам Цикл 
			НоваяСтрока = ТаблицаДвижения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТаблицаДвижения.Количество() > 1 Тогда 
		
		ТаблицаДвижения.Свернуть("Период, ВидДвижения, Контрагент, ДоговорВзаиморасчетов, РегламентированныйУчет, ХозОперация, ВидОперации", "Сумма, СуммаБаз");
		
	КонецЕсли;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", ТаблицаДвижения);

КонецПроцедуры


///Корректировки
Процедура ПодготовитьТаблицыКорректировокДолга(Запрос,ДополнительныеСвойства)Экспорт
	
	     
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&ВидДвиженияПриход КАК ВидДвижения,
	               |	ПокупателиПриход.Контрагент КАК Контрагент,
	               |	ПокупателиПриход.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	&РегламентированныйУчет КАК РегламентированныйУчет,
	               |	СУММА(ПокупателиПриход.УвеличениеДолга) КАК Сумма,
	               |	СУММА(ПокупателиПриход.УвеличениеДолга) КАК СуммаБаз,
	               |	&ХозОперация КАК ХозОперация,
	               |	&ВидОперацииПКЗ КАК ВидОперации
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПокупателиПриход
	               |ГДЕ
	               |	ПокупателиПриход.УвеличениеДолга > 0
	               |	И ПокупателиПриход.ТипДоговора <> &ТипДоговораПокупка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупателиПриход.Контрагент,
	               |	ПокупателиПриход.ДоговорВзаиморасчетов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Период,
	               |	&ВидДвиженияРасход,
	               |	ПокупателиРасход.Контрагент,
	               |	ПокупателиРасход.ДоговорВзаиморасчетов,
	               |	&РегламентированныйУчет,
	               |	СУММА(ПокупателиРасход.УменьшениеДолга),
	               |	СУММА(ПокупателиРасход.УменьшениеДолга),
	               |	&ХозОперация,
	               |	&ВидОперацииПДЗ
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПокупателиРасход
	               |ГДЕ
	               |	ПокупателиРасход.УменьшениеДолга > 0
	               |	И ПокупателиРасход.ТипДоговора <> &ТипДоговораПокупка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупателиРасход.Контрагент,
	               |	ПокупателиРасход.ДоговорВзаиморасчетов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&ВидДвиженияПриход КАК ВидДвижения,
	               |	ПокупателиПоДокументамПриход.Контрагент КАК Контрагент,
	               |	ПокупателиПоДокументамПриход.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ПокупателиПоДокументамПриход.Сделка КАК Сделка,
	               |	&РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ПокупателиПоДокументамПриход.УвеличениеДолга КАК Сумма,
	               |	ПокупателиПоДокументамПриход.УвеличениеДолга КАК СуммаБаз,
	               |	&ХозОперация КАК ХозОперация,
	               |	&ВидОперацииПКЗ КАК ВидОперации
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПокупателиПоДокументамПриход
	               |ГДЕ
	               |	ПокупателиПоДокументамПриход.УвеличениеДолга > 0
	               |	И ПокупателиПоДокументамПриход.ТипДоговора <> &ТипДоговораПокупка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Период,
	               |	&ВидДвиженияРасход,
	               |	ПокупателиПоДокументамРасход.Контрагент,
	               |	ПокупателиПоДокументамРасход.ДоговорВзаиморасчетов,
	               |	ПокупателиПоДокументамРасход.Сделка,
	               |	&РегламентированныйУчет,
	               |	ПокупателиПоДокументамРасход.УменьшениеДолга,
	               |	ПокупателиПоДокументамРасход.УменьшениеДолга,
	               |	&ХозОперация,
	               |	&ВидОперацииПДЗ
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПокупателиПоДокументамРасход
	               |ГДЕ
	               |	ПокупателиПоДокументамРасход.УменьшениеДолга > 0
	               |	И ПокупателиПоДокументамРасход.ТипДоговора <> &ТипДоговораПокупка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&ВидДвиженияПриход КАК ВидДвижения,
	               |	ПоставщикиПриход.Контрагент КАК Контрагент,
	               |	ПоставщикиПриход.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	&РегламентированныйУчет КАК РегламентированныйУчет,
	               |	СУММА(ПоставщикиПриход.УвеличениеДолга) КАК Сумма,
	               |	СУММА(ПоставщикиПриход.УвеличениеДолга) КАК СуммаБаз,
	               |	&ХозОперация КАК ХозОперация,
	               |	&ВидОперацииПДЗ КАК ВидОперации
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПоставщикиПриход
	               |ГДЕ
	               |	ПоставщикиПриход.УвеличениеДолга > 0
	               |	И ПоставщикиПриход.ТипДоговора = &ТипДоговораПокупка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоставщикиПриход.Контрагент,
	               |	ПоставщикиПриход.ДоговорВзаиморасчетов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Период,
	               |	&ВидДвиженияРасход,
	               |	ПоставщикиРасход.Контрагент,
	               |	ПоставщикиРасход.ДоговорВзаиморасчетов,
	               |	&РегламентированныйУчет,
	               |	СУММА(ПоставщикиРасход.УменьшениеДолга),
	               |	СУММА(ПоставщикиРасход.УменьшениеДолга),
	               |	&ХозОперация,
	               |	&ВидОперацииПКЗ
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПоставщикиРасход
	               |ГДЕ
	               |	ПоставщикиРасход.УменьшениеДолга > 0
	               |	И ПоставщикиРасход.ТипДоговора = &ТипДоговораПокупка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоставщикиРасход.Контрагент,
	               |	ПоставщикиРасход.ДоговорВзаиморасчетов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&ВидДвиженияПриход КАК ВидДвижения,
	               |	ПоставщикиПоДокументамПриход.Контрагент КАК Контрагент,
	               |	ПоставщикиПоДокументамПриход.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ПоставщикиПоДокументамПриход.Сделка КАК Сделка,
	               |	&РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ПоставщикиПоДокументамПриход.УвеличениеДолга КАК Сумма,
	               |	ПоставщикиПоДокументамПриход.УвеличениеДолга КАК СуммаБаз,
	               |	&ХозОперация КАК ХозОперация,
	               |	&ВидОперацииПДЗ КАК ВидОперации
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПоставщикиПоДокументамПриход
	               |ГДЕ
	               |	ПоставщикиПоДокументамПриход.УвеличениеДолга > 0
	               |	И ПоставщикиПоДокументамПриход.ТипДоговора = &ТипДоговораПокупка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&Период,
	               |	&ВидДвиженияРасход,
	               |	ПоставщикиПоДокументамРасход.Контрагент,
	               |	ПоставщикиПоДокументамРасход.ДоговорВзаиморасчетов,
	               |	ПоставщикиПоДокументамРасход.Сделка,
	               |	&РегламентированныйУчет,
	               |	ПоставщикиПоДокументамРасход.УменьшениеДолга,
	               |	ПоставщикиПоДокументамРасход.УменьшениеДолга,
	               |	&ХозОперация,
	               |	&ВидОперацииПКЗ
	               |ИЗ
	               |	ВтТаблицаСостав КАК ПоставщикиПоДокументамРасход
	               |ГДЕ
	               |	ПоставщикиПоДокументамРасход.УменьшениеДолга > 0
	               |	И ПоставщикиПоДокументамРасход.ТипДоговора = &ТипДоговораПокупка";

	
	РезультатМассив = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", РезультатМассив[0].Выгрузить());
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателямиПоДокументам",  РезультатМассив[1].Выгрузить());
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", РезультатМассив[2].Выгрузить());
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщикамиПоДокументам",  РезультатМассив[3].Выгрузить());

	
КонецПроцедуры

//Взаимозачет
Процедура ПодготовитьТаблицыВзаимозачета(Запрос, ДополнительныеСвойства) Экспорт 
		
	//Уменьшение задолженности дебитора
	ДополнительныеСвойства.Вставить("Дебитор", Истина);
	ПодготовитьТаблицуЗакрытияСделокСПоставщиками(Запрос, ДополнительныеСвойства);
	ПодготовитьТаблицуЗакрытияСделокСПокупателями(Запрос, ДополнительныеСвойства);
	
	Дт_РасчетыСПоставщиками = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщикамиПоДокументам;
	Дт_РасчетыСПокупателями = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателямиПоДокументам;
	
	//Уменьшение задолженности перед кредитором
	ДополнительныеСвойства.Вставить("Дебитор", Ложь);
	ПодготовитьТаблицуЗакрытияСделокСПоставщиками(Запрос, ДополнительныеСвойства);
	ПодготовитьТаблицуЗакрытияСделокСПокупателями(Запрос, ДополнительныеСвойства);
	
	Кт_РасчетыСПоставщиками = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщикамиПоДокументам;
	Кт_РасчетыСПокупателями = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателямиПоДокументам;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Кт_РасчетыСПоставщиками, Дт_РасчетыСПоставщиками);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Кт_РасчетыСПокупателями, Дт_РасчетыСПокупателями);
	
	ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщикамиПоДокументам = Дт_РасчетыСПоставщиками;
	ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателямиПоДокументам = Дт_РасчетыСПокупателями;
	
	ПодготовитьТаблицуРасчетыСПоставщиками(Запрос, ДополнительныеСвойства);
	ПодготовитьТаблицуРасчетыСПокупателями(Запрос, ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти


#Область ОстаткиПартийОрганизаций


//Регистр накопления "Партии товаров организации"
Процедура ПодготовитьТаблицуСписанияПартийТоваровОрганизации(Запрос, ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.ДляПроведения.ПроводитьПоОстаткамОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	Период         = ДополнительныеСвойства.ДляПроведения.Дата;
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	
	ТипЗнчДокумента   = ТипЗнч(ДокументСсылка);	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций КАК АналитикаУчета
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций";
	
	
	
	РезультЗапроса = Запрос.Выполнить();
	
	//Установим блокировку
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиОрганизации");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитикаУчета","АналитикаУчета");
	Блокировка.Заблокировать();	
	
	ДатаДокументаСдвинутаВперед = Ложь;
	Если ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед", ДатаДокументаСдвинутаВперед) И ДатаДокументаСдвинутаВперед = Истина Тогда	
		Набор = РегистрыНакопления.ОстаткиОрганизации.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ДокументСсылка); 
		Набор.Записать();
	КонецЕсли;
	
	ТаблицаДвижения = Новый ТаблицаЗначений;
	ТаблицаДвижения.Колонки.Добавить("Период");
	ТаблицаДвижения.Колонки.Добавить("ВидДвижения");
	ТаблицаДвижения.Колонки.Добавить("АналитикаУчета",Новый ОписаниеТипов("СправочникСсылка.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций"));
	ТаблицаДвижения.Колонки.Добавить("СтатусПартии");
	ТаблицаДвижения.Колонки.Добавить("Партия");

	ТаблицаДвижения.Колонки.Добавить("Количество");
	ТаблицаДвижения.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаДвижения.Колонки.Добавить("ХозОперация");
	ТаблицаДвижения.Колонки.Добавить("СтавкаНДС");
	ТаблицаДвижения.Колонки.Добавить("Возврат",Новый ОписаниеТипов("Булево"));
	
 	ТаблицаПотребности = Новый ТаблицаЗначений;
	ТаблицаПотребности.Колонки.Добавить("Период");
	ТаблицаПотребности.Колонки.Добавить("АналитикаУчета",Новый ОписаниеТипов("СправочникСсылка.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций"));
	ТаблицаПотребности.Колонки.Добавить("Количество");
	
	Кс = 1;
	ВидДвижения = ВидДвиженияНакопления.Расход;
	Если ТипЗнчДокумента  = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		ТекстЗапроса = ТекстЗапросСписанияПартийОрганизацийВозвратПоставщику();
		Кс = -1;	
		ВидДвижения = ВидДвиженияНакопления.Приход;

	Иначе		
		ТекстЗапроса = ТекстЗапросаСписанияПартийОрганизаций();
	КонецЕсли;
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	
	СформироватьДвиженияПартийОрганизации(ДополнительныеСвойства,РезультатЗапроса,ТаблицаДвижения,ТаблицаПотребности,ВидДвижения,Кс);
	
	Если ТипЗнчДокумента  = Тип("ДокументСсылка.ТК_ЗакрытиеСменыЗКС") Тогда
		СформироватьДвиженияПартийОрганизацийВозврат(ДополнительныеСвойства,Запрос,ТаблицаДвижения,"ВозвратЗКС");
	ИначеЕсли ТипЗнчДокумента  = Тип("ДокументСсылка.ТК_Приложение2КНалоговойНакладной") Тогда
		СформироватьДвиженияПартийОрганизацийВозврат(ДополнительныеСвойства,Запрос,ТаблицаДвижения,"ВозвратПриложение2");
	КонецЕсли;
	
	ТаблицаДвижения.ЗаполнитьЗначения(Период,"Период");	
	ТаблицаПотребности.ЗаполнитьЗначения(Период,"Период");	
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваровОрганизации",ТаблицаДвижения);	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПотребностиТоваровОрганизации",ТаблицаПотребности);	
	
КонецПроцедуры

Функция ТекстЗапросаСписанияПартийОрганизаций()

	ТекстЗапроса ="ВЫБРАТЬ
	              |	ВложенныйЗапрос.АналитикаУчета КАК АналитикаУчета,
	              |	ВложенныйЗапрос.Количество КАК Количество,
	              |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС
	              |ПОМЕСТИТЬ вт_Товары
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций КАК АналитикаУчета,
	              |		СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	              |		МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС
	              |	ИЗ
	              |		ВтТаблицаТовары КАК ВтТаблицаТовары
	              |	
	              |	СГРУППИРОВАТЬ ПО
	              |		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций) КАК ВложенныйЗапрос
	              |ГДЕ
	              |	ВложенныйЗапрос.Количество > 0
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ОстаткиОрганизацииОстатки.АналитикаУчета КАК АналитикаУчета,
	              |	ОстаткиОрганизацииОстатки.Партия КАК Партия,
	              |	ОстаткиОрганизацииОстатки.СтатусПартии КАК СтатусПартии,
	              |	ОстаткиОрганизацииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	              |	ОстаткиОрганизацииОстатки.СуммаОстаток КАК СуммаОстаток,
	              |	ОстаткиОрганизацииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	              |	ВЫБОР
	              |		КОГДА ОстаткиОрганизацииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	              |			ТОГДА 1
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК ПорядокСтатуса,
	              |	ВЫБОР
	              |		КОГДА ОстаткиОрганизацииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ОстаткиОрганизацииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	              |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	              |	КОНЕЦ КАК МоментВремени
	              |ПОМЕСТИТЬ ВТ_ОстаткиПартий
	              |ИЗ
	              |	РегистрНакопления.ОстаткиОрганизации.Остатки(
	              |			&МоментВремени,
	              |			АналитикаУчета В
	              |				(ВЫБРАТЬ
	              |					вт_Товары.АналитикаУчета КАК АналитикаУчета
	              |				ИЗ
	              |					вт_Товары КАК вт_Товары)) КАК ОстаткиОрганизацииОстатки
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	вт_Товары.АналитикаУчета КАК АналитикаУчета,
	              |	вт_Товары.Количество КАК Количество,
	              |	ВТ_ОстаткиПартий.СтатусПартии КАК СтатусПартии,
	              |	ВТ_ОстаткиПартий.Партия КАК Партия,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	              |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	              |	ВТ_ОстаткиПартий.ПорядокСтатуса КАК ПорядокСтатуса,
	              |	вт_Товары.СтавкаНДС КАК СтавкаНДС
	              |ИЗ
	              |	вт_Товары КАК вт_Товары
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПартий КАК ВТ_ОстаткиПартий
	              |		ПО вт_Товары.АналитикаУчета = ВТ_ОстаткиПартий.АналитикаУчета
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ПорядокСтатуса УБЫВ,
	              |	ВТ_ОстаткиПартий.МоментВремени
	              |ИТОГИ
	              |	МАКСИМУМ(Количество),
	              |	СУММА(КоличествоОстаток),
	              |	СУММА(СуммаОстаток),
	              |	СУММА(СуммаНДСОстаток),
	              |	МАКСИМУМ(СтавкаНДС)
	              |ПО
	              |	АналитикаУчета";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросСписанияПартийОрганизацийВозвратПоставщику()
	
	 ТекстЗапроса ="ВЫБРАТЬ
	               |	ВложенныйЗапрос.АналитикаУчета КАК АналитикаУчета,
	               |	ВложенныйЗапрос.Количество КАК Количество,
	               |	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	               |	ВложенныйЗапрос.Партия КАК Партия
	               |ПОМЕСТИТЬ вт_ТоварыПартия
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций КАК АналитикаУчета,
	               |		ВтТаблицаТовары.Партия КАК Партия,
	               |		СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	               |		МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС
	               |	ИЗ
	               |		ВтТаблицаТовары КАК ВтТаблицаТовары
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций,
	               |		ВтТаблицаТовары.Партия) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.Количество > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_ТоварыПартия.АналитикаУчета КАК АналитикаУчета,
	               |	СУММА(вт_ТоварыПартия.Количество) КАК Количество,
	               |	МАКСИМУМ(вт_ТоварыПартия.СтавкаНДС) КАК СтавкаНДС
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	вт_ТоварыПартия КАК вт_ТоварыПартия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт_ТоварыПартия.АналитикаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиОрганизацииОстатки.АналитикаУчета КАК АналитикаУчета,
	               |	ОстаткиОрганизацииОстатки.Партия КАК Партия,
	               |	ОстаткиОрганизацииОстатки.СтатусПартии КАК СтатусПартии,
	               |	ОстаткиОрганизацииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ОстаткиОрганизацииОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ОстаткиОрганизацииОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	               |	ВЫБОР
	               |		КОГДА ОстаткиОрганизацииОстатки.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПорядокСтатуса,
	               |	ВЫБОР
	               |		КОГДА ОстаткиОрганизацииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	               |			ТОГДА ВЫРАЗИТЬ(ОстаткиОрганизацииОстатки.Партия КАК Документ.ПоступлениеТоваров).МоментВремени
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МоментВремени
	               |ПОМЕСТИТЬ ВТ_ОстаткиПартий
	               |ИЗ
	               |	РегистрНакопления.ОстаткиОрганизации.Остатки(
	               |			&МоментВремени,
	               |			АналитикаУчета В
	               |				(ВЫБРАТЬ
	               |					вт_Товары.АналитикаУчета КАК АналитикаУчета
	               |				ИЗ
	               |					вт_Товары КАК вт_Товары)) КАК ОстаткиОрганизацииОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Товары.АналитикаУчета КАК АналитикаУчета,
	               |	вт_Товары.Количество КАК Количество,
	               |	ВТ_ОстаткиПартий.СтатусПартии КАК СтатусПартии,
	               |	ВТ_ОстаткиПартий.Партия КАК Партия,
	               |	ЕСТЬNULL(ВТ_ОстаткиПартий.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ВТ_ОстаткиПартий.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	               |	вт_Товары.СтавкаНДС КАК СтавкаНДС,
	               |	ВЫБОР
	               |		КОГДА НЕ вт_ТоварыПартия.Партия ЕСТЬ NULL
	               |			ТОГДА 1
	               |		ИНАЧЕ ВТ_ОстаткиПартий.ПорядокСтатуса
	               |	КОНЕЦ КАК ПорядокСтатуса
	               |ИЗ
	               |	вт_ТоварыПартия КАК вт_Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПартий КАК ВТ_ОстаткиПартий
	               |			ЛЕВОЕ СОЕДИНЕНИЕ вт_ТоварыПартия КАК вт_ТоварыПартия
	               |			ПО ВТ_ОстаткиПартий.АналитикаУчета = вт_ТоварыПартия.АналитикаУчета
	               |				И ВТ_ОстаткиПартий.Партия = вт_ТоварыПартия.Партия
	               |		ПО вт_Товары.АналитикаУчета = ВТ_ОстаткиПартий.АналитикаУчета
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокСтатуса,
	               |	ВТ_ОстаткиПартий.МоментВремени
	               |ИТОГИ
	               |	МАКСИМУМ(Количество),
	               |	СУММА(КоличествоОстаток),
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаНДСОстаток),
	               |	МАКСИМУМ(СтавкаНДС)
	               |ПО
	               |	АналитикаУчета";
	Возврат ТекстЗапроса;

КонецФункции


Процедура СформироватьДвиженияПартийОрганизации(ДополнительныеСвойства,РезультатЗапроса,ТаблицаДвижения,ТаблицаПотребности,ВидДвижения,Кс)
	
	ХозОперация    = ДополнительныеСвойства.ДляПроведения.ХозОперация;

	ВыборкаАналитика =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаАналитика.Следующий() Цикл 
		
		ОсталосьСписать = ВыборкаАналитика.Количество;
		ВыборкаПартия = ВыборкаАналитика.Выбрать();
		
		Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
			
			Если ВыборкаПартия.КоличествоОстаток <= 0 Тогда      
				Продолжить; 
			КонецЕсли;
			
			КоличествоОстаток = ВыборкаПартия.КоличествоОстаток;
			СуммаОстаток      = ВыборкаПартия.СуммаОстаток;
			СуммаНДСОстаток   = ВыборкаПартия.СуммаНДСОстаток;
			
			НоваяЗапись = ТаблицаДвижения.Добавить();
			НоваяЗапись.ВидДвижения    = ВидДвижения;
			НоваяЗапись.АналитикаУчета = ВыборкаАналитика.АналитикаУчета;
			НоваяЗапись.Партия		   = ВыборкаПартия.Партия;
			НоваяЗапись.СтавкаНДС	   = ВыборкаАналитика.СтавкаНДС;
			
			НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
			НоваяЗапись.Количество   = Кс * Мин(ОсталосьСписать, КоличествоОстаток);
			НоваяЗапись.Сумма        = Окр(Кс * ?(КоличествоОстаток<=ОсталосьСписать, СуммаОстаток,СуммаОстаток/КоличествоОстаток*ОсталосьСписать),2);
			НоваяЗапись.СуммаНДС     = Окр(Кс * ?(КоличествоОстаток<=ОсталосьСписать, СуммаНДСОстаток,СуммаНДСОстаток/КоличествоОстаток*ОсталосьСписать),2);
			НоваяЗапись.ХозОперация  = ХозОперация;
			
			ОсталосьСписать   = ОсталосьСписать   - Кс * НоваяЗапись.Количество;
			КоличествоОстаток = КоличествоОстаток - Кс * НоваяЗапись.Количество;
			СуммаОстаток      = СуммаОстаток 	  - Кс * НоваяЗапись.Сумма;
			СуммаНДСОстаток   = СуммаНДСОстаток   - Кс *  НоваяЗапись.СуммаНДС;
			
		КонецЦикла;
		
		Если ОсталосьСписать <> 0 Тогда
			
			НоваяЗапись = ТаблицаПотребности.Добавить();
			НоваяЗапись.АналитикаУчета = ВыборкаАналитика.АналитикаУчета;
			НоваяЗапись.Количество     = ОсталосьСписать;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияПартийОрганизацийВозврат(ДополнительныеСвойства,Запрос,ТаблицаДвижения,ТипВозврата)
	
	
	ТекстЗапроса ="ВЫБРАТЬ
	|	ВложенныйЗапрос.АналитикаУчета КАК АналитикаУчета,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ вт_ТоварыВозврат
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций КАК АналитикаУчета,
	|		СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	|		МАКСИМУМ(ВтТаблицаТовары.СтавкаНДС) КАК СтавкаНДС
	|	ИЗ
	|		ВтТаблицаТовары КАК ВтТаблицаТовары
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВтТаблицаТовары.АналитикаУчетаНоменклатурыОрганизаций) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Количество < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ТоварыВозврат.АналитикаУчета КАК АналитикаУчета,
	|	вт_ТоварыВозврат.Количество КАК Количество,
	|	вт_ТоварыВозврат.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	вт_ТоварыВозврат КАК вт_ТоварыВозврат";
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = 	Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ТипВозврата = "ВозвратЗКС" Тогда
		
		ТекстЗапроса   = "ВЫБРАТЬ
		|	ОстаткиОрганизации.АналитикаУчета КАК АналитикаУчета,
		|	ОстаткиОрганизации.СтатусПартии КАК СтатусПартии,
		|	ОстаткиОрганизации.Партия КАК Партия,
		|	СУММА(ОстаткиОрганизации.Количество) КАК Количество,
		|	СУММА(ОстаткиОрганизации.Сумма) КАК Сумма,
		|	СУММА(ОстаткиОрганизации.СуммаНДС) КАК СуммаНДС,
		|	ОстаткиОрганизации.СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ ВТ_СписанныеПартии
		|ИЗ
		|	РегистрНакопления.ОстаткиОрганизации КАК ОстаткиОрганизации
		|ГДЕ
		|	ОстаткиОрганизации.Период МЕЖДУ &НачалоПериодаВозврат И &КонецПериодаВозврат
		|	И ОстаткиОрганизации.АналитикаУчета В
		|			(ВЫБРАТЬ
		|				вт_ТоварыВозврат.АналитикаУчета КАК АналитикаУчета
		|			ИЗ
		|				вт_ТоварыВозврат КАК вт_ТоварыВозврат)
		|	И ОстаткиОрганизации.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиОрганизации.Партия,
		|	ОстаткиОрганизации.АналитикаУчета,
		|	ОстаткиОрганизации.СтатусПартии,
		|	ОстаткиОрганизации.СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТоварыВозврат.АналитикаУчета КАК АналитикаУчета,
		|	вт_ТоварыВозврат.Количество КАК Количество,
		|	ВТ_СписанныеПартии.СтатусПартии КАК СтатусПартии,
		|	ВТ_СписанныеПартии.Партия КАК Партия,
		|	ЕСТЬNULL(ВТ_СписанныеПартии.Количество, 0) КАК КоличествоПродано,
		|	ВТ_СписанныеПартии.Сумма КАК Сумма,
		|	ВТ_СписанныеПартии.СуммаНДС КАК СуммаНДС,
		|	ВТ_СписанныеПартии.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	вт_ТоварыВозврат КАК вт_ТоварыВозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПартии КАК ВТ_СписанныеПартии
		|		ПО вт_ТоварыВозврат.АналитикаУчета = ВТ_СписанныеПартии.АналитикаУчета
		|ИТОГИ
		|	МАКСИМУМ(Количество)
		|ПО
		|	АналитикаУчета";
		
		Период         = ДополнительныеСвойства.ДляПроведения.Дата;
		
		Запрос.УстановитьПараметр("НачалоПериодаВозврат",Период-60*60*24*7);
		Запрос.УстановитьПараметр("КонецПериодаВозврат",Период);
		ХозОперация = Справочники.ХозОперации.ЗакрытиеСменыВозврат;
	ИначеЕсли ТипВозврата = "ВозвратПриложение2" Тогда
		ТекстЗапроса   = "ВЫБРАТЬ
		|	вт_ТоварыВозврат.АналитикаУчета КАК АналитикаУчета,
		|	вт_ТоварыВозврат.Количество КАК Количество,
		|	ОстаткиОрганизации.СтатусПартии КАК СтатусПартии,
		|	ОстаткиОрганизации.Партия КАК Партия,
		|	ОстаткиОрганизации.Количество КАК КоличествоПродано,
		|	ОстаткиОрганизации.Сумма КАК Сумма,
		|	ОстаткиОрганизации.СуммаНДС КАК СуммаНДС,
		|	ОстаткиОрганизации.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	вт_ТоварыВозврат КАК вт_ТоварыВозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиОрганизации КАК ОстаткиОрганизации
		|		ПО вт_ТоварыВозврат.АналитикаУчета = ОстаткиОрганизации.АналитикаУчета
		|ГДЕ
		|	ОстаткиОрганизации.Регистратор = &НакладнаяКорректировки
		|ИТОГИ
		|	МАКСИМУМ(Количество)
		|ПО
		|	АналитикаУчета";
	   ХозОперация = Справочники.ХозОперации.Приложение2КНалоговойНакладной;
	КонецЕсли;
	
		Запрос.Текст = ТекстЗапроса;
	
		РезультатЗапроса = 	Запрос.Выполнить();
		
		ВыборкаАналитика =  РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаАналитика.Следующий() Цикл 
			
			ОсталосьСписать = -ВыборкаАналитика.Количество;
			ВыборкаПартия = ВыборкаАналитика.Выбрать();
			
			Пока ВыборкаПартия.Следующий() И ОсталосьСписать > 0 Цикл 
				
				
				Если ВыборкаПартия.КоличествоПродано <= 0 Тогда      
					Продолжить; 
				КонецЕсли;
				
				КоличествоДвиж = ВыборкаПартия.КоличествоПродано;
				СуммаДвиж      = ВыборкаПартия.Сумма;
				СуммаНДСДвиж   = ВыборкаПартия.СуммаНДС;
				
				НоваяЗапись = ТаблицаДвижения.Добавить();
				НоваяЗапись.ВидДвижения    = ВидДвиженияНакопления.Приход;
				НоваяЗапись.АналитикаУчета = ВыборкаАналитика.АналитикаУчета;
				НоваяЗапись.Партия		   = ВыборкаПартия.Партия;
				НоваяЗапись.СтавкаНДС	   = ВыборкаПартия.СтавкаНДС;
				
				НоваяЗапись.СтатусПартии = ВыборкаПартия.СтатусПартии;
				НоваяЗапись.Количество   = Мин(ОсталосьСписать, КоличествоДвиж);
				НоваяЗапись.Сумма        = Окр(?(КоличествоДвиж<=ОсталосьСписать, СуммаДвиж,СуммаДвиж/КоличествоДвиж*ОсталосьСписать),2);
				НоваяЗапись.СуммаНДС     = Окр(?(КоличествоДвиж<=ОсталосьСписать, СуммаНДСДвиж,СуммаНДСДвиж/КоличествоДвиж*ОсталосьСписать),2);
				НоваяЗапись.ХозОперация  = ХозОперация;
				
				ОсталосьСписать   = ОсталосьСписать - НоваяЗапись.Количество;
				КоличествоДвиж 	  = КоличествоДвиж - НоваяЗапись.Количество;
				СуммаДвиж         = СуммаДвиж - НоваяЗапись.Сумма;
				СуммаНДСДвиж      = СуммаНДСДвиж - НоваяЗапись.СуммаНДС;
				
			КонецЦикла;
			
		КонецЦикла;	
		
	
КонецПроцедуры



#КонецОбласти
