
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем





#КонецОбласти


Процедура ОбновитьОчередь(ДокументСсылка,СтруктураЗаписи)Экспорт
	
	Набор = РегистрыСведений.ТК_ОчередьНаСборкуРезервов.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(ДокументСсылка);
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		ЗаписьНабора = Набор[0];
		ЗаполнитьЗначенияСвойств(ЗаписьНабора,СтруктураЗаписи);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьКоличествоРезервовНаСборку(ТорговаяПлощадка,СкладКомпании)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(1) КАК Количество
	               |	ИЗ
	               |		РегистрСведений.ТК_ОчередьНаСборкуРезервов КАК ТК_ОчередьНаСборкуРезервов
	               |	ГДЕ
	               |		ТК_ОчередьНаСборкуРезервов.Статус = &Статус
	               |		И ВЫРАЗИТЬ(ТК_ОчередьНаСборкуРезервов.Документ КАК Документ.РезервированиеЗаказовПокупателя).ТорговаяПлощадка = &ТорговаяПлощадка
	               |		И ВЫРАЗИТЬ(ТК_ОчередьНаСборкуРезервов.Документ КАК Документ.РезервированиеЗаказовПокупателя).СкладКомпании = &СкладКомпании) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадка);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСборкиРезервов.ГотовКСборке);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;

	
КонецФункции



#КонецОбласти



#КонецЕсли


