
&НаСервере
Процедура ВыполнитьОбменНаСервере(ТипОбмена)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если НЕ ПустаяСтрока(ТипОбъекта) Тогда
		МассивДок = Новый Массив;
		МассивДок.Добавить(ТипОбъекта);
		
	Иначе
		МассивДок = Неопределено;
	КонецЕсли;
	
	ОбработкаОбъект.ЗагрузитьДанные(ТипОбмена,МассивДок);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере("ЗагрузкаДокументы_Global_Center");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменСправочники(Команда)
	ВыполнитьОбменНаСервере("ЗагрузкаСправочники_Global_Center");
КонецПроцедуры
