#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//
// Возвращаемое значание:
//	Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ВалютаДенежныхСредств");
	Результат.Добавить("Владелец");
	Результат.Добавить("СчетУчета");

	Возврат Результат;
	
КонецФункции


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// Функция определяет организацию и валюту выбранного банковского счета.
//
// Параметры:
//  БанковскийСчет - СправочникСсылка.БанковскиеСчетаОрганизаций - Ссылка на банковский счет
//
// Возвращаемое значение:
//	Структура - Организация и реквизиты банковского счета организации
//
Функция ПолучитьРеквизитыБанковскогоСчетаОрганизации(БанковскийСчет) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БанковскиеСчетаОрганизаций.Владелец КАК Организация,
	                      |	БанковскиеСчетаОрганизаций.ВидСчета КАК ВидСчета,
	                      |	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	                      |	БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	                      |	БанковскиеСчетаОрганизаций.Банк КАК Банк,
	                      |	БанковскиеСчетаОрганизаций.КодБанка КАК КодБанка,
	                      |	БанковскиеСчетаОрганизаций.Закрыт КАК Закрыт
	                      |ИЗ
	                      |	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	                      |ГДЕ
	                      |	БанковскиеСчетаОрганизаций.Ссылка = &БанковскийСчет");
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация		= Выборка.Организация;
		ВидСчетаОрг		= Выборка.ВидСчета;
		Валюта 			= Выборка.Валюта;		
		НомерСчета 		= Выборка.НомерСчета;
		Банк 			= Выборка.Банк;
		КодБанка		= Выборка.КодБанка;
		Закрыт			= Выборка.Закрыт;
	Иначе
		Организация		= Справочники.Организации.ПустаяСсылка();
		ВидСчетаОрг		= Неопределено;
		Валюта 			= Справочники.Валюты.ПустаяСсылка();
		НомерСчета 		= "";
		Банк 			= Справочники.КлассификаторБанков.ПустаяСсылка();
		КодБанка		= "";
		Закрыт			= Ложь;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Организация, ВидСчета, Валюта, НомерСчета, Банк, КодБанка, Закрыт",
		Организация,
		ВидСчетаОрг,
		Валюта,
		НомерСчета,
		Банк,
		КодБанка,
		Закрыт);
	
	Возврат СтруктураРеквизитов;

КонецФункции



#КонецОбласти

#КонецОбласти

#КонецЕсли
#КонецЕсли
