
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(ID) Тогда 
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ПортативныеУстройстваВвода.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ПортативныеУстройстваВвода КАК ПортативныеУстройстваВвода
		               |ГДЕ
		               |	ПортативныеУстройстваВвода.ID = &ID";		
		
		Если Не ЭтоНовый() Тогда 
			ТекстЗапроса = ТекстЗапроса + " И ПортативныеУстройстваВвода.Ссылка <> &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;		
		Запрос.УстановитьПараметр("ID", ID);
		
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда 
			Ошибки = "";
			Отказ = Истина;
			
			Выборка = Рез.Выбрать();
			Пока Выборка.Следующий() Цикл 
				ТекстОшибки = НСтр("ru = 'Данный ID уже используется в %Ссылка%'; uk = 'Вказаний ID вже використовується у %Ссылка%'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Ссылка%", Строка(Выборка.Ссылка));
				
				Ошибки = ?(ПустаяСтрока(Ошибки), ТекстОшибки, Ошибки + Символы.ПС + ТекстОшибки);
			КонецЦикла;
			
			Если Не ПустаяСтрока(Ошибки) Тогда 
	 			Сообщение = Новый СообщениеПользователю();
    			Сообщение.Текст = Ошибки;	    		
    			Сообщение.УстановитьДанные(ЭтотОбъект);
        		Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
