
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	 РегистрацияНоменклатурыНаВыгрузку(ПараметрКоманды);
	
	 
	ПоказатьОповещениеПользователя("Регистрация изменений:",,"Зарегистрировано """+Строка(ПараметрКоманды)+""" на ""OS""",);

	 
	 
КонецПроцедуры

&НаСервере
Процедура РегистрацияНоменклатурыНаВыгрузку(НоменклатураСсылка)
	НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
	ОбменФронтСобытия.Обмен_OS_ПриЗаписиОбъектаСправочникаПриЗаписи(НоменклатураОбъект,Ложь);
	ОбменФронтСобытия.ЗарегистрироватьЦеныТовара(НоменклатураСсылка,Ложь);

КонецПроцедуры

