&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Период", Период);
	ТолькоРасхождения = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	dbo_STAT_DATESALES.OPDATE КАК OPDATE,
	//	|	dbo_STAT_DATESALES.ZREPFPSN КАК ZREPFPSN,
	//	|	dbo_STAT_DATESALES.SAREAGUID КАК SAREAGUID,
	//	|	dbo_STAT_DATESALES.SAREAID КАК SAREAID,
	//	|	dbo_STAT_DATESALES.SYSTEMID КАК SYSTEMID,
	//	|	dbo_STAT_DATESALES.WORKDAYID КАК WORKDAYID,
	//	|	dbo_STAT_DATESALES.ZREPNUM КАК ZREPNUM,
	//	|	dbo_STAT_DATESALES.SALESSUM КАК SALESSUM,
	//	|	dbo_STAT_DATESALES.REFUNDSUM КАК REFUNDSUM,
	//	|	dbo_STAT_DATESALES.isDOWNLOADED КАК isDOWNLOADED
	//	|ИЗ
	//	|	ВнешнийИсточникДанных.zFOC.Таблица.dbo_STAT_DATESALES КАК dbo_STAT_DATESALES
	//	|ГДЕ
	//	|	dbo_STAT_DATESALES.OPDATE МЕЖДУ &OPDATE1 И &OPDATE2";
	//
	//Запрос.УстановитьПараметр("OPDATE1", Период.ДатаНачала);
	//Запрос.УстановитьПараметр("OPDATE2", Период.ДатаОкончания);
	//
	//тзПродажиПозет = Запрос.Выполнить().Выгрузить();
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ЗакрытиеСменыЗКС.Дата КАК ДатаЗет,
		|	ТК_КассоваяСменаЗКС.Ссылка КАК СсылкаЗет,
		|	ТК_КассоваяСменаЗКС.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ТК_КассоваяСменаЗКС.КассаККМ КАК КассаККМ,
		|	ТК_КассоваяСменаЗКС.НомерСменыККМ КАК НомерСменыККМ,
		|	ТК_КассоваяСменаЗКС.НомерZотчета КАК НомерZотчета,
		|	ТК_КассоваяСменаЗКС.СуммаДокумента - ТК_КассоваяСменаЗКС.СуммаВозврат КАК СуммаЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаДокумента КАК СуммаЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаВозврат КАК СуммаВозвратЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаВозврат КАК СуммаВозвратЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаСкидки КАК СуммаСкидкиЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаСкидки КАК СуммаСкидкиЗКС,
		|	ТК_КассоваяСменаЗКС.СуммаЭкваер КАК СуммаЭкваерЗет,
		|	ТК_ЗакрытиеСменыЗКС.СуммаЭкваер КАК СуммаЭкваерЗКС,
		|	ТК_ЗакрытиеСменыЗКС.Ссылка КАК СсылкаЗКС,
		|	ТК_КассоваяСменаЗКС.Организация КАК Организация
		|ИЗ
		|	Документ.ТК_КассоваяСменаЗКС КАК ТК_КассоваяСменаЗКС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТК_ЗакрытиеСменыЗКС КАК ТК_ЗакрытиеСменыЗКС
		|		ПО ТК_КассоваяСменаЗКС.Ссылка = ТК_ЗакрытиеСменыЗКС.КассоваяСмена
		|			И (ТК_ЗакрытиеСменыЗКС.Проведен)
		|ГДЕ
		|	ТК_КассоваяСменаЗКС.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ТК_ЗакрытиеСменыЗКС.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СсылкаЗет";
	
	Запрос.УстановитьПараметр("Дата1",  Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
		
	ДеревоЗетОтчетов = РеквизитФормыВЗначение("ТаблицаЗетОтчетов");
	СтрокиДерева = ДеревоЗетОтчетов.Строки;
	СтрокиДерева.Очистить();

	
	Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("СсылкаЗет") Цикл
		
		СтрокаЗет =  СтрокиДерева.Добавить();
		СтрокаЗет.ЗетОтчет = ВыборкаДетальныеЗаписи.СсылкаЗет;
		СтрокаЗет.Сумма = ВыборкаДетальныеЗаписи.СуммаЗет;
		СтрокаЗет.СуммаВозврат = ВыборкаДетальныеЗаписи.СуммаВозвратЗет;
		СтрокаЗет.СуммаСкидки = ВыборкаДетальныеЗаписи.СуммаСкидкиЗет;
		СтрокаЗет.СуммаЭкваер = ВыборкаДетальныеЗаписи.СуммаЭкваерЗет;
		СтрокаЗет.КассаККМ = ВыборкаДетальныеЗаписи.КассаККМ;
		СтрокаЗет.ТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
		СтрокаЗет.НомерЗет = ВыборкаДетальныеЗаписи.НомерZотчета;
		СтрокаЗет.Организация = ВыборкаДетальныеЗаписи.Организация;
		
		СуммаПоЗКС = 0;
		СуммаВозвратПоЗКС = 0;
		СуммаЭкваерПоЗКС = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			 СтрокаЗКС = СтрокаЗет.Строки.Добавить();
			 СтрокаЗКС.ЗетОтчет =ВыборкаДетальныеЗаписи.СсылкаЗКС;
			 СтрокаЗКС.Сумма = ВыборкаДетальныеЗаписи.СуммаЗКС;
			 СтрокаЗКС.СуммаВозврат = ВыборкаДетальныеЗаписи.СуммаВозвратЗКС;
			 СтрокаЗКС.СуммаСкидки = ВыборкаДетальныеЗаписи.СуммаСкидкиЗКС;
			 СтрокаЗКС.СуммаЭкваер = ВыборкаДетальныеЗаписи.СуммаЭкваерЗКС;
 
			 СуммаПоЗКС 	   = СуммаПоЗКС + ВыборкаДетальныеЗаписи.СуммаЗКС;
			 СуммаВозвратПоЗКС = СуммаВозвратПоЗКС + ВыборкаДетальныеЗаписи.СуммаВозвратЗКС;
			 СуммаЭкваерПоЗКС  = СуммаЭкваерПоЗКС + ВыборкаДетальныеЗаписи.СуммаЭкваерЗКС;
		КонецЦикла;
		
		Если СтрокаЗет.Сумма <> СуммаПоЗКС ИЛИ  СтрокаЗет.СуммаВозврат <>  СуммаВозвратПоЗКС  ИЛИ  СтрокаЗет.СуммаЭкваер <>  СуммаЭкваерПоЗКС  Тогда
			СтрокаЗет.ЕстьРасхождения = Истина;
		КонецЕсли;
		СтрокаЗет.СуммаТ        = СуммаПоЗКС;
		СтрокаЗет.СуммаВозвратТ = СуммаВозвратПоЗКС;
		СтрокаЗет.СуммаЭкваерТ  = СуммаЭкваерПоЗКС;
		
		
		Если ТолькоРасхождения И НЕ СтрокаЗет.ЕстьРасхождения Тогда
			СтрокиДерева.Удалить(СтрокаЗет);
		КонецЕсли;
		
		
	КонецЦикла;
	
	 ЗначениеВРеквизитФормы(ДеревоЗетОтчетов,"ТаблицаЗетОтчетов");
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

