


Функция ДокументовВпотоке(Последовательность)Экспорт
	
	 Возврат РегистрыСведений.ТК_ПараметрыВосстановленияПоследовательности.ПолучитьКоличествоДокументовВПотоке(Последовательность);
	 
КонецФункции

Функция ОдновременныхПотоков(Последовательность,БизнесВремя)Экспорт
	
	Возврат РегистрыСведений.ТК_ПараметрыВосстановленияПоследовательности.ПолучитьКоличествоОдновременныхПотоков(Последовательность,БизнесВремя);
		
КонецФункции


Функция УчетнаяЗаписьЭлектроннойПочтыКазанчейство(Учетка)Экспорт
	
	Возврат РегистрыСведений.ТК_КазначействоУчетныеЗаписиПочты.УчетнаяЗаписьКазначейства(Учетка);
	
КонецФункции
