
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Действие = Параметры.Действие;
	
	Создать = Действие = "СоздатьГруппу" ИЛИ Действие = "СоздатьБренд" ИЛИ Действие = "СоздатьТовар" ИЛИ Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "СоздатьАвтомат";
	Автомат = Действие = "СоздатьАвтомат" ИЛИ Действие = "ИзменитьАвтомат" ИЛИ Действие = "ПривязатьСклад" ИЛИ Действие = "ОтвязатьСклад" ИЛИ Действие = "ИзменитьВидАвтомата";
	
	Если НЕ Автомат Тогда
		СтруктураГрупп.Загрузить(Параметры.СтруктураГрупп.Выгрузить());
		тзСтруктураГрупп =  Параметры.СтруктураГрупп.Выгрузить();
		тзГруппы = тзСтруктураГрупп.Скопировать(,"Группа");
		тзГруппы.Свернуть("Группа");
		мГруппы = тзГруппы.ВыгрузитьКолонку("Группа");
		мБренды = тзСтруктураГрупп.Скопировать(Новый Структура("Группа",Параметры.ГруппаИмя)).ВыгрузитьКолонку("Бренд");
	КонецЕсли;
	
	Если Действие = "СоздатьГруппу" Тогда
		Элементы.ГруппаИмя.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
	Если Действие = "ИзменитьГруппу" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		Элементы.ГруппаИмя.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
	
	Если Действие = "СоздатьБренд" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		
		Элементы.БрендИмя.РежимВыбораИзСписка = Ложь;
		Элементы.ГруппаИмя.СписокВыбора.ЗагрузитьЗначения(мГруппы);
		ЭтаФорма.ТекущийЭлемент = Элементы.БрендИмя;
	КонецЕсли;
	
	Если Действие = "ИзменитьБренд" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		БрендИмя = Параметры.БрендИмя;
		БрендКод = Параметры.БрендКод;
		Бренд_imageUrl = Параметры.Бренд_imageUrl;
		
		Элементы.БрендИмя.РежимВыбораИзСписка = Ложь;
		Элементы.ГруппаИмя.СписокВыбора.ЗагрузитьЗначения(мГруппы);
		ЭтаФорма.ТекущийЭлемент = Элементы.БрендИмя;
	КонецЕсли;
	
	Если Действие = "СоздатьТовар" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		БрендИмя = Параметры.БрендИмя;
		БрендКод = Параметры.БрендКод;
		Бренд_imageUrl = Параметры.Бренд_imageUrl;
		
		Элементы.ГруппаИмя.СписокВыбора.ЗагрузитьЗначения(мГруппы);
		Элементы.БрендИмя.СписокВыбора.ЗагрузитьЗначения(мБренды);
		ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура;
	КонецЕсли;
	
	Если Действие = "ИзменитьТовар" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		БрендИмя = Параметры.БрендИмя;
		БрендКод = Параметры.БрендКод;
		Бренд_imageUrl = Параметры.Бренд_imageUrl;
		ТоварИмя = Параметры.ТоварИмя;
		ТоварКод = Параметры.ТоварКод;
		Товар_imageUrl = Параметры.imageUrl;
		Номенклатура = Параметры.Номенклатура;
		
		Элементы.ГруппаИмя.СписокВыбора.ЗагрузитьЗначения(мГруппы);
		Элементы.БрендИмя.СписокВыбора.ЗагрузитьЗначения(мБренды);
		ЭтаФорма.ТекущийЭлемент = Элементы.ИзТовара;
	КонецЕсли;
	
	Если Действие = "ПривязатьНоменклатуру" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		БрендИмя = Параметры.БрендИмя;
		БрендКод = Параметры.БрендКод;
		Бренд_imageUrl = Параметры.Бренд_imageUrl;
		ТоварИмя = Параметры.ТоварИмя;
		ТоварКод = Параметры.ТоварКод;
		Товар_imageUrl = Параметры.imageUrl;
		Номенклатура = Параметры.Номенклатура;
		Элементы.ГруппаИмя.РежимВыбораИзСписка = Ложь;
		Элементы.БрендИмя.РежимВыбораИзСписка = Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура;
	КонецЕсли;
	
	Если Действие = "ОтвязатьНоменклатуру" Тогда
		ГруппаИмя = Параметры.ГруппаИмя;
		ГруппаКод = Параметры.ГруппаКод;
		БрендИмя = Параметры.БрендИмя;
		БрендКод = Параметры.БрендКод;
		Бренд_imageUrl = Параметры.Бренд_imageUrl;
		ТоварИмя = Параметры.ТоварИмя;
		ТоварКод = Параметры.ТоварКод;
		Товар_imageUrl = Параметры.imageUrl;
		Номенклатура = Параметры.Номенклатура;
		Элементы.ГруппаИмя.РежимВыбораИзСписка = Ложь;
		Элементы.БрендИмя.РежимВыбораИзСписка = Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.Номенклатура;
	КонецЕсли;
	
	Если Автомат И НЕ Действие = "СоздатьАвтомат" Тогда
		АвтоматАдрес = Параметры.АвтоматАдрес;
		АвтоматКод = Параметры.АвтоматКод;
		КоличествоЯчеек = Параметры.КоличествоЯчеек;
		Склад = Параметры.Склад;
		СкладАвтомата = Параметры.Склад;
	КонецЕсли;
	
	Если Действие = "ИзменитьВидАвтомата" Тогда
		Склад = Параметры.Склад;
		ВидАвтомата = Параметры.Склад.ВидАвтомата;
		ЭтаФорма.ТекущийЭлемент = Элементы.ВидАвтомата;
	КонецЕсли;
	
	Элементы.ГруппаАвтомата.Видимость		= Автомат;
	Элементы.ГруппаТовара.Видимость			= НЕ Автомат;
	Элементы.ВидАвтомата.Видимость			= Действие = "ИзменитьВидАвтомата";
	Элементы.ГруппаБренды.Видимость			= Действие = "СоздатьТовар" ИЛИ Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру" ИЛИ Действие = "ИзменитьТовар" ИЛИ Действие = "ИзменитьБренд" ИЛИ Действие = "СоздатьБренд";
	Элементы.ГруппаТовары.Видимость			= Действие = "СоздатьТовар" ИЛИ Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру" ИЛИ Действие = "ИзменитьТовар";
	Элементы.ГруппаНоменклатура.Видимость	= Действие = "СоздатьТовар" ИЛИ Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру" ИЛИ Действие = "ИзменитьТовар";
	Элементы.Бренд_imageUrl.Видимость		= Действие = "СоздатьБренд" ИЛИ Действие = "ИзменитьБренд";
	Элементы.Товар_imageUrl.Видимость		= Действие = "СоздатьТовар" ИЛИ Действие = "ИзменитьТовар";;
	Элементы.ФотоБренда.Видимость			= Действие = "СоздатьБренд" ИЛИ Действие = "ИзменитьБренд";
	Элементы.ФотоТовара.Видимость			= Действие = "СоздатьТовар" ИЛИ Действие = "ИзменитьТовар";;
	
	Элементы.ГруппаГруппа.ТолькоПросмотр	= Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру";
	Элементы.ГруппаБренды.ТолькоПросмотр	= Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру";
	Элементы.ГруппаТовары.ТолькоПросмотр	= Действие = "ПривязатьНоменклатуру" ИЛИ Действие = "ОтвязатьНоменклатуру";
	
	Элементы.ГруппаТовара.Картинка			= ?(Создать,БиблиотекаКартинок.СоздатьЭлементСписка,БиблиотекаКартинок.Изменить);
	Элементы.ГруппаАвтомата.Картинка		= ?(Создать,БиблиотекаКартинок.СоздатьЭлементСписка,БиблиотекаКартинок.Изменить);
	
	Элементы.ГруппаАвтомат.ТолькоПросмотр	= Действие = "ПривязатьСклад" ИЛИ Действие = "ОтвязатьСклад";
	Элементы.КоличествоЯчеек.ТолькоПросмотр	= Действие = "ПривязатьСклад" ИЛИ Действие = "ОтвязатьСклад";
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ?(Автомат,Элементы.ГруппаАвтомата,Элементы.ГруппаТовара);
	Заголовок = Действие;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ОК = Истина;
	Если Действие = "СоздатьГруппу" Тогда
		СоздатьГруппу(ОК);	
	ИначеЕсли Действие = "СоздатьБренд" Тогда
		СоздатьБренд(ОК);
	ИначеЕсли Действие = "СоздатьТовар" Тогда
		СоздатьТовар(ОК);
	ИначеЕсли Действие = "ПривязатьНоменклатуру" Тогда
		ПривязатьНоменклатуру(ОК);	
	ИначеЕсли Действие = "ОтвязатьНоменклатуру" Тогда
		ОтвязатьНоменклатуру(ОК);
	ИначеЕсли Действие = "СоздатьАвтомат" Тогда
		СоздатьАвтомат(ОК);
	ИначеЕсли Действие = "ПривязатьСклад" Тогда
		ПривязатьСклад(ОК);
	ИначеЕсли Действие = "ОтвязатьСклад" Тогда
		ОтвязатьСклад(ОК);
	ИначеЕсли Действие = "ИзменитьГруппу" Тогда
		ИзменитьГруппу(ОК);
	ИначеЕсли Действие = "ИзменитьБренд" Тогда
		ИзменитьБренд(ОК);
	ИначеЕсли Действие = "ИзменитьТовар" Тогда
		ИзменитьТовар(ОК);
	ИначеЕсли Действие = "ИзменитьАвтомат" Тогда
		ИзменитьАвтомат(ОК);
	ИначеЕсли Действие = "ИзменитьВидАвтомата" Тогда
		ИзменитьВидАвтомата(ОК);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура БрендИмяПриИзмененииНаСервере()
	тзСтруктураГрупп = СтруктураГрупп.Выгрузить();
	строка = тзСтруктураГрупп.Найти(БрендИмя,"Бренд");
	Если строка <> Неопределено Тогда
		БрендКод = строка.Бренд_id;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БрендИмяПриИзменении(Элемент)
	БрендИмяПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ГруппаИмяПриИзмененииНаСервере()
	тзСтруктураГрупп = СтруктураГрупп.Выгрузить();
	строка = тзСтруктураГрупп.Найти(ГруппаИмя,"Группа");
	Если строка <> Неопределено Тогда
		ГруппаКод = строка.Группа_id;
	КонецЕсли;
	Если Действие = "СоздатьТовар" ИЛИ Действие = "ИзменитьТовар" Тогда
		мБренды = тзСтруктураГрупп.Скопировать(Новый Структура("Группа",ГруппаИмя)).ВыгрузитьКолонку("Бренд");
		Элементы.БрендИмя.СписокВыбора.ЗагрузитьЗначения(мБренды);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГруппаИмяПриИзменении(Элемент)
	ГруппаИмяПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПривязатьНоменклатуру(ОК)
	ОбъектНоменклатура = Номенклатура.ПолучитьОбъект();
	ОбъектНоменклатура.ИД_Товара = ТоварКод;
	ЗаписатьОбъект(ОбъектНоменклатура,ОК);
КонецПроцедуры

&НаСервере
Процедура ОтвязатьНоменклатуру(ОК)
	ОбъектНоменклатура = Номенклатура.ПолучитьОбъект();
	ОбъектНоменклатура.ИД_Товара = 0;
	ЗаписатьОбъект(ОбъектНоменклатура,ОК);
КонецПроцедуры

&НаСервере
Процедура ПривязатьСклад(ОК)
	ОбъектСклад = Склад.ПолучитьОбъект();
	ОбъектСклад.ИД_Автомата = АвтоматКод;
	ЗаписатьОбъект(ОбъектСклад,ОК);
	
	Если ЗначениеЗаполнено(СкладАвтомата) И Склад <> СкладАвтомата Тогда
		ОбъектСклад = СкладАвтомата.ПолучитьОбъект();
		ОбъектСклад.ИД_Автомата = 0;
		ЗаписатьОбъект(ОбъектСклад,ОК);
	КонецЕсли;
	СкладАвтомата = Склад;
КонецПроцедуры

&НаСервере
Процедура ОтвязатьСклад(ОК)
	ОбъектСклад = Склад.ПолучитьОбъект();
	ОбъектСклад.ИД_Автомата = 0;
	ЗаписатьОбъект(ОбъектСклад,ОК);
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппу(ОК)
	Данные = Новый Структура;
	Данные.Вставить("parentId",857);
	Данные.Вставить("name",ГруппаИмя);
	Данные.Вставить("imageUrl","");
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.СоздатьЭлемент_СоздатьЭлемент_POST("category",Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"POST");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьБренд(ОК)
	Данные = Новый Структура;
	Данные.Вставить("parentId",ГруппаКод);
	Данные.Вставить("name",БрендИмя);
	Данные.Вставить("imageUrl",Бренд_imageUrl);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.СоздатьЭлемент_POST("category",Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"POST");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьТовар(ОК)
	Данные = Новый Структура;
	Данные.Вставить("parentId",БрендКод);
	Данные.Вставить("article",Число(Номенклатура.Артикул));
	Данные.Вставить("uktzed",СтрЗаменить(Номенклатура.КодУКТВЭД.Код," ",""));	// + ?(Номенклатура.СтранаПроисхождения.Код = "804","","Х"));
	Данные.Вставить("nameOnScreen",СокрЛП(?(ИзТовара,ТоварИмя,Обработки.ВендингАвтоматы.СократитьНаименование(Номенклатура.Наименование2))));
	Данные.Вставить("nameOnReceipt",СокрЛП(Номенклатура.Наименование2));
	Данные.Вставить("taxId",Номенклатура.СтавкаНДС.Порядок);
	Данные.Вставить("imageUrl",Товар_imageUrl);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.СоздатьЭлемент_POST("product",Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"POST");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьАвтомат(ОК)
	Данные = Новый Структура;
	Данные.Вставить("address",АвтоматАдрес);
	Данные.Вставить("cellCount",260);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.СоздатьЭлемент_POST("automat",Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"POST");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьГруппу(ОК)
	Данные = Новый Структура;
	Данные.Вставить("id",ГруппаКод);
	Данные.Вставить("parentId",857);
	Данные.Вставить("name",ГруппаИмя);
	Данные.Вставить("imageUrl","");
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.ИзменитьЭлемент_PUT("category/"+ГруппаКод,Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"PUT");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьБренд(ОК)
	Данные = Новый Структура;
	Данные.Вставить("id",БрендКод);
	Данные.Вставить("parentId",ГруппаКод);
	Данные.Вставить("name",БрендИмя);
	Данные.Вставить("imageUrl",Бренд_imageUrl);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.ИзменитьЭлемент_PUT("category/"+БрендКод,Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"PUT");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьТовар(ОК)
	Данные = Новый Структура;
	Данные.Вставить("id",ТоварКод);
	Данные.Вставить("parentId",БрендКод);
	Данные.Вставить("article",?(ЗначениеЗаполнено(Номенклатура.Артикул),Число(Номенклатура.Артикул),0));
	Данные.Вставить("uktzed",СтрЗаменить(Номенклатура.КодУКТВЭД.Код," ",""));	// + ?(Номенклатура.СтранаПроисхождения.Код = "804","","Х"));
	Данные.Вставить("nameOnScreen",СокрЛП(?(ИзТовара,ТоварИмя,Обработки.ВендингАвтоматы.СократитьНаименование(Номенклатура.Наименование2))));
	Данные.Вставить("nameOnReceipt",СокрЛП(Номенклатура.Наименование2));
	Данные.Вставить("taxId",Номенклатура.СтавкаНДС.Порядок);
	Данные.Вставить("imageUrl",Товар_imageUrl);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.ИзменитьЭлемент_PUT("product/"+Формат(ТоварКод,"ЧГ=0"),Данные);
	Если Ответ.КодСостояния > 399 Тогда
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"PUT");
		Возврат;
	КонецЕсли;
	
	ТоварИмя = Ответ.Данные.nameOnScreen;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьАвтомат(ОК)
	Данные = Новый Структура;
	Данные.Вставить("id",АвтоматКод);
	Данные.Вставить("address",АвтоматАдрес);
	Данные.Вставить("cellCount",260);
	Данные.Вставить("active",Истина);
	
	Ответ = Обработки.ВендингАвтоматы.ИзменитьЭлемент_PUT("automat/"+АвтоматКод,Данные);
	Если Ответ.КодСостояния > 399 Тогда
		ОК = Ложь;
		Обработки.ВендингАвтоматы.Ошибка404(Ответ,"PUT");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидАвтомата(ОК)
	ОбъектСклад = Склад.ПолучитьОбъект();
	ОбъектСклад.ВидАвтомата = ВидАвтомата;
	ЗаписатьОбъект(ОбъектСклад,ОК);
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	ТоварИмя = Обработки.ВендингАвтоматы.СократитьНаименование(Номенклатура.Наименование2);
	СсылкаНаФото(); 
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СсылкаНаФото()
	Каталог = "https://cab.vendiboard.com/assets/images/16/images/";
	Бренд = СтрЗаменить(БрендИмя," ","_");
	Артикул = СокрЛП(Номенклатура.Артикул);
	Товар_imageUrl = СтрШаблон("%1%2/%3.jpg",Каталог,Бренд,Артикул);
КонецПроцедуры

&НаКлиенте
Процедура ИзТовараПриИзменении(Элемент)
	Элементы.ТоварИмя.ТолькоПросмотр = НЕ ИзТовара;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОбъект(ОбъектДляЗаписи,ОК)
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ОбъектДляЗаписи.Записать();
	Исключение
		ОК = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

