#Область ПроцедурыФормированияДвиженийПоДенежнымСредствам

// Процедура формирования движений по регистру "Расчеты с поставщиками".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщиками;
	
	Если Отказ ИЛИ ТаблицаРасчеты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.РасчетыСПоставщиками;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаРасчеты);
	
КонецПроцедуры

// Процедура формирования движений по регистру "Расчеты с поставщиками по документам".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьРасчетыСПоставщикамиПоДокументам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПоставщикамиПоДокументам;
	
	Если Отказ ИЛИ ТаблицаРасчеты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.РасчетыСПоставщикамиПоДокументам;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаРасчеты);
	
КонецПроцедуры

// Процедура формирования движений по регистру "Расчеты с покупателями".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями;
	
	Если Отказ ИЛИ ТаблицаРасчеты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.РасчетыСПокупателями;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаРасчеты);
	
КонецПроцедуры

// Процедура формирования движений по регистру "Расчеты с покупателями по документам".
//
// Параметры:
//	ДокументОбъект - Текущий документ
//	Отказ - Булево - Признак отказа от проведения документа
//
Процедура ОтразитьРасчетыСПокупателямиПоДокументам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателямиПоДокументам;
	
	Если Отказ ИЛИ ТаблицаРасчеты.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.РасчетыСПокупателямиПоДокументам;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаРасчеты);
	
КонецПроцедуры


#КонецОбласти


#Область УправлениеИнтерфейснымиЭлементами

// Функция - возвращает текстовую строку задолженности по договору
//
// Параметры:
//  Дата				  - Дата - дата получения остатка по структурной единице
//  ДоговорВзаиморасчетов - ДоговорВзаиморасчетов - договор взаиморасчетов
//
Функция ПолучитьТекстЗадолженностиПоДоговору(Дата, ДоговорВзаиморасчетов, Валюта) Экспорт 
	
	Если ЗначениеЗаполнено(Дата) И ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда 
		Остаток = ПолучитьЗадолженностьПоДоговору(ДоговорВзаиморасчетов, Дата);
	Иначе 
		Остаток = 0;
	КонецЕсли;
	
	Если Остаток < 0 Тогда 
		ТекстЗадолженности = НСтр("ru = 'По договору наш долг контрагенту составляет: '; uk = 'По договору наш борг контрагенту складає: '");
	Иначе
		ТекстЗадолженности = НСтр("ru = 'По договору долг контрагента составляет: '; uk = 'По договору борг контрагента складає: '")
	КонецЕсли;
	
	Возврат ТекстЗадолженности + Формат(Остаток, "ЧДЦ=2; ЧН=") + " " + Строка(Валюта);
КонецФункции

// Функция - возвращает задолженности по договору
//
// Параметры:
//  Дата				  - Дата - дата получения остатка по структурной единице
//  ДоговорВзаиморасчетов - ДоговорВзаиморасчетов - договор взаиморасчетов
//
Функция ПолучитьЗадолженностьПоДоговору(ДоговорВзаиморасчетов, Дата = Неопределено) Экспорт 
	
	Долг = 0;
	ТекстЗапроса = "";
	
	Если Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСПокупателями)Тогда	
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РасчетыСПокупателямиОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	РасчетыСПокупателямиОстатки.СуммаОстаток КАК Долг
		               |ПОМЕСТИТЬ втДоговора
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПокупателями.Остатки(&Дата, ДоговорВзаиморасчетов = &Договор) КАК РасчетыСПокупателямиОстатки";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.РасчетыСПоставщиками)Тогда
		
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|
			|ОБЪЕДИНИТЬ ВСЕ
			| ";			
		КонецЕсли;
				
		ТекстЗапроса = ТекстЗапроса + "
			|ВЫБРАТЬ "+?(ПустаяСтрока(ТекстЗапроса),"РАЗРЕШЕННЫЕ","")+"
			|	РасчетыСПоставщикамиОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	РасчетыСПоставщикамиОстатки.СуммаОстаток   КАК Долг "+?(ПустаяСтрока(ТекстЗапроса),"ПОМЕСТИТЬ втДоговора","")+"
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&Дата, ДоговорВзаиморасчетов = &Договор) КАК РасчетыСПоставщикамиОстатки
			| ";
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		ТекстЗапроса = ТекстЗапроса+ "
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоговора.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	СУММА(втДоговора.Долг) КАК Долг
		|ИЗ
		|	втДоговора КАК втДоговора
		|
		|СГРУППИРОВАТЬ ПО
		|	втДоговора.ДоговорВзаиморасчетов";
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =  ТекстЗапроса;
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Договор", ДоговорВзаиморасчетов);
				
		Выборка = Запрос.Выполнить().Выбрать();			
		Если Выборка.Следующий() Тогда 
			Долг = Выборка.Долг;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Долг;	
КонецФункции

#КонецОбласти