#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс


// Процедура заполняет массивы реквизитов, зависимых от хозяйственной операции документа.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Выбранная хозяйственная операция
//	МассивВсехРеквизитов - Массив - Массив всех имен реквизитов, зависимых от хозяйственной операции
//	МассивРеквизитовОперации - Массив - Массив имен реквизитов, используемых в выбранной хозяйственной операции
//
Функция ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;	
	МассивВсехРеквизитов.Добавить("БанковскийСчетОтправитель");
	МассивВсехРеквизитов.Добавить("КассаОтправитель");
	МассивВсехРеквизитов.Добавить("КассаККМ");
	МассивВсехРеквизитов.Добавить("ПринятоОТ");
	МассивВсехРеквизитов.Добавить("ГруппаКонтрагент");
	МассивВсехРеквизитов.Добавить("Контрагент");
	//МассивВсехРеквизитов.Добавить("БанковскийСчетКонтрагента");
	МассивВсехРеквизитов.Добавить("ДокументОснование");
	МассивВсехРеквизитов.Добавить("АвтоЗакрытиеСделок");
	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.СтатьяДДС");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Контрагент");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Организация");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Сумма");
	МассивВсехРеквизитов.Добавить("РасшифровкаПлатежа.Сделка");
		
	МассивРеквизитовОперации = Новый Массив;
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеОплатыОтКлиента") Тогда 		
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");
		//МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ДокументОснование");
		МассивРеквизитовОперации.Добавить("АвтоЗакрытиеСделок");

		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");
		
	ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеОплатыПоЭквайрингу") Тогда 		
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");		
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");
		
	ИначеЕсли ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратДенежныхСредствОтПоставщика") Тогда 
		
		МассивРеквизитовОперации.Добавить("ГруппаКонтрагент");
		МассивРеквизитовОперации.Добавить("Контрагент");
		//МассивРеквизитовОперации.Добавить("БанковскийСчетКонтрагента");
		МассивРеквизитовОперации.Добавить("ДокументОснование");
		МассивРеквизитовОперации.Добавить("АвтоЗакрытиеСделок");
		
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.СтатьяДДС");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Контрагент");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Организация");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ТорговаяПлощадка");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.ДоговорВзаиморасчетов");	
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сумма");
		МассивРеквизитовОперации.Добавить("РасшифровкаПлатежа.Сделка");

	КонецЕсли;
	
КонецФункции


#КонецОбласти
	
#Область Проведение


Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ХозОперация = ДополнительныеСвойства.ДляПроведения.ХозОперация;
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстЗапросаТаблицаДенежныеСредстваКомпании(Запрос, ТекстыЗапроса, Регистры);	
	//ТекстЗапросаРасчетыСПокупателями(Запрос, ТекстыЗапроса, Регистры);							
	//ТекстЗапросаРасчетыСПоставщиками(Запрос, ТекстыЗапроса, Регистры);				
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);				
	
	ПартионныйУчет.ПодготовитьТаблицуЗакрытияСделокСПоставщиками(Запрос, ДополнительныеСвойства);				
	ПартионныйУчет.ПодготовитьТаблицуЗакрытияСделокСПокупателями(Запрос, ДополнительныеСвойства);	
	
	ПартионныйУчет.ПодготовитьТаблицуРасчетыСПоставщиками(Запрос, ДополнительныеСвойства);
	ПартионныйУчет.ПодготовитьТаблицуРасчетыСПокупателями(Запрос, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредств.Дата КАК Период,
	               |	ПоступлениеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредств.ХозОперация КАК ХозОперация,
	               |	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	               |	ПоступлениеБезналичныхДенежныхСредств.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ПоступлениеБезналичныхДенежныхСредств.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ПоступлениеБезналичныхДенежныхСредств.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.МоментВремени КАК МоментВремени,
	               |	ПоступлениеБезналичныхДенежныхСредств.КурсДокумента КАК КурсДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента КАК СуммаДокумента,
	               |	ПоступлениеБезналичныхДенежныхСредств.ДокументОснование КАК Сделка,
	               |	ПоступлениеБезналичныхДенежныхСредств.БанковскийСчет КАК БанковскийСчет
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредств.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 		Реквизиты.Период);
	Запрос.УстановитьПараметр("МоментВремени", 	Реквизиты.МоментВремени);
	Запрос.УстановитьПараметр("Ссылка", 		Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("КурсДокумента", 	Реквизиты.КурсДокумента);
	Запрос.УстановитьПараметр("ВалютаДокумента",Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("БанковскийСчет", Реквизиты.БанковскийСчет);
	Запрос.УстановитьПараметр("ХозОперация", 	Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("РегламентированныйУчет", Истина);
	Запрос.УстановитьПараметр("ВидДоговораПокупка", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка"));
	Запрос.УстановитьПараметр("ВидДоговораПродажа",ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа"));

	
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация", 	Реквизиты.ХозОперация);
	ДополнительныеСвойства.ДляПроведения.Вставить("МоментВремени", 	Реквизиты.МоментВремени);	
	ДополнительныеСвойства.ДляПроведения.Вставить("СуммаДокумента", Реквизиты.СуммаДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента", 	Реквизиты.КурсДокумента);	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВалютаДокумента",Реквизиты.ВалютаДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет", Истина);
	ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании", 	Реквизиты.ПодразделениеКомпании);

КонецПроцедуры


Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТовары";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СтатьяДДС КАК СтатьяДДС,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент КАК Контрагент,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ТорговаяПлощадка <> ЗНАЧЕНИЕ(справочник.торговыеплощадки.пустаяссылка)
	               |			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ТорговаяПлощадка
	               |		ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТорговаяПлощадка
	               |	КОНЕЦ КАК ТорговаяПлощадка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов.ВидДоговора.ВидДоговора = &ВидДоговораПокупка
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК РасчетСПоставщиком,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сделка КАК Сделка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерДок КАК НомерДок,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.АвтоЗакрытиеСделок КАК АвтоЗакрытиеСделок
	               |ПОМЕСТИТЬ ВтТаблицаТовары
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДенежныеСредстваКомпании(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДенежныеСредстваКомпании";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&ВалютаДокумента КАК Валюта,
	               |	&БанковскийСчет КАК СтруктурнаяЕдиница,
	               |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма,
	               |	&ХозОперация КАК ХозОперация,
	               |	ВтТаблицаТовары.СтатьяДДС КАК СтатьяДДС
	               |ИЗ
	               |	ВтТаблицаТовары КАК ВтТаблицаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтТаблицаТовары.СтатьяДДС"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыСПоставщиками(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасчетыСПоставщиками";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	&Период КАК Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	ВтТаблицаТовары.Контрагент КАК Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	              |	ИСТИНА КАК РегламентированныйУчет,
	              |	СУММА(ВтТаблицаТовары.Сумма) КАК Сумма,
	              |	СУММА(ВтТаблицаТовары.Сумма * &КурсДокумента) КАК СуммаБаз,
	              |	&ХозОперация КАК ХозОперация,
	              |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) КАК ВидОперации
	              |ИЗ
	              |	ВтТаблицаТовары КАК ВтТаблицаТовары
	              |ГДЕ
	              |	ВтТаблицаТовары.РасчетСПоставщиком
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВтТаблицаТовары.Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыСПокупателями(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РасчетыСПокупателями";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	&Период КАК Период,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              |	ВтТаблицаТовары.Контрагент КАК Контрагент,
	              |	ВтТаблицаТовары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	              |	ИСТИНА КАК РегламентированныйУчет,
	              |	ВтТаблицаТовары.Сумма КАК Сумма,
	              |	ВтТаблицаТовары.Сумма * &КурсДокумента КАК СуммаБаз,
	              |	&ХозОперация КАК ХозОперация,
	              |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) КАК ВидОперации
	              |ИЗ
	              |	ВтТаблицаТовары КАК ВтТаблицаТовары
	              |ГДЕ
	              |	НЕ ВтТаблицаТовары.РасчетСПоставщиком"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти
	

#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("Взаиморасчеты");	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	&Дата КАК Период,
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Регистратор,
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	                      |ГДЕ
	                      |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата); 
		
	ТаблицыДляПоследовательности.Взаиморасчеты = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности", ТаблицыДляПоследовательности);
	
КонецПроцедуры

#КонецОбласти	
	
	

#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом



#КонецОбласти	


#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры


#КонецОбласти	
	
	
	
	
	
#КонецЕсли