Перем УИД;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Номенклатура", Номенклатура);
	Параметры.Свойство("Промоакция", Промоакция);
	Параметры.Свойство("ид", ид);
	
	УИД= Новый УникальныйИдентификатор(ид);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасшифровкаПромоАкций.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	РасшифровкаПромоАкций.Номенклатура КАК Номенклатура,
		|	РасшифровкаПромоАкций.АкционныйОбьем КАК АкционныйОбьем,
		|	РасшифровкаПромоАкций.ОбьемЗаПредПериод КАК ОбьемЗаПредПериод,
		|	ВЫРАЗИТЬ(РасшифровкаПромоАкций.АкционныйОбьем / РасшифровкаПромоАкций.ОбьемЗаПредПериод КАК ЧИСЛО(15, 3)) КАК Прирост
		|ИЗ
		|	РегистрСведений.РасшифровкаПромоАкций КАК РасшифровкаПромоАкций
		|ГДЕ
		|	РасшифровкаПромоАкций.Промоакция = &Промоакция
		|	И РасшифровкаПромоАкций.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяПлощадка
		|ИТОГИ
		|	СУММА(АкционныйОбьем),
		|	СУММА(ОбьемЗаПредПериод),
		|	ВЫРАЗИТЬ(СРЕДНЕЕ(Прирост) КАК ЧИСЛО(15, 3)) КАК Прирост
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Промоакция", Промоакция);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТорговаяПлощадка = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаТорговаяПлощадка.Следующий() Цикл
		НоваяСтрока = Расшифровка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТорговаяПлощадка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаАкционныйОбьемПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Прирост = ТекущаяСтрока.ОбьемЗаПредПериод/ТекущаяСтрока.АкционныйОбьем+1;
	ПерваяСтрока = Расшифровка[0];
	ПерваяСтрока.АкционныйОбьем = Расшифровка.Итог("АкционныйОбьем")-ПерваяСтрока.АкционныйОбьем;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаОбьемЗаПредПериодПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Прирост = ТекущаяСтрока.ОбьемЗаПредПериод/ТекущаяСтрока.АкционныйОбьем+1;
	ПерваяСтрока = Расшифровка[0];
	ПерваяСтрока.ОбьемЗаПредПериод = Расшифровка.Итог("ОбьемЗаПредПериод")-ПерваяСтрока.ОбьемЗаПредПериод;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	//Запись расшифровки после изменнений в таблице
	УИД= Новый УникальныйИдентификатор(ид);
	Расшифровка.Удалить(0);
	
	Для Каждого СтрокаТаб из Расшифровка Цикл
		Набор = РегистрыСведений.РасшифровкаПромоАкций.СоздатьНаборЗаписей();
		Набор.Отбор.Промоакция.Установить(Промоакция);
		Набор.Отбор.Номенклатура.Установить(Номенклатура);
		Набор.Отбор.ТорговаяПлощадка.Установить(СтрокаТаб.ТорговаяПлощадка);
		Набор.Прочитать();
		
		Если Набор.Количество() Тогда 
			НоваяЗапись = Набор[0];
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	//запись в регистр НомПромоакции
	ЗаписьАкц = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	ЗаписьАкц.ид = УИД;
	ЗаписьАкц.Прочитать();
	Выбран = ЗаписьАкц.Выбран();
	
	Если Выбран Тогда
		ЗаписьАкц.ОбъемПродажАкционный = Расшифровка.Итог("АкционныйОбьем");
		ЗаписьАкц.ОбъемПродажПредПериод = Расшифровка.Итог("ОбьемЗаПредПериод");
		ЗаписьАкц.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить1(Команда)
	СохранитьНаСервере();
    ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
	Об = ПолучитьФорму("Обработка.УправлениеПромоакциями.Форма.Форма");
	Об.фильтрСпискаНоменклатуры ();

КонецПроцедуры
