

#Область ПрограммныйИнтерфейс

//Возвращает строковое представление номенклатуры с характеристикой для отображения в сообщениях
//Параметры
// 		НоменклатураПредставление - строковое предствление номенклатуры или ссылка на элемент справочника "Номенклатура"
// 		ХарактеристикаПредставление - строковое предствление характеристики или ссылка на элемент справочника "Номенклатура"
Функция ПредставлениеНоменклатуры(НоменклатураПредставление, ХарактеристикаПредставление, НазначениеПредставление = "") Экспорт

	СтрПредставление = СокрЛП(НоменклатураПредставление.Артикул) +" "+ СокрЛП(НоменклатураПредставление);

	Если ЗначениеЗаполнено(ХарактеристикаПредставление)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(ХарактеристикаПредставление);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НазначениеПредставление) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(НазначениеПредставление);
	КонецЕсли;
	

	Возврат СтрПредставление;

КонецФункции


#КонецОбласти
