
Функция НаборЗаписейРегистраПоПараметрамОтбора(ПараметрыОтбора)
	
	НаборЗаписей = РегистрыСведений.ТК_ОтсканированныеQRкоды.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
		ЗначениеОтбора = Неопределено;
		Если ПараметрыОтбора.Свойство(ЭлементОтбора.Имя, ЗначениеОтбора) Тогда
			ЭлементОтбора.Установить(ЗначениеОтбора);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НаборЗаписей;
	
КонецФункции

Функция ПараметрыОтбораРегистра()
	
	ПоляОтбора = Новый Структура("ДанныеСканирования,ТорговаяПлощадка");
	
	Возврат ПоляОтбора;
	
КонецФункции

Процедура ОчиститьЗаписиРегистра(ПараметрыОтбора)
	
	НаборЗаписей = НаборЗаписейРегистраПоПараметрамОтбора(ПараметрыОтбора);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОчиститьУстаревшиеЗаписиРегистра(ВыборкаДетальныеЗаписи)Экспорт
	
	ПараметрыОтбора = ПараметрыОтбораРегистра();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора,ВыборкаДетальныеЗаписи);
		ОчиститьЗаписиРегистра(ПараметрыОтбора);
	КонецЦикла;
	
КонецПроцедуры



Функция ПроверитьУникальностьШтрихКода(Знач ДанныеСканирования, ТорговаяПлощадка)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТК_ОтсканированныеQRкоды.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.ТК_ОтсканированныеQRкоды КАК ТК_ОтсканированныеQRкоды
	               |ГДЕ
	               |	ТК_ОтсканированныеQRкоды.ДанныеСканирования = &ДанныеСканирования
	               |	И ТК_ОтсканированныеQRкоды.ТорговаяПлощадка = &ТорговаяПлощадка";
	
	Запрос.УстановитьПараметр("ДанныеСканирования", ДанныеСканирования);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции
