

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	
	#КонецОбласти
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		
		Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);		
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		Месяц = МакетКомпоновки.ЗначенияПараметров.Найти("Месяц").Значение;
		
		ЗаполнитьДанныеИзИсточника(МенеджерВТ, НачалоДня(Месяц));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки,,, МенеджерВТ); 
		
		ДокументРезультат.Очистить();
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура ЗаполнитьДанныеИзИсточника(МенеджерВТ, Месяц)
		тзДанные = Новый ТаблицаЗначений;
		тзДанные.Колонки.Добавить("Форма", ОбщегоНазначения.ОписаниеТипаСтрока(6));
		тзДанные.Колонки.Добавить("Точка", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
		тзДанные.Колонки.Добавить("Потребитель", Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
		тзДанные.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
		тзДанные.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.НачислениеКоммунальныхУслуг"));
		тзДанные.Колонки.Добавить("Потребление", ОбщегоНазначения.ОписаниеТипаЧисло(12,2));
		тзДанные.Колонки.Добавить("Затраты", ОбщегоНазначения.ОписаниеТипаЧисло(12,2));
		
		РезультатЗапросаБанк = ТК_БУХ_РаботаWebСервиса.НачисленияПоКоммунальнымУслугам(Месяц, Истина);
		ДЗ_Банк = РезультатЗапросаБанк.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого стрДок Из ДЗ_Банк.Строки Цикл
			Для Каждого стрДоговор Из стрДок.Строки Цикл
				Для Каждого стрТочка Из стрДоговор.Строки Цикл
					ЕстьПотребитель = стрТочка.ЕстьПотребитель;
					ОбщийФактПотребления = стрТочка.ПотреблениеФакт;
					Для Каждого стрОбъект Из стрТочка.Строки Цикл
						Если ЕстьПотребитель Тогда
							Начислено = стрОбъект.Начислено * стрОбъект.ПотреблениеФакт / ОбщийФактПотребления;
						Иначе
							Начислено = стрОбъект.Начислено;
						КонецЕсли;
						Если Начислено > 0 Тогда
							НовСтрока = тзДанные.Добавить();
							НовСтрока.Форма			= "Банк";
							НовСтрока.Потребление	= стрОбъект.ПотреблениеИтого;
							НовСтрока.Затраты		= Начислено;
							НовСтрока.Договор		= Справочники.ДоговорыКонтрагентов.НайтиПоКоду(стрОбъект.КодДоговор);
							НовСтрока.Точка			= стрОбъект.ТорговаяПлощадкаСсылка;
							НовСтрока.Потребитель	= ?(ЕстьПотребитель,стрОбъект.ПотребительСсылка,стрОбъект.ТорговаяПлощадкаСсылка);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		РезультатЗапросаКасса = ТК_БУХ_УУ_РаботаWebСервиса.НачисленияПоКоммунальнымУслугам(Месяц, Истина);
		ДЗ_Касса1 = РезультатЗапросаКасса[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого стрПодразделение Из ДЗ_Касса1.Строки Цикл
			Если стрПодразделение.КодПодразделение = "000000002" Тогда
				Для Каждого стрДок Из стрПодразделение.Строки Цикл
					Для Каждого стрПризнак Из стрДок.Строки Цикл
						Для Каждого стрТочка Из стрПризнак.Строки Цикл
							Признак = стрТочка.Признак;
							ЕстьПотребитель = стрТочка.ЕстьПотребитель;
							ОбщийФактПотребления = стрТочка.ПотреблениеФакт;
							Для Каждого стрОбъект Из стрТочка.Строки Цикл
								Если Признак = 2 Тогда
									Сумма = стрОбъект.СуммаЗатрат;
								ИначеЕсли Признак = 1 Тогда
									Если ЕстьПотребитель Тогда
										Сумма = стрОбъект.Абонплата * стрОбъект.ПотреблениеФакт / ОбщийФактПотребления;
									Иначе
										Сумма = стрОбъект.Абонплата;
									КонецЕсли;
								КонецЕсли;
								Если Сумма > 0 Тогда
									НовСтрока = тзДанные.Добавить();
									НовСтрока.Форма			= "Касса"+Признак;
									НовСтрока.Потребление	= стрОбъект.ПотреблениеИтого;
									НовСтрока.Затраты		= Сумма;
									//НовСтрока.Договор		= Справочники.ДоговорыКонтрагентов.НайтиПоКоду(стрОбъект.КодДоговор);
									НовСтрока.Документ		= стрОбъект.Регистратор;
									НовСтрока.Точка			= стрОбъект.ТорговаяПлощадкаСсылка;
									НовСтрока.Потребитель	= ?(ЕстьПотребитель,стрОбъект.ПотребительСсылка,стрОбъект.ТорговаяПлощадкаСсылка);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ДЗ_Касса2 = РезультатЗапросаКасса[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого стрПодразделение Из ДЗ_Касса2.Строки Цикл
			Если стрПодразделение.КодПодразделение = "000000002" Тогда
				Для Каждого стрДок Из стрПодразделение.Строки Цикл
					Для Каждого стрПризнак Из стрДок.Строки Цикл
						Для Каждого стрТочка Из стрПризнак.Строки Цикл
							Признак = стрТочка.Признак;
							ЕстьПотребитель = стрТочка.ЕстьПотребитель;
							ОбщийФактПотребления = стрТочка.ПотреблениеФакт;
							Для Каждого стрОбъект Из стрТочка.Строки Цикл
								Если Признак = 2 Тогда
									Сумма = стрОбъект.СуммаЗатрат;
								ИначеЕсли Признак = 1 Тогда
									Если ЕстьПотребитель Тогда
										Сумма = стрОбъект.Абонплата * стрОбъект.ПотреблениеФакт / ОбщийФактПотребления;
									Иначе
										Сумма = стрОбъект.Абонплата;
									КонецЕсли;
								КонецЕсли;
								Если Сумма > 0 Тогда
									НовСтрока = тзДанные.Добавить();
									НовСтрока.Форма			= "Касса"+Признак;
									НовСтрока.Потребление	= стрОбъект.ПотреблениеИтого;
									НовСтрока.Затраты		= Сумма;
									//НовСтрока.Договор		= Справочники.ДоговорыКонтрагентов.НайтиПоКоду(стрОбъект.КодДоговор);
									НовСтрока.Документ		= стрОбъект.Регистратор;
									НовСтрока.Точка			= стрОбъект.ТорговаяПлощадкаСсылка;
									НовСтрока.Потребитель	= ?(ЕстьПотребитель,стрОбъект.ПотребительСсылка,стрОбъект.ТорговаяПлощадкаСсылка);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("тзДанные", тзДанные);	
		Запрос.Текст = "ВЫБРАТЬ
		|	тзДанные.Форма КАК Форма,
		|	тзДанные.Точка КАК Точка,
		|	тзДанные.Потребитель КАК Потребитель,
		|	тзДанные.Документ КАК Документ,
		|	тзДанные.Договор КАК Договор,
		|	тзДанные.Потребление КАК Потребление,
		|	тзДанные.Затраты КАК Затраты
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&тзДанные КАК тзДанные";
		
		Запрос.Выполнить();
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

