#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для передачи в параметрах вспомогательных методов (см. ниже).
//       Соответствует 1 параметру процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь);
//
// Примеры:
//
//  1. Установка описания варианта.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Описание = НСтр("ru = '<Описание>'");
//
//  2. Отключение варианта отчета.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Включен = Ложь;
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиОтчета.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Продажи);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПродажиПоТорговымПлощадкам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по продажам товаров на торговых площадках'; uk = 'Звіт з продажу товарів на торгівельних майданчиках'");
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Продажи.Подсистемы.РозничныеПродажи);
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПродажиПоКонтрагентам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по продажам товаров покупателям'; uk = 'Звіт з продажу товарів покупцям'");
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Продажи.Подсистемы.РозничныеПродажи);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтчетПоОтгрузкамФС");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по отгрзукам (ФС)'; uk = 'Звіт по відвантаженням (ФС)'");
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.Производство);
	
КонецПроцедуры




#КонецОбласти
	
	
	
	
	
	
	
	
	
	
#КонецЕсли