#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ВыполнитьСверкуДокументов(Знач КодПланаОбмена, Знач ПараметрыОперации, Знач ТаблицаДокументов) Экспорт 
	
	Если КодПланаОбмена = "CON"	Тогда
		Возврат СверкаДокументовКонсолидация(ПараметрыОперации, ТаблицаДокументов);			
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Для плана обмена с кодом ""%1"" нет процедуры проверки перегрузки'; uk = 'Для плану обміну з кдом ""%1"" немає процедури перевірки перевантаження'"),
							КодПланаОбмена);
	КонецЕсли;
	
КонецФункции



#КонецОбласти


#Область work_Global_Center

Функция ВыполнитьСверку(Знач ПараметрыВыполнения) Экспорт 
	
	Если ТипЗнч(ПараметрыВыполнения) <> Тип("Структура") Тогда 
		ПараметрыВыполнения = Новый Структура;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	
	Действия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполнения, "Действия", Новый Структура);	
	
	Если Действия.Количество() = 0 Тогда 
		Возврат СтруктураРезультат;
	КонецЕсли;
	
	НачДата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполнения, "НачДата", НачалоДня(ТекущаяДата()));	
	КонДата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыполнения, "КонДата", КонецДня(ТекущаяДата()));	
	
	НачДата_скул = ФорматДатыSQL(НачДата);
	КонДата_скул = ФорматДатыSQL(КонДата);		
	НачДата_Смещ = ФорматДатыSQL(ДобавитьМесяц(НачДата, 2000 * 12));
	КонДата_Смещ = ФорматДатыSQL(ДобавитьМесяц(КонДата, 2000 * 12));
	
	ПараметрыДаты = Новый Структура;
	ПараметрыДаты.Вставить("НачДата", НачДата_скул);
	ПараметрыДаты.Вставить("КонДата", КонДата_скул);
	ПараметрыДаты.Вставить("НачДатаСмещ", НачДата_Смещ);
	ПараметрыДаты.Вставить("КонДатаСмещ", КонДата_Смещ);
		
	Соединение = ПолучитьСоединение("TK1");
	
	ПараметрыВыполнения.Вставить("Отчеты", Новый Структура);
	ПараметрыВыполнения.Вставить("Период_Скул", ПараметрыДаты);
	ПараметрыВыполнения.Вставить("Соединение", Соединение);
		
	//Проверки
	РезультатыДействий = Новый Структура;
	
	Для Каждого Действие Из Действия Цикл 
		РезультатПроверки = "";
		
		ВыполнитьПроверку(Действие.Ключ, ПараметрыВыполнения, РезультатПроверки);
		
		РезультатыДействий.Вставить(Действие.Ключ, РезультатПроверки);
	КонецЦикла;	
	
	Соединение = Неопределено;
	
	СтруктураРезультат.Вставить("Действия", РезультатыДействий);
	СтруктураРезультат.Вставить("Отчеты", ПараметрыВыполнения.Отчеты);	
	
	Возврат СтруктураРезультат;
	
КонецФункции

Процедура ВыполнитьПроверку(Действие, ПараметрыВыполнения, РезультатПроверки = "")
		
	ТаблицаА = "";
	ТаблицаБ = "";
	
	СверкаПоСумме = Ложь;
	СуммаА = "";
	СуммаБ = "";
	
	Если Действие = "ЗакрытиеСмены" Тогда 
		СверкаПоСумме = Истина;
		ТаблицаА = "_Document114";
		ТаблицаБ = "_Document164";
		СуммаА = "_Fld2103";
		СуммаБ = "_Fld714";
	ИначеЕсли Действие = "ВозвратОтПокупателя" Тогда 
		СверкаПоСумме = Истина;
		ТаблицаА = "_Document106";
		ТаблицаБ = "_Document161";		
		СуммаА = "cast(_Fld1745 as decimal(15,2))";
		СуммаБ = "cast(_Fld601 as decimal(15,2))";
	ИначеЕсли Действие = "ВозвратПоставщику" Тогда 		
		СверкаПоСумме = Истина;		
		ТаблицаА = "_Document107";
		ТаблицаБ = "_Document162";
		СуммаА = "_Fld1790";
		СуммаБ = "_Fld642";
	ИначеЕсли Действие = "ПоступлениеТоваров" Тогда 		
		СверкаПоСумме = Истина;		
		ТаблицаА = "_Document149";
		ТаблицаБ = "_Document173";		
		СуммаА = "_Fld3666";
		СуммаБ = "_Fld930";		
	ИначеЕсли Действие = "РеализацияТоваров" Тогда 			
		СверкаПоСумме = Истина;		
		ТаблицаА = "_Document160";
		ТаблицаБ = "_Document177";				
		СуммаА = "_Fld4109";		
		СуммаБ = "_Fld1066";		
	ИначеЕсли Действие = "ПеремещениеТоваров" Тогда 
		ТаблицаА = "_Document137";
		ТаблицаБ = "_Document171";	
	ИначеЕсли Действие = "Инвентаризация" Тогда 
		ТаблицаА = "_Document118";
		ТаблицаБ = "_Document168";	
	ИначеЕсли Действие = "ЗаказПоставщику" Тогда 
		ТаблицаА = "_Document113";
		ТаблицаБ = "_Document163";	
	ИначеЕсли Действие = "ИзменениеЦен" Тогда 
		ТаблицаА = "_Document117";
		ТаблицаБ = "_Document167";
	ИначеЕсли Действие = "ИзменениеАссортимента" Тогда 
		ТаблицаА = "_Document115";
		ТаблицаБ = "_Document165";	
	ИначеЕсли Действие = "СписаниеТоваров" Тогда 
		ТаблицаА = "_Document165";
		ТаблицаБ = "_Document178";	
	ИначеЕсли Действие = "ВыпускПродукции" Тогда 
		ТаблицаА = "_Document109";
		ТаблицаБ = "_Document6450";			
	ИначеЕсли Действие = "ПротоколСогласованияЦен" Тогда 
		ТаблицаА = "_Document154";
		ТаблицаБ = "_Document175";
	ИначеЕсли Действие = "ПересортицаТоваров" Тогда 
		СверкаПоСумме = Истина;
		ТаблицаА = "_Document141";
		ТаблицаБ = "_Document172";		
		СуммаА = "_Fld3346";
		СуммаБ = "_Fld891";
	ИначеЕсли Действие = "ПриходныйКассовыйОрдер" Тогда 
		ТаблицаА = "_Document152";
		ТаблицаБ = "_Document174";
	ИначеЕсли Действие = "РасходныйКассовыйОрдер" Тогда 
		ТаблицаА = "_Document157";
		ТаблицаБ = "_Document176";
	ИначеЕсли Действие = "ПоступлениеБезналичныхДенежныхСредств" Тогда 
		ТаблицаА = "_Document6276";
		ТаблицаБ = "_Document180";
	ИначеЕсли Действие = "СписаниеБезналичныхДенежныхСредств" Тогда 
		ТаблицаА = "_Document6276";
		ТаблицаБ = "_Document181";
	ИначеЕсли Действие = "КорректировкаДолга" Тогда 
		ТаблицаА = "_Document127";
		ТаблицаБ = "_Document7002";
	ИначеЕсли Действие = "ТК_ЗакрытиеСменыЗКС" Тогда 
		ТаблицаА = "_Document7924";
		ТаблицаБ = "_Document8281";
		СверкаПоСумме = Истина;
		СуммаА = "_Fld7933";		
		СуммаБ = "_Fld8308";	
	Иначе
		Возврат;
	КонецЕсли;	
	
	ТабличныйДокумент = Неопределено;
	Соединение = ПараметрыВыполнения.Соединение;
	НачДата = ПараметрыВыполнения.Период_Скул.НачДата;
	КонДата = ПараметрыВыполнения.Период_Скул.КонДата;	
	НачДата_Смещ = ПараметрыВыполнения.Период_Скул.НачДатаСмещ;
	КонДата_Смещ = ПараметрыВыполнения.Период_Скул.КонДатаСмещ;		
	
	Если Действие = "ПриходныйКассовыйОрдер" Тогда 
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld3829 DocSum
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3' and _Fld3822 = 0
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld975 DocSum
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| ((src.Posted != trg.Posted or src.DocSum != trg.DocSum) and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";	
		
	ИначеЕсли Действие = "РасходныйКассовыйОрдер" Тогда 
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld4007 DocSum
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3' and _Fld4000 = 0
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld1033 DocSum
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| ((src.Posted != trg.Posted or src.DocSum != trg.DocSum) and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";			
		
	ИначеЕсли Действие = "ПоступлениеБезналичныхДенежныхСредств" Тогда 		
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld6283 DocSum
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3' and _Fld6283 != 0 and _Fld6284 = 0 and _Fld6285RRef != 0xABBD862A616F4639452F257919122617
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld1166 DocSum
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| ((src.Posted != trg.Posted or src.DocSum != trg.DocSum) and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";			
		
	ИначеЕсли Действие = "СписаниеБезналичныхДенежныхСредств" Тогда 		
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld6284 DocSum
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3' and _Fld6283 = 0 and _Fld6284 != 0
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, _Fld1196 DocSum
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| ((src.Posted != trg.Posted or src.DocSum != trg.DocSum) and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";
		
	ИначеЕсли СверкаПоСумме Тогда 
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted, src.DocSum Ur1_DocSum,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted, trg.DocSum SSL_DocSum
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, %7 DocSum
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3'
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted, %8 DocSum
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| (src.Posted != trg.Posted or (src.DocSum != trg.DocSum and (src.Posted = 1 or trg.Posted = 1)) and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";	
		
		
	Иначе
		
		Шаблон_Осн = "
					|select 
					| dbo.[getStringUUID](src.Ref) Ur1_Ref, src.Number Ur1_Number, src.Date Ur1_Date, src.Posted Ur1_Posted,
					| dbo.[getStringUUID](trg.Ref) SSL_Ref, trg.Number SSL_Number, trg.Date SSL_Date, trg.Posted SSL_Posted
					|from 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted
					| from [work_Global_Center].[dbo].[%1] where cast(_Date_Time as date) between '%2' and '%3'
					|) src
					|full join 
					|(
					| select _IDRRef Ref, _Number Number, _Date_Time Date, convert(int, _Posted) Posted
					| from [sql-tk01].[work_TK].[dbo].[%4] where cast(_Date_Time as date) between '%5' and '%6'
					|) trg on src.Ref = trg.Ref
					|where 
					| (src.Posted != trg.Posted and src.Posted is not null and trg.Posted is not null) 
	 				| or (src.Posted is null and trg.Posted is not null and trg.Posted != 0) 
	 				| or (src.Posted is not null and trg.Posted is null and src.Posted != 0)				
					|";		
		
	КонецЕсли;
	
	Если СверкаПоСумме Тогда 
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон_Осн, 
						ТаблицаА, НачДата, КонДата,
						ТаблицаБ, НачДата_Смещ, КонДата_Смещ, СуммаА, СуммаБ);
	Иначе
		ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						Шаблон_Осн, 
						ТаблицаА, НачДата, КонДата,
						ТаблицаБ, НачДата_Смещ, КонДата_Смещ);
	КонецЕсли;					
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command");
	ЗапросАДО.CommandText = ТекстЗапроса;
	ЗапросАДО.ActiveConnection = Соединение;
	
	Попытка
		
		НачалоЗапроса = ТекущаяДата();
		
		Выборка = ЗапросАДО.Execute();
		
		КонецЗапроса = ТекущаяДата();
		
		Если Выборка.BOF = Ложь Тогда 
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.АвтоМасштаб = Истина;	
			ТабличныйДокумент.ОтображатьЗаголовки = Истина;			
			
			Макет = ПолучитьМакет("ПФ_MXL_Сверка");
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			
			ПодробностиСверки = Новый ТекстовыйДокумент;
			ПодробностиСверки.ДобавитьСтроку(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Период: %1 - %2", Формат(ПараметрыВыполнения.НачДата, "ДФ=dd.MM.yyyy"), Формат(ПараметрыВыполнения.КонДата, "ДФ=dd.MM.yyyy")));
			ПодробностиСверки.ДобавитьСтроку("Время запроса: " + НачалоЗапроса);
			ПодробностиСверки.ДобавитьСтроку("Время выполнения запроса - " + (КонецЗапроса - НачалоЗапроса) + " сек.");
			
			СтруктураЗаголовка = Новый Структура;
			СтруктураЗаголовка.Вставить("ТипДокумента", Действие);
			СтруктураЗаголовка.Вставить("Подробности", ПодробностиСверки.ПолучитьТекст());
			
			ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаголовка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Всего = 0;
			Выборка.MoveFirst();
			Пока Выборка.EOF = Ложь Цикл 
				Всего = Всего + 1;
				
				СтруктураСтроки = Новый Структура;
				СтруктураСтроки.Вставить("ГУИД_А", НРег(Выборка.Fields("Ur1_Ref").Value));
				СтруктураСтроки.Вставить("ГУИД_Б", НРег(Выборка.Fields("SSL_Ref").Value));				
				СтруктураСтроки.Вставить("Дата_А", Выборка.Fields("Ur1_Date").Value);
				СтруктураСтроки.Вставить("Дата_Б", Выборка.Fields("SSL_Date").Value);
				СтруктураСтроки.Вставить("Номер_А", Выборка.Fields("Ur1_Number").Value);
				СтруктураСтроки.Вставить("Номер_Б", Выборка.Fields("SSL_Number").Value);
				
				Если СверкаПоСумме Тогда 
					СтруктураСтроки.Вставить("Сумма_А", Выборка.Fields("Ur1_DocSum").Value);
					СтруктураСтроки.Вставить("Сумма_Б", Выборка.Fields("SSL_DocSum").Value);
				КонецЕсли;
				
				ПроведенА = Выборка.Fields("Ur1_Posted").Value;
				Если ПроведенА = Null Тогда
					ПроведенА = "";
				ИначеЕсли ПроведенА = 1 Тогда 
					ПроведенА = Истина;
				Иначе
					ПроведенА = Ложь;
				КонецЕсли;
				
				ПроведенБ = Выборка.Fields("SSL_Posted").Value;
				Если ПроведенБ = Null Тогда
					ПроведенБ = "";
				ИначеЕсли ПроведенБ = 1 Тогда 
					ПроведенБ = Истина;
				Иначе
					ПроведенБ = Ложь;
				КонецЕсли;
				
				СтруктураСтроки.Вставить("Проведен_А", ПроведенА);
				СтруктураСтроки.Вставить("Проведен_Б", ПроведенБ);
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				Выборка.MoveNext();
			КонецЦикла;		
			
			ОбластьПодвал.Параметры.Заполнить(Новый Структура("Всего", Всего));
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			РезультатПроверки = "Найдено " + (Всего) + " расхождений";
		Иначе
			РезультатПроверки = "Расхождения не найдены!";
		КонецЕсли;
	Исключение
		РезультатПроверки = ОписаниеОшибки();
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;		
	
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Действие + "; " + РезультатПроверки);
	
	Если ТабличныйДокумент <> Неопределено Тогда 
		Структура = Новый Структура;
		Структура.Вставить("ТабличныйДокумент", ТабличныйДокумент);
		Структура.Вставить("Экземпляров", 1);
		Структура.Вставить("СинонимМакета", Действие);
		
		ПараметрыВыполнения.Отчеты.Вставить(Действие, Структура);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область work_consolidation

Функция СверкаДокументовКонсолидация(ПараметрыОперации, ТаблицаДокументов)
	
	ВсеОк = Истина;	
	НачалоПериода = Неопределено;
	КонецПериода = Неопределено;
	
	Действия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОперации, "Действия", Новый Структура);	
	
	Если Не ПараметрыОперации.Свойство("НачалоПериода", НачалоПериода) 
		ИЛИ Не ПараметрыОперации.Свойство("КонецПериода", КонецПериода)
		ИЛИ Действия.Количество() = 0 Тогда 
		
		ВызватьИсключение НСтр("ru = 'Переданы некоректные параметры операции'; uk = 'Передані некоректні параметри операції'");
	КонецЕсли;
	
	НачДата = ФорматДатаВремяSQL(ДобавитьМесяц(НачалоПериода, 2000 * 12));
	КонДата = ФорматДатаВремяSQL(ДобавитьМесяц(КонецПериода, 2000 * 12));
	
	Соединение = ПолучитьСоединение("CON");
	
	Ит = 0;
	КолВоДействий = Действия.Количество();
	
	Для Каждого ВидПроверки Из Действия Цикл 
		Ит = Ит + 1;
		
		ДлительныеОперации.СообщитьПрогресс(
			Цел(Ит / КолВоДействий * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(	
				НСтр("ru = 'Проверка документов ""%1""'; uk = 'Перевірка документів ""%1""'"),
				ВидПроверки.Значение));
		
		ПроверкаПоТипуДокумента(НачДата, КонДата, Соединение, ВидПроверки.Ключ, ВидПроверки.Значение, ТаблицаДокументов);	
	КонецЦикла;
	
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки", Не ВсеОк);	
	
	Если ТаблицаДокументов.Количество() > 0 Тогда 
		Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
		СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Найдено %1 расхождений'; uk = 'Знайдено %1 розбіжностей'"),
									ТаблицаДокументов.Количество());
	Иначе
		СообщениеЗавершения = НСтр("ru = 'Расхождения не найдены'; uk = 'Розбіжності не знайдені'");								
	КонецЕсли;
	
	Результат.Вставить("СообщениеЗавершения", СообщениеЗавершения);
	
	Возврат Результат;
КонецФункции

Процедура ПроверкаПоТипуДокумента(НачалоПериода, КонецПериода, Соединение, Действие, Представление, ТаблицаДокументов)
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Действие);
	
	Если ПараметрыДействия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяМетаданных 	= ПараметрыДействия.ИмяМетаданных;
	ПараметрПоиска 	= ПараметрыДействия.ПараметрПоиска;
	ТаблицаИсточник = ПараметрыДействия.ТаблицаИсточник;
	ТаблицаПриемник = ПараметрыДействия.ТаблицаПриемник;
	
	ШаблонЗапроса = "
		|Declare @date1 as datetime
		|Declare @date2 as datetime
		|
		|set @date1 = '%1'
		|set @date2 = '%2'
		|
		|select
		|trg.Ref Ref,		
		|trg.DocDate DocDate
		|
		|from 
		|(
		|select
		|[work_TK].[dbo].[getStringUUID](_IDRRef) Ref,
		|_Date_Time DocDate,
		|_Number Number,
		|convert(int, _Posted) Posted,
		|convert(int, _Marked) Marked
		|from [work_TK].[dbo].[%3]
		|where _Date_Time between @date1 and @date2
		|) as trg
		|
		|left outer join 
		|
		|(
		|select
		|SUBSTRING(_Fld8237, 43, 36) Ref,
		|convert(int, doc._Marked) Marked
		|from [sql-corp].[work_consolidation].[dbo].[_InfoRg8234] as InfRg
		|inner join [sql-corp].[work_consolidation].[dbo].[%4] as doc
		|on InfRg._Fld8236_RRRef = doc._IDRref and doc._Date_Time between @date1 and @date2
		|where 
		|_Fld8235_RRRef = 0x80C10050569272D911E66615298E10AE
		|and _Fld8238 = '%5'
		|) as src
		|
		|on trg.Ref = src.Ref
		|
		|where 
		|(src.Ref is null and trg.Posted = 1)
		|or (src.Ref is not null and trg.Posted = 1 and src.Marked = 1)
		|or (src.Ref is not null and (trg.Posted = 0 or trg.Marked = 1) and src.Marked = 0)
		|
		|order by DocDate";
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонЗапроса,
						НачалоПериода,
						КонецПериода,
						ТаблицаИсточник,
						ТаблицаПриемник,
						ПараметрПоиска);						
						
	Выборка = ВыполнитьSQLЗапрос(ТекстЗапроса, Соединение);						
											
	Пока Выборка.EOF = Ложь Цикл 
		ИД = Выборка.Fields("Ref").Value;
		
		Попытка
			ГУИД = Новый УникальныйИдентификатор(ИД);
			Док = Документы[ИмяМетаданных].ПолучитьСсылку(ГУИД);
			
			НоваяСтрока = ТаблицаДокументов.Добавить();
			НоваяСтрока.Флаг = Истина;
			НоваяСтрока.Документ = Док;
			НоваяСтрока.ТипДокумента = Действие;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Прервать;
		КонецПопытки;
		
		Выборка.MoveNext();		
	КонецЦикла;
			
КонецПроцедуры

Функция ПолучитьПараметрыДействия(Действие) 
	
	ПараметрыДействия = Новый Структура;
	
	Если Действие = "ПоступлениеТоваров" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ПоступлениеТоваров");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ПоступлениеТоваров");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document173");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ВозвратПоставщику" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ВозвратПоставщику");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ВозвратПоставщику");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document162");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "РеализацияТоваров" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "РеализацияТоваров");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.РеализацияТоваров");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document177");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ВозвратОтПокупателя" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ВозвратОтПокупателя");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ВозвратОтПокупателя");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document161");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ТК_ЗакрытиеСменыЗКС" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ТК_ЗакрытиеСменыЗКС");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ТК_ЗакрытиеСменыЗКС");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document8281");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ЗакрытиеСмены" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ЗакрытиеСмены");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ЗакрытиеСмены");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document164");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ПеремещениеТоваров" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ПеремещениеТоваров");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ПеремещениеТоваров");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document171");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "Инвентаризация" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "Инвентаризация");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.Инвентаризация");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document168");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ВыпускПродукции" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ВыпускПродукции");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ВыпускПродукции");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document6450");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "СписаниеТоваров" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "СписаниеТоваров");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.СписаниеТоваров");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document178");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "ПриходныйКассовыйОрдер" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ПриходныйКассовыйОрдер");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ПриходныйКассовыйОрдер");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document174");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");
	ИначеЕсли Действие = "РасходныйКассовыйОрдер" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "РасходныйКассовыйОрдер");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.РасходныйКассовыйОрдер");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document176");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");		
	ИначеЕсли Действие = "КорректировкаДолга" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ТК_КорректировкаДолга");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ТК_КорректировкаДолга");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document7002");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");		
	ИначеЕсли Действие = "Взаимозачет" Тогда 
		ПараметрыДействия.Вставить("ИмяМетаданных",  "ТК_Взаимозачет");
		ПараметрыДействия.Вставить("ПараметрПоиска", "ДокументСсылка.ТК_Взаимозачет");
		ПараметрыДействия.Вставить("ТаблицаИсточник", "_Document7781");
		ПараметрыДействия.Вставить("ТаблицаПриемник", "_Document167");		
	
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для правила обмена ""%1"" не заданы параметры проверки'; uk = 'Для правила обміну ""%1"" не задані параметри перевірки'"),
				Действие));
				
		Возврат Неопределено;
	КонецЕсли;
	
	
	Возврат ПараметрыДействия;
	
КонецФункции



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоединение(КодПланаОбмена)
	
	Если КодПланаОбмена = "CON" Тогда 
		
		СтрокаСервер = "sql-tk01"; 
		СтрокаБазаДанных = "work_tk";
		СтрокаПользователь = "comparer";
		СтрокаПароль = "^LA4jD2}~ECaM9^B~";
		
	ИначеЕсли КодПланаОбмена = "TK1" Тогда 		
		
		СтрокаСервер = "sql-corp"; //"sql-center";
		СтрокаБазаДанных = "work_Global_Center";
		СтрокаПользователь = "comparer";
		СтрокаПароль = "^LA4jD2}~ECaM9^B~";
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не заданы параметры подключения для Плана обмена с кодом ""%1""
                                  |Обратитесь к программисту'; uk = 'Не вказані параметри підключення для Плану обміну з кодом ""%1""
                                  |Зверніться до программіста'"),
							КодПланаОбмена);
	КонецЕсли;
	
	СтрокаПодключенияКБазе = "Provider=SQLNCLI11;Server="+СокрЛП(СтрокаСервер) + ";Database="+СокрЛП(СтрокаБазаДанных) + ";Uid="+СокрЛП(СтрокаПользователь) + ";Pwd="+СокрЛП(СтрокаПароль) +";";
	
	Попытка
		Connection = Новый COMObject("ADODB.Connection"); 	
		Connection.ConnectionTimeOut = 2500;//1200;
		Connection.CommandTimeout = 2000;
		Connection.CursorLocation = 1; 
		Connection.Mode = 1; 
		//	
		Connection.Open(СтрокаПодключенияКБазе);  
		//	
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Connection;

КонецФункции

Функция ФорматДатыSQL(Дата)	
	Возврат Формат(Дата, "ДФ=yyyyMMdd");
КонецФункции
 
Функция ФорматДатаВремяSQL(Дата)
	Возврат Формат(Дата, "ДФ='yyyy-MM-dd hh:mm:ss'");	
КонецФункции

Функция ВыполнитьSQLЗапрос(ТекстЗапроса, Соединение)
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command");
	ЗапросАДО.CommandText = ТекстЗапроса;
	ЗапросАДО.ActiveConnection = Соединение;
		
	Возврат ЗапросАДО.Execute();		
	
КонецФункции


#КонецОбласти



#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
