

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Поля = Новый Массив;
	//Поля.Добавить("ХозОперация");
	//Поля.Добавить("ВхДокНомер");
	//Поля.Добавить("ВхДокДата");
	//Поля.Добавить("Организация");
	//Поля.Добавить("ПодразделениеКомпании");
	//Поля.Добавить("РегламентированныйУчет");
	//Поля.Добавить("Контрагент");
	//Поля.Добавить("ДоговорВзаиморасчетов");
	//Поля.Добавить("СкладКомпании");
	//Поля.Добавить("Комментарий");
	//Поля.Добавить("Автор");
	//Поля.Добавить("Транзитер");
	//Поля.Добавить("ЕстьОригинал");
	//Поля.Добавить("ЗаменаНакладной");
	//Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
	//Список.УстановитьОграниченияИспользованияВПорядке(Поля);
	
	
	//EDI
	ПараметрыПриСозданииНаСервере = ТК_ОбменEDI.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.КомандыEDI;
	ТК_ОбменEDI.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);

	
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Элементы.ОтборХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ПоступлениеТоваров"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ВидимостьКоманды_УстановкаЦенЛТФ(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#Область EDI

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуEDI(Команда)
	
	ТК_ОбменEDIКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры



#КонецОбласти



&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("Организация", ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборХозОперацияПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("ХозОперация", ОтборХозОперация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеКомпанииПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("ПодразделениеКомпании", ОтборПодразделениеКомпании));	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("Контрагент", ОтборКонтрагент));	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("Автор", ОтборАвтор));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыборкиПриИзменении(Элемент)
	
	УстановитьОтборСписка(Список, Новый Структура("ПериодВыборки", ПериодВыборки));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	//Заполним отбор списка	
	тПериод 		= Настройки.Получить("ПериодВыборки");
	тХозОперация	= Настройки.Получить("ОтборХозОперация");
	тОрганизациия	= Настройки.Получить("ОтборОрганизация");
	тПодразделение	= Настройки.Получить("ОтборПодразделениеКомпании");
	тКонтрагент		= Настройки.Получить("ОтборКонтрагент");
	тАвтор			= Настройки.Получить("ОтборАвтор");
	
	ПараметрыОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(тПериод) Тогда 
		ПараметрыОтбора.Вставить("ПериодВыборки", тПериод);
	КонецЕсли;
	Если ЗначениеЗаполнено(тХозОперация) Тогда 
		ПараметрыОтбора.Вставить("ХозОперация", тХозОперация);
	КонецЕсли;
	Если ЗначениеЗаполнено(тОрганизациия) Тогда 
		ПараметрыОтбора.Вставить("Организация", тОрганизациия);
	КонецЕсли;
	Если ЗначениеЗаполнено(тПодразделение) Тогда 
		ПараметрыОтбора.Вставить("ПодразделениеКомпании", тПодразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(тКонтрагент) Тогда 
		ПараметрыОтбора.Вставить("Контрагент", тКонтрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(тАвтор) Тогда 
		ПараметрыОтбора.Вставить("Автор", тАвтор);
	КонецЕсли;
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ПериодВыборки = Неопределено;
	Если ПараметрыОтбора.Свойство("ПериодВыборки", ПериодВыборки) Тогда 
		
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		ЭлементОтбораДанных = Неопределено;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПериод" Тогда
				ЭлементОтбораДанных = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПериодВыборки) Тогда 
			
			Если ЭлементОтбораДанных = Неопределено Тогда
				ГруппаОтборПериод = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтборПериод.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
				ГруппаОтборПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
				ГруппаОтборПериод.Использование = Истина;
				ГруппаОтборПериод.Представление = "ОтборПериод";
			Иначе
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Истина;
			КонецЕсли;	
			
			ГруппаДатаСортировки = ГруппаОтборПериод.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаДатаСортировки.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
			ГруппаДатаСортировки.Использование = Истина;
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаНачала) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаНачала;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаОкончания) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаОкончания;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;
			
			Если ГруппаДатаСортировки.Элементы.Количество() = 0 Тогда 
				ГруппаОтборПериод.Элементы.Удалить(ГруппаДатаСортировки);
			КонецЕсли;
			
		Иначе
			
			Если ЭлементОтбораДанных <> Неопределено Тогда
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Ложь;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Для Каждого текОтбор Из ПараметрыОтбора Цикл 		
		ИмяРеквизита = текОтбор.Ключ;
		Значение = текОтбор.Значение;
		
		Если текОтбор.Ключ = "ПериодВыборки" Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		ИмяРеквизита, 
		Значение, 
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЗначениеЗаполнено(Значение));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКоманды_УстановкаЦенЛТФ(ТекущиеДанные);
	Если ТекущиеДанные <> Неопределено Тогда
		Попытка
			Элементы.ФормаУстановитьЦеныДляРЦ.Видимость = ТекущиеДанные.ЛТФ_РЦ;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЦеныДляРЦНаСервере(Знач ВыделенныеСтроки)
	ЦенообразованиеСервер.УстановкаЦенДляРЦ(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦеныДляРЦ(Команда)
	УстановитьЦеныДляРЦНаСервере(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти

