

Функция ПолучитьПараметрПоИмени(ИмяПараметра)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграмПараметрыКонтекста.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ТелеграмПараметрыКонтекста КАК ТелеграмПараметрыКонтекста
		|ГДЕ
		|	ТелеграмПараметрыКонтекста.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяПараметра);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
	
КонецФункции
