
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			"Контрагент", 
			Параметры.Контрагент, 
			ВидСравненияКомпоновкиДанных.ВСписке,
			, 
			ЗначениеЗаполнено(Параметры.Контрагент));
	
	Если Параметры.Свойство("ВыбранныеДоговора") Тогда
		Для Каждого СтрДог Из Параметры.ВыбранныеДоговора Цикл 
			 нСтр = ВыбранныеДоговора.Добавить();
			 нСтр.ДоговорКонтрагента = СтрДог;
			 нСтр.ДатаОкончанияДействия = СтрДог.ДатаОкончанияДействия;
		КонецЦикла;
		
	КонецЕсли;
	
			
	
КонецПроцедуры





&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	нСтрока = ВыбранныеДоговора.НайтиСтроки(Новый Структура("ДоговорКонтрагента",ВыбраннаяСтрока));
	Если нСтрока.Количество() = 0 Тогда
		нСтрокаДоговор = ВыбранныеДоговора.Добавить();
		нСтрокаДоговор.ДоговорКонтрагента = ВыбраннаяСтрока;
		нСтрокаДоговор.ДатаОкончанияДействия = Элемент.ТекущиеДанные.ДатаОкончанияДействия;
	Иначе
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)

	АдресХран = ПоместитьДоговораВоВременноеХранилище();
	ОповеститьОВыборе(АдресХран);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДоговораВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(ВыбранныеДоговора.Выгрузить());
КонецФункции
