#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВводНовогоТовараВАссортимент") Тогда
			//ПроверяемыеРеквизиты.Добавить("ВесКг");
			//ПроверяемыеРеквизиты.Добавить("Артикул");
			//ПроверяемыеРеквизиты.Добавить("ТоварнаяМарка");
			//ПроверяемыеРеквизиты.Добавить("ШтрихКодТовара");
			//ПроверяемыеРеквизиты.Добавить("ВидНоменклатуры");
			//ПроверяемыеРеквизиты.Добавить("ТипНоменклатуры");
			//ПроверяемыеРеквизиты.Добавить("НазваниеТовараДляНН");
			//ПроверяемыеРеквизиты.Добавить("ЕдиницаПродажиТовара");
			//ПроверяемыеРеквизиты.Добавить("ГруппаЦенообразования");
			//ПроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияЯщиков");
			//ПроверяемыеРеквизиты.Добавить("НазваниеТовараДляЦенника");
			//ПроверяемыеРеквизиты.Добавить("ЛокализованноеНаименование");
			//ПроверяемыеРеквизиты.Добавить("ТипНоменклатурыПланирования");
			ПроверяемыеРеквизиты.Добавить("Товары.ВидАссортимента");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
		КонецЕсли;
		
		Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВводТоваровВАссортимент") Тогда
			ПроверяемыеРеквизиты.Добавить("Товары.ВидАссортимента");
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ПриКопировании(ОбъектКопирования)
		Автор =  Пользователи.ТекущийПользователь();
		Статус = Перечисления.СтатусыАссортиментногоКомитета.Черновик;
		Для Каждого строка Из Товары Цикл
			строка.ДокументАссортимента = "";
		КонецЦикла;
	КонецПроцедуры
	
	#Область Проведение
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		Если Статус = Перечисления.СтатусыАссортиментногоКомитета.Обработан Тогда
			Отказ = НЕ (РольДоступна("ПолныеПрава") ИЛИ ДополнительныеСвойства.Свойство("ОбрабткаЗаданием"));
		КонецЕсли;
	КонецПроцедуры
	
	Процедура ПриЗаписи(Отказ)
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		
	КонецПроцедуры
	
	
	
	
	#КонецОбласти
	
	
	#Область ИнициализацияИЗаполнение
	
	// Инициализирует документ
	//
	Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		
		//Статус = Перечисления.СтатусыАссортиментногоКомитета.Черновик;
		Автор =  Пользователи.ТекущийПользователь();
		ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		КонецЕсли;
		
	КонецПроцедуры // ИнициализироватьДокумент()
	
	
	
	
	#КонецОбласти
	
	
#КонецЕсли

