
&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог сохранения xml файлов";
	
	Если Диалог.Выбрать() Тогда
		КаталогДанных = Диалог.Каталог;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруТекущийНастроек(Адрес)  
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("ГруппыАкциза", ГруппыАкциза);
	СтруктураЗначений.Вставить("ПринадлежностьКГруппамАкциза", Объект.ПринадлежностьКГруппамАкциза.Выгрузить());
	СтруктураЗначений.Вставить("ТаблицаНалоговых", Объект.ТаблицаНалоговых.Выгрузить());
	СтруктураЗначений.Вставить("Организация", Организация);
	СтруктураЗначений.Вставить("КаталогДанных", КаталогДанных);	
	
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДД.Записать(ИмяВременногоФайла);
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяВременногоФайла);
	
	СериализаторXDTO.ЗаписатьXML(Запись, СтруктураЗначений);
	Запись.Закрыть();
	
	Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
    Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор); // кидаем двоичные данные во врем. хранилище
    Возврат Адрес;

КонецФункции

&НаСервере
Процедура ВосстановитьЗначениеИзСтруктуры(Адрес)  
	
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДД.Записать(ИмяВременногоФайла);
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяВременногоФайла);
	
	Попытка
		СтруктураНастроек = СериализаторXDTO.ПрочитатьXML(Чтение, Тип("Структура"));
	Исключение
	КонецПопытки;
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Значение Из СтруктураНастроек Цикл
		ИмяРеквизита = Значение.Ключ;
		Если ИмяРеквизита = "ПринадлежностьКГруппамАкциза" Тогда
			Таблица = Значение.Значение;
			Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;			
			Объект.ПринадлежностьКГруппамАкциза.Загрузить(Таблица);
		ИначеЕсли ИмяРеквизита = "ТаблицаНалоговых" Тогда
			Таблица = Значение.Значение;
			Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;			
			Объект.ТаблицаНалоговых.Загрузить(Таблица);	
		ИначеЕсли ИмяРеквизита = "Организация" Тогда
			Организация = Значение.Значение;
		ИначеЕсли ИмяРеквизита = "КаталогДанных" Тогда
			КаталогДанных = Значение.Значение;
		КонецЕсли;				
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите xml-файл для сохранения";
	Диалог.Фильтр = "Файл настроек (*.xml)|*.xml";
	
	Если Диалог.Выбрать() Тогда
		Путь = Диалог.ПолноеИмяФайла;		
	Иначе
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилища = "";
	ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь, ЭтаФорма.УникальныйИдентификатор);
		
  	Адрес = ПолучитьСтруктуруТекущийНастроек(АдресВременногоХранилища);	
	
	Двоичное=ПолучитьИзВременногоХранилища(Адрес);  // по адресу временного хранилища получаем двоичные данные
    Двоичное.Записать(Путь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите xml-файл настроек";
	Диалог.Фильтр = "Файл настроек (*.xml)|*.xml";
	
	Если Диалог.Выбрать() Тогда
		Путь = Диалог.ПолноеИмяФайла;		
	Иначе
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилища = "";
	ПоместитьФайл(АдресВременногоХранилища, Путь,,Ложь, ЭтаФорма.УникальныйИдентификатор);
	
	ВосстановитьЗначениеИзСтруктуры(АдресВременногоХранилища);
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки = ПолучитьТекущиеНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(Настройки)
	
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = ЭтаФорма.ПолучитьРеквизиты();
	СтруктураРеквизитов = Новый Структура;
	Для Каждого Стр Из МассивРеквизитов Цикл 
		СтруктураРеквизитов.Вставить(Стр.Имя);
	КонецЦикла;
	
	Для Каждого стрНастройка Из Настройки Цикл 
		ИмяРеквизита = стрНастройка.Ключ;						
		
		Если Не СтруктураРеквизитов.Свойство(ИмяРеквизита) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ИмяРеквизита = "ПринадлежностьКГруппамАкциза" 
			ИЛИ ИмяРеквизита = "ТаблицаНалоговых" Тогда 
			
			ТипРеквизита = ТипЗнч(стрНастройка.Значение);
			Если ТипРеквизита = Тип("ТаблицаЗначений") Тогда 
				Таблица = стрНастройка.Значение.Получить();
			ИначеЕсли ТипРеквизита = Тип("ХранилищеЗначения") Тогда 
				Таблица = стрНастройка.Значение.Получить();
			Иначе
				Продолжить;
			КонецЕсли;
			
			Объект[ИмяРеквизита].Загрузить(Таблица);
		Иначе
			ЭтаФорма[ИмяРеквизита] = стрНастройка.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ЗагрузитьНастройкиНаСервере(Настройки);	
	Настройки = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущиеНастройки()
	
	СжатиеДанных = Новый СжатиеДанных(9);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ГруппыАкциза", ГруппыАкциза);
	СтруктураНастроек.Вставить("ПринадлежностьКГруппамАкциза", Новый ХранилищеЗначения(Объект.ПринадлежностьКГруппамАкциза.Выгрузить(), СжатиеДанных)); 
	СтруктураНастроек.Вставить("Организация", Организация);
	СтруктураНастроек.Вставить("КаталогДанных", КаталогДанных);
	СтруктураНастроек.Вставить("ТаблицаНалоговых", Новый ХранилищеЗначения(Объект.ТаблицаНалоговых.Выгрузить(), СжатиеДанных));
	
	Возврат СтруктураНастроек;
КонецФункции

&НаКлиенте
Процедура ПринадлежностьКГруппамАкцизаГруппаАкцизаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора = ГруппыАкциза;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ГруппыАкциза.Количество() = 0 Тогда
		ГруппыАкциза.Добавить("Алкоголь");
		ГруппыАкциза.Добавить("Вино");
		ГруппыАкциза.Добавить("Пиво");
		ГруппыАкциза.Добавить("Табак");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	МассивДокументов = Новый Массив;

	ТаблицаПодакцизныхТоваров = ПолучитьТаблицуАкциза();	
	
	Если ТаблицаПодакцизныхТоваров = Неопределено ИЛИ ТаблицаПодакцизныхТоваров.Количество() = 0 Тогда
		Возврат МассивДокументов;
	КонецЕсли;
	
	КодыГНИ = ТаблицаПодакцизныхТоваров.Скопировать();
	КодыГНИ.Свернуть("ГНИ");			
	
	ТаблицаАкциза = ТаблицаПодакцизныхТоваров.СкопироватьКолонки("ГНИ, КПП, Акциз, СуммаСНДС, СуммаАкцизногоНалога, СуммаВсего, ОкругленнаяСуммаАкциза");
	
	
	Для Каждого Код Из КодыГНИ Цикл		
		ТаблицаАкциза.Очистить();
		
		СтрокиПоГНИ = ТаблицаПодакцизныхТоваров.НайтиСтроки(Новый Структура("ГНИ", Код.ГНИ));
		ТаблицаДанных = ТаблицаПодакцизныхТоваров.Скопировать(СтрокиПоГНИ);
		ТаблицаДанных.Свернуть("ГНИ, КПП, Акциз", "СуммаСНДС, СуммаАкцизногоНалога, СуммаВсего, ОкругленнаяСуммаАкциза");
		ТаблицаДанных.Сортировать("КПП, Акциз");
		
		Для Каждого ИмяАкциза Из ГруппыАкциза Цикл
			МассивДанныхАкциза = ТаблицаДанных.НайтиСтроки(Новый Структура("Акциз", ИмяАкциза.Значение));
			ТаблицаДанныхАкциза = ТаблицаДанных.Скопировать(МассивДанныхАкциза);
			ТаблицаДанныхАкциза.Свернуть("ГНИ, КПП, Акциз", "СуммаСНДС, СуммаАкцизногоНалога, СуммаВсего, ОкругленнаяСуммаАкциза");
			
			Для Каждого СтрДанных Из ТаблицаДанныхАкциза Цикл
				НовСтрока = ТаблицаАкциза.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, СтрДанных);
			КонецЦикла;;
		КонецЦикла;
		
		ОписаниеФайла = СформироватьДекларации(ТаблицаАкциза, Код.ГНИ);
		МассивДокументов.Добавить(ОписаниеФайла);
		
		СформироватьДодатки(ТаблицаАкциза, Код.ГНИ, МассивДокументов);

	КонецЦикла;
	
	СформироватьФайлИтоговый(ТаблицаПодакцизныхТоваров, МассивДокументов);
	СформироватьФайлРасхождений(ТаблицаПодакцизныхТоваров, МассивДокументов);
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ (ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода)) ИЛИ (НачалоПериода > КонецПериода) Тогда
		Сообщить("Некорректно заполнен период формирования отчета!");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнено поле ""Организация""");
		Возврат;
	КонецЕсли;

	
	МассивФайлов = СформироватьНаСервере();
	
	Если МассивФайлов.Количество() <> 0 Тогда 
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
		Для Каждого Файл Из МассивФайлов Цикл
			НачатьПолучениеФайлаССервера(Оп, Файл.Хранение, Файл.Имя);
		КонецЦикла;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранено "+МассивФайлов.Количество()+ " файла");	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания(ПолученныйФайл, Параметры) Экспорт
КонецПроцедуры

&НаСервере
Функция СформироватьДекларации(ТаблицаАкциза, ГНИ)	
	СтруктураДекларации = ПолучитьСтруктуруДекларации(ТаблицаАкциза, ГНИ);
		
	//ИмяФайла = "Декларация " + ГНИ + ".xml";
	ИмяФайла = СокрЛП(Строка(Организация)) + "_" + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода)) + "_Декларация_" + ГНИ + ".xml"; 
	ПолноеИмяфайла = СокрЛП(КаталогДанных) + "\" + ИмяФайла;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписатьXMLРекурсивно(СтруктураДекларации, ЗаписьXML);
	
	ЗаписьXML.Закрыть();
	
	Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеФайла.Имя = ПолноеИмяфайла;
	ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(Двоичное);
	
	Возврат ОписаниеФайла;
КонецФункции

&НаСервере
Процедура СформироватьДодатки(ТаблицаАкциза, ГНИ, МассивДокументов)
	СписокКПП = ТаблицаАкциза.Скопировать();
	СписокКПП.Свернуть("КПП", "ОкругленнаяСуммаАкциза");
	СписокКПП.Сортировать("КПП");
	Номер = 0;
	
	Для Каждого СтрКПП Из СписокКПП Цикл
		Номер = Номер +1;
		
		МассивДанныхКПП = ТаблицаАкциза.НайтиСтроки(Новый Структура("КПП", СтрКПП.КПП));
		ТаблицаДанныхКПП = ТаблицаАкциза.Скопировать(МассивДанныхКПП);
		ТаблицаДанныхКПП.Свернуть("Акциз", "СуммаСНДС, СуммаАкцизногоНалога, СуммаВсего, ОкругленнаяСуммаАкциза");
		ТаблицаДанныхКПП.Сортировать("Акциз");
		
		СтруктураДодатка = ПолучитьСтруктуруДодатка(ТаблицаДанныхКПП, ГНИ,СтрКПП.КПП, Номер);		
			
		ИмяФайла = СокрЛП(Строка(Организация)) + "_" + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода)) + "_Додаток_" + ГНИ + "_КПП_" + СтрКПП.КПП + ".xml"; 
		ПолноеИмяфайла = СокрЛП(КаталогДанных) + "\" + ИмяФайла;
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");

		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
	
		ЗаписатьXMLРекурсивно(СтруктураДодатка, ЗаписьXML);
	
		ЗаписьXML.Закрыть();
		
		Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеФайла.Имя = ПолноеИмяфайла;
		ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(Двоичное);
		
		МассивДокументов.Добавить(ОписаниеФайла);

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлРасхождений(ТаблицаАкцизаПолная, МассивДокументов)
	ТаблицаАкцизаПолная.Свернуть("ГНИ, КПП", "СуммаСНДС, СуммаАкцизногоНалога, ОкругленнаяСуммаАкциза");
	ТаблицаАкцизаПолная.Сортировать("ГНИ, КПП");	
	ТаблицаАкцизаПолная.Колонки.Добавить("Разница");
	
	Для Каждого Стр Из ТаблицаАкцизаПолная Цикл
		ОкругленнаяСумма = Окр(Стр.ОкругленнаяСуммаАкциза, 0, РежимОкругления.Окр15как20);
		Стр.ОкругленнаяСуммаАкциза = ОкругленнаяСумма;
		Стр.Разница = Стр.СуммаАкцизногоНалога - ОкругленнаяСумма;
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = Обработки.ФормированиеДекларацийИзЗКС.ПолучитьМакет("Разница");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтогов = Макет.ПолучитьОбласть("ИтоговаяСтрока");
	
	ТабДокумент.Вывести(ОбластьШапка);
	Для Каждого Стр Из ТаблицаАкцизаПолная Цикл
		ОбластьСтрока.Параметры.Заполнить(Стр);
		
		КодГНИ = Число(Стр.ГНИ);
		СтрТабл = Объект.ТаблицаНалоговых.НайтиСтроки(Новый Структура("ГНИ",КодГНИ));
		
		Если СтрТабл.Количество() <> 0 Тогда
			ОбластьСтрока.Параметры.ИмяНалоговой = СтрТабл[0].ИмяНалоговой;	
		КонецЕсли;	
		
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтогов.Параметры.СуммаОтчет = ТаблицаАкцизаПолная.Итог("СуммаАкцизногоНалога");
	ОбластьИтогов.Параметры.СуммаДекларация = ТаблицаАкцизаПолная.Итог("ОкругленнаяСуммаАкциза");
	ОбластьИтогов.Параметры.Разница = ТаблицаАкцизаПолная.Итог("Разница");
	
	ТабДокумент.Вывести(ОбластьИтогов);
	
	ИмяФайла = СокрЛП(Строка(Организация)) + "_" + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода)) + "_Расхождения.xlsx"; 
	ПолноеИмяФайла = КаталогДанных + "\" + ИмяФайла;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XLSX");
	ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеФайла.Имя = ПолноеИмяфайла;
	ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(Двоичное);
	
	МассивДокументов.Добавить(ОписаниеФайла);

КонецПроцедуры

&НаСервере
Процедура СформироватьФайлИтоговый(ТаблицаАкцизаПолная, МассивДокументов)
		
	ТабДокумент = Новый ТабличныйДокумент;
	
	СхемаКомпоновкиДанных = Обработки.ФормированиеДекларацийИзЗКС.ПолучитьМакет("ОтчетПоГруппаАкциза");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
	// - Если сделать так, как показано выше(рекомендуют на некоторых ресурсах), то при изменении настроек в режиме клиента
	// этих изменений Вы не увидите, потому что настройки всегда будут по умолчанию. Как правильно - вариант ниже
	//Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ТаблицаАкцизаПолная.Колонки.Добавить("Район");
	
	Для Каждого Стр Из ТаблицаАкцизаПолная Цикл
		
		КодГНИ = Число(Стр.ГНИ);
		СтрТабл = Объект.ТаблицаНалоговых.НайтиСтроки(Новый Структура("ГНИ",КодГНИ));
		
		Если СтрТабл.Количество() <> 0 Тогда
			Стр.Район = СтрТабл[0].Район;	
		КонецЕсли;	
		
	КонецЦикла;

	ВнешнийНаборДанных = Новый Структура("тзТаблица", ТаблицаАкцизаПолная); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ТабДокумент.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ТабДокумент); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);


	ИмяФайла = СокрЛП(Строка(Организация)) + "_" + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода)) + "_ОтчетПоГруппамАкциза.xlsx"; 
	ПолноеИмяФайла = КаталогДанных + "\" + ИмяФайла;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XLSX");
	ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
	
	ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеФайла.Имя = ПолноеИмяфайла;
	ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(Двоичное);
	
	МассивДокументов.Добавить(ОписаниеФайла);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьXMLРекурсивно(Структура, ЗаписьXML)
	Для Каждого Параметр Из Структура Цикл
		ИмяУзла = Параметр.Ключ;
		ЗначениеУзла = Параметр.Значение;
		ЗначениеСтруктура =  ТипЗнч(ЗначениеУзла) = Тип("Структура") ИЛИ ТипЗнч(ЗначениеУзла) = Тип("Соответствие");
		
		Если ИмяУзла = "Атрибуты" Тогда
			Если ЗначениеСтруктура Тогда
				Для Каждого Атрибут Из ЗначениеУзла Цикл
					ЗаписьXML.ЗаписатьАтрибут(Атрибут.Ключ, Атрибут.Значение);
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли ИмяУзла = "Параметры" Тогда
			Если ЗначениеСтруктура Тогда
				ЗаписатьXMLРекурсивно(ЗначениеУзла, ЗаписьXML);
			Иначе			
				ЗаписьXML.ЗаписатьТекст(Строка(ЗначениеУзла));
			КонецЕсли;
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяУзла);
			Если ЗначениеСтруктура Тогда
				ЗаписатьXMLРекурсивно(ЗначениеУзла, ЗаписьXML);
			Иначе
				ЗаписьXML.ЗаписатьТекст(Строка(ЗначениеУзла));
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекст()
	
	Если РегионХарьков Тогда
		Текст = "ВЫБРАТЬ
		        |	ГруппыАкциза.ГруппаТовара КАК ГруппаТовара,
		        |	ГруппыАкциза.ГруппаАкциза КАК ГруппаАкциза
		        |ПОМЕСТИТЬ ВТ
		        |ИЗ
		        |	&ГруппыАкциза КАК ГруппыАкциза
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ВложенныйЗапрос.ГНИ КАК ГНИ,
		        |	ВложенныйЗапрос.КПП КАК КПП,
		        |	СУММА(ВЫРАЗИТЬ(ВложенныйЗапрос.СуммаСНДС КАК ЧИСЛО(15, 2))) КАК СуммаСНДС,
		        |	СУММА(ВложенныйЗапрос.СуммаАкцизногоНалога) КАК СуммаАкцизногоНалога,
		        |	СУММА(ВложенныйЗапрос.СуммаВсего) КАК СуммаВсего,
		        |	ВложенныйЗапрос.Акциз КАК Акциз,
		        |	ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаСНДС) * 0.05 КАК ЧИСЛО(15, 3)) КАК ОкругленнаяСуммаАкциза
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		ЗКСТовары.Ссылка.Организация КАК Организация,
		        |		ЗКСТовары.Ссылка.ПодразделениеКомпании КАК Подразделение,
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.Код, ""0"") КАК КПП,
		        |		ВЫБОР
		        |			КОГДА ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код МЕЖДУ ""2030"" И ""2038""
		        |				ТОГДА 2033
		        |			ИНАЧЕ ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код, ""0"")
		        |		КОНЕЦ КАК ГНИ,
		        |		ЗКСТовары.Номенклатура КАК Номенклатура,
		        |		ЗКСТовары.Номенклатура.Родитель КАК Родитель,
		        |		ЗКСТовары.СтавкаНДС КАК СтавкаНДС,
		        |		СУММА(ЗКСТовары.СуммаВсего - ЗКСТовары.СуммаАкцизногоНалога) КАК СуммаСНДС,
		        |		СУММА(ЗКСТовары.СуммаАкцизногоНалога) КАК СуммаАкцизногоНалога,
		        |		СУММА(ЗКСТовары.СуммаВсего) КАК СуммаВсего,
		        |		ВЫБОР
		        |			КОГДА ВТ.ГруппаАкциза ЕСТЬ NULL
		        |				ТОГДА """"
		        |			ИНАЧЕ ВТ.ГруппаАкциза
		        |		КОНЕЦ КАК Акциз
		        |	ИЗ
		        |		Документ.ТК_ЗакрытиеСменыЗКС.Товары КАК ЗКСТовары
		        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		        |			ПО ЗКСТовары.Номенклатура.Родитель = ВТ.ГруппаТовара
		        |	ГДЕ
		        |		ЗКСТовары.Ссылка.Проведен
		        |		И НЕ ЗКСТовары.Ссылка.ПометкаУдаления
		        |		И ЗКСТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
		        |		И ЗКСТовары.Ссылка.Организация = &Организация
		        |	
		        |	СГРУППИРОВАТЬ ПО
		        |		ЗКСТовары.Номенклатура,
		        |		ЗКСТовары.СтавкаНДС,
		        |		ЗКСТовары.Ссылка.Организация,
		        |		ЗКСТовары.Ссылка.ПодразделениеКомпании,
		        |		ЗКСТовары.Номенклатура.Родитель,
		        |		ВЫБОР
		        |			КОГДА ВТ.ГруппаАкциза ЕСТЬ NULL
		        |				ТОГДА """"
		        |			ИНАЧЕ ВТ.ГруппаАкциза
		        |		КОНЕЦ,
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.Код, ""0""),
		        |		ВЫБОР
		        |			КОГДА ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код МЕЖДУ ""2030"" И ""2038""
		        |				ТОГДА 2033
		        |			ИНАЧЕ ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код, ""0"")
		        |		КОНЕЦ) КАК ВложенныйЗапрос
		        |ГДЕ
		        |	ВложенныйЗапрос.Акциз <> """"
		        |	И ВложенныйЗапрос.СуммаАкцизногоНалога > 0
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВложенныйЗапрос.ГНИ,
		        |	ВложенныйЗапрос.КПП,
		        |	ВложенныйЗапрос.Акциз";
	Иначе 
		Текст = "ВЫБРАТЬ
		        |	ГруппыАкциза.ГруппаТовара КАК ГруппаТовара,
		        |	ГруппыАкциза.ГруппаАкциза КАК ГруппаАкциза
		        |ПОМЕСТИТЬ ВТ
		        |ИЗ
		        |	&ГруппыАкциза КАК ГруппыАкциза
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		        |	ВложенныйЗапрос.ГНИ КАК ГНИ,
		        |	ВложенныйЗапрос.КПП КАК КПП,
		        |	СУММА(ВЫРАЗИТЬ(ВложенныйЗапрос.СуммаСНДС КАК ЧИСЛО(15, 2))) КАК СуммаСНДС,
		        |	СУММА(ВложенныйЗапрос.СуммаАкцизногоНалога) КАК СуммаАкцизногоНалога,
		        |	СУММА(ВложенныйЗапрос.СуммаВсего) КАК СуммаВсего,
		        |	ВложенныйЗапрос.Акциз КАК Акциз,
		        |	ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаСНДС) * 0.05 КАК ЧИСЛО(15, 3)) КАК ОкругленнаяСуммаАкциза
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		ЗКСТовары.Ссылка.Организация КАК Организация,
		        |		ЗКСТовары.Ссылка.ПодразделениеКомпании КАК Подразделение,
		        |		ЗКСТовары.Ссылка.ТорговаяПлощадка КАК ТорговаяПлощадка,
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.Код, ""0"") КАК КПП,
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код, ""0"") КАК ГНИ,
		        |		ЗКСТовары.Номенклатура КАК Номенклатура,
		        |		ЗКСТовары.Номенклатура.Родитель КАК Родитель,
		        |		ЗКСТовары.СтавкаНДС КАК СтавкаНДС,
		        |		СУММА(ЗКСТовары.СуммаВсего - ЗКСТовары.СуммаАкцизногоНалога) КАК СуммаСНДС,
		        |		СУММА(ЗКСТовары.СуммаАкцизногоНалога) КАК СуммаАкцизногоНалога,
		        |		СУММА(ЗКСТовары.СуммаВсего) КАК СуммаВсего,
		        |		ВЫБОР
		        |			КОГДА ВТ.ГруппаАкциза ЕСТЬ NULL
		        |				ТОГДА """"
		        |			ИНАЧЕ ВТ.ГруппаАкциза
		        |		КОНЕЦ КАК Акциз
		        |	ИЗ
		        |		Документ.ТК_ЗакрытиеСменыЗКС.Товары КАК ЗКСТовары
		        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		        |			ПО ЗКСТовары.Номенклатура.Родитель = ВТ.ГруппаТовара
		        |	ГДЕ
		        |		ЗКСТовары.Ссылка.Проведен
		        |		И НЕ ЗКСТовары.Ссылка.ПометкаУдаления
		        |		И ЗКСТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
		        |		И ЗКСТовары.Ссылка.Организация = &Организация
		        |	
		        |	СГРУППИРОВАТЬ ПО
		        |		ЗКСТовары.Номенклатура,
		        |		ЗКСТовары.СтавкаНДС,
		        |		ЗКСТовары.Ссылка.Организация,
		        |		ЗКСТовары.Ссылка.ПодразделениеКомпании,
		        |		ЗКСТовары.Номенклатура.Родитель,
		        |		ВЫБОР
		        |			КОГДА ВТ.ГруппаАкциза ЕСТЬ NULL
		        |				ТОГДА """"
		        |			ИНАЧЕ ВТ.ГруппаАкциза
		        |		КОНЕЦ,
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.НалоговаяИнспекция.Код, ""0""),
		        |		ЕСТЬNULL(ЗКСТовары.Ссылка.СкладКомпании.ТерриторияПоКОАТУУ.Код, ""0""),
		        |		ЗКСТовары.Ссылка.ТорговаяПлощадка) КАК ВложенныйЗапрос
		        |ГДЕ
		        |	ВложенныйЗапрос.Акциз <> """"
		        |	И ВложенныйЗапрос.СуммаАкцизногоНалога > 0
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ВложенныйЗапрос.ГНИ,
		        |	ВложенныйЗапрос.КПП,
		        |	ВложенныйЗапрос.Акциз";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуАкциза()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекст();
	Запрос.УстановитьПараметр("ГруппыАкциза", Объект.ПринадлежностьКГруппамАкциза.Выгрузить());
	Запрос.УстановитьПараметр("НачДата", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонДата", КонецДня(КонецПериода));	
	Запрос.УстановитьПараметр("Организация", Организация);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДекларации(ТаблицаАкциза, ГНИ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОрганизацииКонтактнаяИнформация.Тип КАК Тип,
	                      |	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
	                      |	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	                      |	ОрганизацииКонтактнаяИнформация.Страна КАК Страна,
	                      |	ОрганизацииКонтактнаяИнформация.Регион КАК Регион,
	                      |	ОрганизацииКонтактнаяИнформация.Город КАК Город,
	                      |	ОрганизацииКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	                      |	ОрганизацииКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	                      |	ОрганизацииКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	                      |	ОрганизацииКонтактнаяИнформация.ДействуетС КАК ДействуетС,
	                      |	ОрганизацииКонтактнаяИнформация.Значение КАК Значение
	                      |ИЗ
	                      |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	                      |ГДЕ
	                      |	ОрганизацииКонтактнаяИнформация.Ссылка.Ссылка = &Объект");
	
	Запрос.УстановитьПараметр("Объект", Организация);
	КонтактнаяИнформация = Запрос.Выполнить().Выгрузить();
	
	//DECLAR
	КорневойУзел = Новый Структура;
		
		//Атрибуты DECLAR
		КорАтрибуты = Новый Соответствие;
		КорАтрибуты.Вставить("xsi:noNamespaceSchemaLocation", "J0295608.XSD");
		КорАтрибуты.Вставить("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		
		//Параметры DECLAR
		КорПараметры = Новый Структура;
		
			//DECLARHEAD	
			
			//Параметры DECLARHEAD
			
			тГНИ = Формат(ГНИ,"ЧН=0; ЧГ=");
			тГни = Лев(тГНИ, 2);
			тПараметры = Новый Структура;
			тПараметры.Вставить("TIN", СокрЛП(Организация.КодПоЕДРПОУ)); 
			тПараметры.Вставить("C_DOC", "J02");
			тПараметры.Вставить("C_DOC_SUB", "095");
			тПараметры.Вставить("C_DOC_VER", "10");
			тПараметры.Вставить("C_DOC_TYPE", "0");
			тПараметры.Вставить("C_DOC_CNT", "1");
			тПараметры.Вставить("C_REG", тГни);
			тПараметры.Вставить("C_RAJ", Прав(ГНИ, 2));
			тПараметры.Вставить("PERIOD_MONTH", Месяц(НачалоПериода));
			тПараметры.Вставить("PERIOD_TYPE", "1");
			тПараметры.Вставить("PERIOD_YEAR", Строка(Формат(Год(НачалоПериода), "ЧДЦ=; ЧГ=")));
			тПараметры.Вставить("C_STI_ORIG", Формат(ГНИ,"ЧН=0; ЧГ="));
			тПараметры.Вставить("C_DOC_STAN", "1");
			тПараметры.Вставить("D_FILL", Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));	
			
		КорПараметры.Вставить("DECLARHEAD", Новый Структура("Атрибуты, Параметры", Неопределено, тПараметры));
			
			//DECLARBODY
			
			//Параметры DECLARBODY
			СтандартныйАтрибут = Новый Соответствие;
			СтандартныйАтрибут.Вставить("xsi:nil", "true");
			
			тПараметры = Новый Структура;
			тПараметры.Вставить("HZ", "1");
			тПараметры.Вставить("HZM", Месяц(НачалоПериода));
			тПараметры.Вставить("HZY", Формат(Год(НачалоПериода), "ЧГ="));
			тПараметры.Вставить("HZMP", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("HZYP", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("HNAME", СокрЛП(Организация.НаименованиеПолное));
			тПараметры.Вставить("HTIN", СокрЛП(Организация.КодПоЕДРПОУ));
			тПараметры.Вставить("H00G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G7", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G8", "1");
			тПараметры.Вставить("H00G9", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G10", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G11", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("H00G12", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			Если НЕ КонтактнаяИнформация.Количество()= 0 Тогда
				ПредставлениеАдреса = КонтактнаяИнформация[0].Представление;
				тПараметры.Вставить("HLOC", СокрЛП(ПредставлениеАдреса));
				
				Индекс = Лев(КонтактнаяИнформация[0].Представление, 5);
				тПараметры.Вставить("HZIP", СокрЛП(Индекс));
			КонецЕсли;
			
			
			тПараметры.Вставить("HTEL", "7591759");
			тПараметры.Вставить("HFAX", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("HEMAIL", "medoc@digma.ua");
			
			
			СтрНалоговой = Объект.ТаблицаНалоговых.НайтиСтроки(Новый Структура("ГНИ", Число(ГНИ)));
			Если СтрНалоговой.Количество() <> 0 Тогда
				тПараметры.Вставить("HSTI", СокрЛП(СтрНалоговой[0].ИмяНалоговой));
			КонецЕсли;
			
			тПараметры.Вставить("R100101G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100103G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100113G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100201G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100301G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100401G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100403G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100410G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100420G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100430G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100440G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100501G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100503G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100510G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100520G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100530G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100601G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100603G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100701G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100703G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100801G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100901G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R100903G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101000G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			тПараметры.Вставить("R101011G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101013G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101021G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101023G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101100G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R101111G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101113G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101121G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101123G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101200G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R101211G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101213G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101221G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101223G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101301G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));			
			тПараметры.Вставить("R101401G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101404G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101501G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101504G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101600G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R101610G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101620G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101630G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101640G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101650G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101700G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R101710G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101720G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R101730G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200101G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200102G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200201G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200202G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200301G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200302G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200310G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200320G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200330G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200340G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200401G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200402G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200410G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200420G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200501G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200502G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200601G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200602G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200701G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200702G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R200800G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			
			тПараметры.Вставить("R200815G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200825G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200900G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R200911G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200912G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200921G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R200922G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201000G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R201011G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201012G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201021G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201022G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201101G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201102G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R201104G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R201200G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));   				//Новый
			
			тПараметры.Вставить("R201300G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			//тПараметры.Вставить("R201400G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
            тПараметры.Вставить("R201410G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300101G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300201G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300301G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300310G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300320G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300330G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300340G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300401G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300410G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300420G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300430G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300440G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300501G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300601G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300701G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300801G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R300901G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301001G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R301011G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));  //Новый
			
			тПараметры.Вставить("R301100G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R301111G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301121G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301131G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301204G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
            тПараметры.Вставить("R301304G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301404G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301504G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301604G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R301704G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			//тПараметры.Вставить("R301800G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R400101G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400201G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400210G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400220G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400230G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400240G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400301G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400310G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400320G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400330G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400340G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400401G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400501G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400601G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400701G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400800G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));
			тПараметры.Вставить("R400811G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R400821G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));			
			тПараметры.Вставить("R400904G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R401000G4", Новый Структура("Атрибуты, Параметры", Неопределено, "0"));                //Новый
			тПараметры.Вставить("R401010G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			тПараметры.Вставить("R401020G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый		
			тПараметры.Вставить("R401030G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			тПараметры.Вставить("R401040G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			тПараметры.Вставить("R401050G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый		
			тПараметры.Вставить("R401060G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый
			тПараметры.Вставить("R401070G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено)); //Новый		


			
			ОбщСуммаАкциза = ТаблицаАкциза.Итог("ОкругленнаяСуммаАкциза");			
			ОбщСуммаАкциза = Окр(ОбщСуммаАкциза, 0, РежимОкругления.Окр15как20);
			тПараметры.Вставить("R500100G4", Формат(ОбщСуммаАкциза, "ЧГ="));
			
			СписокКПП = ТаблицаАкциза.Скопировать();
			СписокКПП.Свернуть("КПП", "ОкругленнаяСуммаАкциза");
			
			НомерСтроки = 0;
			Для Каждого СтрКПП Из СписокКПП Цикл
				НомерСтроки = НомерСтроки + 1;
				тПараметры.Вставить("T1RXXXXG2", Новый Структура("Атрибуты, Параметры", Новый Структура("ROWNUM", Строка(НомерСтроки)), СтрКПП.КПП));
				тПараметры.Вставить("T1RXXXXG4", Новый Структура("Атрибуты, Параметры", Новый Структура("ROWNUM", Строка(НомерСтроки)), Формат(Окр(СтрКПП.ОкругленнаяСуммаАкциза, 0, РежимОкругления.Окр15как20), "ЧГ=")));
			КонецЦикла;			
			
			тПараметры.Вставить("R600107G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R600110G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R600120G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			//тПараметры.Вставить("R600207G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			//тПараметры.Вставить("R600210G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			//тПараметры.Вставить("R600220G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R01G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R01G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R01G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R02G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R02G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R02G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R03G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R03G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R03G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R04G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R04G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R04G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R05G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R05G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R05G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R06G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R06G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R06G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R07G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R07G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R07G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R08G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R08G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R08G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R09G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R09G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R09G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R010G1", Новый Структура("Атрибуты, Параметры", Неопределено, "1"));
			тПараметры.Вставить("R010G2", Новый Структура("Атрибуты, Параметры", Неопределено, "1"));
			тПараметры.Вставить("R010G3", Новый Структура("Атрибуты, Параметры", Неопределено, "1"));
			
			тПараметры.Вставить("R011G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R011G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R011G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("R012G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R012G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R012G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));

			тПараметры.Вставить("R013G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R013G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R013G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));

			тПараметры.Вставить("R014G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R014G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R014G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));

			тПараметры.Вставить("R015G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R015G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R015G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));

			тПараметры.Вставить("R016G1", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R016G2", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R016G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			
			тПараметры.Вставить("HFILL", Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));
			тПараметры.Вставить("HDATE1", Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));
			
			Руководитель=ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Организация);
			ГлавныйБухгалтер=ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Организация);
							
			тПараметры.Вставить("HBOS", Врег(Строка(Руководитель)));
			тПараметры.Вставить("HKBOS", Руководитель.Код);
			
			тПараметры.Вставить("HDATE2",Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));
			тПараметры.Вставить("HBUH", Врег(Строка(ГлавныйБухгалтер)));
			тПараметры.Вставить("HKBUH", ГлавныйБухгалтер.Код);

						
		КорПараметры.Вставить("DECLARBODY", Новый Структура("Атрибуты, Параметры", Неопределено, тПараметры));		
		
	КорневойУзел.Вставить("DECLAR", Новый Структура("Атрибуты, Параметры", КорАтрибуты, КорПараметры));
	
	Возврат КорневойУзел;
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДодатка(ТаблицаДанныхКПП, ГНИ,КПП,НомерДодатка)
	СтруктураАкциза = Новый Структура;	
	
	Для Каждого Акциз Из ГруппыАкциза Цикл
		СтрокаАкциза = ТаблицаДанныхКПП.Найти(Акциз.Значение, "Акциз");
		СтруктураАкциза.Вставить(Акциз.Значение, ?(СтрокаАкциза = Неопределено, Новый Структура("СуммаСНДС,ОкругленнаяСуммаАкциза, СуммаАкцизногоНалога, СуммаВсего",0, 0, 0, 0), СтрокаАкциза));
	КонецЦикла;
	
	//DECLAR
	КорневойУзел = Новый Структура;
		
		//Атрибуты DECLAR
		КорАтрибуты = Новый Соответствие;
		КорАтрибуты.Вставить("xsi:noNamespaceSchemaLocation", "J0295607.XSD");
		КорАтрибуты.Вставить("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		
		//тПараметры DECLAR
		КорПараметры = Новый Структура;
		
			//DECLARHEAD	
			
			//тПараметры DECLARHEAD
			тГНИ = Формат(ГНИ,"ЧН=0; ЧГ=");
			тГНИ = Лев(тГНИ, 2);

			тПараметры = Новый Структура;
			тПараметры.Вставить("TIN", СокрЛП(Организация.КодПоЕДРПОУ)); 
			тПараметры.Вставить("C_DOC", "J02");
			тПараметры.Вставить("C_DOC_SUB", "956");
			тПараметры.Вставить("C_DOC_VER", "10");
			тПараметры.Вставить("C_DOC_TYPE", "0");
			тПараметры.Вставить("C_DOC_CNT", "1");
			тПараметры.Вставить("C_REG", тГНИ);
			тПараметры.Вставить("C_RAJ", Прав(ГНИ, 2));
			тПараметры.Вставить("PERIOD_MONTH", Месяц(НачалоПериода));
			тПараметры.Вставить("PERIOD_TYPE", "1");
			тПараметры.Вставить("PERIOD_YEAR", Строка(Формат(Год(НачалоПериода), "ЧДЦ=; ЧГ=")));
			тПараметры.Вставить("C_STI_ORIG", Формат(ГНИ,"ЧН=0; ЧГ="));
			тПараметры.Вставить("C_DOC_STAN", "1");
			тПараметры.Вставить("D_FILL", Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));	
			
		КорПараметры.Вставить("DECLARHEAD", Новый Структура("Атрибуты, Параметры", Неопределено, тПараметры));
			
			//DECLARBODY
			
			//тПараметры DECLARBODY
			СтандартныйАтрибут = Новый Соответствие;
			СтандартныйАтрибут.Вставить("xsi:nil", "true");
			
			тПараметры = Новый Структура;
			Если РегионХарьков Тогда
				тПараметры.Вставить("H02G2S", "Д1."+НомерДодатка);
			Иначе
				тПараметры.Вставить("H02G2S", "Д1.1");
			КонецЕсли;
			тПараметры.Вставить("HZM", Месяц(НачалоПериода));
			тПараметры.Вставить("HZY", Формат(Год(НачалоПериода), "ЧГ="));
			тПараметры.Вставить("HKOATUU", СокрЛП(КПП));
			тПараметры.Вставить("HKATOTTG", СокрЛП(КПП));

			Алкоголь = СтруктураАкциза.Алкоголь;			
			тПараметры.Вставить("R011G3", ФорматироватьЧисло(Алкоголь.СуммаСНДС));
			тПараметры.Вставить("R011G4", "5");
			тПараметры.Вставить("R011G5", ФорматироватьЧисло(Алкоголь.ОкругленнаяСуммаАкциза));
			
			Вино = СтруктураАкциза.Вино;			
			тПараметры.Вставить("R012G3", ФорматироватьЧисло(Вино.СуммаСНДС));
			тПараметры.Вставить("R012G4", "5");
			тПараметры.Вставить("R012G5", ФорматироватьЧисло(Вино.ОкругленнаяСуммаАкциза));
			
			Пиво = СтруктураАкциза.Пиво;
			тПараметры.Вставить("R013G3", ФорматироватьЧисло(Пиво.СуммаСНДС));
			тПараметры.Вставить("R013G4", "5");
			тПараметры.Вставить("R013G5", ФорматироватьЧисло(Пиво.ОкругленнаяСуммаАкциза));
			
			Табак = СтруктураАкциза.Табак;
			тПараметры.Вставить("R014G3", ФорматироватьЧисло(Табак.СуммаСНДС));
			тПараметры.Вставить("R014G4", "5");
			тПараметры.Вставить("R014G5", ФорматироватьЧисло(Табак.ОкругленнаяСуммаАкциза));
			
			СуммаАкциза = ТаблицаДанныхКПП.Итог("ОкругленнаяСуммаАкциза");
			
			тПараметры.Вставить("R01G5", ФорматироватьЧисло(Окр(СуммаАкциза, 2, РежимОкругления.Окр15как20)));
			
			тПараметры.Вставить("R021G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R021G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R021G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R021G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R022G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R022G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R022G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R022G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R023G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R023G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R023G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R023G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R024G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R024G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R024G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R024G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R025G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R025G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R025G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R025G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R026G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R026G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R026G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R026G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R027G3", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R027G4", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R027G5", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));
			тПараметры.Вставить("R027G6", Новый Структура("Атрибуты, Параметры", СтандартныйАтрибут, Неопределено));

			тПараметры.Вставить("R02G6", "0");
			тПараметры.Вставить("R001G6", ФорматироватьЧисло(Окр(СуммаАкциза, 0, РежимОкругления.Окр15как20))); 
			
			тПараметры.Вставить("HDATE1", Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));
			
			Руководитель=ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Организация);
			ГлавныйБухгалтер=ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Организация);
					
			тПараметры.Вставить("HBOS", Врег(Строка(Руководитель)));
			тПараметры.Вставить("HKBOS", Руководитель.Код);
			
			тПараметры.Вставить("HDATE2",Формат(ТекущаяДата(), "ДФ=ddMMyyyy"));
			тПараметры.Вставить("HBUH", Врег(Строка(ГлавныйБухгалтер)));
			тПараметры.Вставить("HKBUH", ГлавныйБухгалтер.Код);
			
		КорПараметры.Вставить("DECLARBODY", Новый Структура("Атрибуты, Параметры", Неопределено, тПараметры));		
	КорневойУзел.Вставить("DECLAR", Новый Структура("Атрибуты, Параметры", КорАтрибуты, КорПараметры));
	
	Возврат КорневойУзел;
КонецФункции


//Действия формы
Функция ФорматироватьЧисло(Значение)
	Возврат Формат(Значение, "ЧРД=.; ЧГ=");
КонецФункции
