
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "ТарифыКоммунальныхУслуг", Объект.Ссылка);
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "АбонплатыКоммунальныхУслуг", Объект.Ссылка);
	Элементы.ГруппаАбонплата.Видимость = Объект.АбонПлата;
	ОформлениеТЧ_Потребители();
КонецПроцедуры

&НаСервере
Процедура ОформлениеТЧ_Потребители();
	Для Каждого строка из Объект.Потребители Цикл
		Потребитель = строка.Потребитель;
		Если ТипЗнч(Потребитель) = Тип("СправочникСсылка.ТорговыеПлощадки") Тогда
			строка.ИндексКартинки = 8;
			строка.Код = Потребитель.Код;
			строка.Контрагент = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Потребитель, ТекущаяДата()).Контрагент;
		ИначеЕсли ТипЗнч(Потребитель) = Тип("СправочникСсылка.ТочкиДоставки") Тогда
			строка.ИндексКартинки = 5;
			строка.Код = Потребитель.Global_ID;
			строка.Контрагент = Потребитель.Владелец;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура АбонПлатаПриИзменении(Элемент)
	Элементы.ГруппаАбонплата.Видимость = Объект.АбонПлата;
КонецПроцедуры
