Функция ПолучитьСоставНастроек() Экспорт
	
	СоставНастроек = Новый Структура;
	СоставНастроек.Вставить("НастройкаПользователя1", "НастройкаПользователя1");
	Возврат СоставНастроек;
	
КонецФункции


Функция ПолучитьНастройкиПользователя(ИдентификаторЧата) Экспорт
	
	НастройкиПользователя = Новый Структура;
	
	СоставНастроек = ПолучитьСоставНастроек();
	Если ИдентификаторЧата = Неопределено Тогда
		Для Каждого КлючИЗначение ИЗ СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
			Возврат НастройкиПользователя;
		КонецЦикла;
	КонецЕсли;
	
	// Сборка текста запроса
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из СоставНастроек Цикл
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "Р." + КлючИЗначение.Ключ + " КАК " + КлючИЗначение.Значение;
	КонецЦикла;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|" + ТекстЗапроса + "
	|ИЗ РегистрСведений.ТелеграмНастройкиПользователей КАК Р
	|ГДЕ Р.ИдентификаторЧата = &ИдентификаторЧата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Для Каждого КлючИЗначение ИЗ СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
			Возврат НастройкиПользователя;
		КонецЦикла;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Для Каждого КлючИЗначение Из СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Выборка[КлючИЗначение.Ключ]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиПользователя;
	
КонецФункции