
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрСсылка) И Параметры.ПараметрСсылка.Проведен Тогда
		Отчет.Волна = Параметры.ПараметрСсылка;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланАктивности.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланАктивности КАК ПланАктивности
		|ГДЕ
		|	ПланАктивности.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Отчет.Волна = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Отчет.Волна.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности") Тогда
		спОтчеты.Добавить("Ленточки",,Истина,БиблиотекаКартинок.Отчеты);
		спОтчеты.Добавить("Премия",,Истина,БиблиотекаКартинок.РазделФинансы16);
		спОтчеты.Добавить("Итого",,Истина,БиблиотекаКартинок.Сумма);
	Иначе
		спОтчеты.Добавить("Выполнение","Выполнение плана",Истина,БиблиотекаКартинок.Отчеты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Каталог = КаталогДокументов();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКнигу(Книга,Представление)
	
	ИмяФайла = СтрЗаменить(СокрЛП(Отчет.Волна),":","`") + " " + Представление + " " + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd") +".XlsX";
	
	ПолноеИмяФайла = Каталог + "\" + ИмяФайла;
	
	Попытка
		Если ТипЗнч(Книга) = Тип("ПакетОтображаемыхДокументов") Тогда
			Книга.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		Иначе
			Книга.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		КонецЕсли;
	Исключение
		ВсЁОк = Ложь;
		ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ВидОтчета)
	Возврат Отчеты.ВыполнениеПлановАктивности.СформироватьОтчет(Отчет.Волна,ВидОтчета,Ложь);
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Для Каждого стрОтчет Из спОтчеты Цикл
		Если стрОтчет.Пометка Тогда
			Книга = СформироватьНаСервере(стрОтчет.Значение);
			СохранитьКнигу(Книга,стрОтчет.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Каталог = Каталог; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок = "Выберите каталог"; 
	//Если пользователь не нажал кнопку ОТМЕНА в диалоге
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВолнаПриИзменении(Элемент)
	ВолнаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВолнаПриИзмененииНаСервере()
	спОтчеты.Очистить();
	Если Отчет.Волна.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности") Тогда
		спОтчеты.Добавить("Ленточки",,Истина,БиблиотекаКартинок.Отчеты);
		спОтчеты.Добавить("Премия",,Истина,БиблиотекаКартинок.РазделФинансы16);
		спОтчеты.Добавить("Итого",,Истина,БиблиотекаКартинок.Сумма);
	Иначе
		спОтчеты.Добавить("Выполнение","Выполнение плана",Истина,БиблиотекаКартинок.Отчеты);
	КонецЕсли;
КонецПроцедуры


