
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ПриКопировании(ОбъектКопирования)
	Владелец = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УжеЕстьТерритория = Справочники.ТерриторииИсполнителей.УжеЕстьТерритория(Владелец, Ссылка);
	Если УжеЕстьТерритория Тогда
		ОбщегоНазначения.СообщитьПользователю("У сотрудника " + Владелец + " уже есть территория.");
		Отказ = Истина;
	КонецЕсли;
	Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Запрещено помечать на удаление элемент.");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли