



// Возвращает список узлов плана обмена
//
Функция МассивУзловДляРегистрации() Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбмена.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменТК_Center КАК УзлыОбмена
	|ГДЕ
	|	 НЕ УзлыОбмена.Ссылка = &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменТК_Center.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

Функция МассивУзловБухгалтерия() Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменБухгалтерия.Ссылка КАК Узел
	               |ИЗ
	               |	ПланОбмена.ОбменБухгалтерия КАК ОбменБухгалтерия
	               |ГДЕ
	               |	НЕ ОбменБухгалтерия.Ссылка = &ЭтотУзел
	               |	И НЕ ОбменБухгалтерия.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменБухгалтерия.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

// Возвращает список узлов плана обмена
//
Функция МассивУзловКонсолицадия() Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменConsolidation.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменConsolidation КАК ОбменConsolidation
	|ГДЕ
	|	НЕ ОбменConsolidation.Ссылка = &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменConsolidation.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

Функция МассивУзловЗУП() Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменZUP.Ссылка КАК Узел
	               |ИЗ
	               |	ПланОбмена.ОбменZUP КАК ОбменZUP
	               |ГДЕ
	               |	НЕ ОбменZUP.Ссылка = &ЭтотУзел";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменZUP.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

Функция ПолучитьУзелОбменаТК_Центр() Экспорт
	
	Возврат ПланыОбмена.ОбменТК_Center.УзелОбменаТКЦентр();
	
КонецФункции

	