
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(объект.ДатаНачала) тогда
		ДатаНачалаТекущейАкции = объект.ДатаНачала;//объект.Промоакция.ДатаНачала;
		СекундВДне = 60*60*24;	
		плюсОдинДень = 1;
		ВыбКоличествоДней=13;
		объект.ДатаОкончания =  НачалоДня(ДатаНачалаТекущейАкции+ВыбКоличествоДней*СекундВДне);
		установитьНаименование ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 установитьНаименование ();
КонецПроцедуры

&НаСервере
процедура установитьНаименование ()
	//текОбъект = РеквизитФормыВЗначение("Объект");
	//текОбъект.сформироватьНаименование ();
	Если ЗначениеЗаполнено(Объект.Код) тогда
		Объект.Наименование = "Промо №"+Строка(Число(Объект.Код))+", с "+Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy")+" по "+Формат(Объект.ДатаОкончания,"ДФ=dd.MM.yyyy");
	иначе
		Объект.Наименование = "Промо, с "+Формат(Объект.ДатаНачала,"ДФ=dd.MM.yyyy")+" по "+Формат(Объект.ДатаОкончания,"ДФ=dd.MM.yyyy");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Закрыта тогда
		Если позволеныАдминистративныеФункцииПромоакций () тогда
			Элементы.Наименование.ТолькоПросмотр = ложь;
		иначе			
			Элементы.Наименование.ТолькоПросмотр = Объект.Закрыта;	
		КонецЕсли;
		
	КонецЕсли;
	Элементы.Наименование.ТолькоПросмотр = Объект.Закрыта;
	Элементы.ДатаНачала.ТолькоПросмотр = Объект.Закрыта;
	Элементы.ДатаОкончания.ТолькоПросмотр = Объект.Закрыта;
КонецПроцедуры

&НаСервере
функция позволеныАдминистративныеФункцииПромоакций ()
	предикат1 = ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.ПолныеПрава)
			ИЛИ  ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.АдминистрированиеПромоакций);
	возврат предикат1;
КонецФункции

&НаКлиенте
Процедура УправлениеПромоакцией(Команда)
	параметрыФормы = новый структура("парПромоакция",объект.Ссылка);
	ф = ОткрытьФорму("Обработка.УправлениеПромоакциями.Форма.Форма",параметрыФормы);
КонецПроцедуры
