#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Результат.Добавить("Код");
	Результат.Добавить("Подразделение");
	Результат.Добавить("Объект");
	Результат.Добавить("ВалютаДенежныхСредств");
	Результат.Добавить("ЗаводскойНомер");
	Результат.Добавить("ФискальныйНомер");
	Результат.Добавить("АлкогольнаяЛицензия");
	Результат.Добавить("ДатаОкончанияАлкогольнойЛицензии");

	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ЭтоГруппа
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ 
	|			ЗначениеРазрешено(Организация)
	|			И ЗначениеРазрешено(Подразделение)
	|			И ЗначениеРазрешено(Объект)	
	|	КОНЕЦ";
		
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти


Функция ПолучитьКассуККМзвНомер(звНомер,Организация)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассыККМ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.ЗаводскойНомер = &ЗаводскойНомер
		|	И КассыККМ.Организация = &Организация
		|	И КассыККМ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЗаводскойНомер", звНомер);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.КассыККМ.ПустаяСсылка();
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	КассаККМ = ВыборкаДетальныеЗаписи.Ссылка;
	
	Возврат КассаККМ
	
КонецФункции


Функция ВернутьКассуККМ_Фок(знач звНомер,знач фсНомер,знач ТоргПлощадка,Знач Организация = Неопределено)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.ЗаводскойНомер = &ЗаводскойНомер
	|	И КассыККМ.Объект = &ТорговаяПлощадка
	|	И КассыККМ.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассыККМ.Организация = &Организация
	|		КОНЕЦ
	|	И КассыККМ.ФискальныйНомер = &ФискальныйНомер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КассыККМ.Ссылка
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.ЗаводскойНомер = &_ЗаводскойНомер
	|	И КассыККМ.Объект = &ТорговаяПлощадка
	|	И КассыККМ.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассыККМ.Организация = &Организация
	|		КОНЕЦ
	|	И КассыККМ.ФискальныйНомер = &ФискальныйНомер";
	
	Запрос.УстановитьПараметр("ЗаводскойНомер", звНомер);
	Запрос.УстановитьПараметр("ФискальныйНомер", фсНомер);

	Запрос.УстановитьПараметр("_ЗаводскойНомер", "_"+звНомер);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТоргПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.КассыККМ.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	КассаККМ = ВыборкаДетальныеЗаписи.Ссылка;
	
	Возврат КассаККМ

	
КонецФункции


#КонецОбласти


#КонецЕсли
