
Функция ВыполнитьЗагрузку(ХранилищеСообщенияОбмена,Key)
	
	 
	
	ОтветСтруктура = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML(Key,"ExchangeUO_Download",ХранилищеСообщенияОбмена);
	
		
	типXDTO = ФабрикаXDTO.Тип("http://www.digma.ua/xml-exchenge","MessageExchange");
	ОтветXDTO = ФабрикаXDTO.Создать(типXDTO);
	
	ЗаполнитьЗначенияСвойств(ОтветXDTO,ОтветСтруктура);
	
	Возврат  ОтветXDTO;
	
КонецФункции

Функция SendData(PravilaKD, Parametry, ContinueOb, Status)
	
	Возврат ТК_ОбменДаннымиСервер.СформироватьПакетДанных(PravilaKD,Parametry, ContinueOb, Status);
	
КонецФункции

Функция RegDoc()
	Возврат ТК_ОбменCentr.ЗарегистрироватьИзменения();
КонецФункции

Функция DelRegDoc()
	Возврат ТК_ОбменCentr.УдалитьРегистрацию();
КонецФункции


