
&НаСервереБезКонтекста
Процедура ЗапуститьНаСервере()
	Обработки.ОбработкаАссортиментногоКомитета.ОбработатьАссортиментныйКомитет();
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиНаСервере(НаДату)
	Обработки.ОбработкаАссортиментногоКомитета.ВывестиРаспроданныйТовар(НаДату);
КонецПроцедуры

&НаКлиенте
Процедура Вывести(Команда)
	ВывестиНаСервере(Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата = ТекущаяДата();
КонецПроцедуры
