
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	СкладОтбор = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Склад")).Значение;
	ДатаОтбор  = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата")).Значение;

	Подразделение = СкладОтбор.Подразделение;
	ЭтоБаффет 		= ОбменФронтПовтИсп.ЭтоПодрзаделениеБафит(Подразделение);
	ЭтоФабрикаСыра 	= ОбменФронтПовтИсп.ЭтоПодразделениеФабрикаСыра(Подразделение);	
	
	Если ТипЗнч(ДатаОтбор) = Тип("Дата") Тогда
		ПараметрДата = ДатаОтбор;
	Иначе
		ПараметрДата = ДатаОтбор.Дата;
	КонецЕсли;
	
	ДатаОтбора = Формат(ПараметрДата, "ДФ=yyyy-MM-dd");
			
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СкладКод"),СкладОтбор.Код);	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтбор"),ДатаОтбора);	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачало"), НачалоДня(ПараметрДата));	
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЭтоАттика"), Не ЭтоБаффет И Не ЭтоФабрикаСыра);	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЭтоБаффет"), ЭтоБаффет);	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЭтоФабрикаСыра"), ЭтоФабрикаСыра);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры
