
&НаКлиенте
Процедура Назад(Команда)
	Элементы.Загрузка.Видимость = Ложь;
	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.Основная;
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаСервере(ШтрихКод)
	Карточка = Справочники.Карточки.СоздатьЭлемент();
	Карточка.ДатаСоздания = ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода,ТекущаяДата());
	Карточка.ОкончаниеДействия = КонецПериода;
	Карточка.ТипДисконтнойКарты = ТипКарты;
	Карточка.ШтрихКод = ШтрихКод;
	Карточка.Наименование = ШтрихКод;
	Карточка.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакет()
	ТабличныйДокумент = Справочники.Карточки.ПолучитьМакет("Макет");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементы(Команда)
	Если ТабличныйДокумент.ВысотаТаблицы = 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для загрузки!");
	КонецЕсли;
	
	ИтогСоздано = 0;
	
	Для Стр = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		тШтрихКод = СокрЛП(ТабличныйДокумент.Область(Стр, 1).Текст);
		Если СтрДлина(тШтрихКод) < 13 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("В строке "+стр+" некорректно указан штрихкод карточки "+тШтрихКод +", проверьте правильность заполнения!");
			Продолжить;
		КонецЕсли;
		
		СоздатьЭлементыНаСервере(тШтрихКод);
		
		ИтогСоздано = ИтогСоздано+1;
		
	КонецЦикла;
	ОбщегоНазначенияКлиент.СообщитьПользователю("Создано "+ИтогСоздано+" записей!");
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Элементы.Загрузка.Видимость = Истина;
	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.Загрузка;
	
	ЗаполнитьМакет();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьМакет();
КонецПроцедуры
