
&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ЗаполнитьНаименованиеПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)

	ЗаполнитьНаименованиеПоУмолчанию();
	
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьНаименованиеПоУмолчанию()
	
	НаименованиеПоУмолчанию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Сертификат %1 %2'; uk = 'Сертифікат %1 %2'"),
									?(Не ПустаяСтрока(Объект.Номер), "№"+Объект.Номер, ""),
									?(ЗначениеЗаполнено(Объект.ДатаВыдачи), 
											НСтр("ru = 'выдан '; uk = 'виданий '") + Формат(Объект.ДатаВыдачи, "ДФ=dd.MM.yy"),
											""));
											
	Объект.Наименование = СокрЛП(НаименованиеПоУмолчанию);
	
КонецПроцедуры


