#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом



#КонецОбласти




#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаГрафикЗаказов(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаГрафикЗаказов(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТК_ГрафикиЗаказов";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТК_ГрафикЗаказов.Ссылка КАК Ссылка,
	               |	ТК_ГрафикЗаказов.Дата КАК Период,
	               |	ТК_ГрафикЗаказов.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_ГрафикЗаказов.Договор КАК Договор,
	               |	ТК_ГрафикЗаказов.Контрагент КАК Контрагент,
	               |	ТК_ГрафикЗаказов.Подписан КАК Подписан,
	               |	ТК_ГрафикЗаказов.ПериодичностьЗаказа КАК ПериодичностьЗаказа,
	               |	ТК_ГрафикЗаказов.ДниНедели КАК ДниНедели,
	               |	ТК_ГрафикЗаказов.КоличествоДнейПериодичности КАК КоличествоДнейПериодичности,
	               |	ТК_ГрафикЗаказов.ПериодичностьПоДнямНедели КАК ПериодичностьПоДнямНедели,
	               |	ТК_ГрафикЗаказов.СрокПоставки КАК СрокПоставки,
	               |	ТК_ГрафикЗаказов.РегламентЗаказа КАК РегламентЗаказа,
	               |	ТК_ГрафикЗаказов.ВремяОтправкиЗаказа КАК ВремяОтправкиЗаказа,
	               |	ТК_ГрафикЗаказов.СуммаМинимальногоЗаказа КАК СуммаМинимальногоЗаказа,
	               |	ТК_ГрафикЗаказов.КоличествоМинимальногоЗаказа КАК КоличествоМинимальногоЗаказа,
	               |	ТК_ГрафикЗаказов.Миксация КАК Миксация,
	               |	ТК_ГрафикЗаказов.ЧерезТСД КАК ЧерезТСД
	               |ИЗ
	               |	Документ.ТК_ГрафикЗаказов КАК ТК_ГрафикЗаказов
	               |ГДЕ
	               |	ТК_ГрафикЗаказов.Ссылка = &Ссылка";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы
//
// Параметры:
//	Запрос				- Запрос - запрос, параметры которого предварительно установлены.
//	ТекстыЗапроса		- Список значений - в списке перечислены тексты запросов и их имена.
//	Таблицы				- Структура - структура в которую будут помещены полученные таблицы для движений.
//	ДобавитьРазделитель	- Булево - Истина, если нужно добавить разделитель ";" между запросами.
//	ДобавлятьСловоТаблица	- Булево - Истина, если к имени таблицы движений нужно вначало добавить слово "Таблица"
//
Процедура ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы, ДобавитьРазделитель = Ложь, ДобавлятьСловоТаблица = Истина, ТолькоОтмеченные=Ложь) Экспорт
	
	ТаблицыЗапроса = ОбщегоНазначенияТК.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, ДобавитьРазделитель);
	
	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) И (Не ТолькоОтмеченные Или ТекстЗапроса.Пометка) Тогда

			Если ДобавлятьСловоТаблица Тогда
				// Таблицы для проведения должны начинаться с "Таблица"
				Если НЕ СтрНачинаетсяС(ИмяТаблицы, "Таблица") Тогда
					ИмяТаблицы = "Таблица" + ИмяТаблицы;
				КонецЕсли;
			КонецЕсли;
			
			Таблицы.Вставить(ИмяТаблицы, ТаблицыЗапроса[ТекстЗапроса.Представление]);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


#КонецОбласти





#КонецЕсли