

#Область ПодпискиНаСобытия

Процедура ОбменБух_ПриЗаписиДокумента(Источник, Отказ) Экспорт
	
	Регистрировать = Истина;
	
	Если Источник.ОбменДанными.Загрузка 
		ИЛИ (Источник.ДополнительныеСвойства.ЭтоНовый И Не Источник.РегламентированныйУчет)
		ИЛИ Отказ Тогда
		
		Регистрировать = Ложь;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВыпускПродукции") И Источник.ХозОперация <> Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда	
		Регистрировать = Ложь;
	КонецЕсли;	
	
	Если Регистрировать Тогда 
		ЗарегистрироватьИзменения(Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьИзменения(Ссылка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУзлов = ТК_ОбменCentrПовтИсп.МассивУзловБухгалтерия();
	
	Если МассивУзлов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Ссылка);
	
КонецПроцедуры


#КонецОбласти

