
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.НовоеСостояние.СписокВыбора.Добавить(Перечисления.СтатусыСборкиРезервов.СогласованоСБ,"Согласовано");
	Элементы.НовоеСостояние.СписокВыбора.Добавить(Перечисления.СтатусыСборкиРезервов.ОтклоненоСБ,"Отклонено");
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументПеремещение(Отменить = Ложь,ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка 
		НачатьТранзакцию();
		ДокументРасходОбъект = ДокументСсылка.ПолучитьОбъект();
		
		Если Отменить Тогда
			Если НЕ ДокументРасходОбъект.ПометкаУдаления Тогда
				ДокументРасходОбъект.УстановитьПометкуУдаления(Истина);	
			КонецЕсли;
		Иначе
			Если Не ДокументРасходОбъект.Проведен Тогда
				ДокументРасходОбъект.ПометкаУдаления = Ложь;
				ДокументРасходОбъект.Дата = ТекущаяДатаСеанса();
				ДокументРасходОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки");
				ДокументРасходОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			КонецЕсли;
		КонецЕсли;
		
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеТоваров.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			|ГДЕ
			|	ПеремещениеТоваров.ДокументОтгрузки = &ДокументОтгрузки";
			
			Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументСсылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДокументОбъектПриход = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если Отменить Тогда
					Если НЕ ДокументОбъектПриход.ПометкаУдаления Тогда
						ДокументОбъектПриход.УстановитьПометкуУдаления(Истина);	
					КонецЕсли;
				Иначе
					Если Не ДокументОбъектПриход.Проведен Тогда
						ДокументОбъектПриход.ПометкаУдаления = Ложь;
						ДокументОбъектПриход.Дата = ТекущаяДатаСеанса();
						ДокументОбъектПриход.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
					КонецЕсли;
	
				КонецЕсли;
				
			КонецЦикла;
			
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;

	
КонецПроцедуры



&НаСервере
Процедура УстановитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(НовоеСостояние) Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажите новое состояние",,"НовоеСостояние");
		Возврат;
	КонецЕсли;
	
	
	ВыделенныеСтроки = Элементы.ДокументыОтказРекламации.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбран документ для обновления статуса");
		Возврат;
	КонецЕсли;
	
	СтруктураСостояния = Новый Структура;
	СтруктураСостояния.Вставить("Состояние", НовоеСостояние);
	СтруктураСостояния.Вставить("АвторИзменения", Пользователи.ТекущийПользователь().ФизическоеЛицо);
	СтруктураСостояния.Вставить("ТорговаяПлощадка", Справочники.ТорговыеПлощадки.ПустаяСсылка());
	СтруктураСостояния.Вставить("ДатаПоследнегоИзменения", ТекущаяДатаСеанса());
	  ОтменаРекламации = НовоеСостояние = Перечисления.СтатусыСборкиРезервов.ОтклоненоСБ;
	Для Каждого Стр Из ВыделенныеСтроки Цикл
		РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(стр.ссылка,СтруктураСостояния,Истина);
		РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(стр.ссылка,СтруктураСостояния,Истина);
		ОбработатьДокументПеремещение(ОтменаРекламации,стр.ссылка);
	КонецЦикла;	
	
	Элементы.ДокументыОтказРекламации.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НовоеСостояние = Элементы.НовоеСостояние.СписокВыбора[0].Значение;
КонецПроцедуры
