
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивДокументов = ОбработкаОбъект.МассивДокументовЗагрузки();
	
	Для Каждого Стр Из МассивДокументов Цикл 
		СписокПКО.Добавить(Стр,, Ложь);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьОбменНаСервере(ТипОбмена, МассивДок)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	ОбработкаОбъект.ЗагрузитьДанные(ТипОбмена,МассивДок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОчиститьСообщения();
	
	МассивДок = Новый Массив;
	
	Для Каждого Стр Из СписокПКО Цикл 
		Если Стр.Пометка Тогда 
			МассивДок.Добавить(Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДок.Количество() > 0 Тогда 
		ВыполнитьОбменНаСервере("ЗагрузкаДокументы_ФС", МассивДок);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет выбранных правил ПКО");	
	КонецЕсли;
	
КонецПроцедуры

