
&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПользователях.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
		|ГДЕ
		|	СведенияОПользователях.ДатаПоследнейАктивности >= &ДатаЗапрета
		|	И СведенияОПользователях.Пользователь ССЫЛКА Справочник.Пользователи
		|	И СведенияОПользователях.Пользователь.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаЗапрета", КонецДня(ТекущаяДатаСеанса()-60*60*24*30));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'"));
		Возврат;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	СтрокаАдрес = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
			ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДетальныеЗаписи.Пользователь,ВидКИ);

			Если ПустаяСтрока(ЭлАдрес) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("Тема",Тема);
	ПараметрыПисьма.Вставить("Тело",Тело);
	
	Письмо =	РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОчиститьСообщения();
	//
	//Если ПустаяСтрока(Объект.теТема.
	                              
	ОтправитьПисьмоНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Готово");
	Закрыть();
КонецПроцедуры
