
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем





#КонецОбласти


Функция ПолучитьСкладСборкиСотрудника(Сотрудник)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СборщикиРезервов.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.СборщикиРезервов КАК СборщикиРезервов
		|ГДЕ
		|	СборщикиРезервов.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() тогда
		Возврат  Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	СкладСборки = ВыборкаДетальныеЗаписи.Склад;
	
	Возврат СкладСборки;
	
КонецФункции



#КонецОбласти



#КонецЕсли


