///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Номенклатура";
	Набор.Идентификатор = Новый УникальныйИдентификатор("c7cd91d8-6f8a-4d10-82bf-c6fba8475a98");		
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Организации";
	Набор.Идентификатор = Новый УникальныйИдентификатор("132cf01b-7716-4923-9ce7-b27e4c4f355c");
	
	//Документ возврат от покупателя
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ВозвратОтПокупателя";
	Набор.Идентификатор = Новый УникальныйИдентификатор("4077e9fb-c8d8-11e9-a203-005056bf05ac");

	//Документ возврат поставщику
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ВозвратПоставщику";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb22e-c572-11e9-a203-005056bf74c9");

	//Документ заказ поставщику
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ЗаказПоставщику";
	Набор.Идентификатор = Новый УникальныйИдентификатор("e6a3fda7-da04-11e9-a208-005056bf1857");

	//Документ заказ покупателя
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ЗаказПокупателя";
	Набор.Идентификатор = Новый УникальныйИдентификатор("e218ea31-8153-46f6-b9f5-21324b85da60");
	
	//Документ заказ поставщику
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_РезервированиеЗаказовПокупателя";
	Набор.Идентификатор = Новый УникальныйИдентификатор("26c634d0-9f5a-47e6-b760-36ce3134275a");

	//Документ инвентаризация
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_Инвентаризация";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cf42e9ae-d072-11e9-a206-005056bf1857");

	//Документ поступление безналичных денежных средств
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ПоступлениеБезналичныхДенежныхСредств";
	Набор.Идентификатор = Новый УникальныйИдентификатор("2af3762f-ff04-11e9-a210-005056bf1857");

	//Документ поступление товаров
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ПоступлениеТоваров";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb237-c572-11e9-a203-005056bf74c9");

	//Документ приходный кассовый ордер
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ПриходныйКассовыйОрдер";
	Набор.Идентификатор = Новый УникальныйИдентификатор("fc5ae438-fa62-11e9-a211-005056bf05ac");

	//Документ протокол согласования цен
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ПротоколСогласованияЦен";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb239-c572-11e9-a203-005056bf74c9");

	//Документ расходный кассовый ордер
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_РасходныйКассовыйОрдер";
	Набор.Идентификатор = Новый УникальныйИдентификатор("1692a2b9-fc90-11e9-a210-005056bf1857");

	//Документ реализация товаров
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "_НеИспользуется1";
	Набор.Идентификатор = Новый УникальныйИдентификатор("277f2ffb-c59d-11e9-a203-005056bf74c9");
	Набор.Используется = Ложь;
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_РеализацияТоваров";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("277f2ffb-c59d-11e9-a214-005056bf74c9");

		ДочернийНабор = Набор.Строки.Добавить();
		ДочернийНабор.Имя = "Документ_РеализацияТоваров_ТТН";
		ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("20e217a7-5a63-4ccb-8cad-258f01476bd4");	
			
		ДочернийНабор = Набор.Строки.Добавить();                      
		ДочернийНабор.Имя = "Документ_РеализацияТоваров_Общие";
		ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("6679a9c5-ffc1-4edb-8919-4f8683f412cb");	

	//Документ списание безналичных денежных средств
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_СписаниеБезналичныхДенежныхСредств";
	Набор.Идентификатор = Новый УникальныйИдентификатор("2fe2a355-0170-11ea-a210-005056bf1857");

	//Документ списание товаров
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_СписаниеТоваров";
	Набор.Идентификатор = Новый УникальныйИдентификатор("5b8aca82-c410-4cca-b54c-01079cde1a3a");
	
	//Документ Изменение цен
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ИзменениеЦен";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb238-c572-11e9-a203-005056bf74c9");
	
	//Документ Изменение цен
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_Рецептура";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb238-c572-11e9-a206-115056bf76c9");	
	
	//Справочник банковские счета контрагентов
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_БанковскиеСчетаКонтрагентов";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb231-c572-11e9-a203-005056bf74c9");

	//Справочник банковские счета организаций
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_БанковскиеСчетаОрганизаций";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb234-c572-11e9-a203-005056bf74c9");

	//Справочник контрагенты
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Контрагенты";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb235-c572-11e9-a203-005056bf74c9");

	//Справочник подразделения компании
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ПодразделенияКомпании";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb233-c572-11e9-a203-005056bf74c9");

	//Справочник склады компании
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_СкладыКомпании";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb230-c572-11e9-a203-005056bf74c9");

	//Справочник статьи ддс
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_СтатьиДДС";
	Набор.Идентификатор = Новый УникальныйИдентификатор("83f966d9-f964-11e9-a211-005056bf05ac");

	//Справочник торговые площадки
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ТорговыеПлощадки";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb22f-c572-11e9-a203-005056bf74c9");

	//Справочник физические лица
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ФизическиеЛица";
	Набор.Идентификатор = Новый УникальныйИдентификатор("cb4bb22d-c572-11e9-a203-005056bf74c9");

	//Справочник точки доставки
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ТочкиДоставки";
	Набор.Идентификатор = Новый УникальныйИдентификатор("0d63a696-bd66-47f7-9ce7-edf673804903");

	//Справочник Группы Пользователей
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ГруппыПользователей";
	Набор.Идентификатор = Новый УникальныйИдентификатор("0d63a696-bd66-49f8-6ce5-edf883804903");	
		
	//Документ ТК_ЗаказПокупателяКазначейсвто
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ТК_ЗаказПокупателяКазначейсвто";
	Набор.Идентификатор = Новый УникальныйИдентификатор("46ca796e-e59a-4081-a1e9-9dce1f2001a8");
	
	//Документ ТК_ТТН
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "_НеИспользуется0";
	Набор.Идентификатор = Новый УникальныйИдентификатор("4c684daa-5657-4a0c-9504-754080d3b88a");
	Набор.Используется = Ложь;
		
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ТК_ТТН";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("4c684daa-5700-4a0c-9504-754080d3b00f");
	
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Документ_ТК_ТТН_Логистика";
	ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("4c684daa-5700-4a0c-9504-754080d3b01f");	
		
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Документ_ТК_ТТН_Общие";
	ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("4c684daa-5700-4a1c-9504-754080d3b02f");	
	
	//Документ ТК_НалоговаяНакладная
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ТК_НалоговаяНакладная";
	Набор.Идентификатор = Новый УникальныйИдентификатор("3c685dab-5657-4a0d-9505-755090d5b89a");
	
	//Документ ТК_Приложение2КНалоговойНакладной
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ТК_Приложение2КНалоговойНакладной";
	Набор.Идентификатор = Новый УникальныйИдентификатор("2c696dab-4824-3a1d-9515-756090d5b89a");
	
	//Документ КонсолидированныеОстаткиОрганизации
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_КонсолидированныеОстаткиОрганизации";
	Набор.Идентификатор = Новый УникальныйИдентификатор("5ca99f93-2692-4fd3-8b93-433b5e34aca6");	
	
	//Документ ПланАктивности
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ПланАктивности";
	Набор.Идентификатор = Новый УникальныйИдентификатор("7c9b26de-9965-11eb-a211-005056bcccf8");	
	
	//Справочник ТК_КонтактныеЛица
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ТК_КонтактныеЛица";
	Набор.Идентификатор = Новый УникальныйИдентификатор("56909b51-bba7-4732-bf6c-dd8ed5093161");	
	
	//Справочник ДоговорыКонтрагентов
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ДоговорыКонтрагентов";
	Набор.Идентификатор = Новый УникальныйИдентификатор("56909b52-bba7-4934-bf6c-dd8ed5093161");	
	
	//Документ ВыпускПродукции
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ВыпускПродукции";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("56909b52-bba7-5146-bf7c-dd9ed5113181");	
		
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Документ_ВыпускПродукции_ТТН";
	ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("56909b52-bba7-5146-bf7c-dd9ed5123182");	
		
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Документ_ВыпускПродукции_Общие";
	ДочернийНабор.Идентификатор = Новый УникальныйИдентификатор("56909b52-bba7-5146-bf7c-dd9ed5133183");	
	
	//Документ ОприходованиеТоваров
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ТК_ОприходованиеТоваров";
	Набор.Идентификатор = Новый УникальныйИдентификатор("7c1b36de-1033-11eb-a211-005056bcccf0");	
	
	//Справочник СтатьиДоходовИРасходов
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_СтатьиДоходовИРасходов";
	Набор.Идентификатор = Новый УникальныйИдентификатор("74801b51-bbb7-4970-bf4c-da8ed5091934");	
	
	//Справочник ТоварныеМарки
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_ТоварныеМарки";
	Набор.Идентификатор = Новый УникальныйИдентификатор("8754128b-0d09-40b9-97b3-d13091ed8df3");	
	
КонецПроцедуры

// Получает наименования наборов свойств второго уровня на разных языках.
//
// Параметры:
//  Наименования - Соответствие - представление набора на переданном языке:
//     * Ключ     - Строка - Имя набора свойств. Например, "Справочник_Партнеры_Общие".
//     * Значение - Строка - Наименование набора для переданного кода языка.
//  КодЯзыка - Строка - Код языка. Например, "en".
//
// Пример:
//  Наименования["Справочник_Партнеры_Общие"] = НСтр("ru='Общие'; en='General';", КодЯзыка);
//
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
	
	Наименования["Документ_ВыпускПродукции_ТТН"] 		= НСтр("ru = 'Данные для ТТН'; uk = 'Дані для ТТН'", КодЯзыка);	
	Наименования["Документ_ВыпускПродукции_Общие"] 		= НСтр("ru = 'Общие реквизиты'; uk = 'Загальні реквізити'", КодЯзыка);	
	
	Наименования["Документ_РеализацияТоваров_ТТН"] 		= НСтр("ru = 'Данные для ТТН'; uk = 'Дані для ТТН'", КодЯзыка);	
	Наименования["Документ_РеализацияТоваров_Общие"] 	= НСтр("ru = 'Общие реквизиты'; uk = 'Загальні реквізити'", КодЯзыка);	

	Наименования["Документ_ТК_ТТН_Логистика"] 			= НСтр("ru = 'Данные логистики'; uk = 'Дані логістики'", КодЯзыка);	
	Наименования["Документ_ТК_ТТН_Общие"] 				= НСтр("ru = 'Общие реквизиты'; uk = 'Загальні реквізити'", КодЯзыка);	
	
КонецПроцедуры

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - ЛюбаяСсылка      - ссылка на объект со свойствами.
//               - ФормаКлиентскогоПриложения - форма объекта, к которому подключены свойства.
//               - ДанныеФормыСтруктура - описание объекта, к которому подключены свойства.
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений - с колонками:
//     * Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений -
//     * ОбщийНабор - Булево - Истина, если набор свойств содержит свойства,
//                             общие для всех объектов.
//    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//    // или страница, которая создается, если наборов больше одного без учета
//    // пустого набора, который описывает свойства группы удаленных реквизитов.
//
//    // Если значение Неопределено, значит, использовать значение по умолчанию.
//
//    // Для любой группы управляемой формы.
//     * Высота                   - Число -
//     * Заголовок                - Строка -
//     * Подсказка                - Строка -
//     * РастягиватьПоВертикали   - Булево -
//     * РастягиватьПоГоризонтали - Булево -
//     * ТолькоПросмотр           - Булево -
//     * ЦветТекстаЗаголовка      - Цвет -
//     * Ширина                   - Число -
//     * ШрифтЗаголовка           - Шрифт -
//                    
//    // Для обычной группы и страницы.
//     * Группировка              - ГруппировкаПодчиненныхЭлементовФормы -
//
//    // Для обычной группы.
//     * Отображение              - ОтображениеОбычнойГруппы -
//
//    // Для страницы.
//     * Картинка                 - Картинка -
//     * ОтображатьЗаголовок      - Булево -
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает, получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
//  КлючНазначения   - Неопределено - (начальное значение) - указывает вычислить
//                      ключ назначения автоматически и добавить к значениям свойств
//                      формы КлючНазначенияИспользования и КлючСохраненияПоложенияОкна,
//                      чтобы изменения формы (настройки, положение и размер) сохранялись
//                      отдельно для разного состава наборов.
//                      Например, для каждого вида номенклатуры - свой состав наборов.
//
//                    - Строка - (не более 32 символа) - использовать указанный ключ
//                      назначения для добавления к значениям свойств формы.
//                      Пустая строка - не изменять свойства ключей формы, т.к. они
//                      устанавливается в форме и уже учитывают различия состава наборов.
//
//                    Добавка имеет формат "КлючНаборовСвойств<КлючНазначения>",
//                    чтобы <КлючНазначения> можно было обновлять без повторной добавки.
//                    При автоматическом вычислении <КлючНазначения> содержит хеш
//                    идентификаторов ссылок упорядоченных наборов свойств.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Знач Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки = Тип("ДокументСсылка.ВыпускПродукции") Тогда		
		ЗаполнитьНаборСвойствВыпусковПродукции(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ТК_ТТН") Тогда 
		ЗаполнитьНаборСвойствТТН(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.РеализацияТоваров") Тогда 
		ЗаполнитьНаборСвойствРеализацииТоваров(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьНаборСвойствВыпусковПродукции(ВыпускПродукции, ТипСсылки, НаборыСвойств)
	
	Если ТипЗнч(ВыпускПродукции) = ТипСсылки Тогда
		Объект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ВыпускПродукции, "ХозОперация");
	Иначе
		Объект = ВыпускПродукции;
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда 
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ВыпускПродукции_ТТН");
	КонецЕсли;
	
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ВыпускПродукции_Общие");
		
КонецПроцедуры

Процедура ЗаполнитьНаборСвойствТТН(ТТН, ТипСсылки, НаборыСвойств)
	
	Если ТипЗнч(ТТН) = ТипСсылки Тогда
		Объект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТТН, "ЕстьДанныеЛогистики");
	Иначе
		Объект = ТТН;
	КонецЕсли;	
	
	Если Объект.ЕстьДанныеЛогистики Тогда 
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ТК_ТТН_Логистика");			
	КонецЕсли;
	
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_ТК_ТТН_Общие");	
	
КонецПроцедуры

Процедура ЗаполнитьНаборСвойствРеализацииТоваров(РеализацияТоваров, ТипСсылки, НаборыСвойств)
	
	Если ТипЗнч(РеализацияТоваров) = ТипСсылки Тогда
		Объект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			РеализацияТоваров, "ХозОперация");
	Иначе
		Объект = РеализацияТоваров;
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров Тогда 
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_РеализацияТоваров_ТТН");
	КонецЕсли;
	
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Документ_РеализацияТоваров_Общие");
		
КонецПроцедуры


Процедура ЗаполнитьНаборСвойствПоВидуНоменклатуры(Номенклатура, ТипСсылки, НаборыСвойств)
	
КонецПроцедуры


#КонецОбласти

