

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("ВидСообщения");
	Поля.Добавить("ТекущийСтатус");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	СтандартнаяОбработка = Ложь;
	 
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = Строка(Данные.ТекущийСтатус) +" Исходящее сообщение "+ Данные.ВидСообщения + " №"+Данные.Номер+" от "+Данные.Дата;
	СтандартнаяОбработка = ложь;
КонецПроцедуры
