#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	

Процедура ЗаполнитьРеквизитыТабличнойЧасти(КоллекцияДанных,СтрокиЗаполнения = Неопределено)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтрокиЗаполнения = Неопределено Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить( ,"НомерСтроки,Документ,Отгрузка");
	ИначеЕсли СтрокиЗаполнения.Количество() > 0 Тогда
		ПараметрКоллекция = КоллекцияДанных.Выгрузить(СтрокиЗаполнения ,"НомерСтроки,Документ,Отгрузка");
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтоТабличнаяЧасть = ТипЗнч(КоллекцияДанных) = Тип("ДокументТабличнаяЧасть.ТК_ТТН.Источники") ;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КоллекцияДанных", ПараметрКоллекция);
	
	РеквизитыЗаполнения = "Организация,Контрагент,ТочкаДоставки,Регламент,Автор,Статус";
	
	
	ТекстЗапроса ="ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Таблица.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
	|	Таблица.Документ КАК Документ,
	|	Таблица.Отгрузка КАК Отгрузка
	|ПОМЕСТИТЬ втТаблицаДокументов
	|ИЗ
	|	&КоллекцияДанных КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Если ЭтоТабличнаяЧасть Тогда
		
		ТекстЗапроса= ТекстЗапроса + "
		|ВЫБРАТЬ
		|	втТаблицаДокументов.НомерСтроки КАК НомерСтроки,
		|	ВложенныйЗапрос.Вес КАК Масса
		|ИЗ
		|	втТаблицаДокументов КАК втТаблицаДокументов
		|     &УсловиеВесСоедиение
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		ТекстЗапроса= ТекстЗапроса + "
		|	ВЫБРАТЬ
		|	втТаблицаДокументов.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ПеремещениеТоваров).СкладКомпанииПолучатель.ТочкаДоставки.Владелец
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РеализацияТоваров).Контрагент
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РезервированиеЗаказовПокупателя).Контрагент
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ВыпускПродукции).Контрагент
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ПеремещениеТоваров).СкладКомпанииПолучатель.ТочкаДоставки
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РеализацияТоваров).ТочкаДоставки
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РезервированиеЗаказовПокупателя).ТочкаДоставки
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ВыпускПродукции).ТочкаДоставки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТочкаДоставки,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ПеремещениеТоваров).СкладКомпанииПолучатель.ТочкаДоставки.ПорядокСигаретный
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РеализацияТоваров).ТочкаДоставки.ПорядокСигаретный
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РезервированиеЗаказовПокупателя).ТочкаДоставки.ПорядокСигаретный
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ВыпускПродукции).ТочкаДоставки.ПорядокСигаретный
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Маршрут,
		|	&УсловиеВес КАК УсловиеВес,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ПеремещениеТоваров).РегламентированныйУчет
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РеализацияТоваров).РегламентированныйУчет
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.РезервированиеЗаказовПокупателя).ДокументОснование.РегламентированныйУчет
		|		КОГДА втТаблицаДокументов.Документ ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Документ КАК Документ.ВыпускПродукции).РегламентированныйУчет
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Регламент,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.ПеремещениеТоваров).Автор
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.РеализацияТоваров).Автор
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.ВыпускПродукции).Автор
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Автор,
		|	ВЫБОР
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.ПеремещениеТоваров).Организация
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.РеализацияТоваров
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.РеализацияТоваров).Организация
		|		КОГДА втТаблицаДокументов.Отгрузка ССЫЛКА Документ.ВыпускПродукции
		|			ТОГДА ВЫРАЗИТЬ(втТаблицаДокументов.Отгрузка КАК Документ.ВыпускПродукции).Организация
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Организация,
		|	ТК_СостояниеДокументовИзмененияСрезПоследних.Состояние КАК Статус
		|ИЗ
		|	втТаблицаДокументов КАК втТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_СостояниеДокументовИзменения.СрезПоследних(
		|				,
		|				СсылкаНаОбъект В
		|					(ВЫБРАТЬ
		|						втТаблицаДокументов.Отгрузка
		|					ИЗ
		|						втТаблицаДокументов)) КАК ТК_СостояниеДокументовИзмененияСрезПоследних
		|		ПО (втТаблицаДокументов.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
		|			И (втТаблицаДокументов.Отгрузка = ТК_СостояниеДокументовИзмененияСрезПоследних.СсылкаНаОбъект)
		|
		|&УсловиеВесСоедиение
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
				
	КонецЕсли;
	
	Если СтрокиЗаполнения = Неопределено ИЛИ НЕ СтрокиЗаполнения.Свойство("Масса") Тогда
		ТекстЗапросаВес = "";
		СоединениеВес = "";
		
	Иначе
		ТекстЗапросаВес = "
		|	ВложенныйЗапрос.Вес КАК Масса,";
		
		СоединениеВес   ="
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		РеализацияТоваровТовары.Ссылка КАК ДокументСсылка,
		|		СУММА(РеализацияТоваровТовары.ЕдиницаИзмерения.Вес * РеализацияТоваровТовары.Количество) КАК Вес
		|	ИЗ
		|		Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|	ГДЕ
		|		РеализацияТоваровТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					втТаблицаДокументов.Документ КАК Документ
		|				ИЗ
		|					втТаблицаДокументов КАК втТаблицаДокументов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РеализацияТоваровТовары.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПеремещениеТоваровТовары.Ссылка,
		|		СУММА(ПеремещениеТоваровТовары.ЕдиницаИзмерения.Вес * ПеремещениеТоваровТовары.Количество)
		|	ИЗ
		|		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|	ГДЕ
		|		ПеремещениеТоваровТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					втТаблицаДокументов.Документ КАК Документ
		|				ИЗ
		|					втТаблицаДокументов КАК втТаблицаДокументов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПеремещениеТоваровТовары.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТК_НалоговаяНакладнаяТовары.Ссылка,
		|		СУММА(ТК_НалоговаяНакладнаяТовары.ЕдиницаИзмерения.Вес * ТК_НалоговаяНакладнаяТовары.Количество)
		|	ИЗ
		|		Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
		|	ГДЕ
		|		ТК_НалоговаяНакладнаяТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					втТаблицаДокументов.Документ КАК Документ
		|				ИЗ
		|					втТаблицаДокументов КАК втТаблицаДокументов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТК_НалоговаяНакладнаяТовары.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РезервированиеЗаказовПокупателяТовары.Ссылка,
		|		СУММА(РезервированиеЗаказовПокупателяТовары.ЕдиницаИзмерения.Вес * РезервированиеЗаказовПокупателяТовары.Количество)
		|	ИЗ
		|		Документ.РезервированиеЗаказовПокупателя.Товары КАК РезервированиеЗаказовПокупателяТовары
		|	ГДЕ
		|		РезервированиеЗаказовПокупателяТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					втТаблицаДокументов.Документ КАК Документ
		|				ИЗ
		|					втТаблицаДокументов КАК втТаблицаДокументов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РезервированиеЗаказовПокупателяТовары.Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВыпускПродукцииПродукция.Ссылка,
		|		СУММА(ВыпускПродукцииПродукция.ЕдиницаИзмерения.Вес * ВыпускПродукцииПродукция.Количество)
		|	ИЗ
		|		Документ.ВыпускПродукции.Продукция КАК ВыпускПродукцииПродукция
		|	ГДЕ
		|		ВыпускПродукцииПродукция.Ссылка В
		|				(ВЫБРАТЬ
		|					втТаблицаДокументов.Документ КАК Документ
		|				ИЗ
		|					втТаблицаДокументов КАК втТаблицаДокументов)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВыпускПродукцииПродукция.Ссылка) КАК ВложенныйЗапрос
		|		ПО втТаблицаДокументов.Документ = ВложенныйЗапрос.ДокументСсылка ";
		
		
		Если ЭтоТабличнаяЧасть Тогда
			РеквизитыЗаполнения = "Масса";
		Иначе
			РеквизитыЗаполнения = РеквизитыЗаполнения+",Масса";	
		КонецЕсли;
		
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеВес КАК УсловиеВес,",ТекстЗапросаВес);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеВесСоедиение",СоединениеВес);
	Запрос.Текст =ТекстЗапроса;
	
	
	Если СтрокиЗаполнения <> Неопределено Тогда
		ТЗРезультат = Запрос.Выполнить().Выгрузить();
		
		Если ЭтоТабличнаяЧасть Тогда
			Для Каждого Стр Из ТЗРезультат Цикл
				ЗаполнитьЗначенияСвойств(КоллекцияДанных[Стр.Номерстроки - 1], Стр,РеквизитыЗаполнения);
			КонецЦикла;
			
		Иначе	
			Для Каждого Стр Из ТЗРезультат Цикл
				ЗаполнитьЗначенияСвойств(КоллекцияДанных[Стр.Номерстроки - 1], Стр,РеквизитыЗаполнения);
				КоллекцияДанных[Стр.Номерстроки - 1].Маршрут = Лев(Формат(Стр.Маршрут, "ЧЦ=10; ЧГ="),2);
				КоллекцияДанных[Стр.Номерстроки - 1].СтатусОтгрузки = ПолучитьСтатусОтгрузки(КоллекцияДанных[Стр.Номерстроки - 1]);
				КоллекцияДанных[Стр.Номерстроки - 1].СтатусДокумента = ПолучитьСтатусДокумента(КоллекцияДанных[Стр.Номерстроки - 1].Документ);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Выборка = Запрос.Выполнить().Выбрать();
		Для Н=0 По КоллекцияДанных.Количество()-1 Цикл
			Выборка.Следующий(); 
			ЗаполнитьЗначенияСвойств(КоллекцияДанных[Н], Выборка,  РеквизитыЗаполнения);
			КоллекцияДанных[Н].Маршрут = Лев(Формат(Выборка.Маршрут, "ЧЦ=10; ЧГ="),2);
			КоллекцияДанных[Н].СтатусОтгрузки = ПолучитьСтатусОтгрузки(КоллекцияДанных[Н]);
			КоллекцияДанных[Н].СтатусДокумента = ПолучитьСтатусДокумента(КоллекцияДанных[Н].Документ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИсточникиОтгрузитьВОднуНакладную(СсылкаТТН, тчИсточники, ДокументыСозданы = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателяТовары.Номенклатура КАК Номенклатура,
	|	РезервированиеЗаказовПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	РезервированиеЗаказовПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РезервированиеЗаказовПокупателяТовары.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование КАК ЗаказПокупателя,
	|	РезервированиеЗаказовПокупателяТовары.Количество * РезервированиеЗаказовПокупателяТовары.Коэффициент КАК Количество,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование.ТочкаДоставки КАК ТочкаДоставки,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование.Контрагент КАК ЗаказПокупателяКонтрагент,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование.СкладКомпании КАК СкладКомпании,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование.СкладКомпании.ТипЦенСебестоимости КАК ТипЦен,
	|	РезервированиеЗаказовПокупателяТовары.Ссылка.ДокументОснование.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|ИЗ
	|	Документ.ТК_ТТН.Источники КАК ТТНИсточники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезервированиеЗаказовПокупателя.Товары КАК РезервированиеЗаказовПокупателяТовары
	|		ПО ТТНИсточники.Документ = РезервированиеЗаказовПокупателяТовары.Ссылка
	|ГДЕ
	|	ТТНИсточники.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(ТТНИсточники.Документ) = ТИП(Документ.РезервированиеЗаказовПокупателя)
	|ИТОГИ
	|	МАКСИМУМ(ЗаказПокупателя),
	|	МАКСИМУМ(ЗаказПокупателяКонтрагент)
	|ПО
	|	ТочкаДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаТТН);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	
	ВыборкаЗаказПокупателяТочкаДоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказПокупателяТочкаДоставки.Следующий() Цикл
		ФлагЗК = Истина;
		
		Если ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(ВыборкаЗаказПокупателяТочкаДоставки.ЗаказПокупателяКонтрагент) Тогда 
			ВидПодчиненного = "ПеремещениеТоваров";					
			дОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			ВидПодчиненного = "РеализацияТоваров";
			дОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
		КонецЕсли;
		
		дОбъект.Дата = ПолучитьОперативнуюОтметкуВремени();
		ВыборкаДетальныеЗаписи = ВыборкаЗаказПокупателяТочкаДоставки.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ФлагЗК Тогда
				дОбъект.Заполнить(ВыборкаДетальныеЗаписи.ЗаказПокупателя);
				//дОбъект.ТипЦен = дОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
				дОбъект.Товары.Очистить();
				дОбъект.РаспределениеОтгрузки.Очистить();
				
				Если ВидПодчиненного="РеализацияТоваров" тогда
					Если дОбъект.ДоговорВзаиморасчетов.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Комиссия") Тогда
						дОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РеализацияТоваровКомиссия");
						ДоговорВзаиморасчетов = дОбъект.ДоговорВзаиморасчетов;
					КонецЕсли;
					
					СтруктураДействий.Вставить("ЗаполнитьГруппуЦенообразования",	Новый Структура("Номенклатура","ГруппаЦенообразования"));
					СтруктураДействий.Вставить("ЦеныИзДоговора",ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровТипаЦенПоДоговору(дОбъект));
					СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
					
					//ИначеЕсли ВидПодчиненного="ПеремещениеТоваров" тогда
					//	дОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
					//	ДоговорВзаиморасчетов = ВыборкаДетальныеЗаписи.ДоговорВзаиморасчетов;
					//	дОбъект.ТипЦен = ВыборкаДетальныеЗаписи.ТипЦен;
					//	дОбъект.СкладКомпании = ВыборкаДетальныеЗаписи.СкладКомпании;
					//	дОбъект.ТорговаяПлощадкаПолучатель = Справочники.СкладыКомпании.НайтиПоРеквизиту("ТочкаДоставки",ВыборкаДетальныеЗаписи.ТочкаДоставки).ТорговаяПлощадка;					
				КонецЕсли;
				
				СтруктураПолейДляЗаполненияЦен = Новый Структура;							
				СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(дОбъект));
				СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
				
				ФлагЗК = Ложь;
			КонецЕсли;
			НоваяСтрокаТовары = дОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,ВыборкаДетальныеЗаписи);     
			
			НоваяСтрокаЗаказы = дОбъект.РаспределениеОтгрузки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗаказы,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		дОбъект.РаспределениеОтгрузки.Свернуть("ЗаказПокупателя");
		дОбъект.Товары.Свернуть("Номенклатура, ЕдиницаИзмерения, Коэффициент, ХарактеристикаНоменклатуры, СтавкаНДС, Цена", "Количество, Сумма, СуммаНДС, СуммаВсего, КоличествоБазовое");
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(дОбъект.Товары, СтруктураДействий, Неопределено);
		
		Попытка
			дОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДокументыСозданы = Истина;
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		Если дОбъект.Проведен тогда
			
			Если ВидПодчиненного="ПеремещениеТоваров" Тогда
				Рез = ПолучитьПодчиненные(дОбъект.Ссылка, ВидПодчиненного);
				
				Если Рез.Количество()=0 тогда
					дОбъектПР = Документы[ВидПодчиненного].СоздатьДокумент();   
				Иначе 
					Если Рез.Количество()>1 тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Внимание! Найдено несколько документов ''%1'' для ПР %2'; uk = 'Увага! Знайдено декілька документів ''%1'' для ПР %2'"),
						ВидПодчиненного,
						дОбъект));														
					КонецЕсли;
					
					дОбъектПР = Рез[0].Ссылка.ПолучитьОбъект();
					
					Если дОбъектПР.ПометкаУдаления тогда
						дОбъектПР.УстановитьПометкуУдаления(Ложь);
					ИначеЕсли дОбъектПР.Проведен тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Внимание! Подчиненное ПР ''%1'' для ''%2'' уже есть и проведено'; uk = 'Увага! Підпорядковане ПР ''%1'' для ''%2'' вже створене та проведене'"),
						дОбъектПР, 
						дОбъект));														
						
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 документ ''%2'' для ПР ''%3'''; uk = '%1 документ ''%2'' для ПР ''%3'''"),
				?(дОбъектПР.Ссылка.Пустая(), НСтр("ru = 'Создаем'; uk = 'Створюємо'"), НСтр("ru = 'Изменяем'; uk = 'Змінюємо'")), 
				дОбъектПР,
				дОбъект));																					
				
				дОбъектПР.Заполнить(дОбъект.Ссылка);				
				дОбъектПР.Дата = ПолучитьОперативнуюОтметкуВремени();
				//дОбъектПР.ТорговаяПлощадка = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(дОбъект.СкладКомпании);
				//дОбъектПР.СкладКомпанииПолучатель = Справочники.СкладыКомпании.НайтиПоРеквизиту("ТочкаДоставки",дОбъект.ДокументОснование.ТочкаДоставки);
				//дОбъектПР.ТипЦен = дОбъектПР.СкладКомпанииПолучатель.ТипЦенРозничнойТорговли;
				//дОбъектПР.ПодразделениеКомпании = дОбъектПР.СкладКомпанииПолучатель.Подразделение;
				//дОбъектПР.Организация = Справочники.СкладыКомпании.ОрганизацияСклада(дОбъектПР.СкладКомпанииПолучатель);
				//дОбъектПР.ВхДокНомер = дОбъект.Номер;
				//дОбъектПР.ВхДокДата = дОбъект.Дата;
				
				дОбъектПР.РаспределениеОтгрузки.Очистить();
				
				Попытка
					дОбъектПР.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Попытка
						дОбъектПР.Записать(РежимЗаписиДокумента.Запись);
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Документ ''%1'' не может быть записан!
						|%2'; uk = 'Документ ''%1'' не може бути записаний!
						|%2'"),
						дОбъектПР,
						ОписаниеОшибки()));						
					КонецПопытки; 
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;		                     
	
	Для каждого тсДокументы Из тчИсточники Цикл	
		//костыль 04,04,23 Svat
		//Если ЗначениеЗаполнено(тсДокументы.Документ.ДокументОснование) Тогда
		//	ДокОснование = тсДокументы.Документ.ДокументОснование;
		//ИначеЕсли ТипЗнч(тсДокументы.Документ) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
		//	Попытка
		//		ДокОснование = тсДокументы.Документ.РаспределениеОтгрузки[0]ЗаказПокупателя;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		//конец костыль
		
		тзРез = ПолучитьПодчиненные(тсДокументы.Документ.ДокументОснование);
		Если тзРез.Количество() > 0 тогда
			тсДокументы.Отгрузка = тзРез[0].ПодчиненныйДокумент;
			тсДокументы.СтатусОтгрузки = ПолучитьСтатусОтгрузки(тсДокументы);;
			Если тзРез.Количество() > 1 Тогда 				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Внимание! Найдено несколько документов по заказу ''%1'''; uk = 'Увага! Знайдено декілька документів по замовленню ''%1'''"),
				тсДокументы.Документ));														
				
			КонецЕсли;
		ИначеЕсли тзРез.Количество()=0 Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа ''%1'' подчиненный документ не был найден!'; uk = 'Для документу ''%1'' не знайдений підпорядкований документ!'"),
			тсДокументы.Документ));																	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ИсточникиОтгрузитьРаздельно(СсылкаТТН, тчИсточники, ДокументыСозданы = Ложь) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателя.ДокументОснование КАК ЗаказПокупателя,
	|	ЗаказПокупателя.Проведен КАК Проведен,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ТТНИсточники.Отгрузка КАК Отгрузка
	|ИЗ
	|	Документ.ТК_ТТН.Источники КАК ТТНИсточники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|			ПО РезервированиеЗаказовПокупателя.ДокументОснование = ЗаказПокупателя.Ссылка
	|		ПО ТТНИсточники.Документ = РезервированиеЗаказовПокупателя.Ссылка
	|ГДЕ
	|	ТТНИсточники.Ссылка = &Ссылка
	|	И ТТНИсточники.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаТТН);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	//Для каждого тсДокументы Из тчИсточники Цикл		
	Пока Выборка.Следующий() Цикл 
		
		ТекДокумент = Выборка.ЗаказПокупателя;
		
		Если НЕ Выборка.Проведен Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Резерв ''%1'' не проведен! Нельзя резервировать непроведенные документы'; uk = 'Резерв ''%1'' не проведений! Заборонено резервувати непроведені документи'"),
			ТекДокумент));			
			Продолжить;
		КонецЕсли;
		
		// поищем существующие
		Если ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(Выборка.Контрагент) Тогда 		
			ВидПодчиненного = "ПеремещениеТоваров";
		Иначе
			ВидПодчиненного = "РеализацияТоваров";
		КонецЕсли;
		
		тзРез = ПолучитьПодчиненные(ТекДокумент, ВидПодчиненного);
		
		Если тзРез.Количество() > 0 тогда
			Если тзРез.Количество()>1 тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Внимание! Найдено несколько документов ''%1'' по заказу %2'; uk = 'Увага! Знайдено декілька документів ''%1'' по заказу %2'"),
				ВидПодчиненного,
				ТекДокумент));														
			КонецЕсли;
			
			дОбъект = тзРез[0].ПодчиненныйДокумент.ПолучитьОбъект();
			Если тзРез.Количество()=1 И дОбъект.Проведен И ЗначениеЗаполнено(Выборка.Отгрузка) Тогда
				Продолжить;
			ИначеЕсли дОбъект.ПометкаУдаления тогда
				дОбъект.УстановитьПометкуУдаления(Ложь);
			ИначеЕсли дОбъект.Проведен тогда
				дОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;		
		Иначе
			Если ВидПодчиненного = "ПеремещениеТоваров" Тогда 
				дОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ИначеЕсли ВидПодчиненного = "РеализацияТоваров" Тогда 
				дОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
			КонецЕсли;			
		КонецЕсли;		
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 документ ''%2'' по заказу ''%3'''; uk = '%1 документ ''%2'' по заказу ''%3'''"),
		?(дОбъект.Ссылка.Пустая(), НСтр("ru = 'Создаем'; uk = 'Створюємо'"), НСтр("ru = 'Изменяем'; uk = 'Змінюємо'")), 
		Строка(дОбъект),
		Строка(ТекДокумент)));																					
		
		дОбъект.Заполнить(ТекДокумент);
		дОбъект.Дата = ПолучитьОперативнуюОтметкуВремени(); 
		
		//Если ВидПодчиненного = "ПеремещениеТоваров" Тогда
		//	ДоговорВзаиморасчетов = ТекДокумент.ДоговорВзаиморасчетов;
		//	дОбъект.ТипЦен = ТекДокумент.ТипЦен;
		//	дОбъект.СкладКомпании = ТекДокумент.СкладКомпании;
		//	
		//	СкладПолучатель = Справочники.СкладыКомпании.НайтиПоРеквизиту("ТочкаДоставки",ТекДокумент.ТочкаДоставки);
		//	
		//	дОбъект.ТорговаяПлощадкаПолучатель = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(СкладПолучатель);
		//КонецЕсли;
		
		дОбъект.РаспределениеОтгрузки.Очистить();
		НоваяСтрокаЗаказы = дОбъект.РаспределениеОтгрузки.Добавить();
		НоваяСтрокаЗаказы.ЗаказПокупателя = ТекДокумент;
		
		Если дОбъект.Товары.Количество()=0 тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По заказу ''%1''  ничего не зарезервировано - отгружать нечего!'; uk = 'По замовленню ''%1''  нічого не зарезервовано - відвантажувати нічого!'"), 
			ТекДокумент));																					
			Продолжить;
		КонецЕсли;
		
		//ЗаказХозОперация = ТекДокумент.ХозОперация;
		
		Если НЕ ЗначениеЗаполнено(дОбъект.СкладКомпании) Тогда 			
			дОбъект.СкладКомпании = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойСклад");
		КонецЕсли;		
		
		Если ВидПодчиненного = "РеализацияТоваров" тогда
			Если дОбъект.ДоговорВзаиморасчетов.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Комиссия") Тогда
				дОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РеализацияТоваровКомиссия");
			КонецЕсли;
		ИначеЕсли ВидПодчиненного = "ПеремещениеТоваров" тогда
			дОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");			
		КонецЕсли;
		
		дОбъект.ДокументОснование = ТекДокумент;		
		Попытка
			дОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДокументыСозданы = Истина;
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		Если дОбъект.Проведен тогда
			//тсДокументы.Отгрузка = дОбъект.Ссылка;
			
			Если ВидПодчиненного="ПеремещениеТоваров" Тогда
				Рез = ПолучитьПодчиненные(дОбъект.Ссылка, ВидПодчиненного);				
				Если Рез.Количество() > 0 тогда
					Если Рез.Количество() > 1 тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Внимание! Найдено несколько документов ''%1'' для ПР %2'; uk = 'Увага! Знайдено декілька документів ''%1'' для ПР %2'"),
						ВидПодчиненного,
						Строка(дОбъект)));																										
					КонецЕсли;
					
					дОбъектПР = Рез[0].Ссылка.ПолучитьОбъект();
					
					Если дОбъектПР.Проведен тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Внимание! Подчиненное ПР ''%1'' для ПР ''%2'' уже есть и проведено'; uk = 'Увага! Підпорядковане ПР ''%1'' для ПР ''%2'' вже створене та проведене'"),
						дОбъектПР, 
						дОбъект));														
						Продолжить;
					КонецЕсли;
					
					Если дОбъектПР.ПометкаУдаления тогда
						дОбъектПР.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
				Иначе
					дОбъектПР = Документы.ПеремещениеТоваров.СоздатьДокумент();
				КонецЕсли;
				
				дОбъектПР.Дата = ПолучитьОперативнуюОтметкуВремени(); //ТекущаяДата();				
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 документ ''%2'' для ПР ''%3'''; uk = '%1 документ ''%2'' для ПР ''%3'''"),
				?(дОбъектПР.Ссылка.Пустая(), НСтр("ru = 'Создаем'; uk = 'Створюємо'"), НСтр("ru = 'Изменяем'; uk = 'Змінюємо'")), 
				Строка(дОбъектПР),
				Строка(дОбъект)));																					
				
				дОбъектПР.Заполнить(дОбъект.Ссылка);
				
				//дОбъектПР.СкладКомпании = дОбъект.СкладКомпании.Подразделение;
				//дОбъектПР.СкладПолучатель = Справочники.СкладыКомпании.НайтиПоРеквизиту("ТочкаДоставки",ТекДокумент.ТочкаДоставки);
				//дОбъектПР.ТипЦен = дОбъектПР.СкладПолучатель.ТипЦенРозничнойТорговли;
				//дОбъектПР.ПодразделениеКомпании = дОбъектПР.СкладПолучатель.Подразделение;
				//дОбъектПР.Организация = дОбъектПР.СкладПолучатель.Организация;
				//дОбъектПР.ВхДокНомер = дОбъект.Номер;
				//дОбъектПР.ВхДокДата = дОбъект.Дата;
				
				//дОбъектПР.РаспределениеОтгрузки.Очистить();
				
				Попытка
					дОбъектПР.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Попытка
						дОбъектПР.Записать(РежимЗаписиДокумента.Запись);
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Документ ''%1'' не может быть записан!
						|%2'; uk = 'Документ ''%1'' не може бути записаним!
						|%2'"),
						Строка(дОбъектПР),
						ОписаниеОшибки()));								
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа ''%1'' подчиненный документ не был найден!'; uk = 'Для документу ''%1'' підпорядкований документ не був знайдений!'"),
			ТекДокумент));						
		КонецЕсли;
		
	КонецЦикла;		
	
	Для каждого тсДокументы Из тчИсточники Цикл	
		тзРез = ПолучитьПодчиненные(тсДокументы.Документ.ДокументОснование);
		Если тзРез.Количество() > 0 тогда
			тсДокументы.Отгрузка = тзРез[0].ПодчиненныйДокумент;
			тсДокументы.СтатусОтгрузки = ПолучитьСтатусОтгрузки(тсДокументы);;
			Если тзРез.Количество() > 1 Тогда 				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Внимание! Найдено несколько документов по заказу ''%1'''; uk = 'Увага! Знайдено декілька документів по замовленню ''%1'''"),
				тсДокументы.Документ));														
				
			КонецЕсли;
		ИначеЕсли тзРез.Количество()=0 Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа ''%1'' подчиненный документ не был найден!'; uk = 'Для документу ''%1'' не знайдений підпорядкований документ!'"),
			тсДокументы.Документ));																	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСтатусОтгрузки(Строка) Экспорт 
	
	Отгрузка = Строка.Отгрузка;
	Если ЗначениеЗаполнено(Отгрузка) Тогда
		Если РегистрыСведений.ТК_СостояниеДокументов.ПолучитьАктуальныйСтатусДокумента(Отгрузка) Тогда
			СтатусОтгрузки = 5;
		ИначеЕсли Отгрузка.Проведен Тогда
			СтатусОтгрузки = 5;
		ИначеЕсли Отгрузка.ПометкаУдаления Тогда
			СтатусОтгрузки = 6;
		Иначе
			СтатусОтгрузки = 0;
		КонецЕсли;
	Иначе
		Если ТипЗнч(Строка.Документ)=Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.Документ.ДокументОснование) Тогда 
				Если ПолучитьПодчиненные(Строка.Документ.РаспределениеОтгрузки[0].ЗаказПокупателя).Количество()>0 Тогда
					СтатусОтгрузки = 2;
				Иначе 
					СтатусОтгрузки = -1;
				КонецЕсли;
			Иначе
				Если ПолучитьПодчиненные(Строка.Документ.ДокументОснование).Количество()>0 Тогда
					СтатусОтгрузки = 2;
				Иначе 
					СтатусОтгрузки = -1;
				КонецЕсли;				
			КонецЕсли;
		Иначе
			СтатусОтгрузки = -1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусОтгрузки;
	
КонецФункции

Функция ПолучитьСтатусДокумента(Документ) Экспорт 
	
	Если ЗначениеЗаполнено(Документ) Тогда
		Если Документ.Проведен Тогда
			СтатусОтгрузки = 0;
		ИначеЕсли Документ.ПометкаУдаления Тогда
			СтатусОтгрузки = 2;
		Иначе
			СтатусОтгрузки = 1;
		КонецЕсли;
	Иначе
		СтатусОтгрузки = 1;
	КонецЕсли;
	
	Возврат СтатусОтгрузки;
	
КонецФункции

Функция ПолучитьПодчиненные(Ссылка, ВидДокумента = "") Экспорт 
	
	МассивВидовДокументов = Новый Массив;	
	ТипВидДокумента = ТипЗнч(ВидДокумента);
	ТекстЗаппроса = "";
	
	Если ТипВидДокумента = Тип("Строка") И Не ПустаяСтрока(ВидДокумента) Тогда 
		МассивВидовДокументов.Добавить(ВидДокумента);
	ИначеЕсли ТипВидДокумента = Тип("Массив") Тогда 
		Для Каждого Стр Из ВидДокумента Цикл 
			МассивВидовДокументов.Добавить(ВидДокумента);
		КонецЦикла;
	Иначе
		МассивВидовДокументов.Добавить("РеализацияТоваров");
		МассивВидовДокументов.Добавить("ПеремещениеТоваров");
	КонецЕсли;	
	
	КоличествоВидов = МассивВидовДокументов.Количество();
	
	ШаблонЗапроса = "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК ПодчиненныйДокумент,
	|	ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.%1).Дата КАК Дата
	|%2
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.%1
	|	И ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.%1).Проведен";
	
	ШаблонПорядок = "УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	
	Для Каждого Стр Из МассивВидовДокументов Цикл 				
		Если Не ПустаяСтрока(ТекстЗаппроса) Тогда 
			ТекстЗаппроса = ТекстЗаппроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
		КонецЕсли;
		
		ТекстЗаппроса = ТекстЗаппроса + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗапроса, 
		Стр,
		?(КоличествоВидов > 1 И ПустаяСтрока(ТекстЗаппроса), "ПОМЕСТИТЬ СвязанныеДокументы", ""));
	КонецЦикла;
	
	Если КоличествоВидов > 1 Тогда 
		ТекстЗаппроса = ТекстЗаппроса + Символы.ПС + ";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязанныеДокументы.ПодчиненныйДокумент КАК ПодчиненныйДокумент,
		|	СвязанныеДокументы.Дата КАК Дата
		|ИЗ
		|	СвязанныеДокументы КАК СвязанныеДокументы";
	КонецЕсли;
	
	ТекстЗаппроса = ТекстЗаппроса + Символы.ПС + ШаблонПорядок;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗаппроса;		
	
	Возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// ТТН
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	//КомандаПечати.Идентификатор = "ТТН";
	//КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная'; uk = 'Товаро-транспортна накладна'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
	
	// ТТН Аттика
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "ТТН_Аттика";
	КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная (Аттика)'; uk = 'Товаро-транспортна накладна (Аттіка)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
	// ТТН Аттика орг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "ТТН_АттикаОрг";
	КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная (Аттика) по организациям'; uk = 'Товаро-транспортна накладна (Аттика) по организациям'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		

	// ТТН Казначейство
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "ТТН_Казн";
	КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная (Казн)'; uk = 'Товаро-транспортна накладна (Казн)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
	// ТТН Казначейство детально
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "ТТН_КазнДет";
	КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная (Казн) детально'; uk = 'Товаро-транспортна накладна (Казн) детально'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		

	// ТТН Фабрика Сыра
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "ТТН_ФС";
	КомандаПечати.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
	// Маршрутный лист
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ТК_ТТН";
	КомандаПечати.Идентификатор = "МаршрутныйЛист";
	КомандаПечати.Представление = НСтр("ru = 'Маршрутный лист'; uk = 'Маршрутний лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


#КонецОбласти	


#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда   // ТТН
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН",
		НСтр("ru = 'Товаро-транспортная накладная'; uk = 'Товаро-транспортна накладна'"), 
		ПечатьТТН(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН_Аттика") Тогда
		
		//ПараметрыВывода.Вставить("QR_Заголовок", Ложь);
		
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН_Аттика",
		НСтр("ru = 'Товаро-транспортная накладная (Аттика)'; uk = 'Товаро-транспортна накладна (Аттика)'"), 
		ПечатьТТН_Аттика(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН_Казн") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН_Казн",
		НСтр("ru = 'Товаро-транспортная накладная (Казн)'; uk = 'Товаро-транспортна накладна (Казн)'"), 
		ПечатьТТН_Казн(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН_КазнДет") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН_КазнДет",
		НСтр("ru = 'Товаро-транспортная накладная (Казн) детально'; uk = 'Товаро-транспортна накладна (Казн) детально'"), 
		ПечатьТТН_КазнДетально(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН_АттикаАлкоголь");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН_ФС") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН_ФС",
		НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'"), 
		ПечатьТТН_ФС(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН_ФС");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН_АттикаОрг") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ТТН_АттикаОрг",
		НСтр("ru = 'Товаро-транспортная накладная (Аттика) по организациям'; uk = 'Товаро-транспортна накладна (Аттика) по организациям'"), 
		ПечатьТТН_АттикаОрг(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МаршрутныйЛист") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"МаршрутныйЛист",
		НСтр("ru = 'Маршрутный лист'; uk = 'Маршрутний лист'"), 
		ПечатьМаршрутныйЛист(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ТК_ТТН.ПФ_MXL_МаршрутныйЛист");		
		
	КонецЕсли;	
	
КонецПроцедуры

// ТТН
Функция ПечатьТТН(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваров.Ссылка КАК Ссылка,
	|	РеализацияТоваров.Организация КАК Поставщик,
	|	РеализацияТоваров.Организация.НаименованиеПолное КАК ПредставлениеПоставщика,
	|	РеализацияТоваров.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	РеализацияТоваров.СкладКомпании КАК ПредставлениеСкладаМестоСоставления,
	|	РеализацияТоваров.Контрагент КАК Контрагент,
	|	РеализацияТоваров.Контрагент.НаименованиеПолное КАК ПредставлениеПокупателя,
	|	РеализацияТоваров.ДоговорВзаиморасчетов КАК ОснованиеПредставление,
	|	РеализацияТоваров.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваров.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваров.ТочкаДоставки КАК ТочкаДоставки,
	|	РеализацияТоваров.ТочкаДоставки.Представление КАК АдресДоставки,
	|	РеализацияТоваров.Дата КАК Дата,
	|	РеализацияТоваров.Номер КАК Номер,
	|	РеализацияТоваров.Автор КАК Автор,
	|	РеализацияТоваров.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Представление КАК ТоварПредставление,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ХарактеристикаНоменклатуры.Наименование КАК ХарактеристикаНоменклатуры,
	|		Количество КАК Количество,
	|		Коэффициент КАК Коэффициент,
	|		КоличествоБазовое КАК КоличествоБазовое,
	|		Цена КАК ЦенаПредставление,
	|		ЦенаБезНалогов КАК ЦенаБезНалогов,
	|		Сумма КАК Сумма,
	|		СуммаВсего КАК СуммаВсего,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаБезНалогов КАК СуммаБезНалогов,
	|		ПроцентСкидки КАК ПроцентСкидки,
	|		СуммаСкидки КАК СуммаСкидки,
	|		Номенклатура.ЕдиницаИзмеренияУпаковки КАК ЕдиницаИзмеренияУпаковки,
	|		Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
	|		ВЫБОР
	|			КОГДА РеализацияТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент > 0
	|				ТОГДА РеализацияТоваров.Товары.КоличествоБазовое / РеализацияТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМест
	|	) КАК Товары
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеализацияТоваров.МоментВремени,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СчетНаОплату";
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	КодЯзыкаПечать = "uk"; // КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваров.ПФ_MXL_СчетНаОплату");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьЗаголовокСчета	= Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтогоПоСтранице	= Макет.ПолучитьОбласть("ИтогоПоСтранице");	
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл 
		
		СтруктураШапки = Новый Структура("ТекстЗаголовка, ПредставлениеПоставщика, ПредставлениеПокупателя");
		
		СтруктураШапки.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Счет-фактура №%1 от %2'; uk = 'Рахунок-фактура №%1 від %2'", КодЯзыкаПечать),
		СокрЛП(ВыборкаДокументов.Номер),
		Формат(ВыборкаДокументов.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		
		ЗаполнитьЗначенияСвойств(СтруктураШапки, ВыборкаДокументов, "ПредставлениеПоставщика, ПредставлениеПокупателя");
		
		СтруктураПодвала = Новый Структура("ВсегоМест, СуммаСкидки, СуммаНДС, СуммаВсего,  ВалютаДокумента, Автор", 0, 0, 0, 0,,);
		ЗаполнитьЗначенияСвойств(СтруктураПодвала, ВыборкаДокументов, "ВалютаДокумента, Автор");
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;	
		КонецЕсли;		
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;				
		
		
		//Заполняем документ
		ТабличныйДокумент.Вывести(ОбластьЗаголовокСчета);
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);						
		
		ВыборкаТовары = ВыборкаДокументов.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл 
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтроки", ВыборкаТовары.НомерСтроки);
			СтруктураСтроки.Вставить("ТоварПредставление", СокрЛП(ВыборкаТовары.Артикул) + ", " + СокрЛП(ВыборкаТовары.ТоварПредставление));
			СтруктураСтроки.Вставить("КоличествоПредставление", Строка(ВыборкаТовары.Количество) + " " + СокрЛП(ВыборкаТовары.ЕдиницаИзмерения));
			СтруктураСтроки.Вставить("КоличествоМестПредставление", Строка(ВыборкаТовары.КоличествоМест) + " " + СокрЛП(ВыборкаТовары.ЕдиницаИзмеренияУпаковки));
			СтруктураСтроки.Вставить("ПредставлениеСкидки", ВыборкаТовары.СуммаСкидки);
			СтруктураСтроки.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДС);
			СтруктураСтроки.Вставить("СуммаВсего", ВыборкаТовары.СуммаВсего);
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			СтруктураПодвала.ВсегоМест = СтруктураПодвала.ВсегоМест + ВыборкаТовары.КоличествоМест;
			СтруктураПодвала.СуммаСкидки = СтруктураПодвала.СуммаСкидки + ВыборкаТовары.СуммаСкидки;
			СтруктураПодвала.СуммаНДС = СтруктураПодвала.СуммаНДС + ВыборкаТовары.СуммаНДС;
			СтруктураПодвала.СуммаВсего = СтруктураПодвала.СуммаВсего + ВыборкаТовары.СуммаВсего;
		КонецЦикла;
		
		ДопПараметрСуммыПрописью = НСтр("ru = 'гривна,гривны,гривен,ж,копейка, копейки, копеек, ж'; uk = 'гривня,гривні,гривень,ж,копійка, копійки, копійок, ж'", Лев(КодЯзыкаПечать, 2));
		СуммаПрописью = ЧислоПрописью(СтруктураПодвала.СуммаВсего, "Л='" + КодЯзыкаПечать + "'", ДопПараметрСуммыПрописью);
		
		СтруктураПодвала.Вставить("СуммаПрописью", СуммаПрописью);
		
		ОбластьПодвал.Параметры.Заполнить(СтруктураПодвала);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// ТТН Аттика
Функция ПечатьТТН_Аттика(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТТНИсточники.Ссылка КАК Ссылка,
	               |	ТК_ТТНИсточники.Ссылка.Дата КАК Дата,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ТК_ТТНИсточники.Документ КАК Документ,
	               |	ТК_ТТНИсточники.Масса КАК Масса,
	               |	ТК_ТТНИсточники.Отгрузка КАК Отгрузка
	               |ПОМЕСТИТЬ ТТН_Источники
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата КАК Дата,
	               |	ТТН_Источники.Ссылка КАК ТТН,
	               |	ТТН_Источники.Отгрузка КАК Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер КАК Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Контрагент КАК ОтгрузкаКонтрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).СуммаДокумента КАК ОтгрузкаСуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса) КАК Масса,
	               |	""РН"" КАК ТипДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0) КАК СуммаНДС
	               |ПОМЕСТИТЬ втИсточники
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""РН"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Документ = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Отгрузка.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Отгрузка КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = ПеремещениеТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Отгрузка) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Отгрузка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Документ.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Документ = ПеремещениеТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВП"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |				ПО ТТН_Источники.Документ = ВозвратПоставщикуТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""НН"",
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаНДСДокумента
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ТК_НалоговаяНакладная.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА РеализацияТоваровТовары.КоличествоБазовое / РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ РеализацияТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ) КАК КоличествоМест
	               |ПОМЕСТИТЬ втКоличествоМест
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое / ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВозвратПоставщикуТовары.КоличествоБазовое / ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВозвратПоставщикуТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсточники.ТТН КАК ТТН,
	               |	втИсточники.Отгрузка КАК Отгрузка,
	               |	втИсточники.Дата КАК ОтгрузкаДата,
	               |	втИсточники.Номер КАК ОтгрузкаНомер,
	               |	втИсточники.ОтгрузкаКонтрагент КАК ОтгрузкаКонтрагент,
	               |	ЕСТЬNULL(втИсточники.ОтгрузкаСуммаДокумента, 0) КАК ОтгрузкаСуммаДокумента,
	               |	ЕСТЬNULL(втИсточники.Масса, 0) КАК ОтгрузкаМасса,
	               |	ЕСТЬNULL(втКоличествоМест.КоличествоМест, 0) КАК ОтгрузкаКоличествоМест,
	               |	втИсточники.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(втИсточники.СуммаНДС, 0) КАК СуммаНДС
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоМест КАК втКоличествоМест
	               |		ПО втИсточники.Отгрузка = втКоличествоМест.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втИсточники.Дата
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Отгрузка),
	               |	СУММА(ОтгрузкаСуммаДокумента),
	               |	СУММА(ОтгрузкаМасса),
	               |	СУММА(ОтгрузкаКоличествоМест),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ТТН,
	               |	ОтгрузкаКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_ТТН.Ссылка КАК Ссылка,
	               |	ТК_ТТН.Дата КАК Дата,
	               |	ТК_ТТН.Номер КАК Номер,
	               |	ТК_ТТН.Автомобиль КАК Автомобиль,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Модель КАК АвтомобильМодель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГосНомер КАК АвтомобильГосНомер,
	               |	ТК_ТТН.ВидПеревозки КАК ВидПеревозки,
	               |	ТК_ТТН.Организация КАК Организация,
	               |	ТК_ТТН.ПунктОтправитель КАК ПунктОтправитель,
	               |	ТК_ТТН.ПунктПолучатель КАК ПунктПолучатель,
	               |	ТК_ТТН.Прицеп КАК Прицеп,
	               |	ТК_ТТН.Перевозчик КАК Перевозчик,
	               |	ТК_ТТН.Водитель КАК Водитель,
	               |	ТК_ТТН.Заказчик КАК Заказчик,
	               |	ТК_ТТН.ДолжностьОтветственногоОтправителя КАК ДолжностьОтветственногоОтправителя,
	               |	ТК_ТТН.ОтветственныйОтправитель КАК ОтветственныйОтправитель,
	               |	ТК_ТТН.НомерПрав КАК НомерПрав,		               
				   |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).VIN КАК ВинКодАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГодВыпуска КАК ГодВыпускаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Высота КАК ВысотаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Длина КАК ДлинаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Ширина КАК ШиринаАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) КАК ВесАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) + ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Грузоподъемность, 0) КАК ВесАвтомобиляСГрузом

	               |ИЗ
	               |	Документ.ТК_ТТН КАК ТК_ТТН
	               |ГДЕ
	               |	ТК_ТТН.Ссылка В(&МассивСсылок)";
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); //Нужно переделать, хотябы на максимальную дату из объектов печати
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ТаблицаРеквизиты = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	ТаблицаРеквизиты.Индексы.Добавить("Ссылка");
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТТН_Аттика";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьАвтотранспорт	= Макет.ПолучитьОбласть("ПараметрыАвтотранспорта");
	ОбластьПогрузочныеОперации = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	
	ВыборкаТТН = МассивРезультатов[МассивРезультатов.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		
		РеквизитыТТН = ТаблицаРеквизиты.Найти(ВыборкаТТН.ТТН, "Ссылка");
		
		НомерПравСАвтомобиля = ?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"),РеквизитыТТН.Автомобиль.НомерПрав,"");
		НомерПрав = ?(ЗначениеЗаполнено(РеквизитыТТН.НомерПрав),РеквизитыТТН.НомерПрав, НомерПравСАвтомобиля); 
		Если РеквизитыТТН.Водитель <> Неопределено Тогда 
			ВодительСНП = ?(ТипЗнч(РеквизитыТТН.Водитель) = Тип("Строка"),РеквизитыТТН.Водитель, РеквизитыТТН.Водитель.Наименование) + ", " + НомерПрав;
		КонецЕсли;
		
		стрРеквизитыШапки = Новый Структура;
		стрРеквизитыШапки.Вставить("Дата", 						Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,РеквизитыТТН.Дата), "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		стрРеквизитыШапки.Вставить("Номер", 					СокрЛП(РеквизитыТТН.Номер));
		стрРеквизитыШапки.Вставить("МаркаИГосНомерАвтомобиля", 	?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"), Строка(РеквизитыТТН.АвтомобильМодель) + " №" + Строка(РеквизитыТТН.АвтомобильГосНомер), Строка(РеквизитыТТН.Автомобиль)));
		стрРеквизитыШапки.Вставить("ГосНомерПрицепа", 			?(ЗначениеЗаполнено(РеквизитыТТН.Прицеп), РеквизитыТТН.Прицеп, НСтр("ru = 'нету'; uk = 'немає'", КодЯзыкаПечать)));
		стрРеквизитыШапки.Вставить("ВидПеревозки", 				РеквизитыТТН.ВидПеревозки);
		стрРеквизитыШапки.Вставить("Водитель",					НСтр("ru = 'Водитель'; uk = 'Водій'", КодЯзыкаПечать) + ", " + РеквизитыТТН.Водитель);
		стрРеквизитыШапки.Вставить("ВодительСНП",				ВодительСНП); //Добавить номер прав
		стрРеквизитыШапки.Вставить("ПунктОтправитель",			СокрЛП(РеквизитыТТН.ПунктОтправитель));
		стрРеквизитыШапки.Вставить("ПунктПолучатель", 			СокрЛП(РеквизитыТТН.ПунктПолучатель));
		стрРеквизитыШапки.Вставить("Отправитель",				Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Организация, Истина, Истина, Истина, Истина,,, КодЯзыкаПечать));				
		стрРеквизитыШапки.Вставить("ВинКодАвтомобиля", 			РеквизитыТТН.ВинКодАвтомобиля);
		стрРеквизитыШапки.Вставить("ГодВыпускаАвтомобиля", 		Формат(РеквизитыТТН.ГодВыпускаАвтомобиля, "ЧДЦ=0; ЧГ="));
		стрРеквизитыШапки.Вставить("ШиринаАвтомобиля", 			Формат(РеквизитыТТН.ШиринаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ДлинаАвтомобиля", 			Формат(РеквизитыТТН.ДлинаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВысотаАвтомобиля",			Формат(РеквизитыТТН.ВысотаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВесАвтомобиля",				Формат(РеквизитыТТН.ВесАвтомобиля / 1000, "ЧДЦ=3"));
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Заказчик) Тогда 
			стрРеквизитыШапки.Вставить("ПлательщикПредставление",	?(ТипЗнч(РеквизитыТТН.Заказчик) = Тип("СправочникСсылка.Контрагенты"), Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Заказчик, Истина, Ложь, Истина,,, КодЯзыкаПечать), СокрЛП(РеквизитыТТН.Заказчик)));	
		КонецЕсли;				
		
		//Организация перевозчик
		ТипПеревозчика = ТипЗнч(РеквизитыТТН.Перевозчик);
		Если ТипПеревозчика = Тип("СправочникСсылка.Организации") Тогда 
			ПредставлениеПеревозчика = Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина,,Истина,,,,КодЯзыкаПечать);
		ИначеЕсли ТипПеревозчика = Тип("СправочникСсылка.Контрагенты") Тогда 
			ПредставлениеПеревозчика = Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина,,Истина,,,КодЯзыкаПечать);
		Иначе
			ПредставлениеПеревозчика = СокрЛП(Строка(РеквизитыТТН.Перевозчик));
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОрганизацияПеревозчик", ПредставлениеПеревозчика);
		
		//Представление ответственного отправителя
		ПредставлениеОтправителя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоОтправителя) Тогда 
			ПредставлениеОтправителя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоОтправителя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйОтправитель) Тогда 
			ПредставлениеОтправителя = ?(Не ПустаяСтрока(ПредставлениеОтправителя), ПредставлениеОтправителя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйОтправитель);
		КонецЕсли;
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжность", 	ПредставлениеОтправителя);
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжностьБух", 	ПредставлениеОтправителя);
		
		ВыборкаКонтрагент = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;						
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			СуммаВсего 		= ВыборкаКонтрагент.ОтгрузкаСуммаДокумента;
			СуммаНДС 		= ВыборкаКонтрагент.СуммаНДС; 
			КоличествоМест 	= Цел(ВыборкаКонтрагент.ОтгрузкаКоличествоМест);			
			Масса 			= ВыборкаКонтрагент.ОтгрузкаМасса;			
			Тонны 			= Масса/1000;
			ВесАвтоСГрузом  = Масса+РеквизитыТТН.ВесАвтомобиля;

			Если КоличествоМест < 1 Тогда
				КоличествоМест = 1;
			КонецЕсли;
			
			СтруктураШапки = Новый Структура;																
			СтруктураШапки.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(СуммаВсего, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("СуммаНДС", Окр(СуммаНДС,2));
			СтруктураШапки.Вставить("КоличествоМестПрописью", ЧислоПрописью(Число(КоличествоМест), "Л=uk_UA; ДП=Истина", ",,,с,,,,,0"));
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
			СтруктураШапки.Вставить("ГрузополучательПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Истина, Истина, Истина,, КодЯзыкаПечать));
			СтруктураШапки.Вставить("ИтогоСуммаСНДС", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураШапки.Вставить("ИтогоМасса", Формат(Тонны, "ЧДЦ=3"));

			стрРеквизитыШапки.Вставить("ВесАвтомобиляСГрузом",	Формат(ВесАвтоСГрузом / 1000, "ЧДЦ=3"));
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураШапки, стрРеквизитыШапки, Истина);						
			
			Если Не СтруктураШапки.Свойство("ПлательщикПредставление") Тогда 
				СтруктураШапки.Вставить("ПлательщикПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Ложь, Истина,,, КодЯзыкаПечать)); 
			КонецЕсли;
			
			ДокументыСопровождения = "";
			ДокументыСГрузом = "";
			ВыборкаДокументы = ВыборкаКонтрагент.Выбрать();
			СписокНомеров = Новый СписокЗначений;
			Пока ВыборкаДокументы.Следующий() Цикл 															
				Если СписокНомеров.НайтиПоЗначению(ВыборкаДокументы.ОтгрузкаНомер)=Неопределено Тогда
					СписокНомеров.Добавить(ВыборкаДокументы.ОтгрузкаНомер);
				Иначе
					Продолжить;
				КонецЕсли;
				
				ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.ОтгрузкаНомер + ";";				
				
				ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
				?(ВыборкаДокументы.ТипДокумента = "ПМ",
				НСтр("ru = 'Перемещение товаров'; uk = 'Переміщення товарів'", КодЯзыкаПечать),
				НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать)
				),
				СокрЛП(ВыборкаДокументы.ОтгрузкаНомер),
				Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаДокументы.ОтгрузкаДата), "ДФ=dd.MM.yy"));
			КонецЦикла;
			
			СтрокаДокументы = НСтр("ru = 'Товар согласно накладных №'; uk = 'Товар згідно накладних №'", КодЯзыкаПечать) + ДокументыСопровождения;
			
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтроки", 1);
			СтруктураСтроки.Вставить("ТоварНаименование", СтрокаДокументы);
			СтруктураСтроки.Вставить("БазоваяЕдиницаНаименование", "ящ");
			СтруктураСтроки.Вставить("Количество", Формат(КоличествоМест, "ЧДЦ=0; ЧРГ="));
			СтруктураСтроки.Вставить("Сумма", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураСтроки.Вставить("ВидУпаковки", "ящик");
			СтруктураСтроки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			СтруктураСтроки.Вставить("Масса", Формат(Тонны, "ЧДЦ=3"));
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластьВсего.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			ОбластьПодписи.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			ОбластьАвтотранспорт.Параметры.Заполнить(стрРеквизитыШапки);
			ТабличныйДокумент.Вывести(ОбластьАвтотранспорт);

			ОбластьПогрузочныеОперации.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// ТТН Аттика по организациям
Функция ПечатьТТН_АттикаОрг(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТТНИсточники.Ссылка КАК Ссылка,
	               |	ТК_ТТНИсточники.Ссылка.Дата КАК Дата,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ТК_ТТНИсточники.Документ КАК Документ,
	               |	ТК_ТТНИсточники.Масса КАК Масса,
	               |	ТК_ТТНИсточники.Отгрузка КАК Отгрузка
	               |ПОМЕСТИТЬ ТТН_Источники
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата КАК Дата,
	               |	ТТН_Источники.Ссылка КАК ТТН,
	               |	ТТН_Источники.Отгрузка КАК Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер КАК Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Контрагент КАК ОтгрузкаКонтрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).СуммаДокумента КАК ОтгрузкаСуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса) КАК Масса,
	               |	""РН"" КАК ТипДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0) КАК СуммаНДС
	               |ПОМЕСТИТЬ втИсточники
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""РН"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Документ = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Отгрузка.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Отгрузка КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = ПеремещениеТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Отгрузка) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Отгрузка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Документ.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Документ = ПеремещениеТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВП"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |				ПО ТТН_Источники.Документ = ВозвратПоставщикуТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""НН"",
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаНДСДокумента
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ТК_НалоговаяНакладная.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА РеализацияТоваровТовары.КоличествоБазовое / РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ РеализацияТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ) КАК КоличествоМест
	               |ПОМЕСТИТЬ втКоличествоМест
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое / ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВозвратПоставщикуТовары.КоличествоБазовое / ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВозвратПоставщикуТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсточники.ТТН КАК ТТН,
	               |	втИсточники.Отгрузка КАК Отгрузка,
	               |	втИсточники.Дата КАК ОтгрузкаДата,
	               |	втИсточники.Номер КАК ОтгрузкаНомер,
	               |	втИсточники.ОтгрузкаКонтрагент КАК ОтгрузкаКонтрагент,
	               |	ЕСТЬNULL(втИсточники.ОтгрузкаСуммаДокумента, 0) КАК ОтгрузкаСуммаДокумента,
	               |	ЕСТЬNULL(втИсточники.Масса, 0) КАК ОтгрузкаМасса,
	               |	ЕСТЬNULL(втКоличествоМест.КоличествоМест, 0) КАК ОтгрузкаКоличествоМест,
	               |	втИсточники.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(втИсточники.СуммаНДС, 0) КАК СуммаНДС,
	               |	втИсточники.Отгрузка.Организация КАК ОтгрузкаОрганизация
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоМест КАК втКоличествоМест
	               |		ПО втИсточники.Отгрузка = втКоличествоМест.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втИсточники.Дата
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Отгрузка),
	               |	СУММА(ОтгрузкаСуммаДокумента),
	               |	СУММА(ОтгрузкаМасса),
	               |	СУММА(ОтгрузкаКоличествоМест),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ТТН,
	               |	ОтгрузкаОрганизация,
	               |	ОтгрузкаКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_ТТН.Ссылка КАК Ссылка,
	               |	ТК_ТТН.Дата КАК Дата,
	               |	ТК_ТТН.Номер КАК Номер,
	               |	ТК_ТТН.Автомобиль КАК Автомобиль,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Модель КАК АвтомобильМодель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГосНомер КАК АвтомобильГосНомер,
	               |	ТК_ТТН.ВидПеревозки КАК ВидПеревозки,
	               |	ТК_ТТН.Организация КАК Организация,
	               |	ТК_ТТН.ПунктОтправитель КАК ПунктОтправитель,
	               |	ТК_ТТН.ПунктПолучатель КАК ПунктПолучатель,
	               |	ТК_ТТН.Прицеп КАК Прицеп,
	               |	ТК_ТТН.Перевозчик КАК Перевозчик,
	               |	ТК_ТТН.Водитель КАК Водитель,
	               |	ТК_ТТН.Заказчик КАК Заказчик,
	               |	ТК_ТТН.ДолжностьОтветственногоОтправителя КАК ДолжностьОтветственногоОтправителя,
	               |	ТК_ТТН.ОтветственныйОтправитель КАК ОтветственныйОтправитель,
	               |	ТК_ТТН.НомерПрав КАК НомерПрав,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).VIN КАК ВинКодАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГодВыпуска КАК ГодВыпускаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Высота КАК ВысотаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Длина КАК ДлинаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Ширина КАК ШиринаАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) КАК ВесАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) + ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Грузоподъемность, 0) КАК ВесАвтомобиляСГрузом
	               |ИЗ
	               |	Документ.ТК_ТТН КАК ТК_ТТН
	               |ГДЕ
	               |	ТК_ТТН.Ссылка В(&МассивСсылок)";
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); //Нужно переделать, хотябы на максимальную дату из объектов печати
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ТаблицаРеквизиты = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	ТаблицаРеквизиты.Индексы.Добавить("Ссылка");
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТТН_Аттика";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьАвтотранспорт	= Макет.ПолучитьОбласть("ПараметрыАвтотранспорта");
	ОбластьПогрузочныеОперации = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	
	ВыборкаТТН = МассивРезультатов[МассивРезультатов.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		ВыборкаОрганиазция = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаОрганиазция.Следующий() Цикл						
		
		РеквизитыТТН = ТаблицаРеквизиты.Найти(ВыборкаОрганиазция.ТТН, "Ссылка");
		
		НомерПравСАвтомобиля = ?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"),РеквизитыТТН.Автомобиль.НомерПрав,"");
		НомерПрав = ?(ЗначениеЗаполнено(РеквизитыТТН.НомерПрав),РеквизитыТТН.НомерПрав, НомерПравСАвтомобиля); 
		Если РеквизитыТТН.Водитель <> Неопределено Тогда 
			ВодительСНП = ?(ТипЗнч(РеквизитыТТН.Водитель) = Тип("Строка"),РеквизитыТТН.Водитель, РеквизитыТТН.Водитель.Наименование) + ", " + НомерПрав;
		КонецЕсли;
		
		стрРеквизитыШапки = Новый Структура;
		стрРеквизитыШапки.Вставить("Дата", 						Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,РеквизитыТТН.Дата), "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		стрРеквизитыШапки.Вставить("Номер", 					СокрЛП(РеквизитыТТН.Номер));
		стрРеквизитыШапки.Вставить("МаркаИГосНомерАвтомобиля", 	?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"), Строка(РеквизитыТТН.АвтомобильМодель) + " №" + Строка(РеквизитыТТН.АвтомобильГосНомер), Строка(РеквизитыТТН.Автомобиль)));
		стрРеквизитыШапки.Вставить("ГосНомерПрицепа", 			?(ЗначениеЗаполнено(РеквизитыТТН.Прицеп), РеквизитыТТН.Прицеп, НСтр("ru = 'нету'; uk = 'немає'", КодЯзыкаПечать)));
		стрРеквизитыШапки.Вставить("ВидПеревозки", 				РеквизитыТТН.ВидПеревозки);
		стрРеквизитыШапки.Вставить("Водитель",					НСтр("ru = 'Водитель'; uk = 'Водій'", КодЯзыкаПечать) + ", " + РеквизитыТТН.Водитель);
		стрРеквизитыШапки.Вставить("ВодительСНП",				ВодительСНП); //Добавить номер прав
		стрРеквизитыШапки.Вставить("ПунктОтправитель",			СокрЛП(РеквизитыТТН.ПунктОтправитель));
		стрРеквизитыШапки.Вставить("ПунктПолучатель", 			СокрЛП(РеквизитыТТН.ПунктПолучатель));
		стрРеквизитыШапки.Вставить("Отправитель",				Справочники.Организации.ПолучитьПредставлениеДляПечати(ВыборкаОрганиазция.ОтгрузкаОрганизация, Истина, Истина, Истина, Истина,,, КодЯзыкаПечать));				
		стрРеквизитыШапки.Вставить("ВинКодАвтомобиля", 			РеквизитыТТН.ВинКодАвтомобиля);
		стрРеквизитыШапки.Вставить("ГодВыпускаАвтомобиля", 		Формат(РеквизитыТТН.ГодВыпускаАвтомобиля, "ЧДЦ=0; ЧГ="));
		стрРеквизитыШапки.Вставить("ШиринаАвтомобиля", 			Формат(РеквизитыТТН.ШиринаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ДлинаАвтомобиля", 			Формат(РеквизитыТТН.ДлинаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВысотаАвтомобиля",			Формат(РеквизитыТТН.ВысотаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВесАвтомобиля",				Формат(РеквизитыТТН.ВесАвтомобиля / 1000, "ЧДЦ=3"));
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Заказчик) Тогда 
			стрРеквизитыШапки.Вставить("ПлательщикПредставление",	?(ТипЗнч(РеквизитыТТН.Заказчик) = Тип("СправочникСсылка.Контрагенты"), Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Заказчик, Истина, Ложь, Истина,,, КодЯзыкаПечать), СокрЛП(РеквизитыТТН.Заказчик)));	
		КонецЕсли;				
		
		//Организация перевозчик
		ТипПеревозчика = ТипЗнч(РеквизитыТТН.Перевозчик);
		Если ТипПеревозчика = Тип("СправочникСсылка.Организации") Тогда 
			ПредставлениеПеревозчика = Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина,,Истина,,,,КодЯзыкаПечать);
		ИначеЕсли ТипПеревозчика = Тип("СправочникСсылка.Контрагенты") Тогда 
			ПредставлениеПеревозчика = Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина,,Истина,,,КодЯзыкаПечать);
		Иначе
			ПредставлениеПеревозчика = СокрЛП(Строка(РеквизитыТТН.Перевозчик));
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОрганизацияПеревозчик", ПредставлениеПеревозчика);
		
		//Представление ответственного отправителя
		ПредставлениеОтправителя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоОтправителя) Тогда 
			ПредставлениеОтправителя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоОтправителя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйОтправитель) Тогда 
			ПредставлениеОтправителя = ?(Не ПустаяСтрока(ПредставлениеОтправителя), ПредставлениеОтправителя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйОтправитель);
		КонецЕсли;
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжность", 	ПредставлениеОтправителя);
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжностьБух", 	ПредставлениеОтправителя);
		
		ВыборкаКонтрагент = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;						
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			СуммаВсего 		= ВыборкаКонтрагент.ОтгрузкаСуммаДокумента;
			СуммаНДС 		= ВыборкаКонтрагент.СуммаНДС; 
			КоличествоМест 	= Цел(ВыборкаКонтрагент.ОтгрузкаКоличествоМест);			
			Масса 			= ВыборкаКонтрагент.ОтгрузкаМасса;			
			Тонны 			= Масса/1000;
			ВесАвтоСГрузом  = Масса+РеквизитыТТН.ВесАвтомобиля;

			Если КоличествоМест < 1 Тогда
				КоличествоМест = 1;
			КонецЕсли;
			
			СтруктураШапки = Новый Структура;																
			СтруктураШапки.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(СуммаВсего, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("СуммаНДС", Окр(СуммаНДС,2));
			СтруктураШапки.Вставить("КоличествоМестПрописью", ЧислоПрописью(Число(КоличествоМест), "Л=uk_UA; ДП=Истина", ",,,с,,,,,0"));
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
			СтруктураШапки.Вставить("ГрузополучательПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Истина, Истина, Истина,, КодЯзыкаПечать));
			СтруктураШапки.Вставить("ИтогоСуммаСНДС", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураШапки.Вставить("ИтогоМасса", Формат(Тонны, "ЧДЦ=3"));

			стрРеквизитыШапки.Вставить("ВесАвтомобиляСГрузом",	Формат(ВесАвтоСГрузом / 1000, "ЧДЦ=3"));
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураШапки, стрРеквизитыШапки, Истина);						
			
			Если Не СтруктураШапки.Свойство("ПлательщикПредставление") Тогда 
				СтруктураШапки.Вставить("ПлательщикПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Ложь, Истина,,, КодЯзыкаПечать)); 
			КонецЕсли;
			
			ДокументыСопровождения = "";
			ДокументыСГрузом = "";
			ВыборкаДокументы = ВыборкаКонтрагент.Выбрать();
			СписокНомеров = Новый СписокЗначений;
			Пока ВыборкаДокументы.Следующий() Цикл 															
				Если СписокНомеров.НайтиПоЗначению(ВыборкаДокументы.ОтгрузкаНомер)=Неопределено Тогда
					СписокНомеров.Добавить(ВыборкаДокументы.ОтгрузкаНомер);
				Иначе
					Продолжить;
				КонецЕсли;
				
				ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.ОтгрузкаНомер + ";";				
				
				ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
				?(ВыборкаДокументы.ТипДокумента = "ПМ",
				НСтр("ru = 'Перемещение товаров'; uk = 'Переміщення товарів'", КодЯзыкаПечать),
				НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать)
				),
				СокрЛП(ВыборкаДокументы.ОтгрузкаНомер),
				Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаДокументы.ОтгрузкаДата), "ДФ=dd.MM.yy"));
			КонецЦикла;
			
			СтрокаДокументы = НСтр("ru = 'Товар согласно накладных №'; uk = 'Товар згідно накладних №'", КодЯзыкаПечать) + ДокументыСопровождения;
			
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтроки", 1);
			СтруктураСтроки.Вставить("ТоварНаименование", СтрокаДокументы);
			СтруктураСтроки.Вставить("БазоваяЕдиницаНаименование", "ящ");
			СтруктураСтроки.Вставить("Количество", Формат(КоличествоМест, "ЧДЦ=0; ЧРГ="));
			СтруктураСтроки.Вставить("Сумма", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураСтроки.Вставить("ВидУпаковки", "ящик");
			СтруктураСтроки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			СтруктураСтроки.Вставить("Масса", Формат(Тонны, "ЧДЦ=3"));
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластьВсего.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			ОбластьПодписи.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			ОбластьАвтотранспорт.Параметры.Заполнить(стрРеквизитыШапки);
			ТабличныйДокумент.Вывести(ОбластьАвтотранспорт);

			ОбластьПогрузочныеОперации.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
			КонецЦикла;
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// ТТН Казн
Функция ПечатьТТН_Казн(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТТНИсточники.Ссылка КАК Ссылка,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ТК_ТТНИсточники.Документ КАК Документ,
	               |	ТК_ТТНИсточники.Масса КАК Масса,
	               |	ТК_ТТНИсточники.Отгрузка КАК Отгрузка,
	               |	ТК_ТТНИсточники.Документ.Дата КАК Дата
	               |ПОМЕСТИТЬ ТТН_Источники
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка КАК ТТН,
	               |	ТТН_Источники.Отгрузка КАК Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер КАК Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Контрагент КАК ОтгрузкаКонтрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).СуммаДокумента КАК ОтгрузкаСуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса) КАК Масса,
	               |	""РН"" КАК ТипДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0) КАК СуммаНДС,
	               |	ТТН_Источники.Дата КАК Дата
	               |ПОМЕСТИТЬ втИсточники
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = РеализацияТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер,
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""РН"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Документ = РеализацияТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Отгрузка.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = ПеремещениеТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПР"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Документ.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Документ = ПеремещениеТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВП"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |				ПО ТТН_Источники.Документ = ВозвратПоставщикуТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""НН"",
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаНДСДокумента,
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ТК_НалоговаяНакладная.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер,
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка.Номер,
	               |	РеализацияТоваровТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровТовары.Ссылка.СуммаДокумента,
	               |	СУММА(РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес * РеализацияТоваровТовары.КоличествоБазовое),
	               |	""РН"",
	               |	СУММА(РеализацияТоваровТовары.СуммаНДС),
	               |	РеализацияТоваровТовары.Ссылка.Дата
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В(&МассивСсылок)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка.Дата,
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка.Номер,
	               |	РеализацияТоваровТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровТовары.Ссылка.СуммаДокумента,
	               |	РеализацияТоваровТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА РеализацияТоваровТовары.КоличествоБазовое / РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ РеализацияТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ) КАК КоличествоМест
	               |ПОМЕСТИТЬ втКоличествоМест
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое / ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВозвратПоставщикуТовары.КоличествоБазовое / ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВозвратПоставщикуТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсточники.ТТН КАК ТТН,
	               |	втИсточники.Отгрузка КАК Отгрузка,
	               |	втИсточники.Дата КАК ОтгрузкаДата,
	               |	втИсточники.Номер КАК ОтгрузкаНомер,
	               |	втИсточники.ОтгрузкаКонтрагент КАК ОтгрузкаКонтрагент,
	               |	ЕСТЬNULL(втИсточники.ОтгрузкаСуммаДокумента, 0) КАК ОтгрузкаСуммаДокумента,
	               |	ЕСТЬNULL(втИсточники.Масса, 0) КАК ОтгрузкаМасса,
	               |	ЕСТЬNULL(втКоличествоМест.КоличествоМест, 0) КАК ОтгрузкаКоличествоМест,
	               |	втИсточники.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(втИсточники.СуммаНДС, 0) КАК ОтгрузкаСуммаНДС
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоМест КАК втКоличествоМест
	               |		ПО втИсточники.Отгрузка = втКоличествоМест.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втИсточники.Дата
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Отгрузка),
	               |	СУММА(ОтгрузкаСуммаДокумента),
	               |	СУММА(ОтгрузкаМасса),
	               |	СУММА(ОтгрузкаКоличествоМест),
	               |	СУММА(ОтгрузкаСуммаНДС)
	               |ПО
	               |	ТТН,
	               |	ОтгрузкаКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_ТТН.Ссылка КАК Ссылка,
	               |	ТК_ТТН.Дата КАК Дата,
	               |	ТК_ТТН.Номер КАК Номер,
	               |	ТК_ТТН.Автомобиль КАК Автомобиль,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Модель КАК АвтомобильМодель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГосНомер КАК АвтомобильГосНомер,
	               |	ТК_ТТН.ВидПеревозки КАК ВидПеревозки,
	               |	ТК_ТТН.Организация КАК Организация,
	               |	ТК_ТТН.ПунктОтправитель КАК ПунктОтправитель,
	               |	ТК_ТТН.ПунктПолучатель КАК ПунктПолучатель,
	               |	ТК_ТТН.Прицеп КАК Прицеп,
	               |	ТК_ТТН.Перевозчик КАК Перевозчик,
	               |	ТК_ТТН.Водитель КАК Водитель,
	               |	ТК_ТТН.Заказчик КАК Заказчик,
	               |	ТК_ТТН.ДолжностьОтветственногоОтправителя КАК ДолжностьОтветственногоОтправителя,
	               |	ТК_ТТН.ОтветственныйОтправитель КАК ОтветственныйОтправитель,
	               |	ТК_ТТН.НомерПрав КАК НомерПрав,
	               |	ВложенныйЗапрос.ФизическоеЛицо КАК Руководитель,
	               |	ТК_ТТН.ДолжностьОтветственногоПолучателя КАК ДолжностьОтветственногоПолучателя,
	               |	ТК_ТТН.ОтветственныйПолучатель КАК ОтветственныйПолучатель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).VIN КАК ВинКодАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГодВыпуска КАК ГодВыпускаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Высота КАК ВысотаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Длина КАК ДлинаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Ширина КАК ШиринаАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) КАК ВесАвтомобиля
	               |ИЗ
	               |	Документ.ТК_ТТН КАК ТК_ТТН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.Организация КАК Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо КАК ФизическоеЛицо,
	               |			ВложенныйЗапрос.Период КАК Период,
	               |			ВложенныйЗапрос.Ссылка КАК Ссылка
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ТК_ТТН.Организация КАК Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо,
	               |				МАКСИМУМ(ОтветственныеЛицаОрганизаций.Период) КАК Период,
	               |				ТК_ТТН.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Документ.ТК_ТТН КАК ТК_ТТН
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	               |					ПО ТК_ТТН.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	               |						И (ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель))
	               |						И (ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации)
	               |						И ТК_ТТН.Дата >= ОтветственныеЛицаОрганизаций.Период
	               |			ГДЕ
	               |				ТК_ТТН.Ссылка В(&МассивСсылок)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТК_ТТН.Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
	               |				ТК_ТТН.Ссылка) КАК ВложенныйЗапрос
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВложенныйЗапрос.Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо,
	               |			ВложенныйЗапрос.Период,
	               |			ВложенныйЗапрос.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ТК_ТТН.Организация = ВложенныйЗапрос.Организация
	               |			И ТК_ТТН.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ТК_ТТН.Ссылка В(&МассивСсылок)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваров.Ссылка,
	               |	РеализацияТоваров.Дата,
	               |	""ВМ "" + РеализацияТоваров.Номер,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль.Модель,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль.ГосНомер,
	               |	""Автоперевезення"",
	               |	РеализацияТоваров.Организация,
	               |	РеализацияТоваров.СкладКомпании.ТочкаДоставки,
	               |	РеализацияТоваров.ТочкаДоставки,
	               |	"""",
	               |	НастройкиЗаполненияТТНСрезПоследних.Перевозчик,
	               |	НастройкиЗаполненияТТНСрезПоследних.Водитель,
	               |	РеализацияТоваров.Организация.Контрагент,
	               |	"""",
	               |	"""",
	               |	"""",
	               |	ВложенныйЗапрос.Руководитель,
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	0
	               |ИЗ
	               |	РегистрСведений.НастройкиЗаполненияТТН.СрезПоследних(&НаДату, ) КАК НастройкиЗаполненияТТНСрезПоследних,
	               |	Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.Организация КАК Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо КАК Руководитель,
	               |			ВложенныйЗапрос.Период КАК Период,
	               |			ВложенныйЗапрос.Ссылка КАК Ссылка
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				РеализацияТоваров.Организация КАК Организация,
	               |				МАКСИМУМ(ОтветственныеЛицаОрганизаций.Период) КАК Период,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо,
	               |				РеализацияТоваров.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Документ.РеализацияТоваров КАК РеализацияТоваров
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	               |					ПО РеализацияТоваров.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	               |						И (ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации)
	               |						И (ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель))
	               |						И РеализацияТоваров.Дата >= ОтветственныеЛицаОрганизаций.Период
	               |			ГДЕ
	               |				РеализацияТоваров.Ссылка В(&МассивСсылок)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РеализацияТоваров.Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
	               |				РеализацияТоваров.Ссылка) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	               |		ПО РеализацияТоваров.Организация = ВложенныйЗапрос.Организация
	               |			И РеализацияТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	РеализацияТоваров.Ссылка В(&МассивСсылок)";
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); //Нужно переделать, хотябы на максимальную дату из объектов печати
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ТаблицаРеквизиты = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	ТаблицаРеквизиты.Индексы.Добавить("Ссылка");
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТТН_Аттика";
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_ТТН_Аттика");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьПогрузочныеОперации = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	ОбластьАвтотранспорт    = Макет.ПолучитьОбласть("ПараметрыАвтотранспорта");
	
	ВыборкаТТН = МассивРезультатов[МассивРезультатов.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		
		РеквизитыТТН = ТаблицаРеквизиты.Найти(ВыборкаТТН.ТТН, "Ссылка");
		НомерПравСАвтомобиля = ?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"),РеквизитыТТН.Автомобиль.НомерПрав,"");
		НомерПрав = ?(ЗначениеЗаполнено(РеквизитыТТН.НомерПрав),РеквизитыТТН.НомерПрав, НомерПравСАвтомобиля); 
		Если РеквизитыТТН.Водитель <> Неопределено Тогда 
			ВодительСНП = ?(ТипЗнч(РеквизитыТТН.Водитель) = Тип("Строка"),РеквизитыТТН.Водитель, РеквизитыТТН.Водитель.Наименование) + ", " + НомерПрав;
		КонецЕсли;
		
		стрРеквизитыШапки = Новый Структура;
		стрРеквизитыШапки.Вставить("Дата", 						Формат(РеквизитыТТН.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		стрРеквизитыШапки.Вставить("Номер", 					СокрЛП(РеквизитыТТН.Номер));
		стрРеквизитыШапки.Вставить("МаркаИГосНомерАвтомобиля", 	?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"), Строка(РеквизитыТТН.АвтомобильМодель) + " №" + Строка(РеквизитыТТН.АвтомобильГосНомер), Строка(РеквизитыТТН.Автомобиль)));
		стрРеквизитыШапки.Вставить("ГосНомерПрицепа", 			?(ЗначениеЗаполнено(РеквизитыТТН.Прицеп), РеквизитыТТН.Прицеп, НСтр("ru = 'нету'; uk = 'немає'", КодЯзыкаПечать)));
		стрРеквизитыШапки.Вставить("ВидПеревозки", 				РеквизитыТТН.ВидПеревозки);
		стрРеквизитыШапки.Вставить("Водитель",					НСтр("ru = 'Водитель'; uk = 'Водій'", КодЯзыкаПечать) + ", " + РеквизитыТТН.Водитель);
		стрРеквизитыШапки.Вставить("ВодительСНП",				ВодительСНП); //Добавить номер прав
		стрРеквизитыШапки.Вставить("ПунктОтправитель",			СокрЛП(РеквизитыТТН.ПунктОтправитель));
		стрРеквизитыШапки.Вставить("ПунктПолучатель", 			СокрЛП(РеквизитыТТН.ПунктПолучатель));
		стрРеквизитыШапки.Вставить("Отправитель",				Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Организация, Истина, Истина, Истина, Истина,,, КодЯзыкаПечать));				
		стрРеквизитыШапки.Вставить("ГодВыпускаАвтомобиля", 		Формат(РеквизитыТТН.ГодВыпускаАвтомобиля, "ЧДЦ=0; ЧГ="));
		стрРеквизитыШапки.Вставить("ШиринаАвтомобиля", 			Формат(РеквизитыТТН.ШиринаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ДлинаАвтомобиля", 			Формат(РеквизитыТТН.ДлинаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВысотаАвтомобиля",			Формат(РеквизитыТТН.ВысотаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВесАвтомобиля",				Формат(РеквизитыТТН.ВесАвтомобиля / 1000, "ЧДЦ=3"));
		стрРеквизитыШапки.Вставить("ВинКодАвтомобиля", 			РеквизитыТТН.ВинКодАвтомобиля);
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Заказчик) Тогда 
			стрРеквизитыШапки.Вставить("ПлательщикПредставление",	?(ТипЗнч(РеквизитыТТН.Заказчик) = Тип("СправочникСсылка.Контрагенты"), Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Заказчик, Истина, Ложь, Истина,,, КодЯзыкаПечать), СокрЛП(РеквизитыТТН.Заказчик)));	
		КонецЕсли;				
		
		//Организация перевозчик
		ТипПеревозчика = ТипЗнч(РеквизитыТТН.Перевозчик);
		Если ТипПеревозчика = Тип("СправочникСсылка.Организации") Тогда 
			ПредставлениеПеревозчика = Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		ИначеЕсли ТипПеревозчика = Тип("СправочникСсылка.Контрагенты") Тогда 
			ПредставлениеПеревозчика = Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		Иначе
			ПредставлениеПеревозчика = СокрЛП(Строка(РеквизитыТТН.Перевозчик));
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОрганизацияПеревозчик", ПредставлениеПеревозчика);
		
		//Представление ответственного отправителя
		ПредставлениеОтправителя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоОтправителя) Тогда 
			ПредставлениеОтправителя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоОтправителя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйОтправитель) Тогда 
			ПредставлениеОтправителя = ?(Не ПустаяСтрока(ПредставлениеОтправителя), ПредставлениеОтправителя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйОтправитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Руководитель) Тогда 
			ПредставлениеОтправителяБух = "Директор,"+РеквизитыТТН.Руководитель;
		КонецЕсли;	
		
		Если ПустаяСтрока(ПредставлениеОтправителя) Тогда 
			ПредставлениеОтправителя = ПредставлениеОтправителяБух;
		КонецЕсли;
		
		ПредставлениеПолучателя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоПолучателя) Тогда 
			ПредставлениеПолучателя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоПолучателя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйПолучатель) Тогда 
			ПредставлениеПолучателя = ?(Не ПустаяСтрока(ПредставлениеПолучателя), ПредставлениеПолучателя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйПолучатель);
		КонецЕсли;
		
		
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжность", 	    ПредставлениеОтправителя);
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжностьБух", 	ПредставлениеОтправителяБух);
		стрРеквизитыШапки.Вставить("ТоварПолучилДолжность", 	    ПредставлениеПолучателя);
		
		ВыборкаКонтрагент = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;						
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			СуммаВсего 		= ВыборкаКонтрагент.ОтгрузкаСуммаДокумента;
			СуммаНДС 		= ВыборкаКонтрагент.ОтгрузкаСуммаНДС;
			КоличествоМест 	= Цел(ВыборкаКонтрагент.ОтгрузкаКоличествоМест);			
			Масса 			= ВыборкаКонтрагент.ОтгрузкаМасса;			
			Тонны 			= Масса/1000;
			
			Если НЕ РеквизитыТТН.ВесАвтомобиля = 0 Тогда 
				стрРеквизитыШапки.Вставить("ВесАвтомобиляСГрузом",	Формат((РеквизитыТТН.ВесАвтомобиля +Масса) /1000, "ЧДЦ=3"));
			КонецЕсли;
			
			Если КоличествоМест < 1 Тогда
				КоличествоМест = 1;
			КонецЕсли;
			
			СтруктураШапки = Новый Структура;																
			СтруктураШапки.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(СуммаВсего, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("СуммаНДС", Окр(СуммаНДС,2));
			СтруктураШапки.Вставить("КоличествоМестПрописью", ЧислоПрописью(Число(КоличествоМест), "Л=uk_UA; ДП=Истина", ",,,с,,,,,0"));
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
			СтруктураШапки.Вставить("ГрузополучательПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Истина, Истина, Истина,, КодЯзыкаПечать));
			СтруктураШапки.Вставить("ИтогоСуммаСНДС", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураШапки, стрРеквизитыШапки, Истина);						
			
			Если Не СтруктураШапки.Свойство("ПлательщикПредставление") Тогда 
				СтруктураШапки.Вставить("ПлательщикПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Ложь, Истина,,, КодЯзыкаПечать)); 
			КонецЕсли;
			
			ДокументыСопровождения = "";
			ДокументыСГрузом = "";
			ВыборкаДокументы = ВыборкаКонтрагент.Выбрать();
			СписокНомеров = Новый СписокЗначений;
			Пока ВыборкаДокументы.Следующий() Цикл 															
				Если СписокНомеров.НайтиПоЗначению(ВыборкаДокументы.ОтгрузкаНомер)=Неопределено Тогда
					СписокНомеров.Добавить(ВыборкаДокументы.ОтгрузкаНомер);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если ВыборкаДокументы.ТипДокумента = "НН" И ВыборкаДокументы.ОтгрузкаДата > '20220601000000'  Тогда 
					Если ВыборкаДокументы.Отгрузка.РН Тогда
						ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.Отгрузка.НомерРН + ";";				
						
						ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
						НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать),
						СокрЛП(ВыборкаДокументы.Отгрузка.НомерРН),
						Формат(ВыборкаДокументы.ОтгрузкаДата, "ДФ=dd.MM.yy"));
					Иначе
						ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.ОтгрузкаНомер + ";";				
						
						ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
						?(ВыборкаДокументы.ТипДокумента = "ПМ",
						НСтр("ru = 'Перемещение товаров'; uk = 'Переміщення товарів'", КодЯзыкаПечать),
						НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать)
						),
						СокрЛП(ВыборкаДокументы.ОтгрузкаНомер),
						Формат(ВыборкаДокументы.ОтгрузкаДата, "ДФ=dd.MM.yy"));	
					КонецЕсли;
				Иначе 
					ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.ОтгрузкаНомер + ";";				
					
					ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
					?(ВыборкаДокументы.ТипДокумента = "ПМ",
					НСтр("ru = 'Перемещение товаров'; uk = 'Переміщення товарів'", КодЯзыкаПечать),
					НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать)
					),
					СокрЛП(ВыборкаДокументы.ОтгрузкаНомер),
					Формат(ВыборкаДокументы.ОтгрузкаДата, "ДФ=dd.MM.yy"));
				КонецЕсли;
			КонецЦикла;
			
			СтрокаДокументы = НСтр("ru = 'Товар согласно накладных №'; uk = 'Товар згідно накладних №'", КодЯзыкаПечать) + ДокументыСопровождения;
			
			СтруктураШапки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтроки", 1);
			СтруктураСтроки.Вставить("ТоварНаименование", СтрокаДокументы);
			СтруктураСтроки.Вставить("БазоваяЕдиницаНаименование", "ящ");
			СтруктураСтроки.Вставить("Количество", Формат(КоличествоМест, "ЧДЦ=0; ЧРГ="));
			СтруктураСтроки.Вставить("Сумма", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураСтроки.Вставить("ВидУпаковки", "ящик");
			СтруктураСтроки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			СтруктураСтроки.Вставить("Масса", Формат(Тонны, "ЧДЦ=3"));
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластьВсего.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			ОбластьПодписи.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			ОбластьАвтотранспорт.Параметры.Заполнить(стрРеквизитыШапки);
			ТабличныйДокумент.Вывести(ОбластьАвтотранспорт);
			
			ОбластьПогрузочныеОперации.Параметры.Заполнить(стрРеквизитыШапки);
			ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// ТТН Казн детально
Функция ПечатьТТН_КазнДетально(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТТНИсточники.Ссылка КАК Ссылка,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ТК_ТТНИсточники.Документ КАК Документ,
	               |	ТК_ТТНИсточники.Масса КАК Масса,
	               |	ТК_ТТНИсточники.Отгрузка КАК Отгрузка,
	               |	ТК_ТТНИсточники.Документ.Дата КАК Дата
	               |ПОМЕСТИТЬ ТТН_Источники
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка КАК ТТН,
	               |	ТТН_Источники.Отгрузка КАК Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер КАК Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Контрагент КАК ОтгрузкаКонтрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).СуммаДокумента КАК ОтгрузкаСуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса) КАК Масса,
	               |	""РН"" КАК ТипДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0) КАК СуммаНДС,
	               |	ТТН_Источники.Дата КАК Дата
	               |ПОМЕСТИТЬ втИсточники
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = РеализацияТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер,
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""РН"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Документ = РеализацияТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Отгрузка.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = ПеремещениеТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ТТН_Источники.Ссылка,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПР"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Документ.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Документ = ПеремещениеТоваровТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВП"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |				ПО ТТН_Источники.Документ = ВозвратПоставщикуТовары.Ссылка.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""НН"",
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаНДСДокумента,
	               |	ТТН_Источники.Дата
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ТК_НалоговаяНакладная.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер,
	               |	ТТН_Источники.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка.Номер,
	               |	РеализацияТоваровТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровТовары.Ссылка.СуммаДокумента,
	               |	СУММА(РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес * РеализацияТоваровТовары.КоличествоБазовое),
	               |	""РН"",
	               |	СУММА(РеализацияТоваровТовары.СуммаНДС),
	               |	РеализацияТоваровТовары.Ссылка.Дата
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В(&МассивСсылок)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка.Дата,
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Ссылка.Номер,
	               |	РеализацияТоваровТовары.Ссылка.Контрагент,
	               |	РеализацияТоваровТовары.Ссылка.СуммаДокумента,
	               |	РеализацияТоваровТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА РеализацияТоваровТовары.КоличествоБазовое / РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ РеализацияТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ) КАК КоличествоМест
	               |ПОМЕСТИТЬ втКоличествоМест
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое / ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВозвратПоставщикуТовары.КоличествоБазовое / ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВозвратПоставщикуТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
	               |	РеализацияТоваровТовары.ЦенаБезНалогов КАК ЦенаБезНалогов,
	               |	РеализацияТоваровТовары.СуммаНДС КАК СуммаНДС,
	               |	РеализацияТоваровТовары.СуммаВсего КАК СуммаВсего,
	               |	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.КоличествоБазовое,
	               |	РеализацияТоваровТовары.ЦенаБезНалогов,
	               |	РеализацияТоваровТовары.СуммаВсего,
	               |	РеализацияТоваровТовары.СуммаНДС,
	               |	РеализацияТоваровТовары.Номенклатура,
	               |	РеализацияТоваровТовары.Количество
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.КоличествоБазовое,
	               |	ПеремещениеТоваровТовары.Цена,
	               |	ПеремещениеТоваровТовары.СуммаНДС,
	               |	ПеремещениеТоваровТовары.СуммаВсего,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Количество
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.КоличествоБазовое,
	               |	ПеремещениеТоваровТовары.Цена,
	               |	ПеремещениеТоваровТовары.СуммаНДС,
	               |	ПеремещениеТоваровТовары.СуммаВсего,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Количество
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	ВозвратПоставщикуТовары.КоличествоБазовое,
	               |	ВозвратПоставщикуТовары.ЦенаБезНалогов,
	               |	ВозвратПоставщикуТовары.СуммаНДС,
	               |	ВозвратПоставщикуТовары.Сумма,
	               |	ВозвратПоставщикуТовары.Номенклатура,
	               |	ВозвратПоставщикуТовары.Количество
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	ВозвратПоставщикуТовары.КоличествоБазовое,
	               |	ВозвратПоставщикуТовары.ЦенаБезНалогов,
	               |	ВозвратПоставщикуТовары.СуммаНДС,
	               |	ВозвратПоставщикуТовары.Сумма,
	               |	ВозвратПоставщикуТовары.Номенклатура,
	               |	ВозвратПоставщикуТовары.Количество
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	ТК_НалоговаяНакладнаяТовары.КоличествоБазовое,
	               |	ТК_НалоговаяНакладнаяТовары.ЦенаБезНалогов,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаНДС,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаВсего,
	               |	ТК_НалоговаяНакладнаяТовары.Номенклатура,
	               |	ТК_НалоговаяНакладнаяТовары.Количество
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	ТК_НалоговаяНакладнаяТовары.КоличествоБазовое,
	               |	ТК_НалоговаяНакладнаяТовары.ЦенаБезНалогов,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаНДС,
	               |	ТК_НалоговаяНакладнаяТовары.СуммаВсего,
	               |	ТК_НалоговаяНакладнаяТовары.Номенклатура,
	               |	ТК_НалоговаяНакладнаяТовары.Количество
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА втТовары.Ссылка ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |			ТОГДА втТовары.Ссылка.НомерРН
	               |		ИНАЧЕ втТовары.Ссылка.Номер
	               |	КОНЕЦ КАК НомерНакладной,
	               |	втТовары.КоличествоБазовое КАК КоличествоБазовое,
	               |	втТовары.ЦенаБезНалогов КАК Цена,
	               |	втТовары.СуммаНДС КАК СуммаНДС,
	               |	втТовары.СуммаВсего КАК Сумма,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК ЧИСЛО(15, 2)), 0) КАК КолВОд,
	               |	втТовары.Ссылка КАК Ссылка,
	               |	втТовары.Номенклатура.Наименование2 КАК ТоварНаименование,
	               |	втТовары.Количество КАК Количество
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |			ПО втТовары.Номенклатура = ДополнительныеСведения.Объект
	               |				И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
	               |		ПО втИсточники.Отгрузка = втТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсточники.ТТН КАК ТТН,
	               |	втИсточники.Отгрузка КАК Отгрузка,
	               |	втИсточники.Дата КАК ОтгрузкаДата,
	               |	втИсточники.Номер КАК ОтгрузкаНомер,
	               |	втИсточники.ОтгрузкаКонтрагент КАК ОтгрузкаКонтрагент,
	               |	ЕСТЬNULL(втИсточники.ОтгрузкаСуммаДокумента, 0) КАК ОтгрузкаСуммаДокумента,
	               |	ЕСТЬNULL(втИсточники.Масса, 0) КАК ОтгрузкаМасса,
	               |	ЕСТЬNULL(втКоличествоМест.КоличествоМест, 0) КАК ОтгрузкаКоличествоМест,
	               |	втИсточники.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(втИсточники.СуммаНДС, 0) КАК ОтгрузкаСуммаНДС
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоМест КАК втКоличествоМест
	               |		ПО втИсточники.Отгрузка = втКоличествоМест.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втИсточники.Дата
	               |ИТОГИ
	               |	СУММА(ОтгрузкаСуммаДокумента),
	               |	СУММА(ОтгрузкаМасса),
	               |	СУММА(ОтгрузкаКоличествоМест),
	               |	СУММА(ОтгрузкаСуммаНДС)
	               |ПО
	               |	ТТН,
	               |	ОтгрузкаКонтрагент,
	               |	Отгрузка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_ТТН.Ссылка КАК Ссылка,
	               |	ТК_ТТН.Дата КАК Дата,
	               |	ТК_ТТН.Номер КАК Номер,
	               |	ТК_ТТН.Автомобиль КАК Автомобиль,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Модель КАК АвтомобильМодель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГосНомер КАК АвтомобильГосНомер,
	               |	ТК_ТТН.ВидПеревозки КАК ВидПеревозки,
	               |	ТК_ТТН.Организация КАК Организация,
	               |	ТК_ТТН.ПунктОтправитель КАК ПунктОтправитель,
	               |	ТК_ТТН.ПунктПолучатель КАК ПунктПолучатель,
	               |	ТК_ТТН.Прицеп КАК Прицеп,
	               |	ТК_ТТН.Перевозчик КАК Перевозчик,
	               |	ТК_ТТН.Водитель КАК Водитель,
	               |	ТК_ТТН.Заказчик КАК Заказчик,
	               |	ТК_ТТН.ДолжностьОтветственногоОтправителя КАК ДолжностьОтветственногоОтправителя,
	               |	ТК_ТТН.ОтветственныйОтправитель КАК ОтветственныйОтправитель,
	               |	ТК_ТТН.НомерПрав КАК НомерПрав,
	               |	ВложенныйЗапрос.ФизическоеЛицо КАК Руководитель,
	               |	ТК_ТТН.ДолжностьОтветственногоПолучателя КАК ДолжностьОтветственногоПолучателя,
	               |	ТК_ТТН.ОтветственныйПолучатель КАК ОтветственныйПолучатель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).VIN КАК ВинКодАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГодВыпуска КАК ГодВыпускаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Высота КАК ВысотаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Длина КАК ДлинаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Ширина КАК ШиринаАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) КАК ВесАвтомобиля
	               |ИЗ
	               |	Документ.ТК_ТТН КАК ТК_ТТН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.Организация КАК Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо КАК ФизическоеЛицо,
	               |			ВложенныйЗапрос.Период КАК Период,
	               |			ВложенныйЗапрос.Ссылка КАК Ссылка
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ТК_ТТН.Организация КАК Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо,
	               |				МАКСИМУМ(ОтветственныеЛицаОрганизаций.Период) КАК Период,
	               |				ТК_ТТН.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Документ.ТК_ТТН КАК ТК_ТТН
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	               |					ПО ТК_ТТН.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	               |						И (ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель))
	               |						И (ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации)
	               |						И ТК_ТТН.Дата >= ОтветственныеЛицаОрганизаций.Период
	               |			ГДЕ
	               |				ТК_ТТН.Ссылка В(&МассивСсылок)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТК_ТТН.Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
	               |				ТК_ТТН.Ссылка) КАК ВложенныйЗапрос
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВложенныйЗапрос.Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо,
	               |			ВложенныйЗапрос.Период,
	               |			ВложенныйЗапрос.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ТК_ТТН.Организация = ВложенныйЗапрос.Организация
	               |			И ТК_ТТН.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ТК_ТТН.Ссылка В(&МассивСсылок)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваров.Ссылка,
	               |	РеализацияТоваров.Дата,
	               |	""ВМ "" + РеализацияТоваров.Номер,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль.Модель,
	               |	НастройкиЗаполненияТТНСрезПоследних.Автомобиль.ГосНомер,
	               |	""Автоперевезення"",
	               |	РеализацияТоваров.Организация,
	               |	РеализацияТоваров.СкладКомпании.ТочкаДоставки,
	               |	РеализацияТоваров.ТочкаДоставки,
	               |	"""",
	               |	НастройкиЗаполненияТТНСрезПоследних.Перевозчик,
	               |	НастройкиЗаполненияТТНСрезПоследних.Водитель,
	               |	РеализацияТоваров.Организация.Контрагент,
	               |	"""",
	               |	"""",
	               |	"""",
	               |	ВложенныйЗапрос.Руководитель,
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	"""",
	               |	0
	               |ИЗ
	               |	РегистрСведений.НастройкиЗаполненияТТН.СрезПоследних(&НаДату, ) КАК НастройкиЗаполненияТТНСрезПоследних,
	               |	Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.Организация КАК Организация,
	               |			ВложенныйЗапрос.ФизическоеЛицо КАК Руководитель,
	               |			ВложенныйЗапрос.Период КАК Период,
	               |			ВложенныйЗапрос.Ссылка КАК Ссылка
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				РеализацияТоваров.Организация КАК Организация,
	               |				МАКСИМУМ(ОтветственныеЛицаОрганизаций.Период) КАК Период,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо,
	               |				РеализацияТоваров.Ссылка КАК Ссылка
	               |			ИЗ
	               |				Документ.РеализацияТоваров КАК РеализацияТоваров
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	               |					ПО РеализацияТоваров.Организация = ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница
	               |						И (ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации)
	               |						И (ОтветственныеЛицаОрганизаций.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель))
	               |						И РеализацияТоваров.Дата >= ОтветственныеЛицаОрганизаций.Период
	               |			ГДЕ
	               |				РеализацияТоваров.Ссылка В(&МассивСсылок)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РеализацияТоваров.Организация,
	               |				ОтветственныеЛицаОрганизаций.ФизическоеЛицо,
	               |				РеализацияТоваров.Ссылка) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	               |		ПО РеализацияТоваров.Организация = ВложенныйЗапрос.Организация
	               |			И РеализацияТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	РеализацияТоваров.Ссылка В(&МассивСсылок)";
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); //Нужно переделать, хотябы на максимальную дату из объектов печати
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ТаблицаРеквизиты = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	ТаблицаРеквизиты.Индексы.Добавить("Ссылка");
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_ТТН_АттикаАлкоголь";
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_ТТН_АттикаАлкоголь");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыДетально");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("СтрокаДетально");
	ОбластьСтрокаДоп		= Макет.ПолучитьОбласть("СтрокаДетальноДоп");
	ОбластьВсего			= Макет.ПолучитьОбласть("ВсегоДетально");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьПогрузочныеОперации = Макет.ПолучитьОбласть("ПогрузочныеОперацииДет");
	ОбластьАвтотранспорт    = Макет.ПолучитьОбласть("ПараметрыАвтотранспортаДет");
	
	ВыборкаТТН = МассивРезультатов[МассивРезультатов.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТовары = МассивРезультатов[МассивРезультатов.ВГраница()-2].Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		
		РеквизитыТТН = ТаблицаРеквизиты.Найти(ВыборкаТТН.ТТН, "Ссылка");
		НомерПравСАвтомобиля = ?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"),РеквизитыТТН.Автомобиль.НомерПрав,"");
		НомерПрав = ?(ЗначениеЗаполнено(РеквизитыТТН.НомерПрав),РеквизитыТТН.НомерПрав, НомерПравСАвтомобиля); 
		Если РеквизитыТТН.Водитель <> Неопределено Тогда 
			ВодительСНП = ?(ТипЗнч(РеквизитыТТН.Водитель) = Тип("Строка"),РеквизитыТТН.Водитель, РеквизитыТТН.Водитель.Наименование) + ", " + НомерПрав;
		КонецЕсли;
		
		стрРеквизитыШапки = Новый Структура;
		стрРеквизитыШапки.Вставить("Дата", 						Формат(РеквизитыТТН.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		стрРеквизитыШапки.Вставить("Номер", 					СокрЛП(РеквизитыТТН.Номер));
		стрРеквизитыШапки.Вставить("МаркаИГосНомерАвтомобиля", 	?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"), Строка(РеквизитыТТН.АвтомобильМодель) + " №" + Строка(РеквизитыТТН.АвтомобильГосНомер), Строка(РеквизитыТТН.Автомобиль)));
		стрРеквизитыШапки.Вставить("ГосНомерПрицепа", 			?(ЗначениеЗаполнено(РеквизитыТТН.Прицеп), РеквизитыТТН.Прицеп, НСтр("ru = 'нету'; uk = 'немає'", КодЯзыкаПечать)));
		стрРеквизитыШапки.Вставить("ВидПеревозки", 				РеквизитыТТН.ВидПеревозки);
		стрРеквизитыШапки.Вставить("Водитель",					НСтр("ru = 'Водитель'; uk = 'Водій'", КодЯзыкаПечать) + ", " + РеквизитыТТН.Водитель);
		стрРеквизитыШапки.Вставить("ВодительСНП",				ВодительСНП); //Добавить номер прав
		стрРеквизитыШапки.Вставить("ПунктОтправитель",			СокрЛП(РеквизитыТТН.ПунктОтправитель));
		стрРеквизитыШапки.Вставить("ПунктПолучатель", 			СокрЛП(РеквизитыТТН.ПунктПолучатель));
		стрРеквизитыШапки.Вставить("Отправитель",				Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Организация, Истина, Истина, Истина, Истина,,, КодЯзыкаПечать));				
		стрРеквизитыШапки.Вставить("ГодВыпускаАвтомобиля", 		Формат(РеквизитыТТН.ГодВыпускаАвтомобиля, "ЧДЦ=0; ЧГ="));
		стрРеквизитыШапки.Вставить("ШиринаАвтомобиля", 			Формат(РеквизитыТТН.ШиринаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ДлинаАвтомобиля", 			Формат(РеквизитыТТН.ДлинаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВысотаАвтомобиля",			Формат(РеквизитыТТН.ВысотаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВесАвтомобиля",				Формат(РеквизитыТТН.ВесАвтомобиля / 1000, "ЧДЦ=3"));
		стрРеквизитыШапки.Вставить("ВинКодАвтомобиля", 			РеквизитыТТН.ВинКодАвтомобиля);
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Заказчик) Тогда 
			стрРеквизитыШапки.Вставить("ПлательщикПредставление",	?(ТипЗнч(РеквизитыТТН.Заказчик) = Тип("СправочникСсылка.Контрагенты"), Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Заказчик, Истина, Ложь, Истина,,, КодЯзыкаПечать), СокрЛП(РеквизитыТТН.Заказчик)));	
		КонецЕсли;				
		
		//Организация перевозчик
		ТипПеревозчика = ТипЗнч(РеквизитыТТН.Перевозчик);
		Если ТипПеревозчика = Тип("СправочникСсылка.Организации") Тогда 
			ПредставлениеПеревозчика = Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		ИначеЕсли ТипПеревозчика = Тип("СправочникСсылка.Контрагенты") Тогда 
			ПредставлениеПеревозчика = Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		Иначе
			ПредставлениеПеревозчика = СокрЛП(Строка(РеквизитыТТН.Перевозчик));
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОрганизацияПеревозчик", ПредставлениеПеревозчика);
		
		//Представление ответственного отправителя
		ПредставлениеОтправителя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоОтправителя) Тогда 
			ПредставлениеОтправителя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоОтправителя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйОтправитель) Тогда 
			ПредставлениеОтправителя = ?(Не ПустаяСтрока(ПредставлениеОтправителя), ПредставлениеОтправителя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйОтправитель);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Руководитель) Тогда 
			ПредставлениеОтправителяБух = "Директор,"+РеквизитыТТН.Руководитель;
		КонецЕсли;	
		
		Если ПустаяСтрока(ПредставлениеОтправителя) Тогда 
			ПредставлениеОтправителя = ПредставлениеОтправителяБух;
		КонецЕсли;
		
		ПредставлениеПолучателя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоПолучателя) Тогда 
			ПредставлениеПолучателя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоПолучателя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйПолучатель) Тогда 
			ПредставлениеПолучателя = ?(Не ПустаяСтрока(ПредставлениеПолучателя), ПредставлениеПолучателя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйПолучатель);
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжность", 	    ПредставлениеОтправителя);
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжностьБух", 	ПредставлениеОтправителяБух);
		стрРеквизитыШапки.Вставить("ТоварПолучилДолжность", 	    ПредставлениеПолучателя);
		
		ВыборкаКонтрагент = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;						
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			СуммаВсего 		= ВыборкаКонтрагент.ОтгрузкаСуммаДокумента;
			СуммаНДС 		= ВыборкаКонтрагент.ОтгрузкаСуммаНДС;
			КоличествоМест 	= Цел(ВыборкаКонтрагент.ОтгрузкаКоличествоМест);			
			Масса 			= ВыборкаКонтрагент.ОтгрузкаМасса;			
			Тонны 			= Масса/1000;
			
			Если НЕ РеквизитыТТН.ВесАвтомобиля = 0 Тогда 
				стрРеквизитыШапки.Вставить("ВесАвтомобиляСГрузом",	Формат((РеквизитыТТН.ВесАвтомобиля +Масса) /1000, "ЧДЦ=3"));
			КонецЕсли;
			
			Если КоличествоМест < 1 Тогда
				КоличествоМест = 1;
			КонецЕсли;
			
			ИтогоКоличество = ВыборкаТовары.Итог("Количество");
			ИтогоКоличествоБазовое = ВыборкаТовары.Итог("КоличествоБазовое");
			СтруктураШапки = Новый Структура;																
			СтруктураШапки.Вставить("ИтогоПДВПрописью", ЧислоПрописью(СуммаНДС, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("СуммаНДС", Окр(СуммаНДС,2));
			СтруктураШапки.Вставить("ИтогоКоличество", ИтогоКоличество);
			СтруктураШапки.Вставить("ИтогоКоличествоБазовое", ИтогоКоличествоБазовое);
			СтруктураШапки.Вставить("ИтогоСумма", ИтогоКоличество);
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
			СтруктураШапки.Вставить("ГрузополучательПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Истина, Истина, Истина,, КодЯзыкаПечать));
			СтруктураШапки.Вставить("ИтогоСуммаСНДС", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураШапки.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(СуммаВсего, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("КоличествоМестПрописью", ЧислоПрописью(Число(ИтогоКоличество), "Л=uk_UA; ДП=Истина", ",,,с,,,,,0"));
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
		    СтруктураШапки.Вставить("ИтогоМасса", Окр(Тонны, 3));
		    СтруктураШапки.Вставить("СуммаАкцизногоНалога", "0 грн. 00 коп.");
		
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураШапки, стрРеквизитыШапки, Истина);						
			
			Если Не СтруктураШапки.Свойство("ПлательщикПредставление") Тогда 
				СтруктураШапки.Вставить("ПлательщикПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Ложь, Истина,,, КодЯзыкаПечать)); 
			КонецЕсли;
			
			ДокументыСопровождения = "";
			ДокументыСГрузом = "";
			ВыборкаДокументы = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СписокНомеров = Новый СписокЗначений;
			
			Пока ВыборкаДокументы.Следующий() Цикл 															
				Если СписокНомеров.НайтиПоЗначению(ВыборкаДокументы.ОтгрузкаНомер)=Неопределено Тогда
					СписокНомеров.Добавить(ВыборкаДокументы.ОтгрузкаНомер);
				Иначе
					Продолжить;
				КонецЕсли;
				
				ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.Отгрузка.НомерРН + ";";				
				
				ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
				НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать),
				СокрЛП(ВыборкаДокументы.Отгрузка.НомерРН),
				Формат(ВыборкаДокументы.Отгрузка.Дата, "ДФ=dd.MM.yy"));
			КонецЦикла;
			
			СтрокаДокументы = НСтр("ru = 'Товар согласно накладных №'; uk = 'Товар згідно накладних №'", КодЯзыкаПечать) + ДокументыСопровождения;
			
			СтруктураШапки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьЗаголовокТаблицы.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			НомерСтроки = 0;	
			ВыборкаДокументы.Сбросить();
			Пока ВыборкаДокументы.Следующий() Цикл 															
				
				СтрокиДокумента = ВыборкаТовары.НайтиСтроки(Новый Структура("Ссылка", ВыборкаДокументы.Отгрузка));
				Для Каждого стр Из СтрокиДокумента Цикл
					
					ОбластьСтрока.Параметры.Заполнить(стр);
					
					НомерСтроки=НомерСтроки+1;
					
					СтруктураСтроки = Новый Структура;
					СтруктураСтроки.Вставить("НомерСтроки", НомерСтроки);
					
					ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
					
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					
				КонецЦикла; 
			КонецЦикла;
			
			ОбластьСтрокаДоп.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаДоп);

			ОбластьВсего.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			ОбластьПодписи.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			ОбластьАвтотранспорт.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьАвтотранспорт);
			
			ОбластьПогрузочныеОперации.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// ТТН Фабрика Сыра
Функция ПечатьТТН_ФС(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТТНИсточники.Ссылка КАК Ссылка,
	               |	ТК_ТТНИсточники.Ссылка.Дата КАК Дата,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ТК_ТТНИсточники.Документ КАК Документ,
	               |	ТК_ТТНИсточники.Масса КАК Масса,
	               |	ТК_ТТНИсточники.Отгрузка КАК Отгрузка
	               |ПОМЕСТИТЬ ТТН_Источники
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата КАК Дата,
	               |	ТТН_Источники.Ссылка КАК ТТН,
	               |	ТТН_Источники.Отгрузка КАК Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер КАК Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Контрагент КАК ОтгрузкаКонтрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).СуммаДокумента КАК ОтгрузкаСуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса) КАК Масса,
	               |	""РН"" КАК ТипДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0) КАК СуммаНДС
	               |ПОМЕСТИТЬ втИсточники
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.РеализацияТоваров).Номер
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.РеализацияТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""РН"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |				ПО ТТН_Источники.Документ = РеализацияТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.РеализацияТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.РеализацияТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Отгрузка.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Отгрузка = ПеремещениеТоваровТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |			И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ПМ"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО ТТН_Источники.Документ.ТорговаяПлощадкаПолучатель = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ПеремещениеТоваровТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |				ПО ТТН_Источники.Документ = ПеремещениеТоваровТовары.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ПеремещениеТоваров
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).Номер,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	               |				И НЕ ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация ЕСТЬ NULL
	               |			ТОГДА ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация.Контрагент
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ПеремещениеТоваров).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВП"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |				ПО ТТН_Источники.Документ = ВозвратПоставщикуТовары.Ссылка
	               |		ГДЕ
	               |			ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |			И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВозвратПоставщику
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВозвратПоставщику.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).Контрагент,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВозвратПоставщику).СуммаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""НН"",
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаНДСДокумента
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ТК_НалоговаяНакладная.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ТТН_Источники.Документ ССЫЛКА Документ.ТК_НалоговаяНакладная
	               |				И ТТН_Источники.Документ.РН
	               |			ТОГДА ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).НомерРН
	               |		ИНАЧЕ ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ТК_НалоговаяНакладная).Номер
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Отгрузка,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВР"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Отгрузка КАК Документ,
	               |			СУММА(ВыпускПродукцииПродукция.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Продукция КАК ВыпускПродукцииПродукция
	               |				ПО ТТН_Источники.Отгрузка = ВыпускПродукцииПродукция.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Отгрузка) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Отгрузка = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Отгрузка ССЫЛКА Документ.ВыпускПродукции
	               |	И ТТН_Источники.Отгрузка <> ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Отгрузка,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Отгрузка КАК Документ.ВыпускПродукции).СуммаДокумента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТТН_Источники.Дата,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Документ,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).СуммаДокумента,
	               |	СУММА(ТТН_Источники.Масса),
	               |	""ВР"",
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)
	               |ИЗ
	               |	ТТН_Источники КАК ТТН_Источники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТТН_Источники.Документ КАК Документ,
	               |			СУММА(ВыпускПродукцииПродукция.СуммаНДС) КАК СуммаНДС
	               |		ИЗ
	               |			ТТН_Источники КАК ТТН_Источники
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Продукция КАК ВыпускПродукцииПродукция
	               |				ПО ТТН_Источники.Документ = ВыпускПродукцииПродукция.Ссылка
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТТН_Источники.Документ) КАК ВложенныйЗапрос
	               |		ПО ТТН_Источники.Документ = ВложенныйЗапрос.Документ
	               |ГДЕ
	               |	ТТН_Источники.Документ ССЫЛКА Документ.ВыпускПродукции
	               |	И ТТН_Источники.Документ <> ЗНАЧЕНИЕ(Документ.ВыпускПродукции.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТН_Источники.Документ,
	               |	ТТН_Источники.Ссылка,
	               |	ТТН_Источники.Дата,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0),
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).Номер,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).Контрагент,
	               |	ВЫРАЗИТЬ(ТТН_Источники.Документ КАК Документ.ВыпускПродукции).СуммаДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА РеализацияТоваровТовары.КоличествоБазовое / РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ РеализацияТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ) КАК КоличествоМест
	               |ПОМЕСТИТЬ втКоличествоМест
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое / ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВозвратПоставщикуТовары.КоличествоБазовое / ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВозвратПоставщикуТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / ТК_НалоговаяНакладнаяТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ТК_НалоговаяНакладнаяТовары.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ТК_НалоговаяНакладная.Товары КАК ТК_НалоговаяНакладнаяТовары
	               |ГДЕ
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ТК_НалоговаяНакладная)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_НалоговаяНакладнаяТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВыпускПродукцииПродукция.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВыпускПродукцииПродукция.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0) > 0
	               |				ТОГДА ВыпускПродукцииПродукция.КоличествоБазовое / ВыпускПродукцииПродукция.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |			ИНАЧЕ ВыпускПродукцииПродукция.КоличествоБазовое / 50
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.ВыпускПродукции.Продукция КАК ВыпускПродукцииПродукция
	               |ГДЕ
	               |	ВыпускПродукцииПродукция.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИсточники.Отгрузка КАК Отгрузка
	               |			ИЗ
	               |				втИсточники КАК втИсточники
	               |			ГДЕ
	               |				втИсточники.Отгрузка ССЫЛКА Документ.ВыпускПродукции)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыпускПродукцииПродукция.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсточники.ТТН КАК ТТН,
	               |	втИсточники.Отгрузка КАК Отгрузка,
	               |	втИсточники.Дата КАК ОтгрузкаДата,
	               |	втИсточники.Номер КАК ОтгрузкаНомер,
	               |	втИсточники.ОтгрузкаКонтрагент КАК ОтгрузкаКонтрагент,
	               |	ЕСТЬNULL(втИсточники.ОтгрузкаСуммаДокумента, 0) КАК ОтгрузкаСуммаДокумента,
	               |	ЕСТЬNULL(втИсточники.Масса, 0) КАК ОтгрузкаМасса,
	               |	ЕСТЬNULL(втКоличествоМест.КоличествоМест, 0) КАК ОтгрузкаКоличествоМест,
	               |	втИсточники.ТипДокумента КАК ТипДокумента,
	               |	ЕСТЬNULL(втИсточники.СуммаНДС, 0) КАК СуммаНДС
	               |ИЗ
	               |	втИсточники КАК втИсточники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоМест КАК втКоличествоМест
	               |		ПО втИсточники.Отгрузка = втКоличествоМест.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втИсточники.Дата
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Отгрузка),
	               |	СУММА(ОтгрузкаСуммаДокумента),
	               |	СУММА(ОтгрузкаМасса),
	               |	СУММА(ОтгрузкаКоличествоМест),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ТТН,
	               |	ОтгрузкаКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТК_ТТН.Ссылка КАК Ссылка,
	               |	ТК_ТТН.Дата КАК Дата,
	               |	ТК_ТТН.Номер КАК Номер,
	               |	ТК_ТТН.Автомобиль КАК Автомобиль,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Модель КАК АвтомобильМодель,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГосНомер КАК АвтомобильГосНомер,
	               |	ТК_ТТН.ВидПеревозки КАК ВидПеревозки,
	               |	ТК_ТТН.Организация КАК Организация,
	               |	ТК_ТТН.ПунктОтправитель КАК ПунктОтправитель,
	               |	ТК_ТТН.ПунктПолучатель КАК ПунктПолучатель,
	               |	ТК_ТТН.Прицеп КАК Прицеп,
	               |	ТК_ТТН.Перевозчик КАК Перевозчик,
	               |	ТК_ТТН.Водитель КАК Водитель,
	               |	ТК_ТТН.Заказчик КАК Заказчик,
	               |	ТК_ТТН.ДолжностьОтветственногоОтправителя КАК ДолжностьОтветственногоОтправителя,
	               |	ТК_ТТН.ОтветственныйОтправитель КАК ОтветственныйОтправитель,
	               |	ТК_ТТН.НомерПрав КАК НомерПрав,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).VIN КАК ВинКодАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).ГодВыпуска КАК ГодВыпускаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Высота КАК ВысотаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Длина КАК ДлинаАвтомобиля,
	               |	ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Ширина КАК ШиринаАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) КАК ВесАвтомобиля,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Вес, 0) + ЕСТЬNULL(ВЫРАЗИТЬ(ТК_ТТН.Автомобиль КАК Справочник.Автотранспорт).Грузоподъемность, 0) КАК ВесАвтомобиляСГрузом
	               |ИЗ
	               |	Документ.ТК_ТТН КАК ТК_ТТН
	               |ГДЕ
	               |	ТК_ТТН.Ссылка В(&МассивСсылок)";
	
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); //Нужно переделать, хотябы на максимальную дату из объектов печати
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	
	ТаблицаРеквизиты = МассивРезультатов[МассивРезультатов.ВГраница()].Выгрузить();
	ТаблицаРеквизиты.Индексы.Добавить("Ссылка");
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТТН_ФС";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_ТТН_ФС");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьАвтотранспорт	= Макет.ПолучитьОбласть("ПараметрыАвтотранспорта");
	ОбластьПогрузочныеОперации = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	
	ВыборкаТТН = МассивРезультатов[МассивРезультатов.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		
		РеквизитыТТН = ТаблицаРеквизиты.Найти(ВыборкаТТН.ТТН, "Ссылка");
		
		стрРеквизитыШапки = Новый Структура;
		стрРеквизитыШапки.Вставить("Дата", 						Формат(РеквизитыТТН.Дата, "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		стрРеквизитыШапки.Вставить("Номер", 					СокрЛП(РеквизитыТТН.Номер));
		стрРеквизитыШапки.Вставить("МаркаИГосНомерАвтомобиля", 	?(ТипЗнч(РеквизитыТТН.Автомобиль) = Тип("СправочникСсылка.Автотранспорт"), Строка(РеквизитыТТН.АвтомобильМодель) + " №" + Строка(РеквизитыТТН.АвтомобильГосНомер), Строка(РеквизитыТТН.Автомобиль)));
		стрРеквизитыШапки.Вставить("ГосНомерПрицепа", 			?(ЗначениеЗаполнено(РеквизитыТТН.Прицеп), РеквизитыТТН.Прицеп, НСтр("ru = 'нету'; uk = 'немає'", КодЯзыкаПечать)));
		стрРеквизитыШапки.Вставить("ВидПеревозки", 				РеквизитыТТН.ВидПеревозки);
		стрРеквизитыШапки.Вставить("Водитель",					НСтр("ru = 'Водитель'; uk = 'Водій'", КодЯзыкаПечать) + ", " + РеквизитыТТН.Водитель);
		стрРеквизитыШапки.Вставить("ВодительСНП",				РеквизитыТТН.Водитель); //Добавить номер прав
		стрРеквизитыШапки.Вставить("ПунктОтправитель",			СокрЛП(РеквизитыТТН.ПунктОтправитель));
		стрРеквизитыШапки.Вставить("ПунктПолучатель", 			СокрЛП(РеквизитыТТН.ПунктПолучатель));
		стрРеквизитыШапки.Вставить("Отправитель",				Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Организация, Истина, Истина, Истина, Истина,,, КодЯзыкаПечать));				
		стрРеквизитыШапки.Вставить("ВинКодАвтомобиля", 			РеквизитыТТН.ВинКодАвтомобиля);
		стрРеквизитыШапки.Вставить("ГодВыпускаАвтомобиля", 		Формат(РеквизитыТТН.ГодВыпускаАвтомобиля, "ЧДЦ=0; ЧГ="));
		стрРеквизитыШапки.Вставить("ШиринаАвтомобиля", 			Формат(РеквизитыТТН.ШиринаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ДлинаАвтомобиля", 			Формат(РеквизитыТТН.ДлинаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВысотаАвтомобиля",			Формат(РеквизитыТТН.ВысотаАвтомобиля, "ЧГ="));
		стрРеквизитыШапки.Вставить("ВесАвтомобиля",				Формат(РеквизитыТТН.ВесАвтомобиля / 1000, "ЧДЦ=3"));
		стрРеквизитыШапки.Вставить("ВесАвтомобиляСГрузом",		Формат(РеквизитыТТН.ВесАвтомобиляСГрузом / 1000, "ЧДЦ=3"));
		
		Если ЗначениеЗаполнено(РеквизитыТТН.Заказчик) Тогда 
			стрРеквизитыШапки.Вставить("ПлательщикПредставление",	?(ТипЗнч(РеквизитыТТН.Заказчик) = Тип("СправочникСсылка.Контрагенты"), Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Заказчик, Истина, Ложь, Истина,,, КодЯзыкаПечать), СокрЛП(РеквизитыТТН.Заказчик)));	
		КонецЕсли;				
		
		//Организация перевозчик
		ТипПеревозчика = ТипЗнч(РеквизитыТТН.Перевозчик);
		Если ТипПеревозчика = Тип("СправочникСсылка.Организации") Тогда 
			ПредставлениеПеревозчика = Справочники.Организации.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		ИначеЕсли ТипПеревозчика = Тип("СправочникСсылка.Контрагенты") Тогда 
			ПредставлениеПеревозчика = Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(РеквизитыТТН.Перевозчик, Истина);
		Иначе
			ПредставлениеПеревозчика = СокрЛП(Строка(РеквизитыТТН.Перевозчик));
		КонецЕсли;
		
		стрРеквизитыШапки.Вставить("ОрганизацияПеревозчик", ПредставлениеПеревозчика);
		
		//Представление ответственного отправителя
		ПредставлениеОтправителя = "";
		Если Не ПустаяСтрока(РеквизитыТТН.ДолжностьОтветственногоОтправителя) Тогда 
			ПредставлениеОтправителя = СокрЛП(РеквизитыТТН.ДолжностьОтветственногоОтправителя);
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыТТН.ОтветственныйОтправитель) Тогда 
			ПредставлениеОтправителя = ?(Не ПустаяСтрока(ПредставлениеОтправителя), ПредставлениеОтправителя + ", ", "") + СокрЛП(РеквизитыТТН.ОтветственныйОтправитель);
		КонецЕсли;
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжность", 	ПредставлениеОтправителя);
		стрРеквизитыШапки.Вставить("ОтпускРазрешилДолжностьБух", 	ПредставлениеОтправителя);
		
		ВыборкаКонтрагент = ВыборкаТТН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл 
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;						
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			СуммаВсего 		= ВыборкаКонтрагент.ОтгрузкаСуммаДокумента;
			СуммаНДС 		= ВыборкаКонтрагент.СуммаНДС; 
			КоличествоМест 	= Цел(ВыборкаКонтрагент.ОтгрузкаКоличествоМест);			
			Масса 			= ВыборкаКонтрагент.ОтгрузкаМасса;			
			Тонны 			= Масса/1000;
			
			Если КоличествоМест < 1 Тогда
				КоличествоМест = 1;
			КонецЕсли;
			
			СтруктураШапки = Новый Структура;																
			СтруктураШапки.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(СуммаВсего, "Л=uk_UA; ДП = Истина", НСтр("ru = 'гривна, гривны, гривен, м, копейка, копейки, копеек, ж, 2'; uk = 'гривна, гривні, гривень, ж, копійка, копійки, копійок, ж, 2'", КодЯзыкаПечать)));//Константы.ВалютаРегламентированногоУчета.Получить().ПараметрыПрописи));
			СтруктураШапки.Вставить("СуммаНДС", Окр(СуммаНДС,2));
			СтруктураШапки.Вставить("КоличествоМестПрописью", ЧислоПрописью(Число(КоличествоМест), "Л=uk_UA; ДП=Истина", ",,,с,,,,,0"));
			СтруктураШапки.Вставить("МассаПрописью", ЧислоПрописью(Окр(Тонны, 2),"Л=uk_UA; ДП=Истина", "ціла, цілих, цілих, ж, тисячних, тисячних, тисячних, м, 3"));
			СтруктураШапки.Вставить("ГрузополучательПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Истина, Истина, Истина,, КодЯзыкаПечать));
			СтруктураШапки.Вставить("ИтогоСуммаСНДС", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураШапки.Вставить("ИтогоМасса", Формат(Тонны, "ЧДЦ=3"));
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураШапки, стрРеквизитыШапки, Истина);						
			
			Если Не СтруктураШапки.Свойство("ПлательщикПредставление") Тогда 
				СтруктураШапки.Вставить("ПлательщикПредставление", Справочники.Контрагенты.ПолучитьПредставлениеДляПечати(ВыборкаКонтрагент.ОтгрузкаКонтрагент, Истина, Ложь, Истина,,, КодЯзыкаПечать)); 
			КонецЕсли;
			
			ДокументыСопровождения = "";
			ДокументыСГрузом = "";
			ВыборкаДокументы = ВыборкаКонтрагент.Выбрать();
			СписокНомеров = Новый СписокЗначений;
			Пока ВыборкаДокументы.Следующий() Цикл 															
				Если СписокНомеров.НайтиПоЗначению(ВыборкаДокументы.ОтгрузкаНомер)=Неопределено Тогда
					СписокНомеров.Добавить(ВыборкаДокументы.ОтгрузкаНомер);
				Иначе
					Продолжить;
				КонецЕсли;
				
				ДокументыСопровождения = ДокументыСопровождения + " " + ВыборкаДокументы.ОтгрузкаНомер + ";";				
				
				ДокументыСГрузом = ДокументыСГрузом + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 №%2 от %3;'; uk = '%1 №%2 від %3;'", КодЯзыкаПечать),
				?(ВыборкаДокументы.ТипДокумента = "ПМ",
				НСтр("ru = 'Перемещение товаров'; uk = 'Переміщення товарів'", КодЯзыкаПечать),
				НСтр("ru = 'Расходная накладная'; uk = 'Видаткова накладна'", КодЯзыкаПечать)
				),
				СокрЛП(ВыборкаДокументы.ОтгрузкаНомер),
				Формат(ВыборкаДокументы.ОтгрузкаДата, "ДФ=dd.MM.yy"));
			КонецЦикла;
			
			СтрокаДокументы = НСтр("ru = 'Товар согласно накладных №'; uk = 'Товар згідно накладних №'", КодЯзыкаПечать) + ДокументыСопровождения;
			
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("НомерСтроки", 1);
			СтруктураСтроки.Вставить("ТоварНаименование", СтрокаДокументы);
			СтруктураСтроки.Вставить("БазоваяЕдиницаНаименование", "ящ");
			СтруктураСтроки.Вставить("Количество", Формат(КоличествоМест, "ЧДЦ=0; ЧРГ="));
			СтруктураСтроки.Вставить("Сумма", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0"));
			СтруктураСтроки.Вставить("ВидУпаковки", "ящик");
			СтруктураСтроки.Вставить("ДокументыСопровождения", ДокументыСГрузом);
			СтруктураСтроки.Вставить("Масса", Формат(Тонны, "ЧДЦ=3"));
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластьВсего.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
			ОбластьПодписи.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
			ОбластьАвтотранспорт.Параметры.Заполнить(стрРеквизитыШапки);
			ТабличныйДокумент.Вывести(ОбластьАвтотранспорт);
			
			ОбластьПогрузочныеОперации.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Маршрутный лист
Функция ПечатьМаршрутныйЛист(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТК_ТТНИсточники.Ссылка КАК ТТН,
	               |	ТК_ТТНИсточники.Ссылка.Номер КАК ТТН_Номер,
	               |	ТК_ТТНИсточники.Ссылка.Дата КАК ТТН_Дата,
	               |	ТК_ТТНИсточники.Ссылка.Автомобиль КАК ТТН_Автомобиль,
	               |	ТК_ТТНИсточники.Ссылка.Экспедитор КАК ТТН_Экспедитор,
	               |	ТК_ТТНИсточники.Ссылка.Водитель КАК ТТН_Водитель,
	               |	ТК_ТТНИсточники.Ссылка.Заказчик КАК ТТН_Заказчик,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ТК_ТТНИсточники.Документ ССЫЛКА Документ.РезервированиеЗаказовПокупателя
	               |			ТОГДА ТК_ТТНИсточники.Отгрузка
	               |		ИНАЧЕ ТК_ТТНИсточники.Документ
	               |	КОНЕЦ КАК Документ
	               |ПОМЕСТИТЬ ИсточникиТТН
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |ГДЕ
	               |	ТК_ТТНИсточники.Ссылка В(&МассивСсылок)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваров.Ссылка КАК Ссылка,
	               |	ПеремещениеТоваров.Дата КАК Дата,
	               |	ПеремещениеТоваров.Номер КАК Номер,
	               |	ПеремещениеТоваров.Организация КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	               |				И ПеремещениеТоваров.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	               |			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК АдресДоставки,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	               |				И ПеремещениеТоваров.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	               |			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки.Порядок
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяССылка)
	               |			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.Порядок
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Порядок,
	               |	ЕСТЬNULL(ДополнительныеСведения.Значение, ЛОЖЬ) КАК Попачка
	               |ПОМЕСТИТЬ РеквизитыДокументов
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО ПеремещениеТоваров.ДокументОснование = ДополнительныеСведения.Объект
	               |			И (ДополнительныеСведения.Свойство.Имя = ""Попачечно_b9a6d6a63dc74ae1a8f7d6a75ea25654"")
	               |ГДЕ
	               |	ПеремещениеТоваров.Ссылка В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ИсточникиТТН.Документ КАК Документ
	               |			ИЗ
	               |				ИсточникиТТН КАК ИсточникиТТН
	               |			ГДЕ
	               |				ИсточникиТТН.Документ ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваров.Ссылка,
	               |	РеализацияТоваров.Дата,
	               |	РеализацияТоваров.Номер,
	               |	РеализацияТоваров.Контрагент,
	               |	РеализацияТоваров.ТочкаДоставки.Наименование,
	               |	РеализацияТоваров.ТочкаДоставки.Порядок,
	               |	ЕСТЬNULL(ДополнительныеСведения.Значение, ЛОЖЬ)
	               |ИЗ
	               |	Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО РеализацияТоваров.ДокументОснование = ДополнительныеСведения.Объект
	               |			И (ДополнительныеСведения.Свойство.Имя = ""Попачечно_b9a6d6a63dc74ae1a8f7d6a75ea25654"")
	               |ГДЕ
	               |	РеализацияТоваров.Ссылка В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ИсточникиТТН.Документ КАК Документ
	               |			ИЗ
	               |				ИсточникиТТН КАК ИсточникиТТН
	               |			ГДЕ
	               |				ИсточникиТТН.Документ ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщику.Ссылка,
	               |	ВозвратПоставщику.Дата,
	               |	ВозвратПоставщику.Номер,
	               |	ВозвратПоставщику.Контрагент,
	               |	ВозвратПоставщику.СкладКомпании.ТочкаДоставки.Наименование,
	               |	ВозвратПоставщику.СкладКомпании.ТочкаДоставки.Порядок,
	               |	ЛОЖЬ
	               |ИЗ
	               |	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	               |ГДЕ
	               |	ВозвратПоставщику.Ссылка В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ИсточникиТТН.Документ КАК Документ
	               |			ИЗ
	               |				ИсточникиТТН КАК ИсточникиТТН
	               |			ГДЕ
	               |				ИсточникиТТН.Документ ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ПеремещениеТоваровТовары.КоличествоБазовое) КАК Количество
	               |ПОМЕСТИТЬ тчТоварыКоличество
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка,
	               |	СУММА(РеализацияТоваровТовары.КоличествоБазовое)
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |		ПО РеализацияТоваровТовары.Номенклатура = спрНоменклатура.Ссылка
	               |			И (спрНоменклатура.Ссылка В ИЕРАРХИИ (&НоменклатураБутылки))
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВозвратПоставщикуТовары.КоличествоБазовое)
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	               |	СУММА(ПеремещениеТоваровТовары.КоличествоБазовое) КАК КоличествоБазовое,
	               |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков КАК ЕдиницаИзмеренияЯщиков,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки КАК ЕдиницаИзмеренияУпаковки,
	               |	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент КАК ЕдиницаИзмеренияЯщиковКоэффициент
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.ПеремещениеТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки,
	               |	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,
	               |	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровТовары.Ссылка,
	               |	СУММА(РеализацияТоваровТовары.КоличествоБазовое),
	               |	РеализацияТоваровТовары.Номенклатура,
	               |	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки,
	               |	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |ИЗ
	               |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	               |ГДЕ
	               |	РеализацияТоваровТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.РеализацияТоваров)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровТовары.Ссылка,
	               |	РеализацияТоваровТовары.Номенклатура,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков,
	               |	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент,
	               |	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,
	               |	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	СУММА(ВозвратПоставщикуТовары.КоличествоБазовое),
	               |	ВозвратПоставщикуТовары.Номенклатура,
	               |	ВозвратПоставщикуТовары.Номенклатура.ОсновнаяЕдиницаИзмерения,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияУпаковки,
	               |	ВозвратПоставщикуТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент
	               |ИЗ
	               |	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	               |ГДЕ
	               |	ВозвратПоставщикуТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеквизитыДокументов.Ссылка КАК Ссылка
	               |			ИЗ
	               |				РеквизитыДокументов КАК РеквизитыДокументов
	               |			ГДЕ
	               |				РеквизитыДокументов.Ссылка ССЫЛКА Документ.ВозвратПоставщику)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратПоставщикуТовары.Ссылка,
	               |	ВозвратПоставщикуТовары.Номенклатура,
	               |	ВозвратПоставщикуТовары.Номенклатура.ОсновнаяЕдиницаИзмерения,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияУпаковки,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент,
	               |	ВозвратПоставщикуТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,
	               |	ВозвратПоставщикуТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	               |ИТОГИ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсточникиТТН.ТТН КАК ТТН,
	               |	ИсточникиТТН.ТТН_Номер КАК ТТН_Номер,
	               |	ИсточникиТТН.ТТН_Дата КАК ТТН_Дата,
	               |	ИсточникиТТН.ТТН_Автомобиль КАК ТТН_Автомобиль,
	               |	ИсточникиТТН.ТТН_Экспедитор КАК ТТН_Экспедитор,
	               |	ИсточникиТТН.ТТН_Водитель КАК ТТН_Водитель,
	               |	ИсточникиТТН.ТТН_Заказчик КАК ТТН_Заказчик,
	               |	ИсточникиТТН.Документ КАК Документ,
	               |	РеквизитыДокументов.Дата КАК Дата,
	               |	РеквизитыДокументов.Номер КАК Номер,
	               |	РеквизитыДокументов.Контрагент КАК Контрагент,
	               |	РеквизитыДокументов.АдресДоставки КАК АдресДоставки,
	               |	ЕСТЬNULL(тчТоварыКоличество.Количество, 0) КАК Количество,
	               |	ВЫРАЗИТЬ(РеквизитыДокументов.Порядок / 100 - 0.5 КАК ЧИСЛО(3, 0)) КАК Маршрут,
	               |	РеквизитыДокументов.Попачка КАК тПопачка
	               |ИЗ
	               |	ИсточникиТТН КАК ИсточникиТТН
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыДокументов КАК РеквизитыДокументов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ тчТоварыКоличество КАК тчТоварыКоличество
	               |			ПО РеквизитыДокументов.Ссылка = тчТоварыКоличество.Ссылка
	               |		ПО ИсточникиТТН.Документ = РеквизитыДокументов.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитыДокументов.Порядок,
	               |	ТТН_Дата,
	               |	ТТН,
	               |	ИсточникиТТН.НомерСтроки
	               |ИТОГИ
	               |	МАКСИМУМ(ТТН_Номер),
	               |	МАКСИМУМ(ТТН_Дата),
	               |	МАКСИМУМ(ТТН_Автомобиль),
	               |	МАКСИМУМ(ТТН_Экспедитор),
	               |	МАКСИМУМ(ТТН_Водитель),
	               |	МАКСИМУМ(ТТН_Заказчик),
	               |	СУММА(Количество),
	               |	МАКСИМУМ(Маршрут)
	               |ПО
	               |	ТТН";
	
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0095000"));  //Безалкогольные напитки
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0100000")); //Спиртное
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("НоменклатураБутылки", СписокНоменклатуры);
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_МаршрутныйЛист";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	КодЯзыкаПечать = "ru"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТК_ТТН.ПФ_MXL_МаршрутныйЛист");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги			= Макет.ПолучитьОбласть("Итоги");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	//МассивРезультатов[4].выгрузить()
	
	ВыборкаТЧ_Товары = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТТН = МассивРезультатов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаТТН.Следующий() Цикл						
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;						
		КонецЕсли;		
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ТекстЗаголовка", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Маршрутный лист №%1 от %2'; uk = 'Маршрутний лист №%1 від %2'", КодЯзыкаПечать),
		СокрЛП(ВыборкаТТН.ТТН_Номер),
		Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаТТН.ТТН_Дата), "ДФ=dd.MM.yyyy")));
		
		СтруктураРеквизитов.Вставить("Автомобиль", СокрЛП(ВыборкаТТН.ТТН_Автомобиль)+",     экспедитор: "+СокрЛП(ВыборкаТТН.ТТН_Экспедитор));
		СтруктураРеквизитов.Вставить("Водитель", ВыборкаТТН.ТТН_Водитель);
		СтруктураРеквизитов.Вставить("Заказчик", ВыборкаТТН.ТТН_Заказчик);
		СтруктураРеквизитов.Вставить("Количество", ВыборкаТТН.Количество);
		СтруктураРеквизитов.Вставить("Маршрут", ВыборкаТТН.Маршрут);
		//СтруктураРеквизитов.Вставить("КоличествоБутылок", Цел(ВыборкаТТН.КоличествоБутылок));
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураРеквизитов);
		
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Строка(ВыборкаТТН.ТТН.УникальныйИдентификатор()),1,190);
		ОбластьЗаголовок.Рисунки.QRКод.Картинка = Новый Картинка(ДанныеQRКода);

		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		Выборка = ВыборкаТТН.Выбрать();
		НомерСтроки = 0;
		Пока Выборка.Следующий() Цикл 
			НомерСтроки = НомерСтроки + 1;
			СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
			
			СтруктураСтроки = Новый Структура("Дата, Номер, Контрагент, АдресДоставки, Количество");
			
			ВыборкаТЧ_Товары.Сбросить();			
			
			Пока ВыборкаТЧ_Товары.НайтиСледующий(Выборка.Документ, "Ссылка") Цикл 					
				ВыборкаТовары = ВыборкаТЧ_Товары.Выбрать();					
				
				Пока ВыборкаТовары.Следующий() Цикл 
					
					КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
					ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
					ВыборкаТовары.Номенклатура,
					ВыборкаТовары.КоличествоБазовое,
					ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
					ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
					ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
					ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
					ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
					ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
					СтруктураИтоговМест);
				КонецЦикла;
				
				
			КонецЦикла;
			СтруктураСтроки.Вставить("КоличествоБутылок", ТК_УправлениеПечатью.ПредставлениеИтоговКоличестваМест(СтруктураИтоговМест, КодЯзыкаПечать));
			
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);			
			СтруктураСтроки.Вставить("НомерСтроки", НомерСтроки);
			Если ЗначениеЗаполнено(ДатаПечати) Тогда
				СтруктураСтроки.Дата = ДатаПечати;	
			КонецЕсли;
			
			Картинка = БиблиотекаКартинок.Пометка; 
			Если Выборка.тПопачка Тогда 
				ОбластьСтрока.Рисунки.Фото1.Картинка = Картинка;
			Иначе
				ОбластьСтрока.Рисунки.Фото1.Картинка = Новый Картинка;
			КонецЕсли;
			
			Если НЕ Выборка.тПопачка Тогда 
				ОбластьСтрока.Рисунки.Фото2.Картинка = Картинка;
			Иначе
				ОбластьСтрока.Рисунки.Фото2.Картинка = Новый Картинка;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьИтоги.Параметры.Заполнить(СтруктураРеквизитов);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		ОбластьПодписи.Параметры.Заполнить(СтруктураРеквизитов);
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаТТН.ТТН);		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


#КонецОбласти	
	
	
	
	
#КонецЕсли