#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область Проведение
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
		// Создадим запрос инициализации движений
		
		Запрос = Новый Запрос;
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		// Сформируем текст запроса
		
		ТекстыЗапроса = Новый СписокЗначений;
		ТекстЗапросаТаблицаПланАктивности(Запрос, ТекстыЗапроса, Регистры);
		
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
	КонецПроцедуры
	
	Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
	КонецПроцедуры
	
	Функция ТекстЗапросаТаблицаПланАктивности(Запрос, ТекстыЗапроса, Регистры)
		
		ИмяРегистра = "ПланАктивности";
		
		Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат "";
		КонецЕсли; 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ПланАктивностиПланы.Ссылка.Дата КАК Период,
		|	ПланАктивностиПланы.СкладКомпании КАК СкладКомпании,
		|	ПланАктивностиПланы.ЦелеваяМарка КАК ЦелеваяМарка,
		|	ПланАктивностиПланы.ВидПериода КАК ВидПериода,
		|	ПланАктивностиПланы.НачалоДействия КАК НачалоДействия,
		|	ПланАктивностиПланы.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ПланАктивностиПланы.Количество КАК Количество
		|ИЗ
		|	Документ.ПланАктивности.Планы КАК ПланАктивностиПланы
		|ГДЕ
		|	ПланАктивностиПланы.Ссылка = &Ссылка";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область ПрограммныйИнтерфейс	
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		//	Ленточки
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Ленточки";
		КомандаПечати.Порядок = 1;
		КомандаПечати.Картинка = БиблиотекаКартинок.Отчеты;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать ленточек';uk='Друк стрічок'");
		КомандаПечати.Представление = НСтр("ru = 'Ленточки';uk='Стрічки'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
		//	Премия
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Премия";
		КомандаПечати.Порядок = 2;
		КомандаПечати.Картинка = БиблиотекаКартинок.РазделФинансы16;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать данных по премиям';uk='Друк даних по преміях'");
		КомандаПечати.Представление = НСтр("ru = 'Премия';uk='Премія'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
		//	Выполнение
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ПланАктивности";
		КомандаПечати.Идентификатор = "Выполнение";
		КомандаПечати.Порядок = 3;
		КомандаПечати.Картинка = БиблиотекаКартинок.Сумма;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Печать данных по выполнению плана';uk='Друк даних по виконанню плану'");
		КомандаПечати.Представление = НСтр("ru = 'Выполнение плана';uk='Виконання плану'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
		
	КонецПроцедуры
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	#КонецОбласти
	
	
	#Область Печать
	
	// Формирует печатные формы.
	//
	// Параметры:
	//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
	//  ПараметрыПечати - Структура - дополнительные настройки печати;
	//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
	//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
	//                                            представление - имя области, в которой был выведен объект (выходной параметр);
	//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ленточки") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Ленточки",
			НСтр("ru = 'Ленточки';uk='Стрічки'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Ленточки"),
			,
			"Отчеты.ВыполнениеПлановАктивности.Ленточки");		
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Премия") Тогда 		
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Премия",
			НСтр("ru = 'Премия';uk='Премія'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Премия"),
			,
			"Отчеты.ВыполнениеПлановАктивности.Премия");		
		ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Выполнение") Тогда 		
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Выполнение",
			НСтр("ru = 'Выполнение плана';uk='Виконання плану'"), 
			ПечатьАктивности(МассивОбъектов, ОбъектыПечати, "Итого"),
			,
			"отчеты.ВыполнениеПлановАктивности.Итого");		
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПечатьАктивности(МассивОбъектов, ОбъектыПечати, Отчет)
		Возврат Отчеты.ВыполнениеПлановАктивности.СформироватьОтчет(МассивОбъектов[0],Отчет);
	КонецФункции
	
	
	#КонецОбласти	
	
	
	#Область СлужебныеПроцедурыИФункции
	
	
	#КонецОбласти	
	
	
	
#КонецЕсли