#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	

Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		ПредставлениеСтатуса = Строка(Запись.СостояниеВерсии);
		ПредставлениеПрогрессаПодписания = Неопределено;
		
		Если Запись.СостояниеВерсии = Перечисления.СтатусыДокументовEDI.НаПодписи 
			И ЗначениеЗаполнено(Запись.ЭлектронныйДокумент) Тогда
			ПредставлениеПрогрессаПодписания = "";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПредставлениеПрогрессаПодписания) Тогда
			Запись.ПредставлениеСостояния = СтрШаблон("%1 %2", ПредставлениеСтатуса, ПредставлениеПрогрессаПодписания);
		Иначе
			Запись.ПредставлениеСостояния = ПредставлениеСтатуса;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры






#КонецЕсли
