

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства		

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства	

КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбластьПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры
  
&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ТипГородаПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура РайонГородаПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ТипУлицыПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры

&НаКлиенте
Процедура ДопИформацияПриИзменении(Элемент)
	ПолучитьАдрес();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


&НаКлиенте
Процедура ПолучитьАдрес() Экспорт
	    Текст="";//+Строка(Число(СокрЛП(Код)))+". ";
		Текст = Текст + Строка(Объект.ТипГорода) + " " + Строка(Объект.Город)+", ";
		Если Объект.Улица<>"" Тогда
			Текст = Текст + Строка(Объект.ТипУлицы)+" "+СокрЛП(Объект.Улица);
		КонецЕсли;
		Если Объект.Дом<>"" Тогда
			Текст = Текст + ", б. " +СокрЛП(Объект.Дом);
		КонецЕсли;
		Если Объект.Корпус<>"" Тогда
			Текст = Текст + ", корп. " +СокрЛП(Объект.Корпус);
		КонецЕсли;
		Если Объект.Квартира<>"" Тогда
			Текст = Текст + ", кв. " +СокрЛП(Объект.Квартира);
		КонецЕсли;
		Если СокрЛП(Объект.НаименованиеТочки)<>"" Тогда
			Текст = Текст + ", '" +СокрЛП(Объект.НаименованиеТочки)+"'" ;
		КонецЕсли;
		Если СокрЛП(Объект.ДопИформация)<>"" Тогда
			Текст = Текст + ", " +СокрЛП(Объект.ДопИформация);
		КонецЕсли;
		
	  Объект.Наименование = Текст;
	  
КонецПроцедуры



#КонецОбласти














