#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ТипЦен.ТребуетСогласования Тогда  
		ТекПользователь = Пользователи.ТекущийПользователь();
		МожетПровести   = РегистрыСведений.СогласователиПротоколов.МожетСогласовывать(ТипЦен, ТекПользователь.ФизическоеЛицо);
		
		Если НЕ МожетПровести и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			Статус = Перечисления.СтатусыПротоколовСогласованияЦен.ТребуетСогласования;
			ОбщегоНазначения.СообщитьПользователю("Нет доступа на проведение документа, документ записан!!!");
		ИначеЕсли  МожетПровести и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Статус = Перечисления.СтатусыПротоколовСогласованияЦен.Согласован;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда 
		ЗаполнитьДокументНаОснованииПоступленияТоваров(ДанныеЗаполнения);
	Иначе
		ИнициализироватьДокумент(ДанныеЗаполнения);	
	КонецЕсли;	

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = Неопределено;
	ИнициализироватьДокумент();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ПротоколСогласованияЦен.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Если ДополнительныеСвойства.ДляПроведения.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПротоколСогласованияЦенАкция") Тогда
		ЦенообразованиеСервер.ОтразитьСогласованиеЦенАкция(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		ЦенообразованиеСервер.ОтразитьСогласованиеЦен(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	ЦенообразованиеСервер.ОтразитьЦеныКонтрагентов(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДатаНачалаДействия < НачалоДня(ТекущаяДата()) Тогда 
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Если Не ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекущийПользователь,"НеКонтролироватьДатуНачалаДействияИзмененияЦен", Ложь) Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Запрещено проводить Протокол согласования цен с датой начала действия в заднем числе'; uk = 'Заборонено проводити Зміну цін з датою почтаку дії у задньому числі'"),
			ЭтотОбъект,"ДатаНачалаДействия"
			);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

	
	
	
	
	
	

#Область ИнициализацияИЗаполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор				  = Пользователи.ТекущийПользователь();
	ДатаВводаВАссортимент = НачалоДня(ТекущаяДатаСеанса());
	//ХозОперация	 		  = Справочники.ХозОперации.ВводТоваровВАссортимент;
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	КурсДокумента         = 1;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииПоступленияТоваров(Знач ПоступлениеОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Справочник.Хозоперации.ПротоколСогласованияЦен) КАК ХозОперация,
	               |	ПоступлениеТоваров.Организация КАК Организация,
	               |	ПоступлениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ПоступлениеТоваров.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеТоваров.КурсДокумента КАК КурсДокумента,
	               |	ПоступлениеТоваров.Ссылка КАК ДокументОснование,
	               |	ПоступлениеТоваров.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ПоступлениеТоваров.Контрагент КАК Контрагент,
	               |	ПоступлениеТоваров.ТипЦен КАК ТипЦен,
	               |	НАЧАЛОПЕРИОДА(ПоступлениеТоваров.Дата, ДЕНЬ) КАК ДатаНачалаДействия,
	               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПоступлениеТоваров.Дата, ДЕНЬ), ГОД, 1) КАК СрокДействия,
	               |	ПоступлениеТоваров.Товары.(
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		СтавкаНДС КАК СтавкаНДС,
	               |		Цена КАК Цена,
	               |		ЦенаБезНалогов КАК ЦенаБезНалогов
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |ГДЕ
	               |	ПоступлениеТоваров.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ПоступлениеОснование);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		Товары.Очистить();
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл 
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТовары);
		КонецЦикла;
	КонецЕсли;	
		
	Автор =  Пользователи.ТекущийПользователь();

КонецПроцедуры



#КонецОбласти

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
#КонецЕсли