
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("Антимонопольный"));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриходыНаСервере()
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   			Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	 			Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   			КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   			Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);

	Документы.Антимонопольный.ЗполнитьДанныеПоПриходам(ДанныеДокумента,Объект.ТаблицаОтчета1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриходы(Команда)
	ЗаполнитьПриходыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыНаСервере()
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	   Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);
	
	Документы.Антимонопольный.ЗполнитьДанныеПоРасходам(ДанныеДокумента,Объект.ТаблицаОтчета2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасходы(Команда)
	ЗаполнитьРасходыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговуюНаСервере()
	ТаблицаПриходов     =   Объект.ТаблицаОтчета1.Выгрузить(,"КодАМ,КоличествоПриход");
	ТаблицаПриходов.Свернуть("КодАМ","КоличествоПриход");
	
	
	Объект.ТаблицаОтчета3.Очистить();
	ТаблицаИтог = Объект.ТаблицаОтчета3.Выгрузить();
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	   Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);
	
	Документы.Антимонопольный.ЗполнитьДанныеПоРознице(ДанныеДокумента,ТаблицаИтог);
	
	
	Для Каждого Стр Из ТаблицаПриходов Цикл 
		НоваяСтрока = ТаблицаИтог.Добавить();
		НоваяСтрока.КодАМ = СокрЛП(Стр.КодАМ);
		НоваяСтрока.ПриходОпт = Стр.КоличествоПриход;
	КонецЦикла;
	ТаблицаРасходов =    Объект.ТаблицаОтчета2.Выгрузить(,"КодАМ,КоличествоРасход");
	ТаблицаРасходов.Свернуть("КодАМ","КоличествоРасход");
	Для Каждого Стр Из ТаблицаРасходов Цикл 
		НоваяСтрока = ТаблицаИтог.Добавить();
		НоваяСтрока.КодАМ = СокрЛП(Стр.КодАМ);
		НоваяСтрока.РасходОпт = Стр.КоличествоРасход;
	КонецЦикла;
	ТаблицаИтог.Свернуть("КодАМ","ОстатокНаНачало,ПриходВсего,ПриходПроизводитель,ПриходОпт,ПриходИмпорт,РасходВсего,РасходРозница,РасходОпт,РасходЭкспорт,ОстатокНаКонец,КоличествоРасходПоОтчету,СуммаРасходПоОтчету,КоличествоРасход,СуммаРасход");
	
	Для Каждого Стр Из ТаблицаИтог Цикл 
		Стр.ПриходВсего = Стр.ПриходПроизводитель + Стр.ПриходОпт + Стр.ПриходИмпорт;
		Стр.РасходВсего = Стр.РасходРозница + Стр.РасходОпт + Стр.РасходЭкспорт;
		Стр.ОстатокНаКонец = Стр.ОстатокНаНачало - Стр.РасходВсего + Стр.ПриходВсего;
		
	КонецЦикла;
	
	
	Объект.ТаблицаОтчета3.Загрузить(ТаблицаИтог);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтоговую(Команда)
	ЗаполнитьИтоговуюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3КоличествоРасходПоОтчетуПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.КоличествоРасходПоОтчету",ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3СуммаРасходПоОтчетуПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.СуммаРасходПоОтчету",ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3ОстатокНаНачалоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.ОстатокНаКонец",ТекущаяСтрока);
КонецПроцедуры





&НаКлиенте
Функция ОбработкаРеквизита(Имя,ТекСтрока) 
	Если Имя = "ТаблицаОтчета3.КоличествоРасходПоОтчету" Тогда
		ЦенаЗаЕд =  ?(ТекСтрока.КоличествоРасход = 0 ,0,ТекСтрока.СуммаРасход  / ТекСтрока.КоличествоРасход);
		ТекСтрока.СуммаРасходПоОтчету =   ЦенаЗаЕд * ТекСтрока.КоличествоРасходПоОтчету;
		ОбработкаРеквизита("ТаблицаОтчета3.СуммаРасходПоОтчету",ТекСтрока);
		ОбработкаРеквизита("ТаблицаОтчета3.РасходРозница",ТекСтрока);

	ИначеЕсли Имя = "ТаблицаОтчета3.СуммаРасходПоОтчету" Тогда
		КолВоГрн =  ?(ТекСтрока.СуммаРасход = 0 ,0,ТекСтрока.КоличествоРасход/ ТекСтрока.СуммаРасход);
		ТекСтрока.КоличествоРасходПоОтчету =   КолВоГрн * ТекСтрока.СуммаРасходПоОтчету;
		ТекСтрока.РасходРозница = ТекСтрока.КоличествоРасходПоОтчету;
		ОбработкаРеквизита("ТаблицаОтчета3.РасходРозница",ТекСтрока);
		
	ИначеЕсли Имя = "ТаблицаОтчета3.РасходРозница" Тогда
		ТекСтрока.РасходВсего = ТекСтрока.РасходРозница + ТекСтрока.РасходОпт + ТекСтрока.РасходЭкспорт;
		ОбработкаРеквизита("ТаблицаОтчета3.ОстатокНаКонец",ТекСтрока);
		
	ИначеЕсли Имя = "ТаблицаОтчета3.ОстатокНаКонец" Тогда
		ТекСтрока.ОстатокНаКонец = ТекСтрока.ОстатокНаНачало + ТекСтрока.ПриходВсего -  ТекСтрока.РасходВсего;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция НайтиКодТеритории(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК КодТеритории
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Контрагенты
		|	И ДополнительныеСведения.Свойство.Имя = ""КодТеритории""
		|	И ДополнительныеСведения.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат "";
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.КодТеритории;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ТаблицаОтчета1КонтрагентПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОтчета1.ТекущиеДанные;
	ТекДанные.КодТеретории = НайтиКодТеритории(ТекДанные.Контрагент);
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОтчета2КодТереторииПриИзменении(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОтчета2КонтрагентПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОтчета2.ТекущиеДанные;
	ТекДанные.КодТеретории = НайтиКодТеритории(ТекДанные.Контрагент);
КонецПроцедуры

