#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс


Функция СформироватьДокументы(Знач ДеревоДокументов, Знач ДопПараметры) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Организация = ДопПараметры.Организация;
	
	Автор = Пользователи.ТекущийПользователь();
	ВалютаДокумента = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладыКомпании.Ссылка КАК СкладКомпании,
	               |	СкладыКомпании.Подразделение КАК Подразделение,
	               |	СкладыКомпании.ТипЦенСебестоимости КАК ТипЦен,
	               |	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ЕСТЬNULL(ТК_УчетХарактеристикНаСкладахСрезПоследних.НеВестиУчетПоХарактеристикам, ЛОЖЬ) КАК НеВестиУчетПоХарактеристикам
	               |ИЗ
	               |	РегистрСведений.ТК_УчетХарактеристикНаСкладах.СрезПоследних КАК ТК_УчетХарактеристикНаСкладахСрезПоследних,
	               |	Справочник.СкладыКомпании КАК СкладыКомпании
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(, ТорговаяПлощадка = ВЫРАЗИТЬ(&Ссылка КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	               |		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	               |ГДЕ
	               |	СкладыКомпании.Ссылка = &Ссылка";
	
	Результат = Новый Структура;
	
	Ит = 0;
	Для Каждого СтрокаДереваДокумент Из ДеревоДокументов.Строки Цикл 
		Ит = Ит + 1;
		
		Если СтрокаДереваДокумент.Выбор = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДопПараметры.СкладКомпании.Подразделение <> СтрокаДереваДокумент.ДоговорПокупателя.Подразделение Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Подразделение склада %1 не соответствует подразделению договора. Пропускаем...'; uk = 'Підрозділ %1 складу %1 не відповідає підрозділу договору. Пропускаємо...'"),
			ДопПараметры.СкладКомпании));					
			Продолжить;
		КонецЕсли;
		
		ДокументЗаказОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		
		СкладКомпании = ДопПараметры.СкладКомпании;

		Запрос.УстановитьПараметр("Ссылка", СкладКомпании);
		РеквизитыСклада = Новый Структура("Подразделение, ТипЦен, Организация, ТорговаяПлощадка, НеВестиУчетПоХарактеристикам",
									ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка"),
									ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка"),
									ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка"),
									Ложь);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ЗаполнитьЗначенияСвойств(РеквизитыСклада, Выборка);		
		КонецЕсли;

		ДокументЗаказОбъект.РегламентированныйУчет = Истина;
		
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		ДокументЗаказОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПокупателя");
		ДокументЗаказОбъект.Организация = Организация;
		ДокументЗаказОбъект.Автор = Автор;
		ДокументЗаказОбъект.ПодразделениеКомпании = РеквизитыСклада.Подразделение;		
		ДокументЗаказОбъект.ТорговаяПлощадка = РеквизитыСклада.ТорговаяПлощадка;
		ДокументЗаказОбъект.СкладКомпании = СкладКомпании;
		ДокументЗаказОбъект.ТипЦен = РеквизитыСклада.ТипЦен;
		ДокументЗаказОбъект.ВалютаДокумента = ВалютаДокумента;
		ДокументЗаказОбъект.КурсДокумента = 1;
				
		ДокументЗаказОбъект.Дата = ТекущаяДата();
		ДокументЗаказОбъект.УстановитьНовыйНомер();
		
		ДокументЗаказОбъект.Контрагент = СтрокаДереваДокумент.Контрагент;
		ДокументЗаказОбъект.ДоговорВзаиморасчетов = СтрокаДереваДокумент.ДоговорПокупателя;
		ДокументЗаказОбъект.ТочкаДоставки= СтрокаДереваДокумент.ТочкаДоставки;
		
		Для Каждого СтрокаТовары Из СтрокаДереваДокумент.Строки Цикл 
			НоваяСтрокаТовары = ДокументЗаказОбъект.Товары.Добавить();
			
			НоваяСтрокаТовары.Номенклатура = СтрокаТовары.ДокументНоменклатура;			
			НоваяСтрокаТовары.ХарактеристикаНоменклатуры =  Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			Количество = СтрокаТовары.Количество*НоваяСтрокаТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент;
			НоваяСтрокаТовары.Количество =   Количество;
			НоваяСтрокаТовары.КоличествоБазовое =   Количество;
		КонецЦикла;
		
		тзТоварыДокумента = ДокументЗаказОбъект.Товары.Выгрузить();
		
		Кэш = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокументЗаказОбъект,,ТекущаяДата()));
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокументЗаказОбъект.Контрагент,ДокументЗаказОбъект.Организация,ДокументЗаказОбъект.ТорговаяПлощадка,"Реализация"));
		СтруктураДействий.Вставить("ПересчитатьЦенуСНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	

		Для Каждого ТекущаяСтрока Из тзТоварыДокумента Цикл 
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
		    ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Кэш);					
		КонецЦикла;			
		
		Разделить = Ложь;
		КопияСтавка = тзТоварыДокумента.Скопировать();
		КопияСтавка.Свернуть("СтавкаНДС");
		Если КопияСтавка.Количество() > 1 Тогда
			Разделить = Истина;
		КонецЕсли;
		
		Если Разделить 	Тогда 
			НайденыеСтроки = тзТоварыДокумента.НайтиСтроки(Новый Структура("СтавкаНДС", Справочники.СтавкиНДС.БезНДС));
			тзБезНДС  = тзТоварыДокумента.Скопировать(НайденыеСтроки);
			Для Каждого стр из НайденыеСтроки Цикл
				тзТоварыДокумента.Удалить(стр);
			КонецЦикла;
			
			ДокументЗаказОбъект.Товары.Загрузить(тзТоварыДокумента);
			
			Попытка
				Если ДокументЗаказОбъект.ПроверитьЗаполнение() Тогда 
					ДокументЗаказОбъект.Записать();
				Иначе
					ДокументЗаказОбъект.Записать();
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокументЗаказОбъект.Ссылка),
					ДокументЗаказОбъект.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокументЗаказОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			
			ДокКопия = ДокументЗаказОбъект.Скопировать();
			ДокКопия.УстановитьНовыйНомер();
			ДокКопия.Товары.Очистить();
			ДокКопия.Товары.Загрузить(тзБезНДС);
			Попытка
				Если ДокКопия.ПроверитьЗаполнение() Тогда 
					ДокКопия.Записать();
				Иначе
					ДокКопия.Записать();
					
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокКопия.Ссылка),
					ДокКопия.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокКопия.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			ДокументЗаказОбъект.Товары.Загрузить(тзТоварыДокумента);
			
			Попытка
				Если ДокументЗаказОбъект.ПроверитьЗаполнение() Тогда 
					ДокументЗаказОбъект.Записать();
				Иначе
					ДокументЗаказОбъект.Записать();
					ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 не проведен'; uk = 'Документ %1 не проведений'"),
					ДокументЗаказОбъект.Ссылка),
					ДокументЗаказОбъект.Ссылка);
				КонецЕсли;
			Исключение                                                                  
				ДокументЗаказОбъект.Записать();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		СтрокаДереваДокумент.Выбор = Ложь	
		
	КонецЦикла;	
	
	Результат.Вставить("ДеревоДокументов", ДеревоДокументов);
	
	Возврат Результат;
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДеревоДокументов(СтруктураДокумента, ДеревоДокументов)
	
	СтрокаДерева = ДеревоДокументов.Строки.Добавить();
	СтрокаДерева.ДокументНоменклатура = "Документ № "+ СтруктураДокумента.НомерДокумента + " от "+ Формат(СтруктураДокумента.ДатаДокумента,"ДФ=dd.MM.yyyy");
	СтрокаДерева.ДатаДокумента = ТекущаяДата();
	СтрокаДерева.ИмяФайла       = СтруктураДокумента.ИмяФайла;
	СтрокаДерева.Выбор = Истина;
	 	
	Для Каждого СтрокаТовары Из СтруктураДокумента.Товары Цикл 
		СтрокаДереваТовары = СтрокаДерева.Строки.Добавить();
		
		СтрокаДереваТовары.ДокументНоменклатура = СтрокаТовары.Номенклатура;   
		СтрокаДереваТовары.Количество = СтрокаТовары.Количество;
		СтрокаДереваТовары.Цена       = СтрокаТовары.Цена;
		СтрокаДереваТовары.СуммаВсего = СтрокаТовары.Цена * СтрокаТовары.Количество;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТоварПоКодуПоставщика(Код)
	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ДополнительныеСведения.Объект КАК Номенклатура
		                    |ИЗ
		                    |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		                    |ГДЕ
		                    |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
		                    |	И ДополнительныеСведения.Свойство.Имя = ""КодТедис""
		                    |	И ДополнительныеСведения.Значение = &КодТедис");
		
		Запрос.УстановитьПараметр("КодТедис",Код);
		РезультатПоиска=Запрос.Выполнить();
		
		Если РезультатПоиска.Пустой() Тогда
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		Иначе
			Выборка = РезультатПоиска.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Номенклатура;
			
		КонецЕсли;
	
КонецФункции

#КонецОбласти



#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
