//--------------------------- доступы ---------------------------------
&НаСервере
функция позволеныАдминистративныеФункцииПромоакций ()
	предикат1 = ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.ПолныеПрава)
	ИЛИ  ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.АдминистрированиеПромоакций);
	возврат предикат1;
КонецФункции

функция яСупервайзер ()
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.ПолныеПрава)
		ИЛИ  ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(метаданные.Роли.АдминистрированиеПромоакций)	
		тогда
		возврат истина;	
	КонецЕсли;
	текГруппаДоступности =  получитьГруппуДоступностиПромоакцийПоМенеджеру (Пользователи.ТекущийПользователь());
	Если текГруппаДоступности <> неопределено тогда
		если текГруппаДоступности.Супервайзер тогда
			возврат истина;
		КонецЕсли;		
	КонецЕсли;
	возврат ложь;
КонецФункции
//--------------------------- доступы конец ---------------------------------



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//если у пользователя нет группы доступности, тогда не пускаем в форму
	грДрст = получитьГруппуДоступностиПромоакцийПоМенеджеру(Пользователи.АвторизованныйПользователь());
	если грДрст = неопределено тогда
		//ПоказатьПредупреждение(,"Пользователь "+Строка(Пользователи.АвторизованныйПользователь())+" не принадлежит ни к одной из групп доступности",10,"Нарушение доступа");
		Сообщить ("Пользователь "+Строка(Пользователи.АвторизованныйПользователь())+" не принадлежит ни к одной из групп доступности");
		
		Отказ=истина;
		возврат;
	КонецЕсли;
	
	Если не параметры.парПромоакция.Пустая() тогда
		объект.Промоакция = параметры.парПромоакция;		
	КонецЕсли;	
	фильтрСпискаНоменклатуры ();
	
КонецПроцедуры



//***********************************************************************
//*** Основная функция, обновляющая таблицу. При добавлении новых     ***
//*** столбцов в регистр, нужно дописывать запрос из этой функции,    ***
//*** чтобы для нас брало нужные поля.                                ***
//***********************************************************************

&НаСервере
Процедура фильтрСпискаНоменклатуры () экспорт
	объект.СписокНоменклатуры.Очистить();
	Если ЗначениеЗаполнено(Объект.Промоакция) тогда 
		тз = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураПромоакций.ид КАК ид,
		|	НоменклатураПромоакций.Менеджер КАК Менеджер,
		|	НоменклатураПромоакций.Промоакция КАК Промоакция,
		|	НоменклатураПромоакций.Номенклатура КАК Номенклатура,
		|	НоменклатураПромоакций.Номенклатура.Артикул КАК Артикул,
		|	НоменклатураПромоакций.Номенклатура.НаименованиеПолное КАК НаименованиеТовара,
		|	НоменклатураПромоакций.Номенклатура.ТоварнаяМарка КАК ТорговаяМарка,
		|	НоменклатураПромоакций.СтатусПозиции КАК СтатусПозиции,
		|	НоменклатураПромоакций.Покрытие КАК Покрытие,
		|	НоменклатураПромоакций.УсловиеОтгрузки КАК УсловиеОтгрузки,
		|	НоменклатураПромоакций.ДоговорИзлишки КАК ДоговорИзлишки,
		|	НоменклатураПромоакций.Компенсация1шт КАК Компенсация1шт,
		|	НоменклатураПромоакций.Номенклатура.ТипНоменклатурыПланирования КАК ТипНоменклатуры,
		|	НоменклатураПромоакций.Характеристика КАК Характеристика,
		|	НоменклатураПромоакций.РозничнаяЦена КАК РозничнаяЦена,
		|	НоменклатураПромоакций.Поставщик КАК Поставщик,
		|	НоменклатураПромоакций.Договор КАК Договор,
		|	НоменклатураПромоакций.НачалоОтгрузки КАК НачалоОтгрузки,
		|	НоменклатураПромоакций.ОкончаниеОтгрузки КАК ОкончаниеОтгрузки,
		|	НоменклатураПромоакций.АкционнаяЦена КАК АкционнаяЦена,
		|	НоменклатураПромоакций.СуммаОплаты КАК СуммаОплаты,
		|	НоменклатураПромоакций.ПроцентКомпенсации КАК ПроцентКомпенсации,
		|	НоменклатураПромоакций.ПроцентСкидки КАК ПроцентСкидки,
		|	НоменклатураПромоакций.РозничнаяЦенаДоАкции КАК РозничнаяЦенаДоАкции,
		|	НоменклатураПромоакций.ДоАкционнаяЦена КАК ДоАкционнаяЦена,
		|	НоменклатураПромоакций.ОбъемПродажПредПериод КАК ОбъемПродажПредПериод,
		|	НоменклатураПромоакций.ОбъемПродажАкционный КАК ОбъемПродажАкционный,
		|	НоменклатураПромоакций.Комментарий КАК Комментарий,
		|	НоменклатураПромоакций.РекламаСтраница КАК РекламаСтраница,
		|	НоменклатураПромоакций.РекламаБорд КАК РекламаБорд,
		|	НоменклатураПромоакций.ТипРозничнойЦены КАК ТипРозничнойЦены,
		|	НоменклатураПромоакций.ДоходОтТекущихПродаж КАК ДоходОтТекущихПродаж,
		|	НоменклатураПромоакций.ДоходностьОтТекущихПродаж КАК ДоходностьОтТекущихПродаж,
		|	НоменклатураПромоакций.ПланируемыйДоходБезКомпенсации КАК ПланируемыйДоходБезКомпенсации,
		|	НоменклатураПромоакций.ПланируемаяДоходностьБезКомпенсации КАК ПланируемаяДоходностьБезКомпенсации,
		|	НоменклатураПромоакций.ПланируемаяКомпенсация КАК ПланируемаяКомпенсация,
		|	НоменклатураПромоакций.ИтогоДоходСКомпенсации КАК ИтогоДоходСКомпенсации,
		|	НоменклатураПромоакций.ПланируемаяДоходностьСКомпенсацией КАК ПланируемаяДоходностьСКомпенсацией,
		|	НоменклатураПромоакций.ПриростВДоходе КАК ПриростВДоходе,
		|	НоменклатураПромоакций.КоличествоТТ КАК КоличествоТТ,
		|	НоменклатураПромоакций.ДатаЗагрузки КАК ДатаЗагрузки,
		|	НоменклатураПромоакций.Мониторинг КАК Мониторинг,
		|	НоменклатураПромоакций.ДатаПоследнегоМониторинга КАК ДатаПоследнегоМониторинга,
		|	НоменклатураПромоакций.РекомендуемаяРозничнаяЦена КАК РекомендуемаяРозничнаяЦена,
		|	НоменклатураПромоакций.ДМП КАК ДМП,
		|	НоменклатураПромоакций.ТипЗакупочнойЦены КАК ТипЗакупочнойЦены,
		|	НоменклатураПромоакций.МинимальнаяЦенаМониторинга КАК МинимальнаяЦенаМониторинга
		|ИЗ
		|	РегистрСведений.НоменклатураПромоакций КАК НоменклатураПромоакций
		|ГДЕ
		|	НоменклатураПромоакций.Промоакция = &Промоакция";
		з = новый запрос (тз);
		з.УстановитьПараметр("Промоакция",Объект.Промоакция);
		з.УстановитьПараметр("ТекущийПользователь",Пользователи.АвторизованныйПользователь());
		рез = з.Выполнить();
		таб = рез.Выгрузить();
		таб.ВыбратьСтроку();
		Объект.СписокНоменклатуры.Загрузить(таб);
	КонецЕсли;
КонецПроцедуры

//***********************************************************************
//***   КОНЕЦ   *   КОНЕЦ*   КОНЕЦ*   КОНЕЦ*   КОНЕЦ*   КОНЕЦ*   КОНЕЦ***
//***********************************************************************

&НаКлиенте
Процедура ПромоакцияПриИзменении(Элемент)
	Объект.СписокНоменклатуры.Очистить();
	Если ЗначениеЗаполнено(объект.Промоакция) тогда
		фильтрСпискаНоменклатуры ();
		Элементы.ИнфоПромоакция.Заголовок="с "+Формат(получитьЗначениеРеквизита(объект.Промоакция,"ДатаНачала"),"ДФ=dd.MM.yyyy")+" по "+Формат(получитьЗначениеРеквизита(объект.Промоакция,"ДатаОкончания"),"ДФ=dd.MM.yyyy");
	иначе
		Элементы.ИнфоПромоакция.Заголовок="промоакция не выбрана";
	КонецЕсли;
	установкаВидимостиИДоступности ();
КонецПроцедуры

&НаКлиенте
процедура установкаВидимостиИДоступности ()
	Если не ЗначениеЗаполнено(объект.Промоакция) тогда
		элементы.СписокНоменклатуры.ТолькоПросмотр=Истина;
		доступностьДопКнопокМеню (ложь);
	иначе
		элементы.СписокНоменклатуры.ТолькоПросмотр=Ложь;
		доступностьДопКнопокМеню (истина);
	КонецЕсли;
	элементы.СписокНоменклатуры.ПодчиненныеЭлементы.СписокНоменклатурыСтатусПозиции.ТолькоПросмотр = не можноРедактироватьСтатусПозиции ();
	//элементы.СписокНоменклатуры.ПодчиненныеЭлементы.СписокНоменклатурыПокрытие.ТолькоПросмотр = не яСупервайзер();
	//элементы.СписокНоменклатуры.ПодчиненныеЭлементы.СписокНоменклатурыПокрытие.ТолькоПросмотр = истина;
	//теперь повторно установим "только просмотр" списка номенклатуры
	Если ЗначениеЗаполнено(объект.Промоакция) тогда
		Если получитьЗначениеРеквизита(объект.Промоакция,"Закрыта") тогда
			Элементы.СписокНоменклатуры.ТолькоПросмотр=Истина;
			доступностьДопКнопокМеню (ложь);
		иначе
			элементы.СписокНоменклатуры.ТолькоПросмотр=Ложь;
			доступностьДопКнопокМеню (истина);			
		КонецЕсли;
	КонецЕсли;
	
	яСупервайзер = яСупервайзер();
	элементы.СписокНоменклатурыОтменитьУтверждено.Доступность=яСупервайзер;
	Элементы.СписокНоменклатурыВыполнитьМониторинг.Доступность=яСупервайзер;	
	//если яСупервайзер() тогда
	//	элементы.СписокНоменклатурыОтменитьУтверждено.Доступность=Истина;
	//	Элементы.СписокНоменклатурыВыполнитьМониторинг.Доступность=Истина;
	//иначе
	//	элементы.СписокНоменклатурыОтменитьУтверждено.Доступность=ложь;
	//	Элементы.СписокНоменклатурыВыполнитьМониторинг.Доступность=ложь;
	//КонецЕсли;
КонецПроцедуры

процедура доступностьДопКнопокМеню (тдоступность)
	для каждого стр из элементы.СписокНоменклатуры.КоманднаяПанель.ПодчиненныеЭлементы цикл
		стр.Доступность=тдоступность;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	//ф=0;
	рез =  проверитьНаличиеНоменклатурыВДругихАкциях ();
	Если рез = неопределено тогда
		пересчетСтрокиТабличнойЧасти(,,,,истина);
	иначе сообщить (рез);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
функция проверитьНаличиеНоменклатурыВДругихАкциях ()
	отказ = ложь;
	ОтменаРедактирования=ложь;
	текущиеДанные =  Элементы.СписокНоменклатуры.ТекущиеДанные;
	ДатаНачала = получитьЗначениеРеквизита(Объект.Промоакция,"ДатаНачала");
	ДатаОкончания = получитьЗначениеРеквизита(Объект.Промоакция,"ДатаОкончания");
	
	Если НЕ текущиеДанные= неопределено тогда
		Если ЗначениеЗаполнено(текущиеДанные.Номенклатура) тогда
			рез=СписокНоменклатурыПередОкончаниемРедактированияНаСервере(текущиеДанные.Номенклатура, ДатаНачала, ДатаОкончания,истина, ОтменаРедактирования, Отказ,текущиеДанные.ид);
			возврат рез;
		КонецЕсли;		
	КонецЕсли;
	возврат Неопределено;
КонецФункции


&НаКлиенте

процедура пересчетСтрокиТабличнойЧасти (перечитыватьИзБазы=ложь,пересчитыватьЗначения = ложь,пересчитыватьАкционноеКоличество = истина,знач текдан = неопределено
	,удалятьКомментарий = ложь) экспорт
	Если текдан = неопределено тогда
		текдан = Элементы.СписокНоменклатуры.ТекущиеДанные;		
	КонецЕсли;
	
	//перечитыватьИзБазы и пересчитыватьЗначения - имеется ввиду принудительно
	Если текдан <> неопределено тогда
		Если ЗначениеЗаполнено(текдан.Номенклатура) тогда
			//текНоменклатура = РеквизитФормыВЗначение( текдан.Номенклатура,Тип("СправочникСсылка.Номенклатура"));
			Если не ЗначениеЗаполнено(текдан.Мониторинг) тогда
				текдан.Мониторинг = получитьЗначениеПеречисления("РезультатыМониторингаПромоакций","НеПроводился");
			КонецЕсли;
			
			текАртикул = получитьЗначениеРеквизита (текдан.Номенклатура,"Артикул");
			текдан.Артикул = текАртикул;
			//-------------------------------------------------------------------------------------------------------
			текГруппаДоступности = получитьГруппуДоступностиПромоакцийПоМенеджеру (текдан.Менеджер);
			текТипЦен = неопределено;
			типЗакупочнойЦены = неопределено;
			Если не текГруппаДоступности = неопределено тогда
				Если текГруппаДоступности = неопределено тогда
					текТипЦен =         получитьЭлементСправочникаПоКоду ("ТипыЦен","DG000003");//розничная					
					типЗакупочнойЦены = получитьЭлементСправочникаПоКоду ("ТипыЦен","DG000002");
				иначе
					текТипЦен =         текГруппаДоступности. ТипРозничнойЦены;
					типЗакупочнойЦены = текГруппаДоступности.типЗакупочнойЦены; 
				КонецЕсли;
			КонецЕсли;
			текдан.ТипРозничнойЦены = текТипЦен;
			текдан.типЗакупочнойЦены = типЗакупочнойЦены;
			
			текдан.НаименованиеТовара =  получитьЗначениеРеквизита          (текдан.Номенклатура,"НаименованиеПолное");
			текдан.ТорговаяМарка =       получитьЗначениеРеквизита               (текдан.Номенклатура,"ТоварнаяМарка");
			текдан.ТипНоменклатуры =     получитьЗначениеРеквизита (текдан.Номенклатура,"ТипНоменклатурыПланирования");
			
			Если (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыПокрытие") тогда
				текдан.КоличествоТТ =  получитьКоличествоТТВПокрытии (текдан.Покрытие);
			КонецЕсли;
			//--------------------------------------------------------------------------------------------------------
			Если (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыНоменклатура") 
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыХарактеристика") 
				или перечитыватьИзБазы 
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыПокрытие")
				тогда
				//отдельно выполним действия, если поле "Номенклатура" является текущим изменяемым реквизитом
				Если (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыНоменклатура") тогда					
					
				КонецЕсли;
				Если удалятьКомментарий тогда
					текдан.Комментарий = "";	
				КонецЕсли;
				
				
				
				//текдан.РозничнаяЦена        = получитьРозничнуюЦенуНоменклатурыПоМенеджеру (текдан.Номенклатура,текдан.Характеристика,текдан.Менеджер,текТипЦен       );
				текдан.РозничнаяЦенаДоАкции = получитьРозничнуюЦенуНоменклатурыПоМенеджеру (текдан.Номенклатура,текдан.Характеристика,текдан.Менеджер,текТипЦен,истина);
				
				//**********************************************************************************************************************************************************
				//***   закупочные цены    ***    закупочные цены    ***   закупочные цены    ***   закупочные цены    ***   закупочные цены    ***   закупочные цены    ***
				//**********************************************************************************************************************************************************				
				инфоЦенаПоставщик        =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(текдан.Номенклатура, текдан.Характеристика,текДан.ТипЗакупочнойЦены);
				Если не инфоЦенаПоставщик = неопределено тогда
					текдан.Поставщик         =  инфоЦенаПоставщик.Контрагент;
					//текдан.АкционнаяЦена     =  инфоЦенаПоставщик.Цена;
					инфоЦенаПоставщикДоАкции =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(текдан.Номенклатура, текдан.Характеристика,текДан.ТипЗакупочнойЦены,истина);
					Если не инфоЦенаПоставщикДоАкции = неопределено тогда
						текдан.ДоАкционнаяЦена   =  инфоЦенаПоставщикДоАкции.Цена;
					КонецЕсли;					
				КонецЕсли;
				//**********************************************************************************************************************************************************
				
				//расчетики
				//тут уже приходится
				текдан.ПроцентКомпенсации = (1-((текдан.АкционнаяЦена- текдан.Компенсация1шт)/?(не ЗначениеЗаполнено(текдан.ДоАкционнаяЦена),1,текдан.ДоАкционнаяЦена)))*100;
				нПроцентСкидки      = ((текдан.РозничнаяЦена/ ?(не ЗначениеЗаполнено(текдан.РозничнаяЦенаДоАкции),1,текдан.РозничнаяЦенаДоАкции))-1)*100;
				текдан.ПроцентСкидки      = Окр(нПроцентСкидки,0,РежимОкругления.Окр15как10);
				//данныеГруппыДоступности =  получитьГруппуДоступностиПромоакцийПоМенеджеру(текдан.Менеджер);
				//Если не данныеГруппыДоступности = неопределено тогда
				//	Если не (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыПокрытие") тогда
				//		текдан.Покрытие = данныеГруппыДоступности.Покрытие;
				//	КонецЕсли;	
				//КонецЕсли;
				Если не (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыПокрытие") тогда
					текПокрытие = получитьПокрытиеПоНоменклатуре (текдан.Номенклатура);
					Если ЗначениеЗаполнено(текПокрытие) тогда
						текдан.Покрытие = получитьПокрытиеПоНоменклатуре (текдан.Номенклатура);
					КонецЕсли;					
				КонецЕсли;
				//объемыПродаж =   получитьОбъемПродажЗаПредыдущийПериод( текдан.Покрытие,текдан.Номенклатура);
				//текдан.ОбъемПродажПредПериод = объемыПродаж.КоличествоОборот;	
				//Если (пересчитыватьАкционноеКоличество) ИЛИ (текДан.Комментарий = "") тогда
				//	текДан.ОбъемПродажАкционный =  объемыПродаж.КоличествоОборотСПриростомСумма;
				//КонецЕсли;				
			КонецЕсли;
			Если (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыНоменклатура")
				ИЛИ элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыХарактеристика"
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыОбъемПродажАкционный") 
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыКомпенсация1шт") 
				ИЛИ пересчитыватьЗначения 
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыПокрытие")
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыРозничнаяЦена")
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыРозничнаяЦенаДоАкции")
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыДоАкционнаяЦена")
				ИЛИ (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыАкционнаяЦена")
				тогда
				//--------------------------------
				текдан.ПроцентКомпенсации = Цел((1-((текдан.АкционнаяЦена- текдан.Компенсация1шт)/?(не ЗначениеЗаполнено(текдан.ДоАкционнаяЦена),1,текдан.ДоАкционнаяЦена)))*100);
				//------------------------------------
				//Если текдан.РозничнаяЦенаДоАкции = 0 тогда
				//	текдан.ПроцентСкидки      =0;
				//иначе
				//	текдан.ПроцентСкидки      = (1- (текдан.РозничнаяЦена/ текдан.РозничнаяЦенаДоАкции))*100;
				//КонецЕсли;
				//----------------------------	
				текдан.ДоходОтТекущихПродаж = (текдан.РозничнаяЦенаДоАкции - текдан.ДоАкционнаяЦена)*текдан.ОбъемПродажПредПериод;
				Если текдан.ОбъемПродажПредПериод*текдан.РозничнаяЦенаДоАкции = 0 тогда
					текДан.ДоходностьОтТекущихПродаж = 0;
				иначе					
					текДан.ДоходностьОтТекущихПродаж =  (текдан.ДоходОтТекущихПродаж/(текдан.ОбъемПродажПредПериод*текдан.РозничнаяЦенаДоАкции))*100;
				КонецЕсли;
				//----------------------------------
				текДан.ПланируемыйДоходБезКомпенсации =  (текдан.РозничнаяЦена - текдан.АкционнаяЦена)*текдан.ОбъемПродажАкционный;
				Если  текДан.ОбъемПродажАкционный*текдан.РозничнаяЦена = 0 тогда
					текДан.ПланируемаяДоходностьБезКомпенсации = 0;
				иначе 					
					текДан.ПланируемаяДоходностьБезКомпенсации = текДан.ПланируемыйДоходБезКомпенсации/(текДан.ОбъемПродажАкционный*текдан.РозничнаяЦена)*100;
				КонецЕсли;
				//----------------------------------------------
				текДан.ПланируемаяКомпенсация =  текдан.ДоАкционнаяЦена* текДан.ОбъемПродажАкционный;
				текДан.ИтогоДоходСКомпенсации =  текДан.ПланируемаяКомпенсация + текДан.ПланируемыйДоходБезКомпенсации;
				а =  текдан.РозничнаяЦена*текдан.ОбъемПродажАкционный;
				Если а = 0 тогда
					текДан.ПланируемаяДоходностьСКомпенсацией = 0;
				иначе					
					текДан.ПланируемаяДоходностьСКомпенсацией =  текДан.ИтогоДоходСКомпенсации/?(а=0,1,а)*100;
				КонецЕсли;
				Если текдан.ДоходОтТекущихПродаж = 0 тогда
					текдан.ПриростВДоходе = 0;
				иначе					
					текдан.ПриростВДоходе = ((текДан.ИтогоДоходСКомпенсации/текдан.ДоходОтТекущихПродаж)-1)*100;
				КонецЕсли;
				
				текдан.КоличествоТТ =  получитьКоличествоТТВПокрытии (текдан.Покрытие);
				//Если это до-акционная цена менялась, придется перемониторить одну строку
				Если (элементы.СписокНоменклатуры.ТекущийЭлемент.Имя = "СписокНоменклатурыРозничнаяЦена") тогда
					Если ЗначениеЗаполнено(текдан.МинимальнаяЦенаМониторинга) тогда
						Если (текдан.РозничнаяЦена+0.1)<=текдан.МинимальнаяЦенаМониторинга тогда
							текдан.Мониторинг = получитьЗначениеПеречисления("РезультатыМониторингаПромоакций","Успешно");
						иначе
							текдан.Мониторинг = получитьЗначениеПеречисления("РезультатыМониторингаПромоакций","Отказано");
							текдан.РекомендуемаяРозничнаяЦена = текдан.МинимальнаяЦенаМониторинга-0.1;							
						КонецЕсли;						
					Иначе
						//можно предупредить, что в этом случае мониторинг одной строки невозможен, или данные мониторинга недоступны
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//получатели данных на сервере
&НаСервере
функция получитьКоличествоТТВПокрытии (покрытие)
	Если ЗначениеЗаполнено(покрытие) тогда
		возврат покрытие.Состав.Количество();
	КонецЕсли;	
	возврат 0;
КонецФункции


функция получитьЭлементСправочникаПоКоду (ИмяСправочника,Код)
	возврат Справочники[ИмяСправочника].найтипоКоду(Код);	
КонецФункции

функция получитьЗначениеРеквизита (эл,имяРеквизита)
	//текЭл = РеквизитФормыВЗначение( эл);
	возврат эл[имяРеквизита];
КонецФункции

функция получитьТекущегоПользователя ()
	возврат Пользователи.АвторизованныйПользователь();	
КонецФункции

функция получитьРозничнуюЦенуНоменклатурыПоМенеджеру (Номенклатура,Характеристика,Менеджер,текТипЦен,доАкционная = ложь)
	Если ЗначениеЗаполнено(Номенклатура) и ЗначениеЗаполнено(Менеджер) тогда
		//сначала по менеджеру находим настройку и из неё извлекаем тип цен
		тз = "ВЫБРАТЬ
		|	МАКСИМУМ(isnull(ЦеныСрезПоследних.Цена,0)) КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(
		|			&ДатаПо,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И ТипЦен = &ТипЦен
		|) КАК ЦеныСрезПоследних";
		з=новый запрос(тз);
		Если доАкционная тогда			
			з.УстановитьПараметр("ДатаПо",КонецДня(объект.Промоакция.ДатаНачала-1));
		иначе
			з.УстановитьПараметр("ДатаПо",КонецДня(объект.Промоакция.ДатаОкончания));
		КонецЕсли;
		
		з.УстановитьПараметр("Номенклатура",Номенклатура);
		з.УстановитьПараметр("Характеристика",Характеристика);
		
		з.УстановитьПараметр("ТипЦен",текТипЦен);
		рез = з.Выполнить();
		Если рез.Пустой() тогда
			возврат 0;
		иначе
			выборка = рез.Выбрать();
			выборка.Следующий();
			возврат выборка.Цена;
		КонецЕсли;		
	КонецЕсли;
	возврат 0;
КонецФункции

функция получитьГруппуДоступностиПромоакцийПоМенеджеру (Менеджер)
	Если ЗначениеЗаполнено(Менеджер) тогда
		тз="ВЫБРАТЬ
		|	ГруппыДоступаПромоакций.Ссылка КАК Ссылка,
		|	ГруппыДоступаПромоакций.Супервайзер КАК Супервайзер,
		|	ГруппыДоступаПромоакций.ТипРозничнойЦены КАК ТипРозничнойЦены,
		|	ГруппыДоступаПромоакций.Покрытие КАК Покрытие,
		|	ГруппыДоступаПромоакций.ТипЗакупочнойЦены КАК ТипЗакупочнойЦены
		|ИЗ
		|	Справочник.ГруппыДоступаПромоакций КАК ГруппыДоступаПромоакций
		|ГДЕ
		|	НЕ ГруппыДоступаПромоакций.ПометкаУдаления
		|	И ГруппыДоступаПромоакций.Пользователь = &Пользователь";
		з = новый запрос (тз);
		з.УстановитьПараметр("Пользователь",Менеджер);
		рез = з.Выполнить();
		Если рез.Пустой() тогда
			возврат Неопределено;
		иначе
			выборка = рез.Выбрать();
			выборка.Следующий();
			СтруктураВозврата = новый Структура ("Ссылка,Супервайзер,ТипРозничнойЦены,Покрытие,ТипЗакупочнойЦены",выборка.Ссылка,выборка.Супервайзер,выборка.ТипРозничнойЦены,выборка.Покрытие,выборка.ТипЗакупочнойЦены);
			возврат СтруктураВозврата;
		КонецЕсли;		
	КонецЕсли;
	возврат неопределено;
КонецФункции

функция  получитьПоставщикаИАкционнуюЦенуИзСпецификации (номенклатура, характеристика, типЦены, доАкционная = ложь )
	структураВозврата = получитьПоставщикаИАкционнуюЦенуИзСпецификацииСл (номенклатура, характеристика, типЦены, "СогласованиеЦенАкция", доАкционная);
	Если структураВозврата = неопределено тогда
		возврат  получитьПоставщикаИАкционнуюЦенуИзСпецификацииСл (номенклатура, характеристика, типЦены, "СогласованиеЦен", доАкционная);		
	КонецЕсли;
	возврат структураВозврата;
КонецФункции

функция получитьПоставщикаИАкционнуюЦенуИзСпецификацииСл (номенклатура, характеристика, типЦены, имяРегистра, доАкционная = ложь )
	//это у нас закупочная цена (будем надеяться, что всегда)
	структураВозврата = новый Структура("Контрагент,Цена",Справочники.Контрагенты.ПустаяСсылка(),0);
	Если ЗначениеЗаполнено(номенклатура) тогда
		//ДатаНачалаТекущейАкции = объект.Промоакция.ДатаНачала;
		//СекундВДне = 60*60*24;	
		//плюсОдинДень = 1;
		//ВыбКоличествоДней=14;
		//ДатаПо = 	НачалоДня(ДатаНачалаТекущейАкции)-1;
		//
		//ДатаС = НачалоДня(ДатаПо)- (ВыбКоличествоДней-плюсОдинДень)*СекундВДне;	
		
		з = новый запрос;
		тз = "ВЫБРАТЬ
		|	СогласованиеЦенСрезПоследних.Контрагент КАК Контрагент,
		|	МАКСИМУМ(СогласованиеЦенСрезПоследних.Цена) КАК Цена
		|ИЗ
		|	РегистрСведений.СогласованиеЦен.СрезПоследних(
		|			&ДатаПо,
		|			ИСТИНА
		|				И СрокДействия >= &СрокДействияНачало
		|				И Номенклатура = &Номенклатура) КАК СогласованиеЦенСрезПоследних
		|ГДЕ
		|	СогласованиеЦенСрезПоследних.Регистратор.ТипЦен = &ТипЦен
		|
		|СГРУППИРОВАТЬ ПО
		|	СогласованиеЦенСрезПоследних.Контрагент";
		
		
		Если доАкционная тогда
			тз=СтрЗаменить(тз,"И СрокДействия >= &СрокДействияНачало","");
			з.УстановитьПараметр("ДатаПо",КонецДня(Объект.Промоакция.ДатаНачала-1));
		иначе
			з.УстановитьПараметр("ДатаПо",КонецДня(Объект.Промоакция.ДатаОкончания));
		КонецЕсли;
		//чтобы остался запрос доступный конструктору, просто заменяем в тексте запроса нужные участки
		тз = СтрЗаменить(тз,"СогласованиеЦен",имяРегистра);
		
		з.Текст = тз;
		
		
		з.УстановитьПараметр("СрокДействияНачало",НачалоДня(объект.Промоакция.ДатаНачала));		
		з.УстановитьПараметр("Номенклатура",номенклатура);
		//з.УстановитьПараметр("характеристика",характеристика);
		з.УстановитьПараметр("ТипЦен",типЦены);
		рез = з.Выполнить();
		если не рез.Пустой() тогда
			выборка = рез.Выбрать();
			выборка.Следующий();
			структураВозврата = новый Структура("Контрагент,Цена",выборка.Контрагент,выборка.Цена);
		иначе
			возврат неопределено;
		КонецЕсли;		
	КонецЕсли;
	возврат структураВозврата;
КонецФункции

функция получитьОбъемПродажЗаПредыдущийПериод ( Покрытие, Номенклатура,получитьРасшифровку = ложь)
	//ДатаНачалаТекущейАкции = объект.Промоакция.ДатаНачала;
	//СекундВДне = 60*60*24;	
	//плюсОдинДень = 1;
	//ВыбКоличествоДней=14;
	//ДатаПо = 	НачалоДня(ДатаНачалаТекущейАкции)-1;
	
	//ДатаС = НачалоДня(ДатаПо)- (ВыбКоличествоДней-плюсОдинДень)*СекундВДне;	
	//датаШоБудетЕслиДобавить1 =  ДатаНачалаТекущейАкции+плюсОдинДень;
	//возврат выбратьОбъемПродажЗаПериод (ДатаС,ДатаПо,Покрытие, Номенклатура,получитьРасшифровку);
КонецФункции

функция выбратьОбъемПродажЗаПериод (знач ДатаС,знач ДатаПо, Покрытие, Номенклатура,получитьРасшифровку = ложь)
	//
	//структураВозврата = новый структура("КоличествоОборот,КоличествоОборотСПриростомСумма");
	//Если не ЗначениеЗаполнено(Покрытие) тогда
	//	возврат структураВозврата;
	//КонецЕсли;
	//
	//тз = "ВЫБРАТЬ
	//     |	ПокрытияСостав.ТорговаяПлощадка КАК ТорговаяПлощадка,
	//     |	МАКСИМУМ(ВЫБОР
	//     |			КОГДА ЕСТЬNULL(ПокрытияСостав.КоэффициентАкционногоПрироста, 1) = 0
	//     |				ТОГДА 1
	//     |			ИНАЧЕ ЕСТЬNULL(ПокрытияСостав.КоэффициентАкционногоПрироста, 1)
	//     |		КОНЕЦ) КАК КоэффициентАкционногоПрироста
	//     |ПОМЕСТИТЬ спрПокрытие
	//     |ИЗ
	//     |	Справочник.Покрытия.Состав КАК ПокрытияСостав
	//     |ГДЕ
	//     |	ПокрытияСостав.Ссылка = &Ссылка
	//     |
	//     |СГРУППИРОВАТЬ ПО
	//     |	ПокрытияСостав.ТорговаяПлощадка
	//     |;
	//     |
	//     |////////////////////////////////////////////////////////////////////////////////
	//     |ВЫБРАТЬ
	//     |	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК ПолеПериода,
	//     |	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
	//     |	СРЕДНЕЕ(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК ОборотСреднее,
	//     |	ПродажиОбороты.ТорговаяПлощадка КАК ТорговаяПлощадка,
	//     |	МАКСИМУМ(ЕСТЬNULL(спрПокрытие.КоэффициентАкционногоПрироста, 1)) КАК КоэффициентАкционногоПрироста,
	//     |	СУММА(ЕСТЬNULL(спрПокрытие.КоэффициентАкционногоПрироста, 1) * ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК КоличествоОборотСПриростомСумма,
	//     |	СРЕДНЕЕ(ЕСТЬNULL(спрПокрытие.КоэффициентАкционногоПрироста, 1) * ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК КоличествоОборотСПриростомСреднее
	//     |ИЗ
	//     |	РегистрНакопления.Продажи.Обороты(
	//     |			&ДатаС,
	//     |			&ДатаПо,
	//     |			День,
	//     |			Номенклатура = &Номенклатура
	//     |				И ТорговаяПлощадка В ИЕРАРХИИ (&ТорговаяПлощадка)) КАК ПродажиОбороты
	//     |		ЛЕВОЕ СОЕДИНЕНИЕ спрПокрытие КАК спрПокрытие
	//     |		ПО ПродажиОбороты.ТорговаяПлощадка = спрПокрытие.ТорговаяПлощадка
	//     |
	//     |СГРУППИРОВАТЬ ПО
	//     |	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ),
	//     |	ПродажиОбороты.ТорговаяПлощадка
	//     |
	//     |УПОРЯДОЧИТЬ ПО
	//     |	ПолеПериода";
	//з = новый запрос (тз);
	//з.УстановитьПараметр("ТорговаяПлощадка",получитьТорговыеПлощадкиПокрытия (Покрытие));
	//з.УстановитьПараметр("ДатаС",НачалоДня(ДатаС));
	//з.УстановитьПараметр("ДатаПо",КонецДня(ДатаПо));
	//з.УстановитьПараметр("Номенклатура",Номенклатура);
	//з.УстановитьПараметр("Ссылка",Покрытие);
	//рез = з.Выполнить();
	//табДаты = новый ТаблицаЗначений;
	//Если не рез.Пустой() тогда
	//	
	//	//создаем таблицу по датам
	//	СекундВДне = 60*60*24;
	//	табДаты = новый ТаблицаЗначений;
	//	табДаты.Колонки.Добавить("Дата");
	//	табДаты.Колонки.Добавить("КолВо");
	//	табДаты.Колонки.Добавить("КолВоАкция");
	//	табДаты.Колонки.Добавить("Среднее");
	//	для н = 0 по 13 цикл
	//		нов = табДаты.Добавить();
	//		нов.Дата = НачалоДня(ДатаС+ СекундВДне*н + н);
	//	КонецЦикла;
	//	
	//	табРезДетально = рез.Выгрузить();
	//	//делаем копию таблицы и сворачиваем по периоду, чтобы посчитать среднее по дням
	//	табРез = табРезДетально.Скопировать(,"ПолеПериода,КоличествоОборот,КоличествоОборотСПриростомСумма");
	//	табРез.Свернуть("ПолеПериода","КоличествоОборот,КоличествоОборотСПриростомСумма");
	//	
	//	средний = табрез.Итог("КоличествоОборот")/табРез.Количество();
	//	среднийАкция = табрез.Итог("КоличествоОборотСПриростомСумма")/табРез.Количество();
	//	для каждого стр из табДаты цикл
	//		//структураПоиска = новый структура ("ПолеПериода",стр.Дата);
	//		найд = табРез.Найти(стр.Дата,"ПолеПериода");
	//		если найд = неопределено тогда
	//			стр.КолВо = средний;
	//			стр.КолВоАкция = среднийАкция;
	//			стр.Среднее = истина;
	//		иначе
	//			стр.КолВо = найд.КоличествоОборот;
	//			стр.КолВоАкция = найд.КоличествоОборотСПриростомСумма;
	//			стр.Среднее = ложь;
	//		КонецЕсли;			
	//	КонецЦикла;	
	//	структураВозврата.КоличествоОборот = табДаты.Итог("КолВо");
	//	структураВозврата.КоличествоОборотСПриростомСумма = табДаты.Итог("КолВоАкция");
	//	
	//	//****************************************************************************************************************************
	//	//****************************** возвращаем "до кучи" табдок с расшифровкой, если необходимо *********************************
	//	//****************************************************************************************************************************
	//	
	//	Если получитьРасшифровку тогда
	//		табдок = новый ТабличныйДокумент;
	//		обработка =  РеквизитФормыВЗначение("Объект");
	//		макет = Обработка.ПолучитьМакет("Макет");
	//		
	//		обл = макет.ПолучитьОбласть("ЗаголовокОтчета");
	//		табдок.Вывести(обл);
	//		
	//		//указываем параметры
	//		обл = макет.ПолучитьОбласть("строкаПараметра");
	//		обл.Параметры.Параметр = "Номенклатура: ";
	//		обл.Параметры.ЗначениеПараметра = Номенклатура;
	//		табдок.Вывести(обл);
	//		
	//		обл = макет.ПолучитьОбласть("строкаПараметра");
	//		обл.Параметры.Параметр = "Покрытие: ";
	//		обл.Параметры.ЗначениеПараметра = Покрытие;
	//		табдок.Вывести(обл);
	//		
	//		обл = макет.ПолучитьОбласть("строкаПараметра");
	//		обл.Параметры.Параметр = "До-акционный период: ";
	//		обл.Параметры.ЗначениеПараметра = Формат (ДатаС,"ДФ=dd.MM.yyyy")+" - "+Формат (ДатаПо,"ДФ=dd.MM.yyyy");
	//		табдок.Вывести(обл);
	//		
	//		обл = макет.ПолучитьОбласть("строкаПараметра");
	//		обл.Параметры.Параметр = "Акционный период: ";
	//		обл.Параметры.ЗначениеПараметра = Формат (Объект.Промоакция.ДатаНачала,"ДФ=dd.MM.yyyy")+" - "+Формат (Объект.Промоакция.ДатаОкончания,"ДФ=dd.MM.yyyy");
	//		табдок.Вывести(обл);			
	//		
	//		обл = макет.ПолучитьОбласть("ШапкаТаблицы");
	//		табдок.Вывести(обл);
	//		нппДетально = 1;
	//		табдок.НачатьАвтогруппировкуСтрок();
	//		для каждого стр1 из табДаты цикл
	//			если стр1.Среднее тогда
	//				обл = макет.ПолучитьОбласть("ГруппаПериод1");
	//			иначе				
	//				обл = макет.ПолучитьОбласть("ГруппаПериод");
	//			КонецЕсли;
	//			обл.Параметры.Заполнить(стр1);
	//			табдок.Вывести(обл,1);
	//			структураПоиска = новый структура ("ПолеПериода", стр1.Дата);
	//			найд = табРезДетально.НайтиСтроки(структураПоиска);
	//			для каждого стр2 из найд цикл
	//				обл = макет.ПолучитьОбласть("строкаДетально");
	//				обл.Параметры.Заполнить(стр2);
	//				обл.Параметры.нпп = нппДетально;
	//				табдок.Вывести(обл,2);
	//				нппДетально=нппДетально+1;
	//			КонецЦикла; 
	//		КонецЦикла;
	//		табдок.ЗакончитьАвтогруппировкуСтрок();
	//		обл = макет.ПолучитьОбласть("Итого");
	//		обл.Параметры.КолВо = табДаты.Итог("КолВо");
	//		обл.Параметры.КолВоАкция = табДаты.Итог("КолВоАкция");
	//		табдок.Вывести(обл);
	//		//обл = макет.ПолучитьОбласть("ЖирныйНиз");
	//		табдок.ФиксацияСверху = 8 ;
	//		табдок.ТолькоПросмотр=Истина;
	//		табдок.АвтоМасштаб=Истина;
	//		табдок.ПоказатьУровеньГруппировокСтрок(1);
	//		табдок.ОтображатьЗаголовки=Ложь;
	//		табдок.ОтображатьСетку=Ложь;
	//		//табдок.Показать("Расшифровка объемов до-акционных и акционных (плановых) продаж");
	//		структураВозврата.Вставить("табдок",табдок);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//возврат структураВозврата;
КонецФункции

функция получитьТорговыеПлощадкиПокрытия (Покрытие)
	Если не (Покрытие=справочники.Покрытия.ПустаяСсылка() или покрытие = неопределено) тогда
		возврат Покрытие.Состав.ВыгрузитьКолонку ("ТорговаяПлощадка");
	иначе
		сз = новый СписокЗначений;
		сз.Добавить(справочники.ТорговыеПлощадки.ПустаяСсылка());
		возврат сз;
	КонецЕсли;	
КонецФункции

функция получитьПокрытиеПоНоменклатуре (Номенклатура)
	Если ЗначениеЗаполнено (Номенклатура) тогда
		тз = "ВЫБРАТЬ
		|	ПокрытияАртикулов.Покрытие КАК Покрытие
		|ИЗ
		|	РегистрСведений.ПокрытияАртикулов КАК ПокрытияАртикулов
		|ГДЕ
		|	ПокрытияАртикулов.Номенклатура = &Номенклатура";
		з=новый запрос (тз);
		з.УстановитьПараметр("Номенклатура",Номенклатура);
		рез = з.Выполнить();
		Если рез.Пустой() тогда
			возврат неопределено;
		иначе
			выборка = рез.Выбрать();
			выборка.Следующий();
			возврат выборка.Покрытие;
		КонецЕсли;
	иначе
		возврат неопределено;		
	КонецЕсли;	
КонецФункции

функция получитьЗначениеПеречисления (ИмяПеречисления,ИмяЭлемента)
	возврат перечисления[ИмяПеречисления][ИмяЭлемента];	
КонецФункции

// КОНЕЦ получатели данных на сервере
&НаКлиенте
Процедура СписокНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
	Если НоваяСтрока тогда
		Если Элементы.СписокНоменклатуры.ТекущиеДанные <> неопределено тогда
			Элементы.СписокНоменклатуры.ТекущиеДанные.ид = "";
			Элементы.СписокНоменклатуры.ТекущиеДанные.Промоакция = Объект.Промоакция;
			Элементы.СписокНоменклатуры.ТекущиеДанные.Менеджер=получитьТекущегоПользователя();
			Элементы.СписокНоменклатуры.ТекущиеДанные.Мониторинг = получитьЗначениеПеречисления("РезультатыМониторингаПромоакций","НеПроводился");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

//************************************************************************
//**     проверяем, не пересекается ли номенклатура с другой акцией     **
//************************************************************************

&НаСервере
функция добавитьОбновить (текСтрока, ключ,обязательныеПоля=неопределено)
	Если (типЗнч(текСтрока) = тип("Структура")) И (типЗнч(ключ)=тип("Структура")) тогда
		для каждого стр из ключ цикл
			текЗнач = стр.Значение;
			Если не ЗначениеЗаполнено(текЗнач) тогда
				возврат ложь;
			КонецЕсли;	
		КонецЦикла;
		Если типЗнч(обязательныеПоля)=тип("Структура") тогда
			для каждого стр из обязательныеПоля цикл
				текЗнач = стр.Значение;
				Если не ЗначениеЗаполнено(текЗнач) тогда
					возврат ложь;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
		для каждого стр из ключ цикл
			МенеджерЗаписи[стр.Ключ] = стр.Значение;	
		КонецЦикла;
		
		МенеджерЗаписи.Прочитать();
		записьСуществует = МенеджерЗаписи.Выбран();
		//для каждого стр из текСтрока цикл
		//	Если НЕ (стр.Представление = "НомерСтроки" ИЛИ стр.Представление = "Артикул" ИЛИ стр.Представление = "НаименованиеТовара" ИЛИ стр.Представление = "ТорговаяМарка") тогда
		//		МенеджерЗаписи[стр.Представление] = стр.Значение;
		//	КонецЕсли;			
		//КонецЦикла;
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,текСтрока);
		Если не записьСуществует тогда
			//типа создаем новую запись
			для каждого стр из ключ цикл
				МенеджерЗаписи[стр.Ключ] = стр.Значение;	
			КонецЦикла;			
		КонецЕсли;		
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	возврат истина;
КонецФункции

&НаСервере
функция ДобавитьДляПривязки (Ключ,ОбязательныеПоля)
	Если типЗнч(ключ) = тип("Структура") Тогда
		для каждого стр из Ключ цикл
			текЗнач = стр.Значение;
			Если не ЗначениеЗаполнено(текЗнач) Тогда
				возврат ложь;
			КонецЕсли;	
		КонецЦикла;
		Если типЗнч(ОбязательныеПоля)=тип("Структура") Тогда
			для каждого стр из ОбязательныеПоля цикл
				текЗнач = стр.Значение;
				Если не ЗначениеЗаполнено(текЗнач) Тогда
					возврат ложь;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияПривязкиПромо.СоздатьМенеджерЗаписи();
		для каждого стр из Ключ цикл
			МенеджерЗаписи[стр.Ключ] = стр.Значение;	
		КонецЦикла;
		
		МенеджерЗаписи.Прочитать();
		ЗаписьСуществует = МенеджерЗаписи.Выбран();
		Если ЗаписьСуществует Тогда
			Если МенеджерЗаписи.СтатусСогласования<>ОбязательныеПоля.СтатусСогласования Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОбязательныеПоля);
				МенеджерЗаписи.Обработан = Ложь;
				//Если не записьСуществует тогда
				//	//типа создаем новую запись
				//	для каждого стр из ключ цикл
				//		МенеджерЗаписи[стр.Ключ] = стр.Значение;	
				//	КонецЦикла;			
				//КонецЕсли;		
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		ИначеЕсли ОбязательныеПоля.СтатусСогласования = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОбязательныеПоля);
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
функция ДобавитьДляПереоценки (Ключ,ОбязательныеПоля)
	Если типЗнч(ключ) = тип("Структура") Тогда
		для каждого стр из Ключ цикл
			текЗнач = стр.Значение;
			Если не ЗначениеЗаполнено(текЗнач) Тогда
				возврат ложь;
			КонецЕсли;	
		КонецЦикла;
		Если типЗнч(ОбязательныеПоля)=тип("Структура") Тогда
			для каждого стр из ОбязательныеПоля цикл
				текЗнач = стр.Значение;
				Если не ЗначениеЗаполнено(текЗнач) Тогда
					возврат ложь;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.РезультатыВыполненияПереоценкиПромо.СоздатьМенеджерЗаписи();
		для каждого стр из Ключ цикл
			МенеджерЗаписи[стр.Ключ] = стр.Значение;	
		КонецЦикла;
		
		МенеджерЗаписи.Прочитать();
		ЗаписьСуществует = МенеджерЗаписи.Выбран();
		Если ЗаписьСуществует Тогда
			Если МенеджерЗаписи.СтатусСогласования<>ОбязательныеПоля.СтатусСогласования Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОбязательныеПоля);
				МенеджерЗаписи.ОбработкаНачалаАкции = Ложь;
				МенеджерЗаписи.ОбработкаОкончанияАкции = Ложь;
				//Если не записьСуществует тогда
				//	//типа создаем новую запись
				//	для каждого стр из ключ цикл
				//		МенеджерЗаписи[стр.Ключ] = стр.Значение;	
				//	КонецЦикла;			
				//КонецЕсли;		
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		ИначеЕсли ОбязательныеПоля.СтатусСогласования = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ОбязательныеПоля);
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции


функция СписокНоменклатурыПередОкончаниемРедактированияНаСервере(Номенклатура, ДатаНачала, ДатаОкончания,НоваяСтрока, ОтменаРедактирования, Отказ,ид)
	попытка
		Если ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) тогда
			тз = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НоменклатураПромоакций.Номенклатура КАК Номенклатура,
			|	НоменклатураПромоакций.Промоакция КАК Промоакция,
			|	НоменклатураПромоакций.Промоакция.ДатаНачала КАК ПромоакцияДатаНачала,
			|	НоменклатураПромоакций.Промоакция.ДатаОкончания КАК ПромоакцияДатаОкончания,
			|	НоменклатураПромоакций.ид КАК ид
			|ИЗ
			|	РегистрСведений.НоменклатураПромоакций КАК НоменклатураПромоакций
			|ГДЕ
			|	НЕ НоменклатураПромоакций.Промоакция.ПометкаУдаления
			|	И НоменклатураПромоакций.Промоакция.ДатаНачала <= &ДатаОкончания
			|	И НоменклатураПромоакций.Промоакция.ДатаОкончания >= &ДатаНачала
			|	И НоменклатураПромоакций.Номенклатура = &Номенклатура
			|	И НоменклатураПромоакций.ид <> &ид";
			з = новый запрос (тз);
			з.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала)); 
			з.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
			з.УстановитьПараметр("Номенклатура", Номенклатура);
			з.УстановитьПараметр("ид", ид);
			рез = з.Выполнить();
			Если рез.Пустой() тогда
				возврат неопределено;
			иначе
				Выборка = рез.Выбрать();
				выборка.Следующий();
				//ОтменаРедактирования=истина;
				Отказ=истина;
				возврат "Номенклатура уже участвует в акции: "+Выборка.Промоакция+" с "+Формат(выборка.ПромоакцияДатаНачала,"ДФ=dd.MM.yyyy")+" по "+ Формат(выборка.ПромоакцияДатаОкончания,"ДФ=dd.MM.yyyy");
			КонецЕсли;		
		КонецЕсли;
	исключение
		//ОтменаРедактирования=истина;
		Отказ=истина;		
		возврат ОписаниеОшибки();
	КонецПопытки;
	возврат неопределено;
КонецФункции

&НаСервере
Процедура СохранитьЗначения(НомерСтроки); 
	ТекСтрока = Объект.СписокНоменклатуры.НайтиПоИдентификатору(НомерСтроки);
	Набор = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	Набор.ид = ТекСтрока.ид;
	Набор.Прочитать();
	Если Набор.Выбран() Тогда 
		ЗаполнитьЗначенияСвойств(Набор,ТекСтрока);
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	добавитьОбновитьНаКлиенте (Элемент, НоваяСтрока, ОтменаРедактирования, Отказ);
	Если НЕ НоваяСтрока И Не ОтменаРедактирования ТОгда
		ТекДан = элементы.СписокНоменклатуры.ТекущиеДанные;
		
		Ид = ТекДан.ПолучитьИдентификатор();
		СохранитьЗначения(Ид);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
процедура добавитьОбновитьНаКлиенте (Элемент, НоваяСтрока, ОтменаРедактирования, Отказ,знач текущиеДанные=неопределено)
	Если текущиеДанные= неопределено тогда
		текущиеДанные =  Элементы.СписокНоменклатуры.ТекущиеДанные;
	КонецЕсли;
	
	Если текущиеДанные <> неопределено тогда
		//проверим, чтобы все видимые элементы были заполнены
		Если текущиеДанные.СтатусПозиции = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") Тогда 
			для каждого стр из элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
				Если СтрНайти(стр.Подсказка, "**обязательное**")<>0 тогда
					текИмя =  СтрЗаменить(стр.Имя,"СписокНоменклатуры","");
					текЗаголовок = СокрЛП(СтрЗаменить(стр.Заголовок,Символы.ПС, " "));
					Если ПустаяСтрока(текЗаголовок) тогда
						текЗаголовок = стр.Имя;
					КонецЕсли;
					
					если не ЗначениеЗаполнено(текущиеДанные[текИмя]) тогда
						Сообщить(Строка(текущиеДанные.НомерСтроки)+". Не заполнено значение в колонке """+текЗаголовок+""", строка не сохранена!",СтатусСообщения.Внимание);
						ОтменаРедактирования=истина;
						//Отказ=Истина;
						возврат;
					КонецЕсли;				
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;			
		
		текКол = элементы.СписокНоменклатуры.ТекущийЭлемент;
		
		ДатаНачала = получитьЗначениеРеквизита(Объект.Промоакция,"ДатаНачала");
		ДатаОкончания = получитьЗначениеРеквизита(Объект.Промоакция,"ДатаОкончания");
		//работа с колонкой номенклатуры
		//Если текКол.Имя = "СписокНоменклатурыНоменклатура" тогда
		рез = СписокНоменклатурыПередОкончаниемРедактированияНаСервере(текущиеДанные.Номенклатура, ДатаНачала, ДатаОкончания,НоваяСтрока, ОтменаРедактирования, Отказ,текущиеДанные.ид);
		Если рез <> неопределено тогда
			Сообщить(рез,СтатусСообщения.Важное);
			текущиеДанные.Номенклатура=неопределено;
		КонецЕсли;
		Если не Отказ тогда
			//добавим/отредактируем строчку
			//о=ДанныеФормыВЗначение(СписокНоменклатуры,тип("ДанныеФормыСтруктураСКоллекцией"));
			списокЗначенийСтроки = новый Структура;
			для каждого стр из Элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
				Если типзнч(стр) = тип("ГруппаФормы") тогда
					заполнитьСтруктуруЗначенийРекурсивно (списокЗначенийСтроки,стр,текущиеДанные);
					продолжить;
				КонецЕсли;
				
				имя=стр.Имя;
				имя=СтрЗаменить(имя,"СписокНоменклатуры","");
				значение =  текущиеДанные[имя];
				//списокЗначенийСтроки.Добавить(значение,имя);
				списокЗначенийСтроки.Вставить(имя,значение);
			КонецЦикла;
			ид = текущиеДанные.ид;
			Если не ЗначениеЗаполнено(ид) тогда
				ид = СокрЛП(новый УникальныйИдентификатор);
			КонецЕсли;
			
			обязательныеПоля = новый структура("ид,Номенклатура,Промоакция,Менеджер",ид,текущиеДанные.Номенклатура,текущиеДанные.Промоакция,текущиеДанные.Менеджер);
			ключ = новый структура("ид",ид);
			Если не добавитьОбновить (списокЗначенийСтроки, ключ,обязательныеПоля) тогда
				Сообщить ("(Ошибка на сервере) Строка не записана, так как не все обязательные или ключеные поля заполнены");
			Иначе
				КлючПривязки = Новый Структура("ГуидСтроки",ид);
				ОбязательныеПоляПривязки = Новый Структура("ГуидСтроки,СтатусСогласования,ДатаУтверждения,Менеджер",ид,текущиеДанные.СтатусПозиции,ТекущаяДата(),ПользователиКлиент.ТекущийПользователь());
				
				Если Не ДобавитьДляПривязки(КлючПривязки, ОбязательныеПоляПривязки) Тогда	
					Сообщить ("(Ошибка на сервере) Данные для привязки не записаны, так как не все обязательные или ключеные поля заполнены");
				КонецЕсли;			
				
				ОбязательныеПоляПереоценки = Новый Структура("ГуидСтроки,СтатусСогласования,ДатаУтверждения,Менеджер",ид,текущиеДанные.СтатусПозиции,ТекущаяДата(),ПользователиКлиент.ТекущийПользователь());
				
				Если Не ДобавитьДляПереоценки(КлючПривязки, ОбязательныеПоляПереоценки) Тогда	
					Сообщить ("(Ошибка на сервере) Данные для привязки не записаны, так как не все обязательные или ключеные поля заполнены");
				КонецЕсли;			
			КонецЕсли;			
			текущиеДанные.ид = ключ.ид;
		КонецЕсли;	
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
функция заполнитьСтруктуруЗначенийРекурсивно (знач предСтруктура,знач стр,текущиеДанные)
	для каждого стр из стр.ПодчиненныеЭлементы цикл
		Если типзнч(стр) = тип("ГруппаФормы") тогда
			заполнитьСтруктуруЗначенийРекурсивно (предСтруктура,стр,текущиеДанные);
			продолжить;
		КонецЕсли;
		
		имя=стр.Имя;
		имя=СтрЗаменить(имя,"СписокНоменклатуры","");
		значение =  текущиеДанные[имя];
		//списокЗначенийСтроки.Добавить(значение,имя);
		предСтруктура.Вставить(имя,значение);
	КонецЦикла;	
	возврат  предСтруктура;
КонецФункции

//************************************************************************
//**  Сохраняем изменения при редактирования любого реквизита           **
//************************************************************************



//******************************************************************************
//***   Удаление                                                             ***
//******************************************************************************

&НаСервере
Процедура УдалитьНаСервере(Менеджер,Номенклатура,Промоакция)
	возврат;
	МенеджерЗаписи = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Менеджер = Менеджер;
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Промоакция   = Промоакция;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли; 	
КонецПроцедуры

процедура удалитьНаСервереПоИД (ид)
	МенеджерЗаписи = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ид = ид;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	оповещение = новый ОписаниеОповещения("ОбработатьОтветНаВопросУдаления",ЭтотОбъект);
	ПоказатьВопрос(оповещение,"Вы уверенны, что хотите удалить строку без возможности восстановления?",РежимДиалогаВопрос.ДаНет,20);
	
КонецПроцедуры

&НаКлиенте
процедура ОбработатьОтветНаВопросУдаления (РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да тогда
		Если не Элементы.СписокНоменклатуры.ТекущиеДанные = неопределено тогда
			//УдалитьНаСервере(Элементы.СписокНоменклатуры.ТекущиеДанные.Менеджер,Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура,Элементы.СписокНоменклатуры.ТекущиеДанные.Промоакция);
			удалитьНаСервереПоИД (Элементы.СписокНоменклатуры.ТекущиеДанные.ид);
			Объект.СписокНоменклатуры.Удалить(Объект.СписокНоменклатуры.НайтиПоИдентификатору(Элементы.СписокНоменклатуры.ТекущаяСтрока));
		иначе
			ПоказатьПредупреждение(,"Укажите строку, которую надо удалить.",10);
		КонецЕсли;		
	иначе
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыПередУдалением(Элемент, Отказ)
	отказ=истина;
	ПоказатьПредупреждение(,"Удалять строчки можно только крестиком в меню таблицы");
	//Удалить(неопределено);
КонецПроцедуры

//****************************************************************************************

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Элементы.ИнфоПромоакция.Заголовок=":";
	установкаВидимостиИДоступности ();
	АдминистративныйДоступ = можноРедактироватьСтатусПозиции();
	ПромоакцияПриИзменении(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	фильтрСпискаНоменклатуры ();
КонецПроцедуры

//************************************************************************************************************************
//   Всякие установки прав и видимости

&НаСервере
функция можноРедактироватьСтатусПозиции ()   //функции супервайзера
	
	можно = ложь;
	//проверяем, нету ли полных прав
	если позволеныАдминистративныеФункцииПромоакций () тогда
		можно = истина;
	КонецЕсли;
	//проверяем, не супервайзер ли
	тз = "ВЫБРАТЬ
	|	ГруппыДоступаПромоакций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступаПромоакций КАК ГруппыДоступаПромоакций
	|ГДЕ
	|	НЕ ГруппыДоступаПромоакций.ПометкаУдаления
	|	И ГруппыДоступаПромоакций.Пользователь = &Пользователь
	|	И ГруппыДоступаПромоакций.Супервайзер";
	з=новый запрос (тз);
	з.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	рез = з.Выполнить();
	Если не рез.Пустой() тогда
		можно = Истина;
	КонецЕсли;
	возврат можно;
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыУсловиеОтгрузкиПриИзменении(Элемент)
	Если элементы.СписокНоменклатуры.ТекущиеДанные <>неопределено тогда
		текДан = элементы.СписокНоменклатуры.ТекущиеДанные;
		Если текДан.УсловиеОтгрузки <> получитьПеречислениеКомпенсация () тогда
			текДан.Компенсация1шт=0;
			//текДан.ПроцентКомпенсации=0;
			
		КонецЕсли;		
	КонецЕсли;
	пересчетСтрокиТабличнойЧасти(ложь,истина);
КонецПроцедуры

&НаСервере
функция получитьПеречислениеКомпенсация ()
	возврат перечисления.Аутсорс_УсловияОтгрузки.Компенсация;	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыКомментарийПриИзменении(Элемент)
	//Если СокрЛП(элементы.СписокНоменклатуры.ТекущиеДанные.Комментарий) = "" тогда
	//	пересчетСтрокиТабличнойЧасти(истина,истина);	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыАкционнаяЦенаПриИзменении(Элемент)
	//пересчетСтрокиТабличнойЧасти(ложь,истина);
КонецПроцедуры

&НаКлиенте
Процедура Пересчет(Команда)
	колВо = объект.СписокНоменклатуры.Количество();
	нпп=1;
	для каждого стр из объект.СписокНоменклатуры	цикл
		если стр.СтатусПозиции = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") тогда
			продолжить;
		КонецЕсли;		
		пересчетСтрокиТабличнойЧасти (истина,истина,ложь,стр);
		добавитьОбновитьНаКлиенте (неопределено, ложь, ложь, ложь,стр);
		Состояние ("Выполняем пересчет: "+цел(нпп/колВо*100)+"%");
		нпп=нпп+1;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетОднойСтроки(Команда)
	Если элементы.СписокНоменклатуры.ТекущиеДанные <> неопределено тогда
		Если  элементы.СписокНоменклатуры.ТекущиеДанные.СтатусПозиции = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") тогда
			Сообщить ("Нельзя пересчитывать утвержденную строку.");
			возврат;
		КонецЕсли;		
		ЭтаФорма.пересчетСтрокиТабличнойЧасти (истина,истина,ложь,элементы.СписокНоменклатуры.ТекущиеДанные);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУтверждено(Команда)
	тек = элементы.СписокНоменклатуры.ТекущиеДанные;
	Если тек <> неопределено тогда
		тек.СтатусПозиции = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Рассматривается");
		Элемент=неопределено;
		НоваяСтрока=ложь;
		ОтменаРедактирования = ложь;
		Отказ = ложь;
		
		добавитьОбновитьНаКлиенте (Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, тек);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьОбъемы()
	//перем  табдок;
	//текдан = элементы.СписокНоменклатуры.ТекущиеДанные;
	//Если текдан<>неопределено тогда		
	//	рез = получитьОбъемПродажЗаПредыдущийПериод( текдан.Покрытие,текдан.Номенклатура,истина);
	//	Если рез.Свойство("табдок",табдок) тогда
	//    	//табдок = рез.табдок;
	//		
	//		табдок.Показать("Расшифровка объемов до-акционных и акционных (плановых) продаж");
	//	КонецЕсли;
	//КонецЕсли;	
	
	текдан = элементы.СписокНоменклатуры.ТекущиеДанные;
	Парам = Новый Структура("Номенклатура, Промоакция, ид", текдан.Номенклатура, Объект.Промоакция, текдан.ид);
	
	
	
	Форма = ПолучитьФорму("Обработка.УправлениеПромоакциями.Форма.РасшифровкаПромо", Парам);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьОбъемыПродаж(Команда)
	РасшифроватьОбъемы();	
КонецПроцедуры



&НаСервере
Процедура ВыполнитьМониторингНаСервере(мас,Адрес,имяФайла)
	//темп_Путь = КаталогВременныхФайлов()+ "prncss_Megan_"+Формат(ТекущаяДата()-Дата(2012,01,01), "ЧГ=0")+расширение;
	ДатаПоследнегоМониторинга=ТекущаяДата();
	темп_файл = ПолучитьИзВременногоХранилища(Адрес);
	//темп_файл.Записать(темп_Путь);
	
	для каждого стр из мас цикл
		МенеджерЗаписи = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ид = стр.Номенклатура;		
		МенеджерЗаписи.Прочитать();
		записьСуществует = МенеджерЗаписи.Выбран();	
		Если записьСуществует тогда
			ДатаПоследнегоМониторинга=ТекущаяДата();
			
			МенеджерЗаписи.Прочитать();
			Если (МенеджерЗаписи.РозничнаяЦена +0.1)<=стр.Цена тогда
				МенеджерЗаписи.Мониторинг = перечисления.РезультатыМониторингаПромоакций.Успешно;
				МенеджерЗаписи.РекомендуемаяРозничнаяЦена = 0;
			иначе
				МенеджерЗаписи.Мониторинг = перечисления.РезультатыМониторингаПромоакций.Отказано;
				МенеджерЗаписи.РекомендуемаяРозничнаяЦена = стр.Цена-0.1;
			КонецЕсли;
			МенеджерЗаписи.МинимальнаяЦенаМониторинга = стр.Цена;
			МенеджерЗаписи.ДатаПоследнегоМониторинга=ДатаПоследнегоМониторинга;
			МенеджерЗаписи.Записать();
		КонецЕсли;		
	КонецЦикла;
	
	//запишем историю
	МенеджерЗаписи = РегистрыСведений.ИсторияМониторингов.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Менеджер = Пользователи.АвторизованныйПользователь();//историю может посмотреть только тот, кто делал мониторинг;
	МенеджерЗаписи.Промоакция = Объект.Промоакция;
	МенеджерЗаписи.ДатаПроведения =ДатаПоследнегоМониторинга;
	хранилищеЗначения = новый ХранилищеЗначения(темп_файл);
	МенеджерЗаписи.СохраненныеДанные =   хранилищеЗначения;
	МенеджерЗаписи.ИмяФайла = имяФайла;
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМониторингСтарая(Команда)
	перем Эксель;
	дляУстановкиРазрешений = глОпределитьТипЯчейкиADO("3") ;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	//Диалог.ПолноеИмяФайла = Объект.Путь; 
	Фильтр = "Файл Эксель 2008 (*.xlsx)|*.xlsx|Файл Эксель  (*.xls)|*.xls"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		Путь = Диалог.ПолноеИмяФайла;
		ф = новый файл(путь);
		расш = ф.Расширение;
		Двоичное = Новый ДвоичныеДанные(Путь);
		Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор);
		Попытка 
			Эксель = Новый COMОбъект("Excel.Application");
			Состояние("Подключение к EXCEL",35);
			
			Книга = Эксель.WorkBooks.Open(путь);
			Лист = Книга.WorkSheets(1);
			КонСтрока=Лист.Cells(1,1).SpecialCells(11).Row;
			КонКолонка=Лист.Cells(1,1).SpecialCells(11).Column;
			
			мас = новый Массив;
			для стр = 1 по КонСтрока цикл
				текст = СокрЛП(Лист.Cells(стр,1).text);
				Если ЗначениеЗаполнено(текст) тогда
					//текНоменклатура = найтиНоменклатуруПоКоду (текст);
					//Если ЗначениеЗаполнено(текНоменклатура) тогда
					//ищем меньшее из цен
					кол = 9;
					меньшее = 1000000;
					пока кол< КонКолонка цикл
						текЧисло=0;
						предв = СокрЛП(Лист.Cells(стр,кол).text);
						Если ЗначениеЗаполнено(предв) тогда
							типЯчейки =  глОпределитьТипЯчейкиADO(предв) ;
							Если типЯчейки = "Число" или типЯчейки = "ЧислоЦелое" тогда									
								текЧисло = Число(предв);
							иначе
								текЧисло = 0;
							КонецЕсли;								
						КонецЕсли;
						Если текЧисло <>0 тогда
							Если текЧисло<меньшее тогда
								меньшее = текЧисло;
							КонецЕсли;								
						КонецЕсли;							
						кол=кол+2;
					КонецЦикла;
					Если не (меньшее = 0 или меньшее = 1000000) тогда
						структураДанных = новый Структура ("Номенклатура,Цена",текст,меньшее);
						мас.Добавить(структураДанных);
					КонецЕсли;						
					//КонецЕсли;					
				КонецЕсли;				
			КонецЦикла;
			Эксель.Quit();
			состояние ("Выполняется мониторинг",75);
			ВыполнитьМониторингНаСервере(мас,Адрес,ф.Имя);
			Состояние ("обновляем список",95);
			фильтрСпискаНоменклатуры ();
			Сообщить ("Мониторинг завершен");
		Исключение 
			Сообщить(ОписаниеОшибки());			
			Эксель.Quit();
			Возврат;
		КонецПопытки;				
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

//-------------- Мониторинг -------------------------   ВАЖНО !!! -------------------------------
//-- Используем асинхронные функции, которые появились только в версии 8.3.16
//-- Поэтому при запуске из предыдущих платформ вполне себе может не работать
//-----------------------------------------------------------------------------------------------



&НаКлиенте                           	
Процедура ВыполнитьМониторинг (Команда)
	перем ссылкаНаФайл,ПутьКФАйлу;
	#Если не ВебКлиент Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		//Диалог.ПолноеИмяФайла = Объект.Путь; 
		Фильтр = "Файл Эксель 2008 (*.xlsx)|*.xlsx|Файл Эксель  (*.xls)|*.xls"; 
		Диалог.Фильтр = Фильтр; 
		Диалог.МножественныйВыбор = Ложь;
		Если Диалог.Выбрать() Тогда
			ПутьКФАйлу = Диалог.ПолноеИмяФайла;
			ф = новый файл(ПутьКФАйлу);
			расш = ф.Расширение;
		Иначе
			Возврат;
		КонецЕсли;		
	#КонецЕсли
	
	оповещениеЗавершение = новый ОписаниеОповещения("МониторингАсинхронно",ЭтотОбъект);
	оповещениеХодВыполнения = новый ОписаниеОповещения("ходВыполненияМониторингаАсинхронно",ЭтотОбъект);
	оповещениеПередНачалом = новый ОписаниеОповещения("передНачаломЗагрузкиФайлаМониторингаАсинхронно",ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(оповещениеЗавершение,оповещениеХодВыполнения,оповещениеПередНачалом,ссылкаНаФайл,ПутьКФАйлу,ЭтаФорма.УникальныйИдентификатор);	
	
КонецПроцедуры

&НаСервере
функция прочитатьФайлНаСервереИВыполнитьМониторинг (Адрес,имя,расширение)
	структураВозврата = новый Структура ("табДок,СтатусОшибки,ОписаниеОшибки",неопределено,ложь,"");
	текФайл = ПолучитьИзВременногоХранилища(Адрес);
	путьВременногоФайла = ПолучитьИмяВременногоФайла(расширение);
	текФайл.Записать( путьВременногоФайла);
	табдок = новый ТабличныйДокумент;
	попытка
		табдок.Прочитать(путьВременногоФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
		колонок = табдок.ШиринаТаблицы;
		Строк = табдок.ВысотаТаблицы;
		//сначала сформируем массив, состоящий из ИД строки промоакции и минимальной цены
		мас = новый Массив;
		для стр = 1 по Строк цикл
			текст = СокрЛП(табдок.Область("R"+стр+"C1").Текст);
			Если ЗначениеЗаполнено(текст) тогда
				//текНоменклатура = найтиНоменклатуруПоКоду (текст);
				//Если ЗначениеЗаполнено(текНоменклатура) тогда
				//ищем меньшее из цен
				кол = 9;
				меньшее = 1000000;
				пока кол< колонок цикл
					текЧисло=0;
					предв = СокрЛП(табдок.Область("R"+стр+"C"+кол+"").Текст);
					Если ЗначениеЗаполнено(предв) тогда
						типЯчейки =  глОпределитьТипЯчейкиADO(предв) ;
						Если типЯчейки = "Число" или типЯчейки = "ЧислоЦелое" тогда									
							текЧисло = Число(предв);
						иначе
							текЧисло = 0;
						КонецЕсли;								
					КонецЕсли;
					Если текЧисло <>0 тогда
						Если текЧисло<меньшее тогда
							меньшее = текЧисло;
						КонецЕсли;								
					КонецЕсли;							
					кол=кол+2;
				КонецЦикла;
				Если не (меньшее = 0 или меньшее = 1000000) тогда
					структураДанных = новый Структура ("Номенклатура,Цена",текст,меньшее);
					мас.Добавить(структураДанных);
				КонецЕсли;						
				//КонецЕсли;					
			КонецЕсли;				
		КонецЦикла;
		//теперь выполним сам мониторинг и запишем экселевский файл в историю мониторинга
		ВыполнитьМониторингНаСервере(мас,Адрес,имя);
		
		структураВозврата.табДок = табдок;
	исключение
		текстОшибки = ОписаниеОшибки();
		структураВозврата.СтатусОшибки=истина;
		структураВозврата.ОписаниеОшибки=текстОшибки;
	КонецПопытки;
	
	возврат структураВозврата;
КонецФункции

&НаКлиенте
Процедура МониторингАсинхронно(ОписаниеПомещенногоФайла,ДополнительныеПараметры) экспорт	
	рез = прочитатьФайлНаСервереИВыполнитьМониторинг (ОписаниеПомещенногоФайла.Адрес,ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя,ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
	Если рез.СтатусОшибки тогда
		ПоказатьПредупреждение("Упсс! Что то пошло не так. Описание ошибки см. в предупреждениях внизу",20);
		Сообщить (рез.ОписаниеОшибки);
		возврат;
	КонецЕсли;
	фильтрСпискаНоменклатуры ();
	//рез.табДок.Показать("Содержимое файла");
	ПоказатьПредупреждение(,"Мониторинг прошел успешно "+ТекущаяДата(),7,"Результат мониторинга");	
КонецПроцедуры

&НаКлиенте
Процедура ходВыполненияМониторингаАсинхронно (ПомещаемыйФайл,Помещено, ОтказОтПомещенияФайла,ДополнительныеПараметры) экспорт
	Состояние ("Ход выполнения "+Помещено+"%");	
КонецПроцедуры

&НаКлиенте
Процедура передНачаломЗагрузкиФайлаМониторингаАсинхронно ( ПомещаемыйФайл, ОтказОтПомещенияФайла,ДополнительныеПараметры) экспорт
	Состояние ("Начало загрузки");
КонецПроцедуры

//*******************************************************************************************
//----- Мониторинг конец ---------- Мониторинг конец ---------- Мониторинг конец ---------- Мониторинг конец -----
//*******************************************************************************************

Функция глОпределитьТипЯчейкиADO(Значение)
	//Разделяет типы на строку, число и дату
	Если не ЗначениеЗаполнено(Значение) тогда
		возврат 0;
	конецЕсли;
	Значение=Строка(Значение);
	//Истина=-1;
	//Ложь=0;
	RegExp = новый COMОбъект("VBScript.RegExp");
	
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Ложь; //Многострочный режим
	//есть ли буквы
	RegExp.Pattern = "^[-\+]?\d+$";
	Если RegExp.Test(Значение)=Истина Тогда
		Возврат "ЧислоЦелое";
	КонецЕсли;
	RegExp.Pattern = "^[-\+]?\d*[.,]?[\d]{0,}$"; //число вообще (и целое и со знаками после точки или запятой)
	Если RegExp.Test(Значение)=Истина Тогда
		Возврат "Число";
	иначе
		RegExp.Pattern = "^\d{1,2}[\.\/-]([0]?\d|1[12])[\.\/-]\d{2,4}$"; //Дата
		//датой считает форматы вида 2.12.2014 , 01.12.14, 3.08.2014, 30-10-2014, 15/12/14 и т.д. первая цифра может быть
		//    одна или две. Цифр года 2, 3 или 4
		если RegExp.Test(Значение) = Истина Тогда
			Возврат "Дата";
		Иначе
			Возврат "Строка";
		КонецЕсли;
	КонецЕсли;
КонецФункции
функция найтиНоменклатуруПоКоду (код)
	текНоменклатура = Справочники.Номенклатура.НайтиПоКоду(код);
	возврат текНоменклатура;
КонецФункции

&НаКлиенте
Процедура ИсторияМониторингов(Команда)
	
	Если ЭтоВнешняяОбработкаОтчет() тогда
		ОткрытьФорму("ВнешняяОбработка.УправлениеПромоакциями.Форма.ИсторияМониторингов",новый структура("Промоакция",объект.Промоакция));
	иначе
		ОткрытьФорму("Обработка.УправлениеПромоакциями.Форма.ИсторияМониторингов",новый структура("Промоакция",объект.Промоакция));
	КонецЕсли;
КонецПроцедуры

&НаСервере 
функция ЭтоВнешняяОбработкаОтчет()
	обЗн = РеквизитФормыВЗначение("Объект");
	возврат обЗн.ЭтоВнешняяОбработкаОтчет();
КонецФункции

&НаКлиенте
Процедура ШаблонМониторинга(Команда)
	ОткрытьФорму("Отчет.ШаблонМониторинга.Форма.ФормаОтчета",новый структура("Промоакция",Объект.Промоакция));
	
КонецПроцедуры

&НаСервере
Функция СписокНоменклатурыАртикулПриИзмененииНаСервере(текАртикул)
	Если не ЗначениеЗаполнено(текАртикул) тогда
		возврат неопределено;
	КонецЕсли;
	тз = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК текНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул ПОДОБНО &Артикул";
	з=новый запрос (тз);
	з.УстановитьПараметр("Артикул",текАртикул);
	рез = з.Выполнить();
	Если рез.Пустой() тогда
		возврат неопределено;
	иначе
		выборка = рез.Выбрать();
		пока выборка.Следующий() цикл
			возврат выборка.текНоменклатура;	
		КонецЦикла;		
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыАртикулПриИзменении(Элемент)
	текАртикул = Элементы.СписокНоменклатуры.ТекущиеДанные.Артикул;
	если ЗначениеЗаполнено(текАртикул) тогда
		текНоменклатура = 	СписокНоменклатурыАртикулПриИзмененииНаСервере(текАртикул);
		Если не текНоменклатура=неопределено тогда
			Элементы.СписокНоменклатуры.ТекущиеДанные.Номенклатура = текНоменклатура;
			рез = проверитьНаличиеНоменклатурыВДругихАкциях();
			Если рез = неопределено тогда
				пересчетСтрокиТабличнойЧасти(истина,истина,истина);
			иначе 
				сообщить (рез);
			КонецЕсли;			
		иначе
			Сообщить ("Номенклатура с артикулом: """+текАртикул+""" не обнаружена");
		КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
функция ПолучитьМакетНаСервере (имяМакета)
	текОбъект = РеквизитФормыВЗначение("Объект");
	макет = текОбъект.ПолучитьМакет(имяМакета);
	возврат макет;
КонецФункции


функция сформироватьТабДокБланка ()
	макет = ПолучитьМакетНаСервере("БланкФормы");
	табДок = новый ТабличныйДокумент();
	табДок.ТолькоПросмотр=Истина;
	табдок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	табДок.АвтоМасштаб=Истина;
	//табДок.ИспользуемоеИмяФайла=Строка(Объект.Промоакция);
	
	обл = макет.ПолучитьОбласть("ЗаголовокОтчета");
	обл.Параметры.Промоакция = Объект.Промоакция;
	табДок.Вывести(обл);		
	
	облПустая = макет.ПолучитьОбласть("ПустаяЯчейка");
	табДок.Вывести(облПустая);
	списокЯчеек = новый списокЗначений;
	для каждого стр из Элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
		если стр.Видимость=Истина тогда
			ШиринаКолонки = стр.Ширина;
			Если ШиринаКолонки = 0 тогда
				ШиринаКолонки = 8;		
			КонецЕсли;
			ШиринаКолонки=ШиринаКолонки*2;
			Макет.Область("ЯчейкаШапки").ШиринаКолонки = ШиринаКолонки;
			
			обл = макет.ПолучитьОбласть("ЯчейкаШапки");
			ЗаголовокКолонки = стр.Заголовок;
			имяКолонки = СтрЗаменить(стр.Имя,"СписокНоменклатуры","");
			Если не ЗначениеЗаполнено(ЗаголовокКолонки) тогда
				ЗаголовокКолонки = имяКолонки;	
			КонецЕсли;
			списокЯчеек.Добавить(имяКолонки);
			обл.Параметры.ИмяКолонки = ЗаголовокКолонки;
			
			табДок.Присоединить(обл);
		КонецЕсли;
	КонецЦикла;
	таб = РеквизитФормыВЗначение("Объект.СписокНоменклатуры");
	//для каждого стр из таб цикл
	//    //ВОтборе = Элементы.СписокНоменклатуры.ПроверитьСтроку(стр.НомерСтроки -1);
	//	//ВОтборе = таб.ПроверитьСтроку(стр.НомерСтроки -1);
	
	//	//Если Не ВОтборе Тогда
	//	//    Продолжить
	//	//КонецЕсли;
	//КонецЦикла;	
	
	возврат табДок;
КонецФункции

&НаСервере
функция добавитьСтрокуВТабДок(табДок,текущиеДанные)
	макет = ПолучитьМакетНаСервере("БланкФормы");
	текСтр = объект.СписокНоменклатуры.Получить(текущиеДанные);
	облПустая = макет.ПолучитьОбласть("ПустаяЯчейка");
	табДок.Вывести(облПустая);
	
	для каждого колонкаТаблицы из Элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
		если колонкаТаблицы.Видимость=Истина тогда
			ШиринаКолонки = колонкаТаблицы.Ширина;
			Если ШиринаКолонки = 0 тогда
				ШиринаКолонки = 8;		
			КонецЕсли;
			ШиринаКолонки=ШиринаКолонки*2;
			Макет.Область("СтрокаТаблицы").ШиринаКолонки = ШиринаКолонки;
			
			имяКолонки = СтрЗаменить(колонкаТаблицы.Имя,"СписокНоменклатуры","");
			обл = макет.ПолучитьОбласть ("СтрокаТаблицы");
			обл.Параметры.ЗначениеЯчейки = текСтр[имяКолонки];
			табДок.Присоединить(обл);
		КонецЕсли;
	КонецЦикла;
	
	возврат табДок;	
КонецФункции


&НаКлиенте
Процедура БланкЭксель(Команда)
	табДок = сформироватьТабДокБланка();
	таб = объект.СписокНоменклатуры;
	для каждого стр из таб цикл		
		ВОтборе = Элементы.СписокНоменклатуры.ПроверитьСтроку(стр.НомерСтроки -1);
		Если Не ВОтборе Тогда
			Продолжить
		КонецЕсли;
		табДок=добавитьСтрокуВТабДок(табДок,стр.НомерСтроки -1);
	КонецЦикла;	
	табДок.Показать(Строка(Объект.Промоакция));
	//табДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ЭтаФорма.Элементы.СписокНоменклатуры.КоманднаяПанель.ПодчиненныеЭлементы.СписокНоменклатурыОтменитьУтверждено.Доступность = Элемент.ТекущиеДанные.СтатусПозиции = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетАкционногоОбьемаНаСервере()
	Объект.РасшифровкаПромо.Очистить();
	НачалоПериода = ТекущаяДата();
	
	Для Каждого Элемент Из Объект.СписокНоменклатуры Цикл
		ПризнакДМП = ?(Элемент.ДМП <> Перечисления.дмп.ПустаяСсылка(), Истина, Ложь);
		
		Если Элемент.СтатусПозиции = Перечисления.ВидСтатусаСогласованияПромоакций.Утверждено Тогда
			Сообщить("Запрещен пересчет позиций со статусом Утверждено!!!");
			Продолжить;
		КонецЕсли;
		
		СписокПлощадок = Новый СписокЗначений;
		Массив = новый Массив;
		
		тНом = Элемент.Номенклатура;
		Номенклатура = Строка(тНом.УникальныйИдентификатор());
		
		Для каждого Площадка из Элемент.Покрытие.Состав Цикл
			ТоргПлощ = Строка(Площадка.ТорговаяПлощадка.УникальныйИдентификатор());
			Массив.Добавить(ТоргПлощ);
			СписокПлощадок.Добавить(Площадка.ТорговаяПлощадка);
		КонецЦикла;
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Массив);
		СписокТП=Запись.Закрыть();
		
		Определение = Новый WSОпределения("http://orders:8096/work_global_center/cwd2.1cws?wsdl");		
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap");
		
		
		Обьем = WS.ПолучениеОбьема(Номенклатура, СписокТП); 
		
		Чтение= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Обьем);
		ТП = ПрочитатьJSON(Чтение);
		
		
		Под = Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки");
		Чис = Новый ОписаниеТипов("Число");
		
		ТаблицаИтоги = Новый ТаблицаЗначений;
		ТаблицаИтоги.Колонки.Добавить("ТорговаяПлощадка", Под);
		ТаблицаИтоги.Колонки.Добавить("Обьем", Чис);
		
		
		
		Для Каждого СтрокаМассива Из Тп Цикл 
			НоваяСтрока = ТаблицаИтоги.Добавить();
			сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
			НоваяСтрока.ТорговаяПлощадка =сТочка ;
			тОбьем = Окр(Число(?(ПризнакДМП, СтрокаМассива.Обьем*1.2,СтрокаМассива.Обьем)));
			НоваяСтрока.Обьем = Цел(тОбьем);
			
			СтрТаб = Объект.РасшифровкаПромо.Добавить();
			СтрТаб.ТорговаяПлощадка = сТочка; 
			СтрТаб.Номенклатура = Элемент.Номенклатура;
			СтрТаб.АкционныйОбьем = тОбьем;
			
		КонецЦикла;
		
		АкцОбьем = ТаблицаИтоги.Итог("Обьем");
		
		
		Если АкцОбьем = 0 Тогда
			
			Для Каждого СтрокаТЧ Из Объект.РасшифровкаПромо Цикл
				Если СтрокаТЧ.Номенклатура = Элемент.Номенклатура Тогда 
					Объект.РасшифровкаПромо.Удалить(СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			
			ТаблицаИтоги.Очистить();
			
			ОбьемДо = WS.ПолучениеОбьемаДоАкции(Номенклатура, СписокТП); 
			
			НЧтение = Новый ЧтениеJSON;
			НЧтение.УстановитьСтроку(ОбьемДо);
			ПТП = ПрочитатьJSON(НЧтение);
			ТаблицаИтоги.Очистить();
			
			Для Каждого СтрокаМассива Из ПТП Цикл
				ЗапросИтог = Новый Запрос;
				ЗапросИтог.Текст = 
				"ВЫБРАТЬ
				|	КоэффициентыПромо.Коэффициент КАК Коэффициент
				|ИЗ
				|	РегистрСведений.КоэффициентыПромо КАК КоэффициентыПромо
				|ГДЕ
				|	КоэффициентыПромо.ТипыНоменклатуры = &ТипыНоменклатуры";
				
				ЗапросИтог.УстановитьПараметр("ТипыНоменклатуры", Элемент.Номенклатура.ТипНоменклатуры);
				РезультатИтог = ЗапросИтог.Выполнить();
				
				Выборка = РезультатИтог.Выбрать();
				
				Если РезультатИтог.Пустой() Тогда 
					Сообщить("Для типа номенклатуры "+Элемент.Номенклатура.ТипНоменклатуры+" не установлен коэфициент Коэффициент Промо!!! Установите коэффициент для номенклатуры "+Элемент.Номенклатура+ " и пересчитайте обьемы для данной номенкратуры!!!" );
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаИтоги.Добавить();
				сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
				НоваяСтрока.ТорговаяПлощадка =сТочка ;
				тОбьем = Окр(Число(?(ПризнакДМП, СтрокаМассива.Обьем*Выборка.Коэффициент*1.2, СтрокаМассива.Обьем*Выборка.Коэффициент)));
				НоваяСтрока.Обьем= тОбьем;
				
				СтрТаб = Объект.РасшифровкаПромо.Добавить();
				СтрТаб.ТорговаяПлощадка = сТочка; 
				СтрТаб.Номенклатура = Элемент.Номенклатура;
				СтрТаб.АкционныйОбьем = тОбьем;
			КонецЦикла;
			
			Обьем1 = ТаблицаИтоги.Итог("Обьем");
			
			Если Обьем1 = 0 Тогда
				
				Для Каждого СтрокаТЧ Из Объект.РасшифровкаПромо Цикл
					Если СтрокаТЧ.Номенклатура = Элемент.Номенклатура Тогда 
						Объект.РасшифровкаПромо.Удалить(СтрокаТЧ);
					КонецЕсли;
				КонецЦикла;
				Пер = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
				
				ТаблицаОбьемов = Новый ТаблицаЗначений;
				ТаблицаОбьемов.Колонки.Добавить("ТорговаяПлощадка", Под);
				ТаблицаОбьемов.Колонки.Добавить("Номенклатура", Пер);
				ТаблицаОбьемов.Колонки.Добавить("Обьем", Чис);
				
				
				
				Запрос1 = Новый Запрос;
				Запрос1.Текст = 
				"ВЫБРАТЬ
				|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ) КАК Дата,
				|	Продажи.ТорговаяПлощадка КАК ТорговаяПлощадка,
				|	Продажи.Номенклатура КАК Номенклатура,
				|	СРЕДНЕЕ(Продажи.Количество) КАК Количество
				|ИЗ
				|	РегистрНакопления.Продажи КАК Продажи
				|ГДЕ
				|	Продажи.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
				|	И Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
				|	И Продажи.ТорговаяПлощадка В(&СписокТП)
				|
				|СГРУППИРОВАТЬ ПО
				|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ),
				|	Продажи.ТорговаяПлощадка,
				|	Продажи.Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата УБЫВ
				|ИТОГИ ПО
				|	ТорговаяПлощадка,
				|	Номенклатура";
				
				
				Запрос1.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода)-1-14*24*60*60);
				Запрос1.УстановитьПараметр("КонецПериода", НачалоДня(НачалоПериода)-1);
				Запрос1.УстановитьПараметр("СписокТП", СписокПлощадок);
				Запрос1.УстановитьПараметр("ТипНоменклатуры", тНом.ТипНоменклатуры);
				
				Результат = Запрос1.Выполнить();
				
				ВыборкаТорговаяПлощадка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТорговаяПлощадка.Следующий() Цикл
					
					
					ВыборкаНоменклатура = ВыборкаТорговаяПлощадка.Выбрать();
					
					Пока ВыборкаНоменклатура.Следующий() Цикл
						
						нСтрока = ТаблицаОбьемов.Добавить();
						нСтрока.ТорговаяПлощадка = ВыборкаТорговаяПлощадка.ТорговаяПлощадка;
						нСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
						нСтрока.Обьем = Окр(Число(ВыборкаНоменклатура.Количество*14));
						
					КонецЦикла;
					ТаблицаОбьемов.Свернуть("ТорговаяПлощадка,Номенклатура","Обьем");
					нСтрокаИтоги = ТаблицаИтоги.Добавить();
					нСтрокаИтоги.ТорговаяПлощадка = ВыборкаТорговаяПлощадка.ТорговаяПлощадка;
					нСтрокаИтоги.Обьем = Окр(ТаблицаОбьемов.Итог("Обьем")/ТаблицаОбьемов.Количество());
					ТаблицаОбьемов.Очистить();
					
				КонецЦикла;
				
				ЗапросИтог = Новый Запрос;
				ЗапросИтог.Текст = 
				"ВЫБРАТЬ
				|	КоэффициентыПромо.Коэффициент КАК Коэффициент
				|ИЗ
				|	РегистрСведений.КоэффициентыПромо КАК КоэффициентыПромо
				|ГДЕ
				|	КоэффициентыПромо.ТипыНоменклатуры = &ТипыНоменклатуры";
				
				ЗапросИтог.УстановитьПараметр("ТипыНоменклатуры", Элемент.Номенклатура.ТипНоменклатуры);
				РезультатИтог = ЗапросИтог.Выполнить();
				
				Выборка = РезультатИтог.Выбрать();
				
				Если РезультатИтог.Пустой() Тогда 
					Сообщить("Для типа номенклатуры "+Элемент.Номенклатура.ТипНоменклатуры+" не установлен коэфициент Коэффициент Промо!!! Установите коэффициент для номенклатуры "+Элемент.Номенклатура+ " и пересчитайте обьемы для данной номенкратуры!!!" );
					Продолжить;
				КонецЕсли;
				
				Пока Выборка.Следующий() Цикл
					Для каждого СтрТабИтог Из ТаблицаИтоги Цикл
						СтрТаб = Объект.РасшифровкаПромо.Добавить();
						СтрТаб.ТорговаяПлощадка = СтрТабИтог.ТорговаяПлощадка; 
						СтрТаб.Номенклатура = Элемент.Номенклатура;
						СтрТаб.АкционныйОбьем = Окр(?(ПризнакДМП, СтрТабИтог.Обьем*Выборка.Коэффициент*1.2,СтрТабИтог.Обьем*Выборка.Коэффициент));
						
						Если Выборка.Коэффициент<>Неопределено Тогда
							СтрТаб.АкционныйОбьем = Окр(?(ПризнакДМП, СтрТабИтог.Обьем*Выборка.Коэффициент*1.2,СтрТабИтог.Обьем*Выборка.Коэффициент));
						Иначе
							Сообщить("Для типа номенклатуры "+Элемент.Номенклатура.ТипНоменклатуры+" не установлен коэфициент Коэффициент Промо!!! Установите коэффициент для номенклатуры "+Элемент.Номенклатура+ " и пересчитайте обьемы для данной номенкратуры!!!" );
							Продолжить;
						КонецЕсли;
						
					КонецЦикла;	
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
		Если  АкцОбьем <> 0 Тогда
			Элемент.ОбъемПродажАкционный = АкцОбьем;
		Иначе
			Элемент.ОбъемПродажАкционный = Обьем1;
		КонецЕсли;
		
		//Заполнение до акционного обьема
		Попытка
			ОбьемДо = WS.ПолучениеОбьемаДоАкции(Номенклатура, СписокТП); 
			
			НЧтение = Новый ЧтениеJSON;
			НЧтение.УстановитьСтроку(ОбьемДо);
			ПТП = ПрочитатьJSON(НЧтение);
			ТаблицаИтоги.Очистить();
			
			Для Каждого СтрокаМассива Из ПТП Цикл 
				НоваяСтрока = ТаблицаИтоги.Добавить();
				сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
				НоваяСтрока.ТорговаяПлощадка =сТочка ;
				НоваяСтрока.Обьем = Окр(Число(СтрокаМассива.Обьем));
				
				СтруктураДляПоиска = Новый Структура;
				СтруктураДляПоиска.Вставить("ТорговаяПлощадка",сТочка);
				СтруктураДляПоиска.Вставить("Номенклатура", Элемент.Номенклатура);
				
				МассивСтрок = Объект.РасшифровкаПромо.НайтиСтроки(СтруктураДляПоиска);
				Если МассивСтрок.Количество()= 0 ТОгда 
					ТаблицаИтоги.Удалить(НоваяСтрока);
				КонецЕсли;
				Для Каждого СтрМасс из МассивСтрок цикл
					СтрМасс.ОбьемЗаПредПериод = Окр(Число(СтрокаМассива.Обьем));
				КонецЦикла;			
			КонецЦикла;
			
			чОбьемДо = ТаблицаИтоги.Итог("Обьем");
			
			Элемент.ОбъемПродажПредПериод = чОбьемДо;
		Исключение
			Сообщить("Для " + тНом +" не расчитан обьем до акции!!!");
		КонецПопытки;
		
		ЗаписьАкц = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
		ЗаписьАкц.ид = Элемент.ид;
		//ЗаписьАкц.Номенклатура = Элемент.Номенклатура;
		ЗаписьАкц.Прочитать();
		Выбран = ЗаписьАкц.Выбран();
		
		Если Выбран Тогда
			
			Если  АкцОбьем <> 0 Тогда
				ЗаписьАкц.ОбъемПродажАкционный = АкцОбьем;
			Иначе
				ЗаписьАкц.ОбъемПродажАкционный = Обьем1;
			КонецЕсли;
			ЗаписьАкц.ОбъемПродажПредПериод = чОбьемДо;
			ЗаписьАкц.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	//запись значений в регистр свевдений
	
	Для Каждого СтрокаТаб из Объект.РасшифровкаПромо Цикл
		Набор = РегистрыСведений.РасшифровкаПромоАкций.СоздатьНаборЗаписей();
		Набор.Отбор.Промоакция.Установить(Объект.Промоакция);
		Набор.Отбор.Номенклатура.Установить(СтрокаТаб.Номенклатура);
		Набор.Отбор.ТорговаяПлощадка.Установить(СтрокаТаб.ТорговаяПлощадка);
		Набор.Прочитать();
		
		Если Набор.Количество() Тогда 
			НоваяЗапись = Набор[0];
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		Иначе
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Промоакция = Объект.Промоакция;
			НоваяЗапись.Номенклатура = СтрокаТаб.Номенклатура; 
			НоваяЗапись.ТорговаяПлощадка = СтрокаТаб.ТорговаяПлощадка;
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетАкционногоОбьема(Команда)
	РасчетАкционногоОбьемаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйКонтрагент = ЭтаФорма.Элементы.СписокНоменклатуры.ТекущиеДанные.Поставщик;
	
	//СтандартнаяОбработка = Ложь;
	//
	//ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФорму("ФормаВыбора", Элемент);
	//ФормаВыбора.Отбор.Владелец.Использование = Истина;
	//ФормаВыбора.Отбор.Контрагент.Использование = Истина;
	//ФормаВыбора.Отбор.Контрагент.ВидСравнения = ВидСравнения.Равно;
	//ФормаВыбора.Отбор.Контрагент.Значение = ВыбранныйКонтрагент;
	//ФормаВыбора.РежимВыбора = Истина;
	//ФормаВыбора.Открыть();
	//
	//	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Контрагент",ВыбранныйКонтрагент));
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервере
Процедура РасчетОбьемовОднойСтрокиНаСервере(Номенклатура, Покрытие, Идент, ДМП, Статус)
	
	Если Статус = Перечисления.ВидСтатусаСогласованияПромоакций.Утверждено Тогда
		Сообщить("Запрещен пересчет позиций со статусом Утверждено!!!");
		Возврат;
	КонецЕсли;
	
	Объект.РасшифровкаПромо.Очистить();
	НачалоПериода = ТекущаяДата();
	ПризнакДМП = ?(ДМП <> Перечисления.дмп.ПустаяСсылка(), Истина, Ложь);
	ИД = Новый УникальныйИдентификатор(Идент);
	
	//Для Каждого Элемент Из Объект.СписокНоменклатуры Цикл
	
	
	СписокПлощадок = Новый СписокЗначений;
	Массив = новый Массив;
	
	
	тНом = Строка(Номенклатура.УникальныйИдентификатор());
	
	Для каждого Площадка из Покрытие.Состав Цикл
		ТоргПлощ = Строка(Площадка.ТорговаяПлощадка.УникальныйИдентификатор());
		Массив.Добавить(ТоргПлощ);
		СписокПлощадок.Добавить(Площадка.ТорговаяПлощадка);
	КонецЦикла;
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Массив);
	СписокТП=Запись.Закрыть();
	
	Определение = Новый WSОпределения("http://orders:8096/work_global_center/cwd2.1cws?wsdl");		
	WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap");
	
	
	Обьем = WS.ПолучениеОбьема(тНом, СписокТП); 
	
	Чтение= Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Обьем);
	ТП = ПрочитатьJSON(Чтение);
	
	
	Под = Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки");
	Чис = Новый ОписаниеТипов("Число");
	
	ТаблицаИтоги = Новый ТаблицаЗначений;
	ТаблицаИтоги.Колонки.Добавить("ТорговаяПлощадка", Под);
	ТаблицаИтоги.Колонки.Добавить("Обьем", Чис);
	
	
	
	Для Каждого СтрокаМассива Из Тп Цикл 
		НоваяСтрока = ТаблицаИтоги.Добавить();
		сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
		НоваяСтрока.ТорговаяПлощадка =сТочка ;
		тОбьем=Окр(Число(?(ПризнакДМП, СтрокаМассива.Обьем*1.2,СтрокаМассива.Обьем)));
		НоваяСтрока.Обьем = тОбьем;
		
		СтрТаб = Объект.РасшифровкаПромо.Добавить();
		СтрТаб.ТорговаяПлощадка = сТочка; 
		СтрТаб.Номенклатура = Номенклатура;
		СтрТаб.АкционныйОбьем = тОбьем;
		
	КонецЦикла;
	
	АкцОбьем = ТаблицаИтоги.Итог("Обьем");
	
	
	Если АкцОбьем = 0 Тогда
		
		Для Каждого СтрокаТЧ Из Объект.РасшифровкаПромо Цикл
			Если СтрокаТЧ.Номенклатура = Номенклатура Тогда 
				Объект.РасшифровкаПромо.Удалить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаИтоги.Очистить();
		
		ОбьемДо = WS.ПолучениеОбьемаДоАкции(тНом, СписокТП); 
		
		НЧтение = Новый ЧтениеJSON;
		НЧтение.УстановитьСтроку(ОбьемДо);
		ПТП = ПрочитатьJSON(НЧтение);
		ТаблицаИтоги.Очистить();
		
		Для Каждого СтрокаМассива Из ПТП Цикл 
			
			ЗапросИтог = Новый Запрос;
			ЗапросИтог.Текст = 
			"ВЫБРАТЬ
			|	КоэффициентыПромо.Коэффициент КАК Коэффициент
			|ИЗ
			|	РегистрСведений.КоэффициентыПромо КАК КоэффициентыПромо
			|ГДЕ
			|	КоэффициентыПромо.ТипыНоменклатуры = &ТипыНоменклатуры";
			
			ЗапросИтог.УстановитьПараметр("ТипыНоменклатуры", Номенклатура.ТипНоменклатуры);
			РезультатИтог = ЗапросИтог.Выполнить();
			
			Выборка = РезультатИтог.Выбрать();
			
			Если РезультатИтог.Пустой() Тогда 
				Сообщить("Для типа номенклатуры "+Номенклатура.ТипНоменклатуры+" не установлен коэфициент Коэффициент Промо!!! Установите коэффициент для номенклатуры "+Номенклатура+ " и пересчитайте обьемы для данной номенкратуры!!!" );
				Объект.РасшифровкаПромо.Очистить();
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаИтоги.Добавить();
			сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
			НоваяСтрока.ТорговаяПлощадка =сТочка ;
			НоваяСтрока.Обьем = СтрокаМассива.Обьем;
			
			СтрТаб = Объект.РасшифровкаПромо.Добавить();
			СтрТаб.ТорговаяПлощадка = сТочка; 
			СтрТаб.Номенклатура = Номенклатура;
			СтрТаб.АкционныйОбьем = Окр(Число(?(ПризнакДМП, СтрокаМассива.Обьем*Выборка.Коэффициент*1.2, СтрокаМассива.Обьем*Выборка.Коэффициент)));
		КонецЦикла;
		Обьем1 = ТаблицаИтоги.Итог("Обьем");
		
		Если Обьем1 = 0 Тогда
			
			Для Каждого СтрокаТЧ Из Объект.РасшифровкаПромо Цикл
				Если СтрокаТЧ.Номенклатура = Номенклатура Тогда 
					Объект.РасшифровкаПромо.Удалить(СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			Пер = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
			
			ТаблицаОбьемов = Новый ТаблицаЗначений;
			ТаблицаОбьемов.Колонки.Добавить("ТорговаяПлощадка", Под);
			ТаблицаОбьемов.Колонки.Добавить("Номенклатура", Пер);
			ТаблицаОбьемов.Колонки.Добавить("Обьем", Чис);
			
			
			
			Запрос1 = Новый Запрос;
			Запрос1.Текст = 
			"ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ) КАК Дата,
			|	Продажи.ТорговаяПлощадка КАК ТорговаяПлощадка,
			|	Продажи.Номенклатура КАК Номенклатура,
			|	СРЕДНЕЕ(Продажи.Количество) КАК Количество
			|ИЗ
			|	РегистрНакопления.Продажи КАК Продажи
			|ГДЕ
			|	Продажи.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
			|	И Продажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|	И Продажи.ТорговаяПлощадка В(&СписокТП)
			|
			|СГРУППИРОВАТЬ ПО
			|	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ),
			|	Продажи.ТорговаяПлощадка,
			|	Продажи.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ
			|ИТОГИ ПО
			|	ТорговаяПлощадка,
			|	Номенклатура";
			
			
			Запрос1.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода)-1-14*24*60*60);
			Запрос1.УстановитьПараметр("КонецПериода", НачалоДня(НачалоПериода)-1);
			Запрос1.УстановитьПараметр("СписокТП", СписокПлощадок);
			Запрос1.УстановитьПараметр("ТипНоменклатуры", Номенклатура.ТипНоменклатуры);
			
			Результат = Запрос1.Выполнить();
			
			ВыборкаТорговаяПлощадка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТорговаяПлощадка.Следующий() Цикл
				
				
				ВыборкаНоменклатура = ВыборкаТорговаяПлощадка.Выбрать();
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					нСтрока = ТаблицаОбьемов.Добавить();
					нСтрока.ТорговаяПлощадка = ВыборкаТорговаяПлощадка.ТорговаяПлощадка;
					нСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
					нСтрока.Обьем = Окр(ВыборкаНоменклатура.Количество*14);
					
				КонецЦикла;
				ТаблицаОбьемов.Свернуть("ТорговаяПлощадка,Номенклатура","Обьем");
				нСтрокаИтоги = ТаблицаИтоги.Добавить();
				нСтрокаИтоги.ТорговаяПлощадка = ВыборкаТорговаяПлощадка.ТорговаяПлощадка;
				нСтрокаИтоги.Обьем = Окр(Число(ТаблицаОбьемов.Итог("Обьем")/ТаблицаОбьемов.Количество()));
				ТаблицаОбьемов.Очистить();
				
			КонецЦикла;
			
			ЗапросИтог = Новый Запрос;
			ЗапросИтог.Текст = 
			"ВЫБРАТЬ
			|	КоэффициентыПромо.Коэффициент КАК Коэффициент
			|ИЗ
			|	РегистрСведений.КоэффициентыПромо КАК КоэффициентыПромо
			|ГДЕ
			|	КоэффициентыПромо.ТипыНоменклатуры = &ТипыНоменклатуры";
			
			ЗапросИтог.УстановитьПараметр("ТипыНоменклатуры", Номенклатура.ТипНоменклатуры);
			РезультатИтог = ЗапросИтог.Выполнить();
			
			Выборка = РезультатИтог.Выбрать();
			
			Если РезультатИтог.Пустой() Тогда 
				Сообщить("Для типа номенклатуры "+Номенклатура.ТипНоменклатуры+" не установлен коэфициент Коэффициент Промо!!! Установите коэффициент для номенклатуры "+Номенклатура+ " и пересчитайте обьемы для данной номенкратуры!!!" );
				Объект.РасшифровкаПромо.Очистить();
				Возврат;
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл
				Для каждого СтрТабИтог Из ТаблицаИтоги Цикл
					СтрТаб = Объект.РасшифровкаПромо.Добавить();
					СтрТаб.ТорговаяПлощадка = СтрТабИтог.ТорговаяПлощадка; 
					СтрТаб.Номенклатура = Номенклатура;
					СтрТаб.АкционныйОбьем = Окр(Число(?(ПризнакДМП, СтрТабИтог.Обьем*Выборка.Коэффициент*1.2,СтрТабИтог.Обьем*Выборка.Коэффициент)));
					Если Выборка.Коэффициент<>Неопределено Тогда
						СтрТаб.АкционныйОбьем = Окр(Число(?(ПризнакДМП, СтрТабИтог.Обьем*Выборка.Коэффициент*1.2,СтрТабИтог.Обьем*Выборка.Коэффициент)));
					КонецЕсли;
				КонецЦикла;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если  АкцОбьем <> 0 Тогда
		АкционныйОбьем = АкцОбьем;
	Иначе
		АкционныйОбьем = Обьем1;
	КонецЕсли;
	
	//Заполнение до акционного обьема
	Попытка
		ОбьемДо = WS.ПолучениеОбьемаДоАкции(тНом, СписокТП); 
		
		НЧтение = Новый ЧтениеJSON;
		НЧтение.УстановитьСтроку(ОбьемДо);
		ПТП = ПрочитатьJSON(НЧтение);
		ТаблицаИтоги.Очистить();
		
		Для Каждого СтрокаМассива Из ПТП Цикл 
			НоваяСтрока = ТаблицаИтоги.Добавить();
			сТочка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМассива.ТорговаяПлощадка));
			НоваяСтрока.ТорговаяПлощадка =сТочка ;
			НоваяСтрока.Обьем = Окр(СтрокаМассива.Обьем);
			
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ТорговаяПлощадка",сТочка);
			СтруктураДляПоиска.Вставить("Номенклатура", Номенклатура);
			
			МассивСтрок = Объект.РасшифровкаПромо.НайтиСтроки(СтруктураДляПоиска);
			Если МассивСтрок.Количество()= 0 ТОгда 
				ТаблицаИтоги.Удалить(НоваяСтрока);
			КонецЕсли;
			Для Каждого СтрМасс из МассивСтрок цикл
				СтрМасс.ОбьемЗаПредПериод = Окр(СтрокаМассива.Обьем);
			КонецЦикла;
			
		КонецЦикла;
		
		чОбьемДо = ТаблицаИтоги.Итог("Обьем");
		
		ОбъемПродажПредПериод = чОбьемДо;
	Исключение
		Сообщить("Для " + тНом +" не расчитан обьем до акции!!!");
	КонецПопытки;
	
	ЗаписьАкц = РегистрыСведений.НоменклатураПромоакций.СоздатьМенеджерЗаписи();
	ЗаписьАкц.ид = ид;
	//ЗаписьАкц.Номенклатура = Элемент.Номенклатура;
	ЗаписьАкц.Прочитать();
	Выбран = ЗаписьАкц.Выбран();
	
	Если Выбран Тогда
		
		Если  АкцОбьем <> 0 Тогда
			ЗаписьАкц.ОбъемПродажАкционный = АкцОбьем;
		Иначе
			ЗаписьАкц.ОбъемПродажАкционный = Обьем1;
		КонецЕсли;
		ЗаписьАкц.ОбъемПродажПредПериод = чОбьемДо;
		ЗаписьАкц.Записать();
		
	КонецЕсли;
	//КонецЦикла;
	
	//запись значений в регистр свевдений
	
	Для Каждого СтрокаТаб из Объект.РасшифровкаПромо Цикл
		Набор = РегистрыСведений.РасшифровкаПромоАкций.СоздатьНаборЗаписей();
		Набор.Отбор.Промоакция.Установить(Объект.Промоакция);
		Набор.Отбор.Номенклатура.Установить(СтрокаТаб.Номенклатура);
		Набор.Отбор.ТорговаяПлощадка.Установить(СтрокаТаб.ТорговаяПлощадка);
		Набор.Прочитать();
		
		Если Набор.Количество() Тогда 
			НоваяЗапись = Набор[0];
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		Иначе
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Промоакция = Объект.Промоакция;
			НоваяЗапись.Номенклатура = СтрокаТаб.Номенклатура; 
			НоваяЗапись.ТорговаяПлощадка = СтрокаТаб.ТорговаяПлощадка;
			НоваяЗапись.АкционныйОбьем  = СтрокаТаб.АкционныйОбьем;
			НоваяЗапись.ОбьемЗаПредПериод = СтрокаТаб.ОбьемЗаПредПериод;
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетОбьемовОднойСтроки(Команда)
	ТекДан = элементы.СписокНоменклатуры.ТекущиеДанные;
	Статус = ТекДан.СтатусПозиции;
	Ном = ТекДан.Номенклатура;
	Покрытие =  ТекДан.Покрытие;
	Идент = ТекДан.ИД;
	ДМП = ТекДан.ДМП;
	РасчетОбьемовОднойСтрокиНаСервере(Ном, Покрытие, Идент, ДМП, Статус);
	
	фильтрСпискаНоменклатуры();
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеИзЭксельНаСервере(Данные)
	
	
	ТаблицаЗначенийИзЭксель = Новый ТаблицаЗначений;
	ТаблицаЗначенийИзЭксель.Колонки.Добавить("Артикул", , "Артикул");
	ТаблицаЗначенийИзЭксель.Колонки.Добавить("Номенклатура", , "Номенклатура");
	ТаблицаЗначенийИзЭксель.Колонки.Добавить("ЦенаЗак", , "Цена");
	ТаблицаЗначенийИзЭксель.Колонки.Добавить("АкционнаяЦена", , "Количество");
	ТаблицаЗначенийИзЭксель.Колонки.Добавить("Компенсация", ,"Компенсация");
	
	
	Счетчик = 0;
	
	Для Индекс = 0 По Данные[0].Количество()-1 Цикл
		
		// Заполняем таблицу значений из массива.
		СтрокаТаблицаЗначенийИзЭксель = ТаблицаЗначенийИзЭксель.Добавить();
		СтрокаТаблицаЗначенийИзЭксель.Артикул = СокрЛП(Данные[0][Счетчик]); 
		СтрокаТаблицаЗначенийИзЭксель.Номенклатура = СокрЛП(Данные[1][Счетчик]);   // Номенклатура
		СтрокаТаблицаЗначенийИзЭксель.ЦенаЗак = СокрЛП(Данные[2][Счетчик]); // ЦенаЗак
		СтрокаТаблицаЗначенийИзЭксель.АкционнаяЦена = СокрЛП(Данные[3][Счетчик]);  //АкционнаяЦена
		СтрокаТаблицаЗначенийИзЭксель.Компенсация = СокрЛП(Данные[4][Счетчик]);  //АкционнаяЦена
		
		Счетчик = Счетчик +1;
		
	КонецЦикла;
	Закупочная = Справочники.ТипыЦен.НайтиПоКоду("DG000002");
	Розница = Справочники.ТипыЦен.НайтиПоКоду("DG000003");	
	// Заполняем табличную часть
	Для Каждого СтрокаТЗ Из ТаблицаЗначенийИзЭксель Цикл 
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Формат(Число(СтрокаТЗ.Артикул),"ЧГ="));
		
		Если Номенклатура= Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			Сообщить("В справочнике «Номенклатура» не найден элемент с кодом " + Формат(Число(СтрокаТЗ.Артикул),"ЧГ="));
			
		Иначе
			НовСтрокаТчПозицииНоменклатуры = Объект.СписокНоменклатуры.Добавить();
			НовСтрокаТчПозицииНоменклатуры.Артикул =СтрокаТЗ.Артикул;
			НовСтрокаТчПозицииНоменклатуры.Номенклатура = Номенклатура;
			НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена = СтрокаТЗ.АкционнаяЦена;
			НовСтрокаТчПозицииНоменклатуры.АкционнаяЦена = СтрокаТЗ.ЦенаЗак;
			НовСтрокаТчПозицииНоменклатуры.Компенсация1шт = СтрокаТЗ.Компенсация;
			НовСтрокаТчПозицииНоменклатуры.Менеджер = ПараметрыСеанса.ТекущийПользователь;
			НовСтрокаТчПозицииНоменклатуры.СтатусПозиции = Перечисления.ВидСтатусаСогласованияПромоакций.Рассматривается;
			Ид = Новый УникальныйИдентификатор();
			НовСтрокаТчПозицииНоменклатуры.ид = Ид;
			НовСтрокаТчПозицииНоменклатуры.ТипРозничнойЦены = Розница;
			НовСтрокаТчПозицииНоменклатуры.Мониторинг = Перечисления.РезультатыМониторингаПромоакций.НеПроводился;
			НовСтрокаТчПозицииНоменклатуры.ТорговаяМарка = получитьЗначениеРеквизита(Номенклатура,"ТоварнаяМарка");
			НовСтрокаТчПозицииНоменклатуры.НаименованиеТовара=получитьЗначениеРеквизита(Номенклатура,"НаименованиеПолное");
			НовСтрокаТчПозицииНоменклатуры.ТипНоменклатуры = получитьЗначениеРеквизита(Номенклатура,"ТипНоменклатуры");
			НовСтрокаТчПозицииНоменклатуры.ТипЗакупочнойЦены = Закупочная;
			
			инфоЦенаПоставщик =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(Номенклатура, ,Закупочная);
			Если не инфоЦенаПоставщик = неопределено тогда
				НовСтрокаТчПозицииНоменклатуры.Поставщик         =  инфоЦенаПоставщик.Контрагент;
				НовСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции     =  инфоЦенаПоставщик.Цена;
				инфоЦенаПоставщикДоАкции =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(Номенклатура, ,Закупочная,истина);
				Если не инфоЦенаПоставщикДоАкции = неопределено тогда
					НовСтрокаТчПозицииНоменклатуры.ДоАкционнаяЦена   =  инфоЦенаПоставщикДоАкции.Цена;
				КонецЕсли;					
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена) и ЗначениеЗаполнено(новСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции) Тогда
				Попытка
					Процент = (НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена/новСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции-1)*100;
					НовСтрокаТчПозицииНоменклатуры.ПроцентСкидки = Формат(Окр(Процент,0,РежимОкругления.Окр15как10), "ЧДЦ=3; ЧГ=");
				ИСключение
				КонецПопытки;
			КонецЕсли;
			
			
			Набор = РегистрыСведений.НоменклатураПромоакций.СоздатьНаборЗаписей();
			НАбор.Отбор.ид.Установить(ид);
			НоваяЗапись = набор.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, НовСтрокаТчПозицииНоменклатуры);
			НоваяЗапись.Промоакция = Объект.Промоакция;
			Набор.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаЗначенийИзЭксель = Неопределено;
	
	Сообщить("Загрузка завершена"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьБланк(Команда)
	перем ссылкаНаФайл,ПутьКФАйлу;
	
	#Если не ВебКлиент Тогда
		НомерПервойСтроки = 2;
		НомерПервойКолонки = 1;
		КоличествоСтрокВЭксель = 0;
		КоличествоКолонокВЭксель = 0;
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбора.Заголовок = "Выберите файл";
		Если ДиалогВыбора.Выбрать() Тогда
			ИмяФайлаЭксель = ДиалогВыбора.ПолноеИмяФайла;
			//Подключаемся к Эксель
			Попытка
				Эксель = Новый COMОбъект("Excel.Application");
				Эксель.WorkBooks.Open(ИмяФайлаЭксель);
				Состояние("Обработка файла Microsoft Excel...");
			Исключение
				Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			Попытка 
				//Открываем необходимый лист
				Эксель.Sheets(1).Select();  // лист 1, по умолчанию  
			Исключение
				//Закрываем Excel
				Эксель.ActiveWorkbook.Close();  
				Эксель = 0;
				Сообщить("Файл "+Строка(Объект.ИмяФайла)+" не соответствует необходимому формату! Первый лист не найден!");
				Возврат;
			КонецПопытки;
			//Получим количество строк и колонок.		
			КоличествоСтрокВЭксель = Эксель.Cells.SpecialCells(11).Row;
			КоличествоКолонокВЭксель = Эксель.Cells.SpecialCells(11).Column;
			// Выделяем область на листе Эксель.
			Область = Эксель.Range(Эксель.Cells(НомерПервойСтроки,НомерПервойКолонки), Эксель.Cells(КоличествоСтрокВЭксель,КоличествоКолонокВЭксель));
			// Выгружаем область Эксель в двумерный массив.
			Данные = Область.Value.Выгрузить();		
			//Отключаемся от Excel 
			Попытка
				Эксель.DisplayAlerts = 0;
				Эксель.ActiveWorkbook.Close();
				Эксель.DisplayAlerts = 1;
				Эксель.Quit(); 
				Эксель = Неопределено;        
			Исключение
				Сообщить("Не удалось отключиться от Excel - " + ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			//Далее обрабатываем на сервере полученные из Эксель данные.
			ОбработатьДанныеИзЭксельНаСервере(Данные)
		КонецЕсли;
	#КонецЕсли
	
	#Если ВебКлиент Тогда
		оповещениеЗавершение = новый ОписаниеОповещения("ЗагрузкаБланка",ЭтотОбъект);
		оповещениеХодВыполнения = новый ОписаниеОповещения("ходВыполнения",ЭтотОбъект);
		оповещениеПередНачалом = новый ОписаниеОповещения("передНачаломЗагрузкиФайла",ЭтотОбъект);
		НачатьПомещениеФайлаНаСервер(оповещениеЗавершение,оповещениеХодВыполнения,оповещениеПередНачалом,ссылкаНаФайл,ПутьКФАйлу,ЭтаФорма.УникальныйИдентификатор);	
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура прочитатьФайлНаСервереИВыгрузитьвТЗ (Адрес,имя,расширение)
	структураВозврата = новый Структура ("табДок,СтатусОшибки,ОписаниеОшибки",неопределено,ложь,"");
	текФайл = ПолучитьИзВременногоХранилища(Адрес);
	путьВременногоФайла = ПолучитьИмяВременногоФайла(расширение);
	текФайл.Записать( путьВременногоФайла);
	табдок = новый ТабличныйДокумент;
	попытка
		табдок.Прочитать(путьВременногоФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
		колонок = табдок.ШиринаТаблицы;
		Строк = табдок.ВысотаТаблицы;
		
		ТаблицаЗначенийИзЭксель = Новый ТаблицаЗначений;
		ТаблицаЗначенийИзЭксель.Колонки.Добавить("Артикул", , "Артикул");
		ТаблицаЗначенийИзЭксель.Колонки.Добавить("Номенклатура", , "Номенклатура");
		ТаблицаЗначенийИзЭксель.Колонки.Добавить("ЦенаЗак", , "Цена");
		ТаблицаЗначенийИзЭксель.Колонки.Добавить("АкционнаяЦена", , "Количество");
		ТаблицаЗначенийИзЭксель.Колонки.Добавить("Компенсация", ,"Компенсация");
		
		
		Счетчик = 1;
		
		Для НомерСтроки=2 По Строк Цикл
			
			СтрокаТаблицаЗначенийИзЭксель = ТаблицаЗначенийИзЭксель.Добавить();
			СтрокаТаблицаЗначенийИзЭксель.Артикул = Формат(Число(ЗначениеКолонки(табдок, НомерСтроки, 1)),"ЧДЦ=0; ЧГ="); //Артикул
			СтрокаТаблицаЗначенийИзЭксель.Номенклатура = СокрЛП(ЗначениеКолонки(табдок, НомерСтроки, 2));   // Номенклатура
			СтрокаТаблицаЗначенийИзЭксель.ЦенаЗак = Формат(ЗначениеКолонки(табдок, НомерСтроки, 3),"ЧДЦ=4; ЧГ="); // ЦенаЗак
			СтрокаТаблицаЗначенийИзЭксель.АкционнаяЦена = Формат(ЗначениеКолонки(табдок, НомерСтроки, 4),"ЧДЦ=4; ЧГ=");  //АкционнаяЦена
			СтрокаТаблицаЗначенийИзЭксель.Компенсация = Формат(ЗначениеКолонки(табдок, НомерСтроки, 5),"ЧДЦ=4; ЧГ=");  //Компенсация
			
			Счетчик = Счетчик +1;
			
		КонецЦикла;
		Закупочная = Справочники.ТипыЦен.НайтиПоКоду("DG000002");
		Розница = Справочники.ТипыЦен.НайтиПоКоду("DG000003");	
		// Заполняем табличную часть
		Для Каждого СтрокаТЗ Из ТаблицаЗначенийИзЭксель Цикл 
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СтрокаТЗ.Артикул);
			
			Если Номенклатура= Справочники.Номенклатура.ПустаяСсылка() Тогда
				
				Сообщить("В справочнике «Номенклатура» не найден элемент с кодом " + Формат(СтрокаТЗ.Артикул,"ЧДЦ=0; ЧГ="));
				
			Иначе
				
				НовСтрокаТчПозицииНоменклатуры = Объект.СписокНоменклатуры.Добавить();
				НовСтрокаТчПозицииНоменклатуры.Артикул =СтрокаТЗ.Артикул;
				НовСтрокаТчПозицииНоменклатуры.Номенклатура = Номенклатура;
				НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена = СтрокаТЗ.АкционнаяЦена;
				НовСтрокаТчПозицииНоменклатуры.АкционнаяЦена = СтрокаТЗ.ЦенаЗак;
				НовСтрокаТчПозицииНоменклатуры.Компенсация1шт = СтрокаТЗ.Компенсация;
				НовСтрокаТчПозицииНоменклатуры.Менеджер = ПараметрыСеанса.ТекущийПользователь;
				НовСтрокаТчПозицииНоменклатуры.СтатусПозиции = Перечисления.ВидСтатусаСогласованияПромоакций.Рассматривается;
				Ид = Новый УникальныйИдентификатор();
				НовСтрокаТчПозицииНоменклатуры.ид = Ид;
				НовСтрокаТчПозицииНоменклатуры.ТипРозничнойЦены = Розница;
				НовСтрокаТчПозицииНоменклатуры.Мониторинг = Перечисления.РезультатыМониторингаПромоакций.НеПроводился;
				НовСтрокаТчПозицииНоменклатуры.ТорговаяМарка = получитьЗначениеРеквизита(Номенклатура,"ТоварнаяМарка");
				НовСтрокаТчПозицииНоменклатуры.НаименованиеТовара=получитьЗначениеРеквизита(Номенклатура,"НаименованиеПолное");
				НовСтрокаТчПозицииНоменклатуры.ТипНоменклатуры = получитьЗначениеРеквизита(Номенклатура,"ТипНоменклатуры");
				НовСтрокаТчПозицииНоменклатуры.ТипЗакупочнойЦены = Закупочная;
				
				инфоЦенаПоставщик =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(Номенклатура, ,Закупочная);
				Если не инфоЦенаПоставщик = неопределено тогда
					НовСтрокаТчПозицииНоменклатуры.Поставщик         =  инфоЦенаПоставщик.Контрагент;
					НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена     =  инфоЦенаПоставщик.Цена;
					инфоЦенаПоставщикДоАкции =  получитьПоставщикаИАкционнуюЦенуИзСпецификации(Номенклатура, ,Закупочная,истина);
					Если не инфоЦенаПоставщикДоАкции = неопределено тогда
						НовСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции   =  инфоЦенаПоставщикДоАкции.Цена;
					КонецЕсли;					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена) и ЗначениеЗаполнено(новСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции) Тогда
					Попытка
						Процент = (НовСтрокаТчПозицииНоменклатуры.РозничнаяЦена/новСтрокаТчПозицииНоменклатуры.РозничнаяЦенаДоАкции-1)*100;
						НовСтрокаТчПозицииНоменклатуры.ПроцентСкидки = Формат(Процент, "ЧДЦ=3; ЧГ=");
					ИСключение
						НовСтрокаТчПозицииНоменклатуры.ПроцентСкидки = 100;
					КонецПопытки;
				КонецЕсли;
				
				
				Набор = РегистрыСведений.НоменклатураПромоакций.СоздатьНаборЗаписей();
				НАбор.Отбор.ид.Установить(ид);
				НоваяЗапись = набор.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, НовСтрокаТчПозицииНоменклатуры);
				НоваяЗапись.Промоакция = Объект.Промоакция;
				Набор.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаЗначенийИзЭксель = Неопределено;
		
		Сообщить("Загрузка завершена"); 
		
	исключение
		текстОшибки = ОписаниеОшибки();
		структураВозврата.СтатусОшибки=истина;
		структураВозврата.ОписаниеОшибки=текстОшибки;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаБланка(ОписаниеПомещенногоФайла,ДополнительныеПараметры) экспорт	
	прочитатьФайлНаСервереИВыгрузитьвТЗ (ОписаниеПомещенногоФайла.Адрес,ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя,ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
КонецПроцедуры

&НаКлиенте
Процедура ходВыполнения (ПомещаемыйФайл,Помещено, ОтказОтПомещенияФайла,ДополнительныеПараметры) экспорт
	Состояние ("Ход выполнения "+Помещено+"%");	
КонецПроцедуры

&НаКлиенте
Процедура передНачаломЗагрузкиФайла ( ПомещаемыйФайл, ОтказОтПомещенияФайла,ДополнительныеПараметры) экспорт
	Состояние ("Начало загрузки");
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаСобытие(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		ПутьКФайлу = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЗначениеКолонки(ТабличныйДокумент, НомерСтроки, НомерКолонки)
	
	Область = ТабличныйДокумент.Область("R" + Строка(НомерСтроки) + "C" + Строка(НомерКолонки));
	Возврат Область.Текст;
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыСтатусПозицииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//текущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	//ТекСтатус = ТекущиеДанные.СтатусПозиции;
	//Для каждого стр из элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
	//	Если СтрНайти(стр.Подсказка, "**обязательное**")<>0 тогда
	//		текИмя =  СтрЗаменить(стр.Имя,"СписокНоменклатуры","");
	//		текЗаголовок = СокрЛП(СтрЗаменить(стр.Заголовок,Символы.ПС, " "));
	//		Если ПустаяСтрока(текЗаголовок) тогда
	//			текЗаголовок = стр.Имя;
	//		КонецЕсли;
	//		
	//		если не ЗначениеЗаполнено(текущиеДанные[текИмя]) тогда
	//			Сообщить(Строка(текущиеДанные.НомерСтроки)+". Не заполнено значение в колонке """+текЗаголовок+""", строка не сохранена!",СтатусСообщения.Внимание);
	//			//ОтменаРедактирования=истина;
	//			СтандартнаяОбработка=Ложь;
	//			возврат;
	//		КонецЕсли;				
	//	КонецЕсли;			
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСтатусПозицииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = получитьЗначениеПеречисления("ВидСтатусаСогласованияПромоакций","Утверждено") Тогда
		текущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		//ТекСтатус = ТекущиеДанные.СтатусПозиции;
		Для каждого стр из элементы.СписокНоменклатуры.ПодчиненныеЭлементы цикл
			Если СтрНайти(стр.Подсказка, "**обязательное**")<>0 тогда
				текИмя =  СтрЗаменить(стр.Имя,"СписокНоменклатуры","");
				текЗаголовок = СокрЛП(СтрЗаменить(стр.Заголовок,Символы.ПС, " "));
				Если ПустаяСтрока(текЗаголовок) тогда
					текЗаголовок = стр.Имя;
				КонецЕсли;
				
				если не ЗначениеЗаполнено(текущиеДанные[текИмя]) тогда
					Сообщить(Строка(текущиеДанные.НомерСтроки)+". Не заполнено значение в колонке """+текЗаголовок+""", строка не сохранена!",СтатусСообщения.Внимание);
					//ОтменаРедактирования=истина;
					СтандартнаяОбработка=Ложь;
					возврат;
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;				
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = Новый ТабличныйДокумент;
	СформироватьОтчетНаСервере(Результат);
	
	Результат.ОтображатьЗаголовки = Ложь;
	Результат.ОтображатьСетку = Ложь;
	Результат.Показать();
КонецПроцедуры


&НаСервере
Процедура СформироватьОтчетНаСервере(Результат)
	
	Дата = КонецДня(Объект.Промоакция.ДатаОкончания)+1;
	Если Дата> ТекущаяДата() Тогда
		Сообщить("Дата формирования остатков не может быть больше текущей!!!");
		Возврат;
	КонецЕсли;
	
	ТабН = Новый ТаблицаЗначений;
	Склады = Новый СписокЗначений;
	СписокН= Новый СписокЗначений;
	
	ТабН.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура",);
	ТабН.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"),"Цена",);
	ТабН.Колонки.Добавить("ДоговорИзлишки",Новый ОписаниеТипов("Строка"),"Договор излишки",);	
	
	Для Каждого стрТовары из Объект.СписокНоменклатуры Цикл
		ит=1;
		СписокН.Добавить(стрТовары.Номенклатура);
		нстр = ТабН.Добавить();
		нстр.Номенклатура = стрТовары.Номенклатура;
		нстр.Цена =  стрТовары.ДоАкционнаяЦена;
		нстр.ДоговорИзлишки =  стрТовары.ДоговорИзлишки;

		Если ит =1 Тогда
			Для Каждого стрПокрытия из стрТовары.Покрытие.Состав Цикл
				Склады.Добавить(стрПокрытия.ТорговаяПлощадка);
			КонецЦикла;
		КонецЕсли;
		ит = ит+1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.Номенклатура КАК Номенклатура,
		|	Табл.Цена КАК Цена,
		|	Табл.ДоговорИзлишки КАК ДоговорИзлишки
		|ПОМЕСТИТЬ Основа
		|ИЗ
		|	&Табл КАК Табл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫРАЗИТЬ(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток * Основа.Цена КАК ЧИСЛО(15, 3)) КАК Сумма,
		|	Основа.ДоговорИзлишки КАК ДоговорИзлишки
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			&Дата,
		|			Номенклатура В (&Номенклатура)
		|				И СкладКомпании.ТорговаяПлощадка В (&Склады)) КАК ОстаткиТоваровКомпанииОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Основа КАК Основа
		|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = Основа.Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", СписокН);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Табл", ТабН);
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатТаб = Новый ТаблицаЗначений;
	РезультатТаб = РезультатЗапроса.Выгрузить();
	
	СхемаКомпоновкиДанных = ПолучитьМакетНаСервере("Отчет");
	
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура",         СписокН);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Дата",            Дата);
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склады",            Склады);
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ВнешнийНаборДанных = Новый Структура("Таблица", РезультатТаб);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент();
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	
КонецПроцедуры




//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

