#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Порядок = 0 Тогда 
		Справочники.ТК_МестаХранения.ЗаполнитьПорядокВОбъекте(ЭтотОбъект);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Порядок = 0;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Порядок = 0;
КонецПроцедуры










#КонецЕсли

