

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь; // пока что сняли ограничение, Адинистратор заказов должен иметь возможность установить любой статус
	//Если РольДоступна(
	//	
	//ДанныеВыбора = Новый СписокЗначений;
	//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаКазначейство.ОтмененИсполнителем"));
	//ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаКазначейство.ОтмененКлиентом"));

КонецПроцедуры
