
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ПрограммныйИнтерфейс

//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.2.252");
//    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
//    ПараметрыРегистрации.Версия = "1.0.0";
//	ПараметрыРегистрации.Наименование = НСтр("ru = 'Загрузка спецификаций'; uk = 'Завантаження специфікацій'");
//	ПараметрыРегистрации.Информация = ""; 
//	
//	Команда = ПараметрыРегистрации.Команды.Добавить();
//    Команда.Представление = НСтр("ru = 'Загрузка спецификаций'; uk = 'Завантаження специфікацій'");
//    Команда.Идентификатор = "ЗагрузкаСпецификаций";
//    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//    Команда.ПоказыватьОповещение = Истина;
//	
//	Возврат ПараметрыРегистрации; 
//	
//КонецФункции


//#КонецОбласти



//#Иначе
//	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");	
//#КонецЕсли