



Функция НеобходимоФормироватьЗадание(ТорговаяПлощадка,МассивТоваров)Экспорт
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаТБД = РегистрыСведений.ТК_ТБД_Периоды.ПериодТБД(ТорговаяПлощадка);
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Дата",ДатаТБД);
	Запрос.Параметры.Вставить("МассивТовары",МассивТоваров);
	Запрос.Параметры.Вставить("ТорговаяПлощадка",ТорговаяПлощадка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТБД.Номенклатура КАК Номенклатура,
	               |	ТК_ТБД.Количество КАК Количество
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	РегистрСведений.ТК_ТБД КАК ТК_ТБД
	               |ГДЕ
	               |	ТК_ТБД.Дата = &Дата
	               |	И ТК_ТБД.ТорговаяПлощадка = &ТорговаяПлощадка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	1 КАК сч
	               |ИЗ
	               |	Товары КАК Товары
	               |ГДЕ
	               |	Товары.Номенклатура В(&МассивТовары)";
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
