
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фильтрСписка ();	

КонецПроцедуры

&НаСервере
процедура фильтрСписка ()
	
	Параметры.Свойство("Промоакция",объект.Промоакция);
	отборПромоакция=ИсторияМониторингов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0);
	отборПромоакция.ЛевоеЗначение=новый ПолеКомпоновкиДанных("Промоакция");
	отборПромоакция.ПравоеЗначение = объект.Промоакция;
	отборПромоакция.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	отборПромоакция.Использование = Истина;
	
	////если энто админ, не используем отбор по менеджеру
	отборменеджер=ИсторияМониторингов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(1);
	//отборменеджер.ПравоеЗначение = пользователи.АвторизованныйПользователь();
	//Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава)
	//	или ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АдминистрированиеПромоакций) тогда
		отборменеджер.Использование=Ложь;
	//иначе
	//	отборменеджер.Использование=истина;				
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
процедура фильтрСпискаНаКлиенте ()
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсторияМониторинговПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	//текДан = Элементы.ИсторияМониторингов.ТекущиеДанные;
	текСтр = Элементы.ИсторияМониторингов.ТекущаяСтрока;
	текФайл=получитьФайлИстории (текСтр);
	

	Если текФайл <> неопределено тогда
		#Если не ВебКлиент Тогда
			имяВременногоФайла = КаталогВременныхФайлов()+текФайл.ИмяФайла;
			текФайл.данные.Записать(имяВременногоФайла);			
			
			ЗапуститьПриложение(имяВременногоФайла);
			//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			//Диалог.Заголовок = "Укажите имя файла";
			////Диалог.ПолноеИмяФайла = Объект.Путь; 
			//Фильтр = "Файл Эксель 2008 (*.xlsx)|*.xlsx|Файл Эксель  (*.xls)|*.xls"; 
			//Диалог.Фильтр = Фильтр; 
			//Диалог.МножественныйВыбор = Ложь;
			//Если Диалог.Выбрать() Тогда
			//	
			//	
			//	
			//КонецЕсли;
		#иначе
			списокКнопокВопроса = новый СписокЗначений ();
			списокКнопокВопроса.Добавить("Показать","Показать");
			списокКнопокВопроса.Добавить("Скачать","Скачать");
			списокКнопокВопроса.Добавить("Отмена","Отмена");
			оповещение = новый ОписаниеОповещения("ОбработатьОтветНаВопрос",ЭтотОбъект,текФайл);
			ПоказатьВопрос(оповещение,"Выберите действие",списокКнопокВопроса,30,"Показать","Что хотите сделать?","Отмена");
		#КонецЕсли
	иначе
		сообщить ("нет данных для отображения");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопрос (РезультатВопроса,ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = "Показать" тогда
		табДок=получитьТабДокДляВебКлиента (ДополнительныеПараметры);
		табДок.Показать(ДополнительныеПараметры.ИмяФайла,ДополнительныеПараметры.ИмяФайла);		
	ИначеЕсли  РезультатВопроса = "Скачать" тогда
		ВремХранилище = ПоместитьВоВременноеХранилище(ДополнительныеПараметры.данные,ЭтаФорма.УникальныйИдентификатор);
		НачатьПолучениеФайлаССервера(ВремХранилище, ДополнительныеПараметры.ИмяФайла);		
	иначе
		Возврат;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция получитьТабДокДляВебКлиента (текФайл)
	//дд = новый ДвоичныеДанные;
	//дд.НачатьЗапись(
	имяВременногоФайла = КаталогВременныхФайлов()+текФайл.ИмяФайла;
	текФайл.данные.Записать(имяВременногоФайла);
	табДок = новый ТабличныйДокумент;
	табДок.Прочитать(имяВременногоФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Возврат табДок;
КонецФункции

&НаСервере
функция получитьФайлИстории (текСтр)
	мз = РегистрыСведений.ИсторияМониторингов.СоздатьМенеджерЗаписи();
	структураВозврата = новый структура ("ИмяФайла,данные");
	ЗаполнитьЗначенияСвойств(мз,текСтр);	
	мз.Прочитать();
	если мз.Выбран() тогда
		структураВозврата.ИмяФайла = мз.ИмяФайла;
		структураВозврата.данные = мз.СохраненныеДанные.Получить();
		возврат структураВозврата;
	иначе
		возврат неопределено;
	КонецЕсли;
КонецФункции

