
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораОтветственный();
	Ответственный = Пользователи.ТекущийПользователь().ФизическоеЛицо;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	ТабДок = Обработки.КорректностьЗаполненияСправочников.ПроверитьКорректностьЗаполненияСправочников(Ответственный);
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОтветственный()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РолиСервисДеск.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.РолиСервисДеск КАК РолиСервисДеск
	|ГДЕ
	|	РолиСервисДеск.Выполнение
	|	И НЕ РолиСервисДеск.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РолиСервисДеск.Ответственный.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Элементы.Ответственный.СписокВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ответственный"));
	
КонецПроцедуры
