
// Возвращает Истина, если переданный объект содержит 
// значения по умолчанию для удостоверения личности
//
// Параметры:
//	ИнформацияОбУдостоверенииЛичности - объект, имеющий свойства 
//		ВидДокумента
//		Серия
//		Номер
//		ДатаВыдачи
//		КемВыдан
//		КодПодразделения
//		
Функция УдостоверениеЛичностиПоУмолчанию(ИнформацияОбУдостоверенииЛичности) Экспорт
	
	Возврат (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.ВидДокумента))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.Серия))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.Номер))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.ДатаВыдачи))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.СрокДействия))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.КемВыдан))
		И (НЕ ЗначениеЗаполнено(ИнформацияОбУдостоверенииЛичности.КодПодразделения));
		
КонецФункции


Функция ДатаСеанса() Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли
	
КонецФункции


Процедура ОбновитьНаборЗаписейИсторииДокументыФизическихЛиц(Форма, ВедущийОбъект) Экспорт
	Перем ЗаписьНабора;
	
	Если Не Форма["ДокументыФизическихЛицНаборЗаписейПрочитан"] Тогда
		
		Форма.ПрочитатьНаборЗаписейПериодическихСведений("ДокументыФизическихЛиц", ВедущийОбъект);
		
	КонецЕсли;
	
	СтруктураЗаписиСтрокой = "";
	ПрежняяЗапись = Новый Структура;
	НужнаЗапятая = Ложь;
	Для Каждого КлючЗначение Из Форма["ДокументыФизическихЛицПрежняя"] Цикл
		Если НужнаЗапятая Тогда
			СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + ",";
		КонецЕсли;
		СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + КлючЗначение.Ключ;
		НужнаЗапятая = Истина;
		ПрежняяЗапись.Вставить(КлючЗначение.Ключ);
	КонецЦикла;
		
	Если ЗначениеЗаполнено(Форма["ДокументыФизическихЛиц"].Период) Тогда
		ПериодИзменен = Форма["ДокументыФизическихЛиц"].Период > Форма["ДокументыФизическихЛицПрежняя"].Период;
		РесурсыИзменены = Ложь;
		Для Каждого КлючЗначение Из Форма["ДокументыФизическихЛицПрежняя"] Цикл
			Если КлючЗначение.Ключ = "Период" Тогда
				Продолжить;
			КонецЕсли;
			Если КлючЗначение.Значение <> Форма["ДокументыФизическихЛиц"][КлючЗначение.Ключ] Тогда
				РесурсыИзменены = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей = Форма["ДокументыФизическихЛицНаборЗаписей"];
		Если (ПериодИзменен И РесурсыИзменены) ИЛИ НаборЗаписей.Количество() = 0 Тогда
			ЗаписьНаНовуюДату = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ВидДокумента", Форма["ДокументыФизическихЛиц"].Период, Форма["ДокументыФизическихЛиц"].ВидДокумента));
			Если ЗаписьНаНовуюДату.Количество() = 0 Тогда
				ЗаписьНабора = НаборЗаписей.Добавить();
			КонецЕсли;
		Иначе
			ЗаписьНаНовуюДату = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ВидДокумента", Форма["ДокументыФизическихЛиц"].Период, Форма["ДокументыФизическихЛиц"].ВидДокумента));
			Если ЗаписьНаНовуюДату.Количество() > 0 Тогда
				ЗаписьНабора = ЗаписьНаНовуюДату[0];
			Иначе
				ЗаписьНабора = НаборЗаписей.Добавить();
			КонецЕсли; 
		КонецЕсли;
		
		Если ЗаписьНабора <> НеОпределено Тогда
			
			// Если в этом периоде уже есть документы являющиеся удостоверением личности - 
			// сбросим признак
			ЯвляющиесяУдостоверениямиЛичности = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ЯвляетсяДокументомУдостоверяющимЛичность", Форма["ДокументыФизическихЛиц"].Период, Истина));
			Для каждого УдостоверениеЛичности Из ЯвляющиесяУдостоверениямиЛичности Цикл
				Если УдостоверениеЛичности.ВидДокумента <> ЗаписьНабора.ВидДокумента Тогда
					УдостоверениеЛичности.ЯвляетсяДокументомУдостоверяющимЛичность = Ложь;
				КонецЕсли; 
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Форма["ДокументыФизическихЛиц"]);
			НаборЗаписей.Сортировать("Период,ЯвляетсяДокументомУдостоверяющимЛичность");
			
			ЗаполнитьЗначенияСвойств(ПрежняяЗапись, Форма["ДокументыФизическихЛиц"]);
			Форма["ДокументыФизическихЛицПрежняя"] = Новый ФиксированнаяСтруктура(ПрежняяЗапись);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПолеУдостоверениеЛичностиПериод(Форма) Экспорт
	                                               
	Если Форма.ДоступенПросмотрДанныхФизическихЛиц Тогда 
		
		// не обязательно заполнение поля Период если данные по умолчанию и при этом 
		// записи о сведениях об инвалидности еще нет
		Если УдостоверениеЛичностиПоУмолчанию(Форма.ДокументыФизическихЛиц)
			И НЕ ЗначениеЗаполнено(Форма.ДокументыФизическихЛицПрежняя.Период) Тогда
			Форма.ДокументыФизическихЛиц.Период = '00010101';
			
			Если Форма.Элементы.Найти("ДокументыФизическихЛицВидДокумента") <> Неопределено Тогда
				Форма.Элементы.ДокументыФизическихЛицВидДокумента.АвтоОтметкаНезаполненного = Ложь;
				Форма.Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Ложь;
			КонецЕсли;
		Иначе
			Если Форма.Элементы.Найти("ДокументыФизическихЛицВидДокумента") <> Неопределено Тогда			
				Форма.Элементы.ДокументыФизическихЛицВидДокумента.АвтоОтметкаНезаполненного = Истина;
				Если ЗначениеЗаполнено(Форма.ДокументыФизическихЛиц.ВидДокумента) Тогда
					Форма.Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Ложь;
				Иначе
					Форма.Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Форма.ДокументыФизическихЛиц.Период) Тогда
				Если ЗначениеЗаполнено(Форма.ДокументыФизическихЛиц.ДатаВыдачи) Тогда
					Форма.ДокументыФизическихЛиц.Период = Форма.ДокументыФизическихЛиц.ДатаВыдачи;
				Иначе
					Форма.ДокументыФизическихЛиц.Период = НачалоДня(ДатаСеанса());
				КонецЕсли;
			КонецЕсли;
			Форма.ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
		КонецЕсли;
		
		РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "ДокументыФизическихЛиц", Форма.ФизическоеЛицоСсылка);
		
	КонецЕсли; 
	
КонецПроцедуры



Процедура ОбработатьОтображениеСерияДокументаФизическогоЛица(ВидДокумента, Серия ,Элемент, Форма) Экспорт
	
	//*?
	//СообщенияПроверки = "";
	//ТипСерии = ФизическиеЛицаКлиентСервер.ТипСерииДокументаУдостоверяющегоЛичность(ВидДокумента);
	//Если ЗначениеЗаполнено(ВидДокумента) И ТипСерии > 0 Тогда
	//	Если НЕ ПустаяСтрока(Серия) Тогда
	//		СерияУказанаПравильно = ФизическиеЛицаКлиентСервер.СерияДокументаУказанаПравильно(ВидДокумента, Серия, СообщенияПроверки);
	//		СообщенияПроверки = ?(ПустаяСтрока(СообщенияПроверки), НСтр("ru='Серия указана правильно';uk='Серія вказана правильно'"), СообщенияПроверки);
	//		Если СерияУказанаПравильно Тогда
	//			Картинка = БиблиотекаКартинок.ОперацияВыполненаУспешно;
	//			ТекстНадписи  = "";
	//			ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//		Иначе
	//			Картинка = БиблиотекаКартинок.Предупреждение;
	//			ТекстНадписи  = НСтр("ru='Ошибка';uk='Помилка'");
	//			ЭлементЦветТекста = Форма.ЦветСтиляПоясняющийОшибкуТекст;
	//		КонецЕсли;
	//	Иначе
	//		СообщенияПроверки = "Не указана серия документа";
	//		ТекстНадписи  = "";
	//		ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//		Картинка = Новый Картинка;
	//	КонецЕсли;
	//Иначе
	//	СообщенияПроверки = "Серия документа";
	//	ТекстНадписи  = "";
	//	ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//	Картинка = Новый Картинка;
	//КонецЕсли;
	//Форма[Элемент.Имя + "ИнфоКартинка"] = Картинка;
	//Форма[Элемент.Имя + "ИнфоТекст"] = ТекстНадписи;
	//Форма.Элементы[Элемент.Имя + "ИнфоКартинка"].Подсказка = СообщенияПроверки;
	//Форма.Элементы[Элемент.Имя + "ИнфоТекст"].Подсказка = СообщенияПроверки;
	//Форма.Элементы[Элемент.Имя + "ИнфоТекст"].ЦветТекста = ЭлементЦветТекста;
	//Элемент.Подсказка  = СообщенияПроверки;
	//Элемент.ЦветТекста = ЭлементЦветТекста;
КонецПроцедуры

Процедура ОбработатьОтображениеНомерДокументаФизическогоЛица(ВидДокумента, Номер ,Элемент, Форма) Экспорт
	//*?
	//СообщенияПроверки = "";
	//ТипНомера = ФизическиеЛицаКлиентСервер.ТипНомераДокументаУдостоверяющегоЛичность(ВидДокумента);
	//Если ЗначениеЗаполнено(ВидДокумента) И ТипНомера > 0 Тогда
	//	Если НЕ ПустаяСтрока(Номер) Тогда
	//		СерияУказанаПравильно = ФизическиеЛицаКлиентСервер.НомерДокументаУказанПравильно(ВидДокумента, Номер, СообщенияПроверки);
	//		СообщенияПроверки = ?(ПустаяСтрока(СообщенияПроверки), НСтр("ru='Номер документа указан правильно';uk='Номер документа вказаний правильно'"), СообщенияПроверки);
	//		Если СерияУказанаПравильно Тогда
	//			Картинка = БиблиотекаКартинок.ОперацияВыполненаУспешно;
	//			ТекстНадписи  = "";
	//			ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//		Иначе
	//			Картинка = БиблиотекаКартинок.Предупреждение;
	//			ТекстНадписи  = НСтр("ru='Ошибка';uk='Помилка'");
	//			ЭлементЦветТекста = Форма.ЦветСтиляПоясняющийОшибкуТекст;
	//		КонецЕсли;
	//	Иначе
	//		СообщенияПроверки = "Не указан номер документа";
	//		ТекстНадписи  = "";
	//		ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//		Картинка = Новый Картинка;
	//	КонецЕсли;
	//Иначе
	//	СообщенияПроверки = "Номер документа";
	//	ТекстНадписи  = "";
	//	ЭлементЦветТекста = Форма.ЦветСтиляЦветТекстаПоля;
	//	Картинка = Новый Картинка;
	//КонецЕсли;
	//Форма[Элемент.Имя + "ИнфоКартинка"] = Картинка;
	//Форма[Элемент.Имя + "ИнфоТекст"] = ТекстНадписи;
	//Форма.Элементы[Элемент.Имя + "ИнфоКартинка"].Подсказка = СообщенияПроверки;
	//Форма.Элементы[Элемент.Имя + "ИнфоТекст"].Подсказка = СообщенияПроверки;
	//Форма.Элементы[Элемент.Имя + "ИнфоТекст"].ЦветТекста = ЭлементЦветТекста;
	//Элемент.Подсказка  = СообщенияПроверки;
	//Элемент.ЦветТекста = ЭлементЦветТекста;
КонецПроцедуры
