
&НаСервереБезКонтекста
Процедура ЗаполнитьРегистрНаСервере()

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Склад
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗакрытиеСмены.Дата) КАК Дата,
		|	ЗакрытиеСмены.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
		|ГДЕ
		|	ЗакрытиеСмены.СкладКомпании В
		|			(ВЫБРАТЬ
		|				ВТ_Склад.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_Склад КАК ВТ_Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакрытиеСмены.СкладКомпании";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Регистрация = УправлениеСвойствами.ЗначениеСвойства(ВыборкаДетальныеЗаписи.СкладКомпании,"OS_АктивныеСклады");
		Если Регистрация = Неопределено Или Регистрация = Ложь Тогда
			Продолжить;
		КонецЕсли;
		РегистрыСведений.ТК_ДатыОстатковOS.ЗаписатьНовуюДату(ВыборкаДетальныеЗаписи.Дата,ВыборкаДетальныеЗаписи.СкладКомпании);	
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистр(Команда)
	ЗаполнитьРегистрНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)
	массивСсылок = Элементы.Список.ВыделенныеСтроки;
	ВыгрузитьНаСервере(массивСсылок);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(МассивСтрок)
	
	МассивСкладов = Новый Массив;
	Для Каждого Стр Из МассивСтрок Цикл 
		    МассивСкладов.Добавить(Стр.СкладКомпании);
	КонецЦикла;
	
	
	 //для получения настроек подключения

	УзлыОбмена = ПланыОбмена.ОбменФронт.ПолучитьМассивУзловВыгрузкиОстатковТовара();
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого УзелОбмена Из УзлыОбмена Цикл 
		ОбменФронтСобытия.ВыполнитьВыгрузкуОстатков(УзелОбмена,МассивСкладов, НСтр("ru='Интерактивная выгрузка остатков';uk='Інтерактивна вивантаження залишків'"));
	КонецЦикла;
	
КонецПроцедуры
