
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачалоПериода = НачалоДня(ТекущаяДата());
	КонецПериода  = КонецДня(ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Функция ОкНаСервере()
	
	НачалоМаршрута = Маршрут*100;
	КонецМаршрута = (Маршрут+1)*100;
	
	СписокКонтр = Новый СписокЗначений;
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("34630835"));
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("38397793"));
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("D36224758"));
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("43242503"));
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("43648523"));
	СписокКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("43646133"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервированиеЗаказовПокупателя.Ссылка КАК Резерв,
		|	КорректировкаЗаказаПокупателя.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Вт_Общее
		|ИЗ
		|	Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
		|		ПО РезервированиеЗаказовПокупателя.ЗаказПокупателя = КорректировкаЗаказаПокупателя.ДокументОснование
		|ГДЕ
		|	РезервированиеЗаказовПокупателя.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РезервированиеЗаказовПокупателя.Ссылка.Проведен
		|	И РезервированиеЗаказовПокупателя.Ссылка.ТочкаДоставки.ПорядокСигаретный МЕЖДУ &НачалоМаршрута И &КонецМаршрута
		|	И РезервированиеЗаказовПокупателя.Ссылка.Контрагент В(&Контрагент)
		|	И РезервированиеЗаказовПокупателя.Ссылка.Организация В(&Организация)
		|	И НЕ РезервированиеЗаказовПокупателя.ЗаказПокупателя.ПометкаУдаления
		|	"+?(НЕ Склад.Количество()=0,"И РезервированиеЗаказовПокупателя.Ссылка.СкладКомпании В ИЕРАРХИИ(&СкладКомпании)","")+"
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервированиеЗаказовПокупателя.Ссылка,
		|	КорректировкаЗаказаПокупателя.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Общее.Резерв КАК Резерв
		|ИЗ
		|	Вт_Общее КАК Вт_Общее
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Общее.Резерв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Общее.Ссылка КАК Ссылка,
		|	Вт_Общее.Резерв КАК Резерв
		|ИЗ
		|	Вт_Общее КАК Вт_Общее
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Общее.Ссылка,
		|	Вт_Общее.Резерв";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоМаршрута",НачалоМаршрута);
	Запрос.УстановитьПараметр("КонецМаршрута", КонецМаршрута);
	Запрос.УстановитьПараметр("Контрагент", СписокКонтр);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СкладКомпании", Склад);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Если МассивРезультатов[1].Пустой() тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивДокументов    = Новый Массив;
	МассивКорректировок = Новый Массив;
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДокументов.Добавить(Выборка.Резерв);
	КонецЦикла;
	
	Выборка1 = МассивРезультатов[2].Выбрать();
	Пока Выборка1.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка1.Ссылка) Тогда 
			МассивКорректировок.Добавить(Выборка1.Резерв);	
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврат = Новый Структура("Документы, Сообщения", МассивДокументов, МассивКорректировок);
	
	Возврат СтруктураВозврат;
	
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	Массив = ОкНаСервере();
	Если Массив = Неопределено Тогда 
		Закрыть();
	Иначе
		Закрыть(Массив);
	КонецЕсли;
КонецПроцедуры
