
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы();
	Уровень1 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Область") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.ГородСпецСтатус");
	Уровень2 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.РайонОбласти");
	Уровень3 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Община");
	Уровень4 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Город") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Поселок") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.Село");
	Уровень5 = Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорияПоКАТОТТГ.РайонГорода");
	
	Элементы.Область.Видимость					= Уровень2 ИЛИ Уровень3 ИЛИ Уровень4 ИЛИ Уровень5;
	Элементы.РайонОбласти.Видимость				= Уровень3 ИЛИ Уровень4 ИЛИ Уровень5;
	Элементы.ТерриториальнаяОбщина.Видимость	= Уровень4 ИЛИ Уровень5;
	Элементы.НаселенныйПункт.Видимость			= Уровень5;
КонецПроцедуры
