
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


#КонецОбласти


Функция ПолучитьМассивТоваров(ГрафикТСД)Экспорт
	МассивТоваров = Новый Массив;
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГрафикТСД,"ВидГрафика,НоменклатураЭлементы,ХранилищеОтборов");	
	
	Если РеквизитыОбъекта.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ТБД Тогда
		Настройки = РеквизитыОбъекта.ХранилищеОтборов.Получить();
		
		СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");
		
		//КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		//КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		//КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		//
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		//МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
		
		ТаблицаРезультат = Новый ТаблицаЗначений; 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
		
		МассивТоваров = ТаблицаРезультат.ВыгрузитьКолонку("Номенклатура");

		
	ИначеЕсли РеквизитыОбъекта.НоменклатураЭлементы Тогда
		МассивТоваров = ГрафикТСД.ТоварныеЭлементы.ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	Возврат МассивТоваров;
КонецФункции




#КонецЕсли
