
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		ПолучитьНастройкиКомпоновщикаПоУмолчанию();
	КонецЕсли;
	
	УстановитьВидимостьНаСервере();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ВидГрафика","Доступность",Объект.Ссылка.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Переодичность","Доступность",Объект.Ссылка.Пустая());

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//Отборы
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	
	НастройкиОтборов = ТекущийОбъект.ХранилищеОтборов.Получить();
	ЗагрузитьНастройкиПоУмолчанию = НастройкиОтборов = Неопределено;
	
	
	Если Не ЗагрузитьНастройкиПоУмолчанию Тогда 
		Попытка
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтборов);
		Исключение
			ЗагрузитьНастройкиПоУмолчанию = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если ЗагрузитьНастройкиПоУмолчанию Тогда 
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);			
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеОтборов = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки(), Новый СжатиеДанных(9));

КонецПроцедуры


&НаКлиенте
Процедура ДниНеделиПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДниНедели(Результат,Переодичность)	Экспорт
	Объект.ДниНедели = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ДниНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Ложь);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Периодичность,ДниНедели", Ложь, СокрЛП(Элементы.ДниНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка=Ложь;
КонецПроцедуры



&НаКлиенте
Процедура ПереодичностьПриИзменении(Элемент)
	

	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату") Тогда
		Элементы.Дата.Видимость = Истина;
		Элементы.ДниНедели.Видимость = Ложь;
		Элементы.ДатаЧисло.Видимость = Ложь;
		
	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца") Тогда
		Элементы.Дата.Видимость = Ложь;
		Элементы.ДниНедели.Видимость = Ложь;
		Элементы.ДатаЧисло.Видимость = Истина;
		
	Иначе
		Элементы.Дата.Видимость = Ложь;
		Элементы.ДниНедели.Видимость = Истина;
		Элементы.ДатаЧисло.Видимость = Ложь;
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ПереодичностьПриИзмененииФрагмент()
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураЭлементыПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
	Объект.ТоварныеГруппы.Очистить();
	Объект.ТоварныеЭлементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаПриИзменении(Элемент)
	
	Если Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ТБД") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ГруппаТоварыЭлементы,ГруппаТоварныеГруппы,НоменклатураЭлементы","Видимость",Ложь);
	ИначеЕсли Объект.ВидГрафика	= ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков") Тогда

		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"НоменклатураЭлементы,ГруппаТоварныеГруппы,ГруппаОтборы","Видимость",Ложь)
		
	Иначе
		
		Если Объект.ВидГрафика = ПредопределенноеЗначение("Перечисление.ТК_ВидыЗадачТСД.ВерификацияЦенников") Тогда
			Объект.НоменклатураЭлементы = Ложь;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Ложь);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Истина);
		КонецЕсли;
			
		ГрафикНаДату  = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату"),Истина,Ложь);
		
		Элементы.Дата.Видимость = ГрафикНаДату;
		Элементы.ДниНедели.Видимость = НЕ ГрафикНаДату;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Ложь);
	

	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьНаСервере()
	//ГрафикНаДату  = ?(Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату"),Истина,Ложь);
	//
	//Элементы.Дата.Видимость = ГрафикНаДату;
	//Элементы.ДниНедели.Видимость = НЕ ГрафикНаДату;
	
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДату") Тогда
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Дата","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДниНедели,ДатаЧисло","Видимость",Ложь);

	ИначеЕсли Объект.Периодичность = ПредопределенноеЗначение("Перечисление.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца") Тогда		
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Дата,ДниНедели","Видимость",Ложь);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДатаЧисло","Видимость",Истина);

	Иначе
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДниНедели","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ДатаЧисло,Дата","Видимость",Ложь);

	КонецЕсли;

	
	
	Если Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ТБД Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Истина);
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"ГруппаТоварыЭлементы,ГруппаТоварныеГруппы,НоменклатураЭлементы","Видимость",Ложь);
	ИначеЕсли Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков Тогда
		
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"НоменклатураЭлементы,ГруппаТоварныеГруппы,ГруппаОтборы","Видимость",Ложь)

	Иначе
		Если Объект.ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ВерификацияЦенников Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"НоменклатураЭлементы","Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварыЭлементы","Видимость",Объект.НоменклатураЭлементы);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаТоварныеГруппы","Видимость",НЕ Объект.НоменклатураЭлементы);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаОтборы","Видимость",Ложь);
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиКомпоновщикаПоУмолчанию()
	
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");			
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
 
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);			

КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ВидГрафика","Доступность",Объект.Ссылка.Пустая());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Переодичность","Доступность",Объект.Ссылка.Пустая());

	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоОтбору(Команда)
	
	Если Модифицированность Тогда
		Сообщить("Сначало необходимо записать график");
		Возврат;
	КонецЕсли;
	
	Табдок = СвормироватьТабдокПоОтборуНаСервере();
	
КонецПроцедуры


&НаСервере
Функция  СвормироватьТабдокПоОтборуНаСервере()
	Табдок = Новый ТабличныйДокумент;
	МассивТоваров  = Справочники.ТК_ГрафикиТСД.ПолучитьМассивТоваров(Объект.Ссылка);
	Возврат Табдок;
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Отказ = ОбщегоНазначенияТК.ПроверитьЗаполнениеНастроекОтчета(КомпоновщикНастроек);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборТовара(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборНоменклатурыПослеЗакрытия", ЭтаФорма,"Подбор");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	ПараметрыФормы.Вставить("РежимВыбора", 		  Истина); 
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
	Если Объект.НоменклатураЭлементы  Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для Каждого СтрокаМассива Из ВыбранноеЗначение Цикл
		Если ЗначениеЗаполнено(СтрокаМассива) Тогда
			Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.ФормаВыбора" Тогда
				Объект.ТоварныеЭлементы.Добавить().Номенклатура = СтрокаМассива;
			Иначе				
				Объект.ТоварныеГруппы.Добавить().Номенклатура = СтрокаМассива;	
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры 


&НаКлиенте
Процедура Заполнить(Команда)
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзТекстовогоПоляПродолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВводСтроки(
		ОписаниеОповещения, 
		"", 
		НСтр("ru = 'Введите артикула товаров с новой строки или через запятую'; uk = 'Введіть артикули товарів з нової строки або через кому'"),
		0,
		Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТекстовогоПоляПродолжение(Текст, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Текст) Тогда 
		Возврат;
	КонецЕсли;

	ЗагрузитьИзТекстовогоПоляНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТекстовогоПоляНаСервере(Текст)
	
	НовТекст = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(",.-;", Текст, Символы.ПС);	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НовТекст, Символы.ПС);
	//СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Стр Из МассивСтрок Цикл 
		текСтр = СокрЛП(Стр);
		
		Если ПустаяСтрока(текСтр) Тогда 
			Продолжить;
		ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текСтр) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Неверный формат артикула ""%1""'; uk = 'Невірний формат артикулу ""%1""'"),
					текСтр));
		Иначе
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", текСтр);	
			Если Не Номенклатура.Пустая() Тогда 
				Объект.ТоварныеЭлементы.Добавить().Номенклатура = Номенклатура;
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не найдена номенклатура с артикулом ""%1""'; uk = 'Не знайдена номенклатура з артикулом ""%1""'"),
						текСтр));					
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

