

Функция УзелОбмена(Подразделение = Неопределено)Экспорт
	
	Возврат ОбменФронт.УзелОбмена(Подразделение); //ОбменФронт.УзелОбмена(Подразделение);
	
КонецФункции

Функция ПолучитьНастройкиПодключения(Подразделение)Экспорт
	
	Узел = ОбменФронт.УзелОбмена(Подразделение);
	 
	Если Узел = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	НастройкиПодключения = ПланыОбмена.ОбменФронт.СтруктураНастрокиПодключения();
	
	ПланыОбмена.ОбменФронт.ЗаполнитьНастройкиПодключения(НастройкиПодключения,Узел);
	Возврат НастройкиПодключения;
	
КонецФункции


Функция НайтиПоКоду(Код)Экспорт
	Возврат ПланыОбмена.ОбменФронт.НайтиПоКоду(Код);
КонецФункции


// Возвращает список узлов плана обмена
//
Функция МассивУзловДляРегистрации(Подразделение = Неопределено) Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	НЕ ОбменФронт.Ссылка = &ЭтотУзел
	|	И ОбменФронт.ПодразделениеКомпании В(&МассивПодразделений)";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменФронт.ЭтотУзел());
	Если Подразделение = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ОбменФронт.ПодразделениеКомпании В(&МассивПодразделений)","");
	Иначе
		Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений(Подразделение));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

// Возвращает список узлов плана обмена
//
Функция МассивУзловДляРегистрацииОстатки(Подразделение) Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	НЕ ОбменФронт.Ссылка = &ЭтотУзел
	|	И ОбменФронт.ВыгружатьОстатки
	|	И ОбменФронт.ПодразделениеКомпании В(&МассивПодразделений)";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменФронт.ЭтотУзел());
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений(Подразделение));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

Функция МассивУзловДляРегистрацииТекущихОстатков(Подразделение) Экспорт
	
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	НЕ ОбменФронт.Ссылка = &ЭтотУзел
	|	И ОбменФронт.ВыгружатьТекущиеОстатки
	|	И ОбменФронт.ПодразделениеКомпании В(&МассивПодразделений)";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменФронт.ЭтотУзел());
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений(Подразделение));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;

	
КонецФункции


Функция МассивУзловДляРегистрацииПеремещений(Подразделение) Экспорт
	
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	НЕ ОбменФронт.Ссылка = &ЭтотУзел
	|	И ОбменФронт.ВыгружатьПеремещения
	|	И ОбменФронт.ПодразделениеКомпании В(&МассивПодразделений)";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменФронт.ЭтотУзел());
	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений(Подразделение));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;

	
КонецФункции



// Возвращает список узлов плана обмена для регистрации документов Инвентаризация
//
Функция МассивУзловДляРегистрацииВыгрузикиИтоговИнвентаризации(Подразделение) Экспорт
	
	МассивУзлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	НЕ ОбменФронт.Ссылка = &ЭтотУзел
	|	И ОбменФронт.ВыгружатьИтогиИнвентаризации
	|	И ОбменФронт.ПодразделениеКомпании В(&ПодразделениеКомпании)";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменФронт.ЭтотУзел());
	Запрос.УстановитьПараметр("ПодразделениеКомпании", МассивПодразделений(Подразделение));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивУзлов.Добавить(Выборка.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции


Функция МассивНеАтивногоТовара() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0000333"));  //НЕ ИСПОЛЬЗУЕМЫЕ ТОВАРЫ
	Массив.Добавить(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("e6d71d93-d8d2-11e6-80d2-0050569272d9")));//Лаборатория
	Массив.Добавить(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("d632b39f-d8d2-11e6-80d2-0050569272d9")));//Тара и этикетка

	
	Возврат Массив;
	
КонецФункции


Функция СтранаУкраина() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	СтраныМира.Код = ""804""";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ВыдыСкладовДляВыгрузки()Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.ВидыСкладов.ТорговыйЗал);
	Массив.Добавить(Справочники.ВидыСкладов.ТорговыйПавильон);
	
	Возврат Массив;
	
КонецФункции

Функция ЭтоПодрзаделениеБафит(Подразделение) Экспорт
	Возврат Справочники.ПодразделенияКомпании.ЭтоБаффит(Подразделение);	
КонецФункции

Функция ЭтоПодразделениеАттика(Подразделение) Экспорт
	Возврат Справочники.ПодразделенияКомпании.ЭтоАттика(Подразделение);	
КонецФункции

Функция ЭтоПодразделениеФабрикаСыра(Подразделение) Экспорт 
	Возврат Справочники.ПодразделенияКомпании.ЭтоФабрикаСыра(Подразделение);
КонецФункции

Функция ЭтоПодразделениеФабрикаСпеций(Подразделение) Экспорт 
	Возврат Справочники.ПодразделенияКомпании.ЭтоФабрикаСпеций(Подразделение);
КонецФункции

Функция ЭтоТекущиеОстаткиТП(ТорговаяПлощадка)Экспорт
	Возврат Справочники.ТорговыеПлощадки.ЭтоТекущиеОстаткиТП(ТорговаяПлощадка);
КонецФункции

Функция МассивПодразделенийАттика()Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0b4-d29a-11e6-80d2-0050569272d9")));//Аттика
	Массив.Добавить(Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("41d2629d-0305-11eb-a2dc-0050568e6e8c")));//ТС Табак-Дигма
	Массив.Добавить(Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("d8eefaa0-4b51-11ee-bbc4-005056bc658e")));//ТС Кур-кума Полтава

	Возврат Массив;
	
КонецФункции

Функция МассивПодразделенийБафет()Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0ba-d29a-11e6-80d2-0050569272d9")));//ТС Buffet

	Возврат Массив;
	
КонецФункции

Функция МассивПодразделений(Подразделение)Экспорт
	
	Если Справочники.ПодразделенияКомпании.ЭтоАттика(Подразделение) Тогда
		Возврат МассивПодразделенийАттика();
		
	Иначе
		Массив = Новый Массив;
		Массив.Добавить(Подразделение);
		Возврат Массив;
	КонецЕсли;		
	
КонецФункции

