
&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	перем  Промоакция;
	параметры.Свойство("Промоакция",Промоакция);	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Промоакция",Промоакция);
	//	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Менеджер",Пользователи.АвторизованныйПользователь());
	////	ЭтотОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Получить(0).Настройки.Отбор.Элементы.Получить(0).ПравоеЗначение=Пользователи.АвторизованныйПользователь();
	//	настройки2 = отчет.КомпоновщикНастроек.Настройки;
	//	элОтбора = настройки2.Отбор.Элементы.Получить(0);
	//	элОтбора.ПравоеЗначение= Пользователи.АвторизованныйПользователь();
	//	отчет.КомпоновщикНастроек.ЗагрузитьНастройки(настройки2);
	Элементы.Результат.ИспользуемоеИмяФайла = Строка(Промоакция);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	параметры.СформироватьПриОткрытии=истина;
	Отчет.КоличествоКонкурентов = 5;
КонецПроцедуры
