

Функция СформироватьКорректировкуЗаказа(НаДату,ДнейОтсрочки,Ошибки="")	Экспорт 
	ВсеОК = Истина;
	СрокПоставки = НаДату-86400*ДнейОтсрочки;
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 	"ВЫБРАТЬ
	//|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	//|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	//|	ЗаказыПоставщикамОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	//|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	//|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	//|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	//|			ИНАЧЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки
	//|		КОНЕЦ <= &СрокПоставки
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗаказПоставщику
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	|	ЗаказыПоставщикамОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	|		ИНАЧЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки
	|	КОНЕЦ КАК СрокПоставки
	|ПОМЕСТИТЬ СрокиПоставки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрокиПоставки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СрокиПоставки.Контрагент КАК Контрагент,
	|	СрокиПоставки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	СрокиПоставки.Номенклатура КАК Номенклатура,
	|	СрокиПоставки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	СрокиПоставки.СрокПоставки КАК СрокПоставки
	|ИЗ
	|	СрокиПоставки КАК СрокиПоставки
	|ГДЕ
	|	СрокиПоставки.СрокПоставки <= &СрокПоставки";
	
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("СрокПоставки", СрокПоставки);
	//Запрос.УстановитьПараметр("Баффет", Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008"));	//	ТС Buffet
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	Выборка = Результат.Выбрать();
	
	нпп = 0;
	НуженДок = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЗаказПоставщику") Цикл 
		
		Если НуженДок Тогда
			дОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
			дОбъект.Дата = ТекущаяДата();	
			дОбъект.Ответственный = Пользователи.ТекущийПользователь();
			дОбъект.Комментарий = "Корректировка заказа поставщику"+Символы.ПС+"Сформирован автоматически "+дОбъект.Дата;
			СтрокаТЧ = дОбъект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя = "ЗаказыПоставщикам";
			
			Попытка
				дОбъект.Записать();
				НуженДок = Ложь;
				НаборЗаписей=РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение=дОбъект.Ссылка;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			нпп = нпп + 1;
			Движение=НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,Выборка);
			Движение.Регистратор = дОбъект.Ссылка;
			Движение.Период = дОбъект.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Заказано = -Выборка.ЗаказаноОстаток;
			Движение.ХозОперация = Справочники.ХозОперации.КорректировкаУчетныхДанных;
		КонецЦикла;
		
		Если нпп > 7777 Тогда
			нпп = 0;
			НуженДок = Истина;
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
			КонецПопытки;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если нпп > 0 Тогда
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоЗакрытиеЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
			ВсеОК = Ложь;
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат  ВсеОК;	
КонецФункции
