
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УзелОбмена = ПараметрКоманды;

		Состояние(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 Начата выгрузка остатков OS';uk='%1 Розпочато вивантаження залишків OS'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT"))
		,,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='по узлу обмена ""%1""...';uk='по вузлу обміну ""%1""...'"),
			УзелОбмена));
			
	ВыгрузитьОстаткиСервер(УзелОбмена);
		
	ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 ""%2""';uk='%1 ""%2""'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT"),
			УзелОбмена) 
		,,
		НСтр("ru='Выгрузка остатков OS завершена';uk='Вивантаження залишків OS завершена'"),
		БиблиотекаКартинок.Информация32);
		
КонецПроцедуры


&НаСервере
Функция ВыгрузитьОстаткиСервер(УзелОбмена)

	Если ПланыОбмена.ОбменФронт.ПолучитьЭтотУзелПланаОбмена(УзелОбмена) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если УзелОбмена.ПометкаУдаления Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбменФронтСобытия.ВыполнитьОбменОстатки(УзелОбмена, НСтр("ru='Интерактивный обмен остатки по складам';uk='Інтерактивний обмін залишки по складах'"));
	
	Возврат Истина;
	
КонецФункции
