


Функция НайтиСменуПоНомеру(НомерСмены)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_КассоваяСменаЗКС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТК_КассоваяСменаЗКС КАК ТК_КассоваяСменаЗКС
	|ГДЕ
	|	ТК_КассоваяСменаЗКС.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Смена =  ВыборкаДетальныеЗаписи.Ссылка;
	
	Возврат Смена;
	
КонецФункции
