///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//ПартииТоваров
Функция ПолучитьКлючФоновогоЗаданияУправленияПотоками(МассивДляОтбора);

	КлючФоновогоЗадания = Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПартий.Ключ;
	
	Если ТипЗнч(МассивДляОтбора) = Тип("Массив") Тогда
	
		КлючФоновогоЗадания = КлючФоновогоЗадания + " UID#";
		Для каждого ОбОтбора Из МассивДляОтбора Цикл
			КлючФоновогоЗадания = КлючФоновогоЗадания + " " + ОбОтбора.УникальныйИдентификатор();
		КонецЦикла; 
	
	КонецЕсли;
	
	Возврат КлючФоновогоЗадания;

КонецФункции // ПолучитьКлючФоновогоЗаданияУправленияПотоками()
//Взаиморасчеты
Функция ПолучитьКлючФоновогоЗаданияУправленияПотокамиВзаиморасчеты(МассивДляОтбора);

	КлючФоновогоЗадания = Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиВзаиморасчетов.Ключ;
	
	Если ТипЗнч(МассивДляОтбора) = Тип("Массив") Тогда
	
		КлючФоновогоЗадания = КлючФоновогоЗадания + " UID#";
		Для каждого ОбОтбора Из МассивДляОтбора Цикл
			КлючФоновогоЗадания = КлючФоновогоЗадания + " " + ОбОтбора.УникальныйИдентификатор();
		КонецЦикла; 
	
	КонецЕсли;
	
	Возврат КлючФоновогоЗадания;

КонецФункции // ПолучитьКлючФоновогоЗаданияУправленияПотоками()
//ПартииОрганизаций
Функция ПолучитьКлючФоновогоЗаданияУправленияПотокамиПартииОгранизаций(МассивДляОтбора);

	КлючФоновогоЗадания = "Управление потоками ""Партии Организаций""";
	
	Если ТипЗнч(МассивДляОтбора) = Тип("Массив") Тогда
	
		КлючФоновогоЗадания = КлючФоновогоЗадания + " UID#";
		Для каждого ОбОтбора Из МассивДляОтбора Цикл
			КлючФоновогоЗадания = КлючФоновогоЗадания + " " + ОбОтбора.УникальныйИдентификатор();
		КонецЦикла; 
	
	КонецЕсли;
	
	Возврат КлючФоновогоЗадания;

КонецФункции // ПолучитьКлючФоновогоЗаданияУправленияПотоками()

Функция КоличествоДокументовПотоке(Знач ВидПоследовательности = Неопределено ) Экспорт
	Если ВидПоследовательности = Неопределено Тогда
		ВидПоследовательности = Перечисления.ВидыПоследовательности.ПартииТоваров;
	КонецЕсли;
	
	Возврат ТК_НастройкиСерверПовтИсп.ДокументовВпотоке(ВидПоследовательности);

КонецФункции // КоличествоДокументовПотоке()

Функция КоличествоОдновременныхПотоков(БизнесВремя = Ложь,Знач ВидПоследовательности = Неопределено )
	
	Если ВидПоследовательности = Неопределено Тогда
		ВидПоследовательности = Перечисления.ВидыПоследовательности.ПартииТоваров;
	КонецЕсли;

	
	Возврат ТК_НастройкиСерверПовтИсп.ОдновременныхПотоков(ВидПоследовательности,БизнесВремя);
	
КонецФункции

//ПартииТоваров
Функция ПолучитьВыборкуДокументовПоСкладу(СкладКомпании, МоментВремени, КоличествоДокументовПотоке)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.Текст =   "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДокументовПотоке, "ЧГ=0") + "
	|	ПартииТоваров.Период КАК Период,
	|	ПартииТоваров.Регистратор КАК Регистратор,
	|	ПартииТоваров.Регистратор.ХозОперация КАК ХозОперация,
	|	ПартииТоваров.МоментВремени КАК МоментВремени,
	|	ПартииТоваров.ПроведенВХронологическойПоследовательности КАК ПроведенВХронологическойПоследовательности
	|ИЗ
	|	Последовательность.ПартииТоваров КАК ПартииТоваров
	|ГДЕ
	|	ПартииТоваров.СкладКомпании = &СкладКомпании
	|	И ПартииТоваров.МоментВремени >= &МоментВремени
	|	И ПартииТоваров.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";

	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

//Взаиморасчеты
Функция ПолучитьВыборкуДокументовПоДоговору(ДоговорВзаиморасчетов, МоментВремени,КоличествоДокументовПотоке)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.Текст =   "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДокументовПотоке, "ЧГ=0") + "
	|	Взаиморасчеты.Период КАК Период,
	|	Взаиморасчеты.Регистратор КАК Регистратор,
	|	Взаиморасчеты.Регистратор.ХозОперация КАК ХозОперация,
	|	Взаиморасчеты.МоментВремени КАК МоментВремени,
	|	Взаиморасчеты.ПроведенВХронологическойПоследовательности КАК ПроведенВХронологическойПоследовательности
	|ИЗ
	|	Последовательность.Взаиморасчеты КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И Взаиморасчеты.МоментВремени >= &МоментВремени
	//|	И Взаиморасчеты.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";

	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

//ПартииОрганизаций
Функция ПолучитьВыборкуДокументовПоОрганизации(Организация, МоментВремени,КоличествоДокументовПотоке)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.Текст =   "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДокументовПотоке, "ЧГ=0") + "
	|	Последовательность.Период КАК Период,
	|	Последовательность.Регистратор КАК Регистратор,
	|	Последовательность.Регистратор.ХозОперация КАК ХозОперация,
	|	Последовательность.МоментВремени КАК МоментВремени,
	|	Последовательность.ПроведенВХронологическойПоследовательности КАК ПроведенВХронологическойПоследовательности
	|ИЗ
	|	Последовательность.ПартииОрганизаций КАК Последовательность
	|ГДЕ
	|	Последовательность.Организация = &Организация
	|	И Последовательность.МоментВремени >= &МоментВремени
	//|	И Последовательность.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";

	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	
	Возврат Выборка;
	
КонецФункции



Процедура ПолучитьМассивПолучателейПеремещения(ДокументСсылка,МассивСкладовПолучателей)
	
	Если ДокументСсылка.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
		МассивСкладовПолучателей.Добавить(ДокументСсылка.СкладКомпанииПолучатель);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПолучитьМассивПолучателейВыпускПеремещение(ДокументСсылка,МассивСкладовПолучателей)
	
	Если ДокументСсылка.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВыпускПродукцииСПеремещением") Тогда
		МассивСкладовПолучателей.Добавить(ДокументСсылка.СкладКомпанииПолучатель);
	КонецЕсли;
	
	
КонецПроцедуры


Функция ПолучитьДвиженияДокумента(ИмяДокумента,ДокументСсылка)
	
	сВзаиморасчетыСПокупателями = Новый Структура;
	сВзаиморасчетыСПокупателями.Вставить("ВозвратОтПокупателя");
	сВзаиморасчетыСПокупателями.Вставить("ПоступлениеБезналичныхДенежныхСредств");
	сВзаиморасчетыСПокупателями.Вставить("ПриходныйКассовыйОрдер");
	сВзаиморасчетыСПокупателями.Вставить("РасходныйКассовыйОрдер");
	сВзаиморасчетыСПокупателями.Вставить("РеализацияТоваров");
	сВзаиморасчетыСПокупателями.Вставить("СписаниеБезналичныхДенежныхСредств");
	сВзаиморасчетыСПокупателями.Вставить("ТК_Взаимозачет");
	сВзаиморасчетыСПокупателями.Вставить("ТК_КорректировкаДолга");
	сВзаиморасчетыСПоставщиками = Новый Структура;
	сВзаиморасчетыСПоставщиками.Вставить("ВозвратПоставщику");
	сВзаиморасчетыСПоставщиками.Вставить("ПоступлениеБезналичныхДенежныхСредств");
	сВзаиморасчетыСПоставщиками.Вставить("ПоступлениеТоваров");
	сВзаиморасчетыСПоставщиками.Вставить("ПриходныйКассовыйОрдер");
	сВзаиморасчетыСПоставщиками.Вставить("РасходныйКассовыйОрдер");
	сВзаиморасчетыСПоставщиками.Вставить("СписаниеБезналичныхДенежныхСредств");
	сВзаиморасчетыСПоставщиками.Вставить("ТК_Взаимозачет");
	сВзаиморасчетыСПоставщиками.Вставить("ТК_КорректировкаДолга");

	ДвиженияДокумента  = Новый  Структура;
	Если сВзаиморасчетыСПокупателями.Свойство(ИмяДокумента) Тогда
		НаборЗаписейРасчетыСПокупателямиПоДокументам =  РегистрыНакопления.РасчетыСПокупателямиПоДокументам.СоздатьНаборЗаписей();
		НаборЗаписейРасчетыСПокупателямиПоДокументам.Отбор.Регистратор.Значение = ДокументСсылка;
		ДвиженияДокумента.Вставить("РасчетыСПокупателямиПоДокументам", НаборЗаписейРасчетыСПокупателямиПоДокументам);
		
		НаборЗаписейРасчетыСПокупателями =  РегистрыНакопления.РасчетыСПокупателями.СоздатьНаборЗаписей();
		НаборЗаписейРасчетыСПокупателями.Отбор.Регистратор.Значение = ДокументСсылка;
		ДвиженияДокумента.Вставить("РасчетыСПокупателями", НаборЗаписейРасчетыСПокупателями);
	КонецЕсли;
	
	Если сВзаиморасчетыСПоставщиками.Свойство(ИмяДокумента) Тогда
		НаборЗаписейРасчетыСПоставщикамиПоДокументам =  РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.СоздатьНаборЗаписей();
		НаборЗаписейРасчетыСПоставщикамиПоДокументам.Отбор.Регистратор.Значение = ДокументСсылка;
		ДвиженияДокумента.Вставить("РасчетыСПоставщикамиПоДокументам", НаборЗаписейРасчетыСПоставщикамиПоДокументам);
		
		НаборЗаписейРасчетыСПоставщиками =  РегистрыНакопления.РасчетыСПоставщиками.СоздатьНаборЗаписей();
		НаборЗаписейРасчетыСПоставщиками.Отбор.Регистратор.Значение = ДокументСсылка;
		ДвиженияДокумента.Вставить("РасчетыСПоставщиками", НаборЗаписейРасчетыСПоставщиками);
	КонецЕсли;

	  Возврат ДвиженияДокумента;
	
КонецФункции




	
///////////////////////////////////////////////////////////////////////////////
// ПЕРЕОПРЕДЕЛЕНИЕ МОДУЛЯ МЕНЕДЖЕРА "РегистрыСведений.РезультатыВыполненияОбработок"

Процедура ДобавитьКомментарий(Комментарий, СтруктураЗаписи, Статус = Неопределено)

	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Комментарий, СтруктураЗаписи, Статус);

КонецПроцедуры

Процедура ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Успешный)

	 РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Успешный);

 КонецПроцедуры 
 
Процедура СообщитьОбОшибке(СообщениеОбОшибке, СтруктураЗаписи, СтатусСообщенияОбОшибке = Неопределено)
	
	РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(СообщениеОбОшибке, СтруктураЗаписи, СтатусСообщенияОбОшибке);
	
КонецПроцедуры 





Функция ПолучитьВремяВыполнения(ДатаСтарта)
	
	Возврат РегистрыСведений.РезультатыВыполненияОбработок.ПолучитьВремяВыполнения(ДатаСтарта);
	
КонецФункции




////////////////////////////
//Процедуры и функции регл. задания востановления
//ПартииТоваров
//Взаиморасчеты
//ПартииОрганизаций
Процедура ЗапуститьФоновоеВосстановлениеПартий(МассивСкладов=Неопределено) Экспорт
	
	УстановленОтборПоСкладам = ТипЗнч(МассивСкладов) = Тип("Массив");
	
	Если УстановленОтборПоСкладам Тогда
		КоличествоОдновременныхПотоков = МассивСкладов.Количество();
	Иначе
		ТекущийЧас = Час(ТекущаяДата());
		Если 21 <= ТекущийЧас ИЛИ ТекущийЧас < 6 Тогда 
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков();
		Иначе
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков(Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "ВосстановлениеПоследовательностиПартий";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = ПолучитьКлючФоновогоЗаданияУправленияПотоками(МассивСкладов);
	
	ДобавитьКомментарий(ИмяКомпьютера(), СтруктруаЗаписиРезультатаВыполнения);
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке();

		
	ДобавитьКомментарий("Количество документов в потоке = " + Формат(КоличествоДокументовПотоке, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	ДобавитьКомментарий("Количество одновременных потоков = " + Формат(КоличествоОдновременныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	
	
	Если НЕ ЗначениеЗаполнено(КоличествоДокументовПотоке) ИЛИ НЕ ЗначениеЗаполнено(КоличествоОдновременныхПотоков) Тогда
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		Возврат;
	КонецЕсли;
	

	
	
	
	МассивСкладовАктивныхЗаданий  =  Обработки.ВосстановлениеПоследовательности.ПолучитьМассивСкладовАктивныхЗаданий();
	Если УстановленОтборПоСкладам Тогда
		МассивСкладовАктивныхЗаданий = ОбщегоНазначенияТК.ВнутреннееСоединениеМассивов(МассивСкладовАктивныхЗаданий, МассивСкладов);
	КонецЕсли;

		
	КоличествоАктивныхПотоков = МассивСкладовАктивныхЗаданий.Количество();
	
	КоличествоДополнительныхПотоков = Мин(КоличествоОдновременныхПотоков - КоличествоАктивныхПотоков, 15);

	ДобавитьКомментарий("Количество активных потоков = " + Формат(КоличествоАктивныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);

	
	
	Если КоличествоДополнительныхПотоков <= 0 Тогда
		ДобавитьКомментарий("Данных для запуска нет.", СтруктруаЗаписиРезультатаВыполнения);
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		
		Возврат;
	КонецЕсли;

	ДатаСтарта = ТекущаяДатаСеанса();	
	РезультатЗапроса = ПолучитьТаблицуПараметровЗапускаСледующихПотоков(КоличествоДополнительныхПотоков
	,МассивСкладовАктивныхЗаданий
	,МассивСкладов);
	
	ВыборкаПараметровСледующийПотоков = РезультатЗапроса.Выбрать();
	
		
	ДобавитьКомментарий("Запрос по необходимости запуска дополнительных потоков. " + ПолучитьВремяВыполнения(ДатаСтарта), СтруктруаЗаписиРезультатаВыполнения);
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	
	ДобавитьКомментарий("Количество дополнительных потоков = " + Формат(КоличествоДополнительныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);
	ДобавитьКомментарий("Количество требующих восстановления = " + Формат(ВыборкаПараметровСледующийПотоков.Количество(), "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

	
	
	
	Пока ВыборкаПараметровСледующийПотоков.Следующий() Цикл 
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.СкладКомпании);
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.МоментВремени);
		ПараметрыЗадания.Добавить(КоличествоДокументовПотоке);
		ПараметрыЗадания.Добавить(Ложь); // ДобавитьНовыеПотокиПослеЗавершения
		ПараметрыЗадания.Добавить(МассивСкладов); // МассивСкладовДляОтбора
		
		НаименованиеЗадания = "Восстановление партий";
		КлючЗадания         = Справочники.СкладыКомпании.ПолучитьКлючФоновогоЗаданияПоСкладу(ВыборкаПараметровСледующийПотоков.СкладКомпании);

		ДобавитьКомментарий("ЗАПУСКАЕМ: " + Строка(ВыборкаПараметровСледующийПотоков.СкладКомпании) + ", " + ВыборкаПараметровСледующийПотоков.МоментВремени, СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

		
		Попытка 
			ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ВыполнитьВосстановлениеПартий",ПараметрыЗадания,КлючЗадания,НаименованиеЗадания);
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.ОченьВажное);
		КонецПопытки;
		
	КонецЦикла;
	
	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	
	
КонецПроцедуры

Процедура ЗапуститьФоновоеВосстановлениеВзаиморасчеты(МассивОтбора = Неопределено)Экспорт
	
		
	УстановленОтбор= ТипЗнч(МассивОтбора) = Тип("Массив");
	
	Если УстановленОтбор Тогда
		КоличествоОдновременныхПотоков = МассивОтбора.Количество();
	Иначе
		ТекущийЧас = Час(ТекущаяДата());
		Если 21 <= ТекущийЧас ИЛИ ТекущийЧас < 6 Тогда 
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков(,Перечисления.ВидыПоследовательности.Взаиморасчеты);
		Иначе
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков(Истина,Перечисления.ВидыПоследовательности.Взаиморасчеты);
		КонецЕсли;
		
	КонецЕсли;
	
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "ВосстановлениеПоследовательностиВзаиморасчеты";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = ПолучитьКлючФоновогоЗаданияУправленияПотокамиВзаиморасчеты(МассивОтбора);
	
	ДобавитьКомментарий(ИмяКомпьютера(), СтруктруаЗаписиРезультатаВыполнения);
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке(Перечисления.ВидыПоследовательности.Взаиморасчеты);
	
	
	ДобавитьКомментарий("Количество документов в потоке = " + Формат(КоличествоДокументовПотоке, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	ДобавитьКомментарий("Количество одновременных потоков = " + Формат(КоличествоОдновременныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	
	
	Если НЕ ЗначениеЗаполнено(КоличествоДокументовПотоке) ИЛИ НЕ ЗначениеЗаполнено(КоличествоОдновременныхПотоков) Тогда
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		Возврат;
	КонецЕсли;
	

	
	

	МассивАктивныхЗаданий  =  Обработки.ВосстановлениеПоследовательности.ПолучитьМассивДоговоровАктивныхЗаданий();
	Если УстановленОтбор Тогда
		МассивАктивныхЗаданий = ОбщегоНазначенияТК.ВнутреннееСоединениеМассивов(МассивАктивныхЗаданий, МассивОтбора);
	КонецЕсли;

		
	КоличествоАктивныхПотоков = МассивАктивныхЗаданий.Количество();
	
	КоличествоДополнительныхПотоков = Мин(КоличествоОдновременныхПотоков - КоличествоАктивныхПотоков, 15);

	ДобавитьКомментарий("Количество активных потоков = " + Формат(КоличествоАктивныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);

	
	
	Если КоличествоДополнительныхПотоков <= 0 Тогда
		ДобавитьКомментарий("Данных для запуска нет.", СтруктруаЗаписиРезультатаВыполнения);
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		
		Возврат;
	КонецЕсли;

	ДатаСтарта = ТекущаяДатаСеанса();	
	РезультатЗапроса = ПолучитьТаблицуПараметровЗапускаСледующихПотоковДоговора(КоличествоДополнительныхПотоков, МассивАктивныхЗаданий, МассивОтбора);
	
	ВыборкаПараметровСледующийПотоков = РезультатЗапроса.Выбрать();
	
		
	ДобавитьКомментарий("Запрос по необходимости запуска дополнительных потоков. " + ПолучитьВремяВыполнения(ДатаСтарта), СтруктруаЗаписиРезультатаВыполнения);
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	
	ДобавитьКомментарий("Количество дополнительных потоков = " + Формат(КоличествоДополнительныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);
	ДобавитьКомментарий("Количество требующих восстановления = " + Формат(ВыборкаПараметровСледующийПотоков.Количество(), "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

	
	Пока ВыборкаПараметровСледующийПотоков.Следующий() Цикл 
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.ДоговорКонтрагента);
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.МоментВремени);
		ПараметрыЗадания.Добавить(КоличествоДокументовПотоке);
		ПараметрыЗадания.Добавить(Ложь); // ДобавитьНовыеПотокиПослеЗавершения
		ПараметрыЗадания.Добавить(МассивОтбора); // 
		
		НаименованиеЗадания = "Восстановление Взаиморасчеты";
		КлючЗадания         = Справочники.ДоговорыКонтрагентов.ПолучитьКлючФоновогоЗаданияПоДоговора(ВыборкаПараметровСледующийПотоков.ДоговорКонтрагента);

		ДобавитьКомментарий("ЗАПУСКАЕМ: " + Строка(ВыборкаПараметровСледующийПотоков.ДоговорКонтрагента) + ", " + ВыборкаПараметровСледующийПотоков.МоментВремени, СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

		
		Попытка 
			ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ВыполнитьВосстановлениеВзаиморасчеты",ПараметрыЗадания,КлючЗадания,НаименованиеЗадания);
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.ОченьВажное);
		КонецПопытки;
		
	КонецЦикла;
	
	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	

	
КонецПроцедуры

Процедура ЗапуститьФоновоеВосстановлениеПартииОрганизаций(МассивОтбора = Неопределено)Экспорт
	
		
	УстановленОтбор= ТипЗнч(МассивОтбора) = Тип("Массив");
	
	Если УстановленОтбор Тогда
		КоличествоОдновременныхПотоков = МассивОтбора.Количество();
	Иначе
		ТекущийЧас = Час(ТекущаяДата());
		Если 21 <= ТекущийЧас ИЛИ ТекущийЧас < 6 Тогда 
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков(,Перечисления.ВидыПоследовательности.ПартииОрганизаций);
		Иначе
			КоличествоОдновременныхПотоков = КоличествоОдновременныхПотоков(Истина,Перечисления.ВидыПоследовательности.ПартииОрганизаций);
		КонецЕсли;
		
	КонецЕсли;
	
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "ВосстановлениеПоследовательностиПартииОрганизаций";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = ПолучитьКлючФоновогоЗаданияУправленияПотокамиПартииОгранизаций(МассивОтбора);
	
	ДобавитьКомментарий(ИмяКомпьютера(), СтруктруаЗаписиРезультатаВыполнения);
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке(Перечисления.ВидыПоследовательности.ПартииОрганизаций);
	
	
	ДобавитьКомментарий("Количество документов в потоке = " + Формат(КоличествоДокументовПотоке, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	ДобавитьКомментарий("Количество одновременных потоков = " + Формат(КоличествоОдновременныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);
	
	
	Если НЕ ЗначениеЗаполнено(КоличествоДокументовПотоке) ИЛИ НЕ ЗначениеЗаполнено(КоличествоОдновременныхПотоков) Тогда
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		Возврат;
	КонецЕсли;
	
	 //

	МассивАктивныхЗаданий  =  Обработки.ВосстановлениеПоследовательности.ПолучитьМассивОрганизацийАктивныхЗаданий();
	Если УстановленОтбор Тогда
		МассивАктивныхЗаданий = ОбщегоНазначенияТК.ВнутреннееСоединениеМассивов(МассивАктивныхЗаданий, МассивОтбора);
	КонецЕсли;

		
	КоличествоАктивныхПотоков = МассивАктивныхЗаданий.Количество();
	
	КоличествоДополнительныхПотоков = Мин(КоличествоОдновременныхПотоков - КоличествоАктивныхПотоков, 15);

	ДобавитьКомментарий("Количество активных потоков = " + Формат(КоличествоАктивныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения);	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);

	
	
	Если КоличествоДополнительныхПотоков <= 0 Тогда
		ДобавитьКомментарий("Данных для запуска нет.", СтруктруаЗаписиРезультатаВыполнения);
		ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		
		Возврат;
	КонецЕсли;

	ДатаСтарта = ТекущаяДатаСеанса();	
	РезультатЗапроса = ПолучитьТаблицуПараметровЗапускаСледующихПотоковОрганизации(КоличествоДополнительныхПотоков, МассивАктивныхЗаданий, МассивОтбора);
	
	ВыборкаПараметровСледующийПотоков = РезультатЗапроса.Выбрать();
	
		
	ДобавитьКомментарий("Запрос по необходимости запуска дополнительных потоков. " + ПолучитьВремяВыполнения(ДатаСтарта), СтруктруаЗаписиРезультатаВыполнения);
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	
	ДобавитьКомментарий("Количество дополнительных потоков = " + Формат(КоличествоДополнительныхПотоков, "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);
	ДобавитьКомментарий("Количество требующих восстановления = " + Формат(ВыборкаПараметровСледующийПотоков.Количество(), "ЧН=0; ЧГ=0"), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

	
	Пока ВыборкаПараметровСледующийПотоков.Следующий() Цикл 
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.Организация);
		ПараметрыЗадания.Добавить(ВыборкаПараметровСледующийПотоков.МоментВремени);
		ПараметрыЗадания.Добавить(КоличествоДокументовПотоке);
		ПараметрыЗадания.Добавить(Ложь); // ДобавитьНовыеПотокиПослеЗавершения
		ПараметрыЗадания.Добавить(МассивОтбора); // 
		
		НаименованиеЗадания = "Восстановление партии организаций";
		КлючЗадания         = Справочники.Организации.ПолучитьКлючФоновогоЗаданияПоОрганизации(ВыборкаПараметровСледующийПотоков.Организация);

		ДобавитьКомментарий("ЗАПУСКАЕМ: " + Строка(ВыборкаПараметровСледующийПотоков.Организация) + ", " + ВыборкаПараметровСледующийПотоков.МоментВремени, СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.Информация);

		
		Попытка 
			ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ВыполнитьВосстановлениеПоследовательностиПартийПоОрганизации",ПараметрыЗадания,КлючЗадания,НаименованиеЗадания);
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(), СтруктруаЗаписиРезультатаВыполнения, СтатусСообщения.ОченьВажное);
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
	
КонецПроцедуры





Процедура ДобавитьНовыеПотокиВосстановленияПоследовательности(МассивСкладовДляОтбора) Экспорт

	УстановленОтборПоСкладам = ТипЗнч(МассивСкладовДляОтбора) = Тип("Массив");
	Если НЕ УстановленОтборПоСкладам Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПартий);
		Если НЕ ФоновыеЗаданияТК.ЗапускРегламентногоЗаданияРазрешен(РегламентноеЗадание) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	                       
	ИмяМетодаЗадания    = "ФоновыеЗаданияТК.ЗапуститьФоновоеВосстановлениеПартий";
	НаименованиеЗадания = "Восстановление последовательности партий";
	КлючЗадания         = ПолучитьКлючФоновогоЗаданияУправленияПотоками(МассивСкладовДляОтбора);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", 	СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", 	ИмяМетодаЗадания);
	СтруктураОтбора.Вставить("Ключ", 		КлючЗадания);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(МассивСкладовДляОтбора);
		ФоновыеЗадания.Выполнить(ИмяМетодаЗадания, ПараметрыЗадания, КлючЗадания, НаименованиеЗадания);
		
	КонецЕсли;

КонецПроцедуры // ДобавитьНовыеПотокиВосстановленияПоследовательности()

Процедура ДобавитьНовыеПотокиВосстановленияПоследовательностиПоДоговорам(МассивОтбора) Экспорт

	УстановленОтбор = ТипЗнч(МассивОтбора) = Тип("Массив");
	Если НЕ УстановленОтбор Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиВзаиморасчетов);
		Если НЕ ФоновыеЗаданияТК.ЗапускРегламентногоЗаданияРазрешен(РегламентноеЗадание) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	                       
	ИмяМетодаЗадания    = "ФоновыеЗаданияТК.ЗапуститьФоновоеВосстановлениеВзаиморасчеты";
	НаименованиеЗадания = "Восстановление Взаиморасчеты";
	КлючЗадания         = ПолучитьКлючФоновогоЗаданияУправленияПотокамиВзаиморасчеты(МассивОтбора);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", 	СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", 	ИмяМетодаЗадания);
	СтруктураОтбора.Вставить("Ключ", 		КлючЗадания);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(МассивОтбора);
		ФоновыеЗадания.Выполнить(ИмяМетодаЗадания, ПараметрыЗадания, КлючЗадания, НаименованиеЗадания);
		
	КонецЕсли;

КонецПроцедуры // ДобавитьНовыеПотокиВосстановленияПоследовательности()

Процедура ДобавитьНовыеПотокиВосстановленияПоследовательностиПоОрганизации(МассивОтбора) Экспорт

	УстановленОтбор = ТипЗнч(МассивОтбора) = Тип("Массив");
	Если НЕ УстановленОтбор Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПартийОрганизаций);
		Если НЕ ФоновыеЗаданияТК.ЗапускРегламентногоЗаданияРазрешен(РегламентноеЗадание) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	                       
	ИмяМетодаЗадания    = "ФоновыеЗаданияТК.ЗапуститьФоновоеВосстановлениеПартииОрганизаций";
	НаименованиеЗадания = "Восстановление партии организаций";
	КлючЗадания         = ПолучитьКлючФоновогоЗаданияУправленияПотокамиПартииОгранизаций(МассивОтбора);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", 	СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", 	ИмяМетодаЗадания);
	СтруктураОтбора.Вставить("Ключ", 		КлючЗадания);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(МассивОтбора);
		ФоновыеЗадания.Выполнить(ИмяМетодаЗадания, ПараметрыЗадания, КлючЗадания, НаименованиеЗадания);
		
	КонецЕсли;

КонецПроцедуры // ДобавитьНовыеПотокиВосстановленияПоследовательности()





Процедура ВыполнитьВосстановлениеПоследовательностиПартийПоСкладу(Склад, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивСкладовДляОтбора) Экспорт 
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке + 1;
	ВыборкаДокументов = ПолучитьВыборкуДокументовПоСкладу(Склад, МоментВремени, КоличествоДокументовПотоке);
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	Если ТаблицаДокументовКоличество <> 0 Тогда
		ОбработаноБезПрерывания = ОбработатьВыборкуДокументов(Склад, ВыборкаДокументов,КоличествоДокументовПотоке);
	Иначе
		ОбработаноБезПрерывания = Истина;
	КонецЕсли;
	
	//
	Если ОбработаноБезПрерывания И ТаблицаДокументовКоличество <= 1 И КоличествоДокументовПотоке > 0 Тогда
		НовыйМомент = Новый МоментВремени(ТекущаяДата());
		Отбор = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",Склад,ложь);
		Если Последовательности.ПартииТоваров.Проверить(НовыйМомент,Отбор)Тогда
			Последовательности.ПартииТоваров.УстановитьГраницу(НовыйМомент,Отбор);
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьНовыеПотокиПослеЗавершения Тогда
		ДобавитьНовыеПотокиВосстановленияПоследовательности(МассивСкладовДляОтбора);
	КонецЕсли;

	
КонецПроцедуры

Процедура ВыполнитьВосстановлениеПоследовательностиВзаиморасчетовПоДоговору(ДоговорКонтрагента, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивОтбора) Экспорт 
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке + 1;
	ВыборкаДокументов = ПолучитьВыборкуДокументовПоДоговору(ДоговорКонтрагента, МоментВремени, КоличествоДокументовПотоке);
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	Если ТаблицаДокументовКоличество <> 0 Тогда
		ОбработаноБезПрерывания = ОбработатьВыборкуДокументовПоВзаиморасчетам(ДоговорКонтрагента, ВыборкаДокументов,КоличествоДокументовПотоке);
	Иначе
		ОбработаноБезПрерывания = Истина;
	КонецЕсли;
	
	//
	Если ОбработаноБезПрерывания И ТаблицаДокументовКоличество <= 1 И КоличествоДокументовПотоке > 0 Тогда
		НовыйМомент = Новый МоментВремени(ТекущаяДата());
		Отбор = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",ДоговорКонтрагента,ложь);
		Если Последовательности.Взаиморасчеты.Проверить(НовыйМомент,Отбор)Тогда
			Последовательности.Взаиморасчеты.УстановитьГраницу(НовыйМомент,Отбор);
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьНовыеПотокиПослеЗавершения Тогда
		ДобавитьНовыеПотокиВосстановленияПоследовательностиПоДоговорам(МассивОтбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьВосстановлениеПоследовательностиПартийПоОрганизации(Организация, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивОтбора) Экспорт 
	
	КоличествоДокументовПотоке = КоличествоДокументовПотоке + 1;
	ВыборкаДокументов = ПолучитьВыборкуДокументовПоОрганизации(Организация, МоментВремени, КоличествоДокументовПотоке);
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	Если ТаблицаДокументовКоличество <> 0 Тогда
		ОбработаноБезПрерывания = ОбработатьВыборкуДокументовПоПартиямОрганизаций(Организация, ВыборкаДокументов,КоличествоДокументовПотоке);
	Иначе
		ОбработаноБезПрерывания = Истина;
	КонецЕсли;
	
	//
	Если ОбработаноБезПрерывания И ТаблицаДокументовКоличество <= 1 И КоличествоДокументовПотоке > 0 Тогда
		НовыйМомент = Новый МоментВремени(ТекущаяДата());
		Отбор = Новый Структура("Организация,ПроведенВХронологическойПоследовательности",Организация,ложь);
		Если Последовательности.ПартииОрганизаций.Проверить(НовыйМомент,Отбор)Тогда
			Последовательности.ПартииОрганизаций.УстановитьГраницу(НовыйМомент,Отбор);
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьНовыеПотокиПослеЗавершения Тогда
		ДобавитьНовыеПотокиВосстановленияПоследовательностиПоОрганизации(МассивОтбора);
	КонецЕсли;
	
КонецПроцедуры





Функция ОбработатьВыборкуДокументов(Склад, ВыборкаДокументов, КоличествоДокументовВПотоке)
	
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	СтрурктураОтбораСклад = Новый Структура("СкладКомпании,ПроведенВХронологическойПоследовательности",Склад,Ложь);
	
	Пока ВыборкаДокументов.Следующий() Цикл 
			
		ДокументСсылка = ВыборкаДокументов.Регистратор;
		ДокументИмя = ДокументСсылка.Метаданные().Имя;	
		ТипДокумента = ТипЗнч(ДокументСсылка);
		
		ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();

		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ."+ДокументИмя);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если НЕ ДокументСсылка.Проведен Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		
		Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			
			Если Последовательности.ПартииТоваров.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад) Тогда	
				УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательности("ПартииТоваров"
				,ДокументСсылка
				,Склад
				,Новый Массив);
				
				Последовательности.ПартииТоваров.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад);
				ЗафиксироватьТранзакцию();
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваров") И ВыборкаДокументов.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			
			Если Последовательности.ПартииТоваров.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад) Тогда	
				УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательности("ПартииТоваров"
				,ДокументСсылка
				,Склад
				,Новый Массив);
				
				Последовательности.ПартииТоваров.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад);
				ЗафиксироватьТранзакцию();
			
				Отказ = Ложь;
				ТК_ОбменCentrСобытия.ТК_Обмен_КонсолидацияРегистрацияИзменений(ДокументСсылка, Отказ);

				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		
		
		Если ТипДокумента = Тип("ДокументСсылка.Инвентаризация") тогда
			
						
			НуженПересчет =  Документы.Инвентаризация.НуженПересчетОстатков(ДокументСсылка);
			
			Если НуженПересчет Тогда
				ПараметрыПересчета = Новый Структура;
				ПараметрыПересчета.Вставить("СкладКомпании", Склад);	
				ПараметрыПересчета.Вставить("Команда", "ПересчитатьКоличествоКнижн");
				ПараметрыПересчета.Вставить("Момент", ДокументСсылка.МоментВремени());
				
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			    Документы.Инвентаризация.ЗаполнитьТоварыПоОстаткамНаСкладе(ДокументОбъект.Товары,ПараметрыПересчета);
				
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательности("ПартииТоваров"
					,ДокументСсылка
					,Склад
					, Новый Массив);
					
					Последовательности.ПартииТоваров.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад);
					
					ЗафиксироватьТранзакцию();

					Отказ = Ложь;
					ТК_ОбменCentrСобытия.ТК_Обмен_КонсолидацияРегистрацияИзменений(ДокументСсылка, Отказ);

					ОценкаПроизводительности.ЗакончитьЗамерВремени("Партии "+ДокументИмя,ВремяНачалаЗамера,,Строка(ДокументСсылка));
					Продолжить;
				Исключение
					
					ВызватьИсключение "ОтразаитьПартииТоваровКомпании "+Строка(ДокументСсылка)+Символы.ПС+ОписаниеОшибки();
					
				КонецПопытки;
				
			КонецЕсли;
			
			
		КонецЕсли;
		
			
		
		
		
		
		ДополнительныеСвойства = Новый Структура;
		ДополнительныеСвойства.Вставить("ПроведениеПоПартиям");	
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
		ДополнительныеСвойства.Вставить("ЭтоНовый",Ложь);

		
				
		Движения = Новый Структура;
		
		НаборЗаписей =  РегистрыНакопления.ПартииТоваровКомпании.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = ДокументСсылка;
		
		Движения.Вставить("ПартииТоваровКомпании", Новый Структура("ПартииТоваровКомпании,Записать",НаборЗаписей,Истина));

	                                  
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения);
		Документы[ДокументИмя].ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
		
		Если ДополнительныеСвойства.Свойство("ДвиженияПартииТоваровИзменение")Тогда
			Движения.ПартииТоваровКомпании.Записать = ДополнительныеСвойства.ДвиженияПартииТоваровИзменение;
		Конецесли;
		
		Попытка
			ЗапасыСервер.ОтразаитьПартииТоваровКомпании(ДополнительныеСвойства, Движения.ПартииТоваровКомпании, Ложь);
		Исключение
			ВызватьИсключение "ОтразаитьПартииТоваровКомпании "+Строка(ДокументСсылка);
		КонецПопытки;
		
		
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПродажиТоваровКомпании") Тогда
			
			
			НаборЗаписей =  РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Значение = ДокументСсылка;
			Движения.Вставить("Продажи", Новый Структура("Продажи,Записать",НаборЗаписей,Истина));
			
			ЗапасыСервер.ОтразаитьПродажиТоваровКомпании(ДополнительныеСвойства, Движения.Продажи, Ложь);
			
		КонецЕсли;	
		
		Если  ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПриходованиеТоваров") Тогда
			
			НаборЗаписей =  РегистрыНакопления.ПриходованиеТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Значение = ДокументСсылка;
			Движения.Вставить("ПриходованиеТоваров", Новый Структура("ПриходованиеТоваров,Записать",НаборЗаписей,Истина));
			
			ЗапасыСервер.ОтразаитьПриходованиеТоваров(ДополнительныеСвойства, Движения.ПриходованиеТоваров, Ложь);
			
			
		КонецЕсли;
		
		Если  ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаОстаткиТоваровТМП") Тогда
			
			НаборЗаписей =  РегистрыНакопления.ОстаткиТоваровТМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Значение = ДокументСсылка;
			Движения.Вставить("ОстаткиТоваровТМП", Новый Структура("ОстаткиТоваровТМП,Записать",НаборЗаписей,Истина));
			
			ЗапасыСервер.ОтразаитьТоварыТМП(ДополнительныеСвойства, Движения.ОстаткиТоваровТМП, Ложь);
			
			
		КонецЕсли;

		
		
		Для Каждого Набор Из Движения Цикл 
			Если Набор.Значение.Записать Тогда
				Набор.Значение[Набор.Ключ].Записать();
			КонецЕсли;
		КонецЦикла;
		
		
		
		МассивСкладовПолучателей = Новый Массив;
		
		Если ТипДокумента = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ПолучитьМассивПолучателейПеремещения(ДокументСсылка,МассивСкладовПолучателей);
			
			///Необходимо проверить документ прихода, если он уже проведен в последовательности, сбросим ее.
			Если ДополнительныеСвойства.ДляПроведения.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал") Тогда
				УправлениеПоследовательностями.ПроверитьУстановитьПоследовательностьВходящегоДокумента("ПартииТоваров",ДокументСсылка,ДополнительныеСвойства);
			КонецЕсли;
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыпускПродукции") Тогда
			ПолучитьМассивПолучателейВыпускПеремещение(ДокументСсылка,МассивСкладовПолучателей);
		КонецЕсли;
		

		
		
		
		МожноПродолжатьВосстановление = Истина;
		Если ТаблицаДокументовКоличество = 1 И  ВыборкаДокументов.ПроведенВХронологическойПоследовательности Тогда
			НаНовыйМомент = Новый МоментВремени(ВыборкаДокументов.Период+1);
			Если Последовательности.ПартииТоваров.Проверить(НаНовыйМомент,СтрурктураОтбораСклад) Тогда
				Последовательности.ПартииТоваров.УстановитьГраницу(НаНовыйМомент,СтрурктураОтбораСклад);
			Иначе
				МожноПродолжатьВосстановление = Ложь;
			КонецЕсли;
		ИначеЕсли Последовательности.ПартииТоваров.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад) Тогда
			
			УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательности("ПартииТоваров"
			,ДокументСсылка
			,Склад
			,МассивСкладовПолучателей);
			
			Последовательности.ПартииТоваров.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбораСклад);
		Иначе
			МожноПродолжатьВосстановление = Ложь;
		КонецЕсли;
		
	    		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);


		
		ЗафиксироватьТранзакцию();
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("Партии "+ДокументИмя,ВремяНачалаЗамера,,Строка(ДокументСсылка));

		Если НЕ (ТипДокумента = Тип("ДокументСсылка.ПересортицаТоваров") 
			//ИЛИ ТипДокумента = Тип("ДокументСсылка.ВыпускПродукции") 
			ИЛИ ТипДокумента = Тип("ДокументСсылка.КорректировкаПартийТоваров")
			//ИЛИ ТипДокумента = Тип("ДокументСсылка.ТК_Переработка")
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ТК_ОприходованиеТоваров")) Тогда
			
			Отказ = Ложь;
			ТК_ОбменCentrСобытия.ТК_Обмен_КонсолидацияРегистрацияИзменений(ДокументСсылка, Отказ);
		КонецЕсли;
		
		
		Если НЕ МожноПродолжатьВосстановление Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Возврат Истина;
	
	
КонецФункции

Функция ОбработатьВыборкуДокументовПоВзаиморасчетам(ДоговорКонтрагента, ВыборкаДокументов, КоличествоДокументовВПотоке)
	
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	СтрурктураОтбора = Новый Структура("ДоговорКонтрагента,ПроведенВХронологическойПоследовательности",ДоговорКонтрагента,Ложь);
	
	Пока ВыборкаДокументов.Следующий() Цикл 
			
		ДокументСсылка = ВыборкаДокументов.Регистратор;
		ДокументИмя = ДокументСсылка.Метаданные().Имя;	
		ТипДокумента = ТипЗнч(ДокументСсылка);
		
		ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ."+ДокументИмя);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если НЕ ДокументСсылка.Проведен Тогда
			
			УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиВзаиморасчеты(ДокументСсылка,ДоговорКонтрагента);
			ЗафиксироватьТранзакцию();
			Продолжить;
		КонецЕсли;
				
		Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			
			Если Последовательности.Взаиморасчеты.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбора) Тогда	
				УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиВзаиморасчеты(ДокументСсылка,ДоговорКонтрагента);	
				
				Последовательности.Взаиморасчеты.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбора);
				ЗафиксироватьТранзакцию();
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеСвойства = Новый Структура;
		ДополнительныеСвойства.Вставить("ПроведениеПоВзаиморасчетам");	
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
	
		ДвиженияДокумента = ПолучитьДвиженияДокумента(ДокументИмя,ДокументСсылка);
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения);
		Документы[ДокументИмя].ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
		
		
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаРасчетыСПокупателямиПоДокументам")Тогда
			Попытка
				ВзаиморасчетыСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, ДвиженияДокумента, Ложь);
				ВзаиморасчетыСервер.ОтразитьРасчетыСПокупателямиПоДокументам(ДополнительныеСвойства, ДвиженияДокумента, Ложь);
			Исключение
				ВызватьИсключение "ОтразаитьРасчетыСПокупателями "+Строка(ДокументСсылка);
			КонецПопытки;
		КонецЕсли;

		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаРасчетыСПоставщикамиПоДокументам")Тогда
			Попытка
				ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, ДвиженияДокумента, Ложь);	
				ВзаиморасчетыСервер.ОтразитьРасчетыСПоставщикамиПоДокументам(ДополнительныеСвойства, ДвиженияДокумента, Ложь);	
			Исключение
				ВызватьИсключение "ОтразаитьРасчетыСПоставщиками "+Строка(ДокументСсылка);
			КонецПопытки;
		КонецЕсли;
			
		Для Каждого Набор Из ДвиженияДокумента Цикл 
			Набор.Значение.Записать();
		КонецЦикла;
		
		МожноПродолжатьВосстановление = Истина;
		Если ТаблицаДокументовКоличество = 1 И  ВыборкаДокументов.ПроведенВХронологическойПоследовательности Тогда
			НаНовыйМомент = Новый МоментВремени(ВыборкаДокументов.Период+1);
			Если Последовательности.Взаиморасчеты.Проверить(НаНовыйМомент,СтрурктураОтбора) Тогда
				Последовательности.Взаиморасчеты.УстановитьГраницу(НаНовыйМомент,СтрурктураОтбора);
			Иначе
				МожноПродолжатьВосстановление = Ложь;
			КонецЕсли;
		ИначеЕсли Последовательности.Взаиморасчеты.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбора) Тогда
			
			УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиВзаиморасчеты(ДокументСсылка,ДоговорКонтрагента);			
			Последовательности.Взаиморасчеты.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбора);
		Иначе
			МожноПродолжатьВосстановление = Ложь;
		КонецЕсли;
	    		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		ЗафиксироватьТранзакцию();
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("Взаиморасчеты "+ДокументИмя,ВремяНачалаЗамера,,Строка(ДокументСсылка));

		Если НЕ МожноПродолжатьВосстановление Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьВыборкуДокументовПоПартиямОрганизаций(Организация, ВыборкаДокументов, КоличествоДокументовВПотоке)
	
	
	ТаблицаДокументовКоличество = ВыборкаДокументов.Количество();
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	СтрурктураОтбора = Новый Структура("Организация,ПроведенВХронологическойПоследовательности",Организация,Ложь);
	
	Пока ВыборкаДокументов.Следующий() Цикл 
			
		ДокументСсылка = ВыборкаДокументов.Регистратор;
		ДокументИмя = ДокументСсылка.Метаданные().Имя;	
		ТипДокумента = ТипЗнч(ДокументСсылка);
		
		ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ."+ДокументИмя);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если НЕ ДокументСсылка.Проведен Тогда
			
			УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиПартииОрганизации(ДокументСсылка,Организация);
			ЗафиксироватьТранзакцию();
			Продолжить;
		КонецЕсли;
				
		Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			
			Если Последовательности.ПартииОрганизаций.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбора) Тогда	
				УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиПартииОрганизации(ДокументСсылка,Организация);	
				
				Последовательности.ПартииОрганизаций.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбора);
				ЗафиксироватьТранзакцию();
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеСвойства = Новый Структура;
		ДополнительныеСвойства.Вставить("ПроведениеПоОстаткамОрганизации");	
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
		
		ДвиженияДокумента = Новый Структура;
		НаборЗаписейОстаткиОрганизации =  РегистрыНакопления.ОстаткиОрганизации.СоздатьНаборЗаписей();
		НаборЗаписейОстаткиОрганизации.Отбор.Регистратор.Значение = ДокументСсылка;
		ДвиженияДокумента.Вставить("ОстаткиОрганизации", НаборЗаписейОстаткиОрганизации);

		Если Не ТипДокумента = Тип("ДокументСсылка.КонсолидированныеОстаткиОрганизации") Тогда
			НаборЗаписейПотребностиОрганизаций =  РегистрыНакопления.ПотребностиОрганизаций.СоздатьНаборЗаписей();
			НаборЗаписейПотребностиОрганизаций.Отбор.Регистратор.Значение = ДокументСсылка;
			ДвиженияДокумента.Вставить("ПотребностиОрганизаций", НаборЗаписейПотребностиОрганизаций);
		КонецЕсли;
		
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения);
		Документы[ДокументИмя].ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
		
		
		Попытка
			
			Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПартииТоваровОрганизации") Тогда
				ЗапасыСервер.ОтразитьОстаткиОрганизации(ДополнительныеСвойства, ДвиженияДокумента, Ложь);
			КонецЕсли;
			
			Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПотребностиТоваровОрганизации") Тогда
				ЗапасыСервер.ОтразитьПотребностьОрганизации(ДополнительныеСвойства, ДвиженияДокумента, Ложь);
			КонецЕсли;

		Исключение
			ВызватьИсключение "ОтразитьОстаткиОрганизации "+Строка(ДокументСсылка);
		КонецПопытки;
		
		
			
		Для Каждого Набор Из ДвиженияДокумента Цикл 
			Набор.Значение.Записать();
		КонецЦикла;
		
		МожноПродолжатьВосстановление = Истина;
		Если ТаблицаДокументовКоличество = 1 И  ВыборкаДокументов.ПроведенВХронологическойПоследовательности Тогда
			НаНовыйМомент = Новый МоментВремени(ВыборкаДокументов.Период+1);
			Если Последовательности.ПартииОрганизаций.Проверить(НаНовыйМомент,СтрурктураОтбора) Тогда
				Последовательности.ПартииОрганизаций.УстановитьГраницу(НаНовыйМомент,СтрурктураОтбора);
			Иначе
				МожноПродолжатьВосстановление = Ложь;
			КонецЕсли;
		ИначеЕсли Последовательности.ПартииОрганизаций.Проверить(ВыборкаДокументов.МоментВремени,СтрурктураОтбора) Тогда
			
			УправлениеПоследовательностями.ЗарегистрироватьВХронологическойПоследовательностиПартииОрганизации(ДокументСсылка,Организация);			
			Последовательности.ПартииОрганизаций.УстановитьГраницу(ВыборкаДокументов.МоментВремени,СтрурктураОтбора);
		Иначе
			МожноПродолжатьВосстановление = Ложь;
		КонецЕсли;
	    		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		ЗафиксироватьТранзакцию();
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ПартииОрганизаций "+ДокументИмя,ВремяНачалаЗамера,,Строка(ДокументСсылка));

		Если НЕ МожноПродолжатьВосстановление Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции



Функция ПолучитьТаблицуПараметровЗапускаСледующихПотоков(КоличествоДополнительныхПотоков
	,МассивСкладовАктивныхЗаданий
	,МассивСкладов = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСкладовАктивныхФоновыхЗаданий", МассивСкладовАктивныхЗаданий);
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПартииТоваров.СкладКомпании КАК СкладКомпании
	               |ПОМЕСТИТЬ ТаблицаДоступныхСкладов
	               |ИЗ
	               |	Последовательность.ПартииТоваров КАК ПартииТоваров
	               |ГДЕ
	               |	НЕ ПартииТоваров.СкладКомпании В (&МассивСкладовАктивныхФоновыхЗаданий)
	               |	И &ОтборПоСкладам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПартииТоваров.СкладКомпании КАК СкладКомпании,
	               |	ПартииТоваров.Период КАК Период,
	               |	ПартииТоваров.Регистратор КАК Регистратор,
	               |	ПартииТоваров.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ПоследовательностьДокументов
	               |ИЗ
	               |	Последовательность.ПартииТоваров КАК ПартииТоваров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступныхСкладов КАК ТаблицаДоступныхСкладов
	               |		ПО ПартииТоваров.СкладКомпании = ТаблицаДоступныхСкладов.СкладКомпании
	               |			И (НЕ ПартииТоваров.ПроведенВХронологическойПоследовательности)
	               |ГДЕ
	               |	ПартииТоваров.Регистратор.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.СкладКомпании КАК СкладКомпании,
	               |	МИНИМУМ(ПоследовательностьДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ пМинимум
	               |ИЗ
	               |	ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.СкладКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.СкладКомпании КАК СкладКомпании,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	МИНИМУМ(ПоследовательностьДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ пРегистраторМинимум
	               |ИЗ
	               |	пМинимум КАК пМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пМинимум.СкладКомпании = ПоследовательностьДокументов.СкладКомпании
	               |			И пМинимум.Период = ПоследовательностьДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.Период,
	               |	ПоследовательностьДокументов.СкладКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.СкладКомпании КАК СкладКомпании,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	ПоследовательностьДокументов.Регистратор КАК Регистратор,
	               |	ПоследовательностьДокументов.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ГраницыДокументов
	               |ИЗ
	               |	пРегистраторМинимум КАК пРегистраторМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пРегистраторМинимум.СкладКомпании = ПоследовательностьДокументов.СкладКомпании
	               |			И пРегистраторМинимум.Период = ПоследовательностьДокументов.Период
	               |			И пРегистраторМинимум.Регистратор = ПоследовательностьДокументов.Регистратор
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ПартииТоваровГраницы.СкладКомпании,
	               |	ПартииТоваровГраницы.Период,
	               |	ПартииТоваровГраницы.Регистратор,
	               |	ПартииТоваровГраницы.МоментВремени
	               |ИЗ
	               |	Последовательность.ПартииТоваров.Границы КАК ПартииТоваровГраницы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступныхСкладов КАК ТаблицаДоступныхСкладов
	               |		ПО ПартииТоваровГраницы.СкладКомпании = ТаблицаДоступныхСкладов.СкладКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пРегистраторМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.СкладКомпании КАК СкладКомпании,
	               |	МИНИМУМ(ГраницыДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ ГД_Минимум
	               |ИЗ
	               |	ГраницыДокументов КАК ГраницыДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.СкладКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.СкладКомпании КАК СкладКомпании,
	               |	ГраницыДокументов.Период КАК Период,
	               |	МИНИМУМ(ГраницыДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ ГД_МинимумРегистратор
	               |ИЗ
	               |	ГД_Минимум КАК ГД_Минимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_Минимум.СкладКомпании = ГраницыДокументов.СкладКомпании
	               |			И ГД_Минимум.Период = ГраницыДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.СкладКомпании,
	               |	ГраницыДокументов.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 9999
	               |	ГраницыДокументов.СкладКомпании КАК СкладКомпании,
	               |	ГраницыДокументов.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	ГД_МинимумРегистратор КАК ГД_МинимумРегистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_МинимумРегистратор.СкладКомпании = ГраницыДокументов.СкладКомпании
	               |			И ГД_МинимумРегистратор.Период = ГраницыДокументов.Период
	               |			И ГД_МинимумРегистратор.Регистратор = ГраницыДокументов.Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени";

	Если МассивСкладов = Неопределено Тогда
		УсловиеОтбораПоСкладам = "";
	Иначе
		Запрос.УстановитьПараметр("МассивСкладовДляОтбора", МассивСкладов);
		УсловиеОтбораПоСкладам = "И ПартииТоваров.СкладКомпании В(&МассивСкладовДляОтбора)";

	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоСкладам", УсловиеОтбораПоСкладам);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 9999", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДополнительныхПотоков, "ЧГ=0"));
	Запрос.Текст = ТекстЗапроса;

	Рез = Запрос.Выполнить();

	Возврат Рез;

	
КонецФункции

Функция ПолучитьТаблицуПараметровЗапускаСледующихПотоковДоговора(КоличествоДополнительныхПотоков
	,МассивАктивныхЗаданий
	,МассивОтбора = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивАктивныхЗаданий", МассивАктивныхЗаданий);
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Взаиморасчеты.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ТаблицаДоступных
	               |ИЗ
	               |	Последовательность.Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	НЕ Взаиморасчеты.ДоговорКонтрагента В (&МассивАктивныхЗаданий)
				   |	И &МассивОтбора
				   |	И НЕ Взаиморасчеты.ДоговорКонтрагента = ЗНАЧЕНИЕ(справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Взаиморасчеты.Период КАК Период,
	               |	Взаиморасчеты.Регистратор КАК Регистратор,
	               |	Взаиморасчеты.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ПоследовательностьДокументов
	               |ИЗ
	               |	Последовательность.Взаиморасчеты КАК Взаиморасчеты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступных КАК ТаблицаДоступных
	               |		ПО Взаиморасчеты.ДоговорКонтрагента = ТаблицаДоступных.ДоговорКонтрагента
	               |			И (НЕ Взаиморасчеты.ПроведенВХронологическойПоследовательности)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ПоследовательностьДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ пМинимум
	               |ИЗ
	               |	ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	МИНИМУМ(ПоследовательностьДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ пРегистраторМинимум
	               |ИЗ
	               |	пМинимум КАК пМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пМинимум.ДоговорКонтрагента = ПоследовательностьДокументов.ДоговорКонтрагента
	               |			И пМинимум.Период = ПоследовательностьДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.ДоговорКонтрагента,
	               |	ПоследовательностьДокументов.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	ПоследовательностьДокументов.Регистратор КАК Регистратор,
	               |	ПоследовательностьДокументов.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ГраницыДокументов
	               |ИЗ
	               |	пРегистраторМинимум КАК пРегистраторМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пРегистраторМинимум.ДоговорКонтрагента = ПоследовательностьДокументов.ДоговорКонтрагента
	               |			И пРегистраторМинимум.Период = ПоследовательностьДокументов.Период
	               |			И пРегистраторМинимум.Регистратор = ПоследовательностьДокументов.Регистратор
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыГраницы.ДоговорКонтрагента,
	               |	ВзаиморасчетыГраницы.Период,
	               |	ВзаиморасчетыГраницы.Регистратор,
	               |	ВзаиморасчетыГраницы.МоментВремени
	               |ИЗ
	               |	Последовательность.Взаиморасчеты.Границы КАК ВзаиморасчетыГраницы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступных КАК ТаблицаДоступных
	               |		ПО ВзаиморасчетыГраницы.ДоговорКонтрагента = ТаблицаДоступных.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пРегистраторМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ГраницыДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ ГД_Минимум
	               |ИЗ
	               |	ГраницыДокументов КАК ГраницыДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ГраницыДокументов.Период КАК Период,
	               |	МИНИМУМ(ГраницыДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ ГД_МинимумРегистратор
	               |ИЗ
	               |	ГД_Минимум КАК ГД_Минимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_Минимум.ДоговорКонтрагента = ГраницыДокументов.ДоговорКонтрагента
	               |			И ГД_Минимум.Период = ГраницыДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.Период,
	               |	ГраницыДокументов.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 9999
	               |	ГраницыДокументов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ГраницыДокументов.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	ГД_МинимумРегистратор КАК ГД_МинимумРегистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_МинимумРегистратор.ДоговорКонтрагента = ГраницыДокументов.ДоговорКонтрагента
	               |			И ГД_МинимумРегистратор.Период = ГраницыДокументов.Период
	               |			И ГД_МинимумРегистратор.Регистратор = ГраницыДокументов.Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени";

	Если МассивОтбора = Неопределено Тогда
		УсловиеОтбора = "";
	Иначе
		Запрос.УстановитьПараметр("МассивОтбора", МассивОтбора);
		УсловиеОтбора = "И  Взаиморасчеты.ДоговорКонтрагента В(&МассивОтбора)";

	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &МассивОтбора", УсловиеОтбора);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 9999", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДополнительныхПотоков, "ЧГ=0"));
	Запрос.Текст = ТекстЗапроса;

	Рез = Запрос.Выполнить();

	Возврат Рез;

	
КонецФункции

Функция ПолучитьТаблицуПараметровЗапускаСледующихПотоковОрганизации(КоличествоДополнительныхПотоков
	,МассивАктивныхЗаданий
	,МассивОтбора = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивАктивныхЗаданий", МассивАктивныхЗаданий);
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	П_О.Организация КАК Организация
	               |ПОМЕСТИТЬ ТаблицаДоступных
	               |ИЗ
	               |	Последовательность.ПартииОрганизаций КАК П_О
	               |ГДЕ
	               |	НЕ П_О.Организация В (&МассивАктивныхЗаданий)
				   |	И &МассивОтбора
				   |	И НЕ П_О.Организация = ЗНАЧЕНИЕ(справочник.Организации.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	П_О.Организация КАК Организация,
	               |	П_О.Период КАК Период,
	               |	П_О.Регистратор КАК Регистратор,
	               |	П_О.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ПоследовательностьДокументов
	               |ИЗ
	               |	Последовательность.ПартииОрганизаций КАК П_О
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступных КАК ТаблицаДоступных
	               |		ПО П_О.Организация = ТаблицаДоступных.Организация
	               |			И (НЕ П_О.ПроведенВХронологическойПоследовательности)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.Организация КАК Организация,
	               |	МИНИМУМ(ПоследовательностьДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ пМинимум
	               |ИЗ
	               |	ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.Организация КАК Организация,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	МИНИМУМ(ПоследовательностьДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ пРегистраторМинимум
	               |ИЗ
	               |	пМинимум КАК пМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пМинимум.Организация = ПоследовательностьДокументов.Организация
	               |			И пМинимум.Период = ПоследовательностьДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследовательностьДокументов.Организация,
	               |	ПоследовательностьДокументов.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоследовательностьДокументов.Организация КАК Организация,
	               |	ПоследовательностьДокументов.Период КАК Период,
	               |	ПоследовательностьДокументов.Регистратор КАК Регистратор,
	               |	ПоследовательностьДокументов.МоментВремени КАК МоментВремени
	               |ПОМЕСТИТЬ ГраницыДокументов
	               |ИЗ
	               |	пРегистраторМинимум КАК пРегистраторМинимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследовательностьДокументов КАК ПоследовательностьДокументов
	               |		ПО пРегистраторМинимум.Организация = ПоследовательностьДокументов.Организация
	               |			И пРегистраторМинимум.Период = ПоследовательностьДокументов.Период
	               |			И пРегистраторМинимум.Регистратор = ПоследовательностьДокументов.Регистратор
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	П_ОГраницы.Организация,
	               |	П_ОГраницы.Период,
	               |	П_ОГраницы.Регистратор,
	               |	П_ОГраницы.МоментВремени
	               |ИЗ
	               |	Последовательность.ПартииОрганизаций.Границы КАК П_ОГраницы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДоступных КАК ТаблицаДоступных
	               |		ПО П_ОГраницы.Организация = ТаблицаДоступных.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ пРегистраторМинимум
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.Организация КАК Организация,
	               |	МИНИМУМ(ГраницыДокументов.Период) КАК Период
	               |ПОМЕСТИТЬ ГД_Минимум
	               |ИЗ
	               |	ГраницыДокументов КАК ГраницыДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГраницыДокументов.Организация КАК Организация,
	               |	ГраницыДокументов.Период КАК Период,
	               |	МИНИМУМ(ГраницыДокументов.Регистратор) КАК Регистратор
	               |ПОМЕСТИТЬ ГД_МинимумРегистратор
	               |ИЗ
	               |	ГД_Минимум КАК ГД_Минимум
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_Минимум.Организация = ГраницыДокументов.Организация
	               |			И ГД_Минимум.Период = ГраницыДокументов.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГраницыДокументов.Период,
	               |	ГраницыДокументов.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 9999
	               |	ГраницыДокументов.Организация КАК Организация,
	               |	ГраницыДокументов.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	ГД_МинимумРегистратор КАК ГД_МинимумРегистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГраницыДокументов КАК ГраницыДокументов
	               |		ПО ГД_МинимумРегистратор.Организация = ГраницыДокументов.Организация
	               |			И ГД_МинимумРегистратор.Период = ГраницыДокументов.Период
	               |			И ГД_МинимумРегистратор.Регистратор = ГраницыДокументов.Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени";

	Если МассивОтбора = Неопределено Тогда
		УсловиеОтбора = "";
	Иначе
		Запрос.УстановитьПараметр("МассивОтбора", МассивОтбора);
		УсловиеОтбора = "И П_О.Организация В(&МассивОтбора)";

	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &МассивОтбора", УсловиеОтбора);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 9999", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДополнительныхПотоков, "ЧГ=0"));
	Запрос.Текст = ТекстЗапроса;

	Рез = Запрос.Выполнить();

	Возврат Рез;

	
КонецФункции





Процедура ТестПроведения()Экспорт
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 10
	//|	РеализацияТоваров.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.РеализацияТоваров КАК РеализацияТоваров
	//|ГДЕ
	//|	РеализацияТоваров.Дата >= &Дата
	//|	И РеализацияТоваров.Проведен
	//|	И РеализацияТоваров.СкладКомпании = &СкладКомпании";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Склад = Справочники.СкладыКомпании.ПустаяСсылка();
	//ОбработатьВыборкуДокументов(Склад,ВыборкаДетальныеЗаписи,1);
	 
	
	ВыполнитьВосстановлениеПоследовательностиПартийПоСкладу(Справочники.СкладыКомпании.НайтиПоКоду("A892"),  Новый МоментВремени(Дата('20200130230738')), 200, Ложь, Неопределено);
	
КонецПроцедуры
