
&НаКлиенте
Процедура ЗагрузитьСFTP(Команда)
	ТК_ОбменEDI.ЗагрузкаFTPСобщенийEDI();	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВходящиеДокументы(Команда)
	
	массивСсылок = Элементы.Список.ВыделенныеСтроки;
	ТК_ОбменEDI.ОбработатьВходящиеСообщенияEDI(массивСсылок);	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВходящиеПовторно(Команда)
	
	массивСсылок = Элементы.Список.ВыделенныеСтроки;
	ТК_ОбменEDI.ОбработатьВходящиеСообщенияEDI(массивСсылок,Истина);	
	Элементы.Список.Обновить();

КонецПроцедуры
