#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


#КонецОбласти	

	
#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТК_Планирование.Период, МЕСЯЦ) КАК Период,
	               |	ТК_Планирование.Ссылка КАК Ссылка,
	               |	ТК_Планирование.ХозОперация КАК ХозОперация,
	               |	ТК_Планирование.Организация КАК Организация,
	               |	ТК_Планирование.ПодразделениеКомпании КАК ПодразделениеКомпании
	               |ИЗ
	               |	Документ.ТК_Планирование КАК ТК_Планирование
	               |ГДЕ
	               |	ТК_Планирование.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка",			ДокументСсылка);
	Запрос.УстановитьПараметр("Период",			Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",	Реквизиты.Организация);
	Запрос.УстановитьПараметр("ХозОперация",	Реквизиты.ХозОперация);
			
	ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании", 	Реквизиты.ПодразделениеКомпании);
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация",			Реквизиты.ХозОперация);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;	
	ТекстЗапросаТаблицаТК_Планирование(Запрос, ТекстыЗапроса, Регистры);
	
	// Исполнение запроса и выгрузка полученных таблиц для движений.
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры


Функция ТекстЗапросаВтТаблицаПланы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаПланы";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТК_ПланированиеПланы.НоменклатураПланирования КАК НоменклатураПланирования,
	               |	ТК_ПланированиеПланы.Показатель КАК Показатель,
	               |	ТК_ПланированиеПланы.Значение КАК Значение
	               |ПОМЕСТИТЬ ВтТаблицаПланы
	               |ИЗ
	               |	Документ.ТК_Планирование.Планы КАК ТК_ПланированиеПланы
	               |ГДЕ
	               |	ТК_ПланированиеПланы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Организация КАК Организация,
	               |	ВтТаблицаПланы.НоменклатураПланирования КАК НоменклатураПланирования,
	               |	ВтТаблицаПланы.Показатель КАК Показатель,
	               |	ВтТаблицаПланы.Значение КАК Значение,
	               |	&ХозОперация КАК ХозОперация
	               |ИЗ
	               |	ВтТаблицаПланы КАК ВтТаблицаПланы";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТК_Планирование(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТК_Планирование";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаПланы", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаПланы(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	&Организация КАК Организация,
	               |	ВтТаблицаПланы.НоменклатураПланирования КАК НоменклатураПланирования,
	               |	ВтТаблицаПланы.Показатель КАК Показатель,
	               |	ВтТаблицаПланы.Значение КАК Значение,
	               |	&ХозОперация КАК ХозОперация
	               |ИЗ
	               |	ВтТаблицаПланы КАК ВтТаблицаПланы"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти	


#Область Последовательность


#КонецОбласти



#Область Печать


#КонецОбласти	






#КонецЕсли