

Функция ЗапросGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	
	//Попытка
		МассивЗаказов = Новый  Массив;
		
		СтруктураЗаказа = Новый Структура();
		СтруктураЗаказа.Вставить("visit_id",99220);
		СтруктураЗаказа.Вставить("pos_code",8181);
		СтруктураЗаказа.Вставить("pos_code_pm","Q9900006");
		СтруктураЗаказа.Вставить("dt",Дата('20240120114359'));
		
		МассивТоваров  = Новый Массив;
		МассивТоваров.Добавить(Новый Структура("product_code,product_code_pm,qty",1016,"0010055621",1));
		МассивТоваров.Добавить(Новый Структура("product_code,product_code_pm,qty",29192,"0010081127",5));
		МассивТоваров.Добавить(Новый Структура("product_code,product_code_pm,qty",1036,"0010055620",3));
		
		СтруктураЗаказа.Вставить("order",МассивТоваров);
		МассивЗаказов.Добавить(СтруктураЗаказа);
		
		СтруктураЗаказа = Новый Структура();
		СтруктураЗаказа.Вставить("visit_id",989595);
		СтруктураЗаказа.Вставить("pos_code",12027);
		СтруктураЗаказа.Вставить("pos_code_pm","11010023");
		СтруктураЗаказа.Вставить("dt",Дата('20240120135506'));
		
		МассивТоваров  = Новый Массив;
		МассивТоваров.Добавить(Новый Структура("product_code,product_code_pm,qty",1252,"0010088749",1));
		МассивТоваров.Добавить(Новый Структура("product_code,product_code_pm,qty",12554,"0010095660",1));
		
		СтруктураЗаказа.Вставить("order",МассивТоваров);
		МассивЗаказов.Добавить(СтруктураЗаказа);
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		
		ЗаписатьJSON(Запись,МассивЗаказов,НастройкиСериализации);
		СтрокаJSON = Запись.Закрыть();
	//Исключение
		//СтрокаJSON = ОписаниеОшибки();
		
	//КонецПопытки;

	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Функция ЗапросPOST(Запрос)
	
	
	Параметры = Новый Структура("Status,Messages",Истина,Новый ТекстовыйДокумент);

	ContentType = Запрос.Заголовки.Получить("Content-Type");
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();

	ТекПользователь = Пользователи.ТекущийПользователь();
	Если ТекПользователь = Пользователи.НайтиПоИмени("OrdersFMU") Тогда
		ПоставщикПеревода = Перечисления.ПоставщикПереводаЗаказа.FMU;
	Иначе
		ПоставщикПеревода = Перечисления.ПоставщикПереводаЗаказа.BAT;
	КонецЕсли;
	
	Если ПустаяСтрока(ТелоЗапроса) Тогда
		Параметры.Status = Ложь;
		Параметры.Messages.ДобавитьСтроку("Порожній запит");
	Иначе	
		
		Если ContentType = "text/csv" Тогда
			Параметры.Status = Ложь;
			Параметры.Messages.ДобавитьСтроку("csv формат не реалізований");
			//СтруктураЗаказа = ТК_МобильныйРабтаHTTP_Сервис.ВосстановлениеCSV(ТелоЗапроса,Параметры);
		ИначеЕсли ContentType = "application/json" Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
			
			МассивИмен = Новый Массив;
			МассивИмен.Добавить("pos_code");
			МассивИмен.Добавить("product_code");
			//МассивИмен.Добавить("ARTNUMBER");
			УстановитьПривилегированныйРежим(Истина);
			Попытка
				СтруктураЗаказа = ПрочитатьJSON(ЧтениеJSON,,"dt",ФорматДатыJSON.ISO,"ВосстановлениеJSON",ТК_МобильныйРабтаHTTP_Сервис,Параметры,МассивИмен);
				Если Параметры.Status Тогда
					ТК_МобильныйРабтаHTTP_Сервис.ЗаписатьПереводЗаказа(СтруктураЗаказа,ПоставщикПеревода);
				КонецЕсли;
			Исключение
				Параметры.Status = Ложь;
				иОшибка = ИнформацияОбОшибке();
				Параметры.Messages.ДобавитьСтроку(Строка(иОшибка.НомерСтроки) +иОшибка.Описание);
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
			ЧтениеJSON.Закрыть();
		Иначе
			Параметры.Status = Ложь;
			Параметры.Messages.ДобавитьСтроку("формат "+ContentType+" не підтримується");

		КонецЕсли;
	КонецЕсли;
	
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("Status");
	ЗаписьJSON.ЗаписатьЗначение(?(Параметры.Status,"Successful","Error"));
	ЗаписьJSON.ЗаписатьИмяСвойства("Messages");
	ЗаписьJSON.ЗаписатьЗначение(Параметры.Messages.ПолучитьТекст());
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции
