
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс


Функция ЗагрузитьТаблицуДокументов(ТипДокумента = "", ПараметрыЗагрузки, Знач ТаблицаДокументов = Неопределено, 
	Знач ТаблицаСнятыхЗетОтчетов = Неопределено, Знач ТаблицаТКС = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);			
	
	Если ТипДокумента = "ЗакрытиеСмены" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовЗакрытиеСмены(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
		
	ИначеЕсли ТипДокумента = "ТКС" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовТКС(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаТКС);
		
	ИначеЕсли ТипДокумента = "Инвентаризация" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовИнвентаризация(ПараметрыЗагрузки, ТаблицаДокументов);
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовПоступлениеТоваров(ПараметрыЗагрузки, ТаблицаДокументов);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовПеремещения(ПараметрыЗагрузки, ТаблицаДокументов);
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовВозвратПоставщику(ПараметрыЗагрузки, ТаблицаДокументов);
		
	Иначе 
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'"));
		Возврат Неопределено;
		
	КонецЕсли;
	
	
КонецФункции

Функция ЗаполнитьТаблицуДокументовДляВыгрузи(ТипДокумента, ПараметрыВыгрузки, Знач ТаблицаДокументов) Экспорт 
	
	Перем НачалоПериода, КонецПериода, ОтборПоСкладам, МассивСкладов, Подразделение;
	
	УстановитьПривилегированныйРежим(Истина);
	ВсеОк = Истина;
	
	ПараметрыВыгрузки.Свойство("НачалоПериода",	НачалоПериода);	
	ПараметрыВыгрузки.Свойство("КонецПериода",	КонецПериода);		
	ПараметрыВыгрузки.Свойство("Подразделение", Подразделение);
	
	ТекстСообщения = "";
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь, ПараметрыВыгрузки.Подразделение, ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка." + ТипДокумента,УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ОтборПоСкладам", Ложь);
	
	Если Не ПараметрыВыгрузки.Свойство("МассивСкладов", МассивСкладов) Тогда 		
		
		ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыВыгрузки.Подразделение, ПараметрыВыгрузки);
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("СкладКомпании");
		
	КонецЕсли;
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	DOCDATE1         = Число(Формат(ДатаДокументаНач-60*60*24,"ДФ=yyyyMMdd000000"));
	DOCDATE2         = Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонецПериода", 	ДатаДокументаКон);
	Запрос.УстановитьПараметр("мСкладКомпании", МассивСкладов);		
	
	
	Если ТипДокумента = "Инвентаризация" Тогда 		
		
		Результат = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "Результат", Ложь);		
		
		Если Результат Тогда 
			ЗаполнитьТаблицуИнвентаризацийРезультат(Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов, ПараметрыВыгрузки);			
		Иначе
			Корректировки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "Корректировки", Ложь);		
			
			ЗаполнитьТаблицуИнвентаризаций(Запрос, НачалоПериода, DOCDATE1, DOCDATE2, ТаблицаДокументов, Корректировки);	
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 		
		
		ЗаполнитьТаблицуПоступлений(Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов);		
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 		
		
		ЗаполнитьТаблицуВозвратов(Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 				
		
		ИзПланаОбмена 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ИзПланаОбмена", Ложь);
		ПланОбмена 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПланОбмена", 	 Неопределено);
		
		ЗаполнитьТаблицуПеремещений(Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов, ИзПланаОбмена, ПланОбмена);		
		
	Иначе
	 	
		ВызватьИсключение НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документа ""'") + ТипДокумента + """";
		
	КонецЕсли;	
	
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	РезультатОперации.Вставить("СообщениеЗавершения", 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Найдено %1 документ(ов)'; uk = 'Знайдено %1 документ(ів)'"), 
			ТаблицаДокументов.Количество()));
	
	РезультатОперации.Вставить("ЕстьОшибки", Не ВсеОк);	
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ВыполнитьЗагрузкуДокументов(ТипДокумента,СтатусДокумента, ПараметрыЗагрузки = Неопределено,  	
	Знач ТаблицаДокументов = Неопределено, Знач ТаблицаСнятыхЗетОтчетов = Неопределено, Знач ТаблицаТКС = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПодключения = Неопределено;
	
	Если ТипЗнч(ПараметрыЗагрузки) = Тип("Структура") Тогда
		ПараметрыЗагрузки.Свойство("ПараметрыПодключения",ПараметрыПодключения);
	КонецЕсли;
	
	
	
	
	ВсеОк = Истина;                        
	СообщениеЗавершения = "";
	
	Если ТипДокумента = "ЗакрытиеСмены" Тогда 
		
		ЗагрузитьДокументЗакрытиеСмены(ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, СообщениеЗавершения, ВсеОк, ПараметрыПодключения, ПараметрыЗагрузки);
		
	ИначеЕсли ТипДокумента = "ТКС" Тогда 
		
		ЗагрузитьДокументТКС(ТаблицаДокументов, ТаблицаТКС, СообщениеЗавершения, ВсеОк);
		
	ИначеЕсли ТипДокумента = "Инвентаризация" Тогда 
		
		ЗагрузитьДокументИнвентаризация(ПараметрыЗагрузки, ТаблицаДокументов, СообщениеЗавершения, ВсеОк);
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		ЗагрузитьДокументПоступлениеТоваров(ТаблицаДокументов, СообщениеЗавершения, ВсеОк);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		
		ЗагрузитьДокументПеремещениеТоваров(ТаблицаДокументов, ПараметрыЗагрузки, СообщениеЗавершения, ВсеОк);			
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
		
		ЗагрузитьДокументВозвратПоставщику(ТаблицаДокументов, СообщениеЗавершения, ВсеОк);
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'"));
		ВсеОк = Ложь;
		
	КонецЕсли;	
	
	РезультатОперации = Новый Структура;	
	Если Не ПустаяСтрока(СообщениеЗавершения) Тогда 
		РезультатОперации.Вставить("СообщениеЗавершения", СообщениеЗавершения);
	КонецЕсли;	
	РезультатОперации.Вставить("ЕстьОшибки", Не ВсеОк);		
	РезультатОперации.Вставить("СообщенияПользователю", ПолучитьСообщенияПользователю(Истина));
	
	Возврат РезультатОперации;
	
КонецФункции

Функция СформироватьОтчет(ПараметрыОтчета) Экспорт 
	
	ВидОтчета = "";
	ПараметрыОтчета.Свойство("ВидОтчета", ВидОтчета);
	
	Если ВидОтчета = "ЦеныОС" Тогда 
		
		Возврат СформироватьОтчетПоЦенамОС(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "ДоприходыЗС" Тогда 
		
		Возврат СформироватьОтчетДоприход(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "ПриходыОС" Тогда 
		
		Возврат СформироватьОтчетПриходыОС(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "ОбъектыБезЗС" Тогда 
		
		Возврат СформироватьОтчетОбъектыБезЗС(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "РасхожденияЯкобс" Тогда 
		
		Возврат СформироватьОтчетРасхожденияЯкобз(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "СверкаПродажOS" Тогда 
		
		Возврат СформироватьОтчетСверкаПродажOS(ПараметрыОтчета);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не известный вид отчета ""'; uk = 'Невідомий вид звіту ""'") + ВидОтчета + """";		
		
	КонецЕсли;
	
КонецФункции

Функция ВыгрузитьОстатки(Параметры)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ОтборПоСкладам 					= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборПоСкладам", Ложь);
	Если ОтборПоСкладам = Ложь Тогда
		ВызватьИсключение НСтр("ru = 'Нет склада для выгрузки'; uk = 'Немає складу для вивантаження'");
	КонецЕсли;
	
	ВсегоСкладов = ОтборПоСкладам.Количество();
	Если ВсегоСкладов = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Нет склада для выгрузки."+Символы.ПС+"Проверьте активные склады.'; uk = 'Немає складу для вивантаження"+Символы.ПС+"Перевірте активні склади.'");
	КонецЕсли;
	
	
	
	//УзелОбмена = ПланыОбмена.ОбменФронт.ПолучитьУзелОбмена();
	//Если УзелОбмена = Неопределено ИЛИ УзелОбмена.ПометкаУдаления Тогда
	//	ВызватьИсключение НСтр("ru = 'Не найдены настройки обмена'; uk = 'Не знайдені настройки обміну'");
	//КонецЕсли;
	
	УзлыОбмена = ПланыОбмена.ОбменФронт.ПолучитьМассивУзловВыгрузкиОстатковТовара();
	Если УзлыОбмена.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не найдены настройки обмена'; uk = 'Не знайдені настройки обміну'");
	КонецЕсли;
	
	Для Каждого УзелОбмена Из УзлыОбмена Цикл 
		
		ТекстСообщения = "";
		ДоступноПодключениеКСерверу = Ложь;
		ОбменФронтСобытия.ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
		
		Если Не ДоступноПодключениеКСерверу Тогда
			ВызватьИсключение ТекстСообщения;
			
		КонецЕсли;
		
		
		ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
		ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
		
		ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
		ПараметрыОбмена.Вставить("РежимЗапускаОбмена", НСтр("ru='Интерактивная выгрузка остатков';uk='Інтерактивна вивантаження залишків'"));
		ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
		
		Ошибки = Неопределено;
		
		
		ТекстСообщения ="";
		сч = 0;
		для Каждого СкладВыгрзуки Из ОтборПоСкладам Цикл 
			сч = сч+1;
			
			Набор = РегистрыСведений.ТК_ДатыОстатковOS.СоздатьНаборЗаписей();
			Набор.Отбор.СкладКомпании.Установить(СкладВыгрзуки);
			Набор.Прочитать();
			Если Набор.Количество() = 0 Тогда
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.СкладКомпании = СкладВыгрзуки;
				НоваяЗапись.Дата = ТекущаяДатаСеанса();
				Набор.Записать();
			КонецЕсли;
			
			СтрТекстИнф = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 из %2 Выгрузка остатков по складу: %3'; uk = '%1 з %2 Вивантаження залишків по складу: %3'"), 
			сч, 
			ВсегоСкладов, 
			Строка(СкладВыгрзуки));
			ДлительныеОперации.СообщитьПрогресс(Цел(сч / ВсегоСкладов * 100),СтрТекстИнф);
			
			
			
			РезультатОбмена = Новый  Структура;
			
			МассивСкладов = Новый Массив;
			МассивСкладов.Добавить(СкладВыгрзуки);
			ОбменФронт.ВыполнитьОбменСфронтомОстаткиПоСкладам(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации,МассивСкладов);
			
			Если Не РезультатОбмена.Успешно Тогда
				
				ТекстСообщения = ТекстСообщения + СтрТекстИнф +" текст ошибки: "+ РезультатОбмена.ТекстСообщений.ПолучитьСтроку(1)+Символы.ПС;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецФункции

Функция ВыгрузитьЦены(Параметры)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбмена = ПланыОбмена.ОбменФронт.ПолучитьУзелОбмена(Параметры.Подразделение);
	Если УзелОбмена = Неопределено Тогда
		
		ВызватьИсключение "Не найден узел обмена по подразделению :"+Строка(Параметры.Подразделение);
	КонецЕсли;
	
	
	
	ТекстСообщения = "";
	ДоступноПодключениеКСерверу = Ложь;
	ОбменФронтСобытия.ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
	
	Если Не ДоступноПодключениеКСерверу Тогда
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	
	ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
	ПараметрыОбмена.Вставить("РежимЗапускаОбмена", НСтр("ru='Интерактивная выгрузка цен';uk='Інтерактивна вивантаження цін'"));
	ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладыКомпанииДоступныеЦены.ТипЦен КАК ТипЦен
	|ИЗ
	|	Справочник.СкладыКомпании.ДоступныеЦены КАК СкладыКомпанииДоступныеЦены
	|ГДЕ
	|	СкладыКомпанииДоступныеЦены.Ссылка.ЭтоГруппа = ЛОЖЬ
	|	И СкладыКомпанииДоступныеЦены.Ссылка.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Нет доступных цен по подразделению :"+Строка(Параметры.Подразделение);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВсегоТиповЦен = ВыборкаДетальныеЗаписи.Количество();
	
	сч = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		сч = сч+1;
		
		
		СтрТекстИнф = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 из %2 Выгрузка цен по типу : %3'; uk = '%1 з %2 Вивантаження цін за типом : %3'"), 
		сч, 
		ВсегоТиповЦен, 
		Строка(ВыборкаДетальныеЗаписи.ТипЦен));
		ДлительныеОперации.СообщитьПрогресс(Цел(сч / ВсегоТиповЦен * 100),СтрТекстИнф);
		РезультатОбмена = Новый  Структура;
		
		ОбменФронт.ВыгрузитьЦеныПоТипуЦен(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации,ВыборкаДетальныеЗаписи.ТипЦен);
		
		Если Не РезультатОбмена.Успешно Тогда
			
			ТекстСообщения = ТекстСообщения + СтрТекстИнф +" текст ошибки: "+ РезультатОбмена.ТекстСообщений.ПолучитьСтроку(1)+Символы.ПС;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	
КонецФункции




Функция ВыполнитьВыгрузкуДокументов(ТипДокумента, ПараметрыВыгрузки, Знач ТаблицаДокументов) Экспорт 
	
	ДокументыНаВыгрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаВыгрузку.Количество();	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Если КоличествоДокументов = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Нет отмеченных документов для выгрузки'; uk = 'Немає відмічених документів для вивантаження'");
	КонецЕсли;
	
	тзВыгрузки = ТаблицаДокументов.Скопировать(ДокументыНаВыгрузку);
	
	Если ТипДокумента <> "Инвентаризация" Тогда
		мДокументы = тзВыгрузки.ВыгрузитьКолонку("Документ");
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(0, "Подключаемся к внешнему источнику");	
	
	
	Если ТипДокумента = "Инвентаризация" Тогда 
		
		Если ТипЗнч(ПараметрыВыгрузки) = Тип("Структура") Тогда 			
			Результат = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "Результат", Ложь);
			Корректировки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "Корректировки", Ложь);
			ПоПлану = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПоПлану", Ложь);
			СозданныеВБазе	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "СозданныеВБазе", Ложь);
		Иначе
			Результат = Ложь;                 
			Корректировки = Ложь;
			ПоПлану = Ложь;
			СозданныеВБазе = Ложь;
		КонецЕсли;
		
		Если Не Результат ИЛИ (Результат И СозданныеВБазе) Тогда 
			ВыгрузитьДокументыИнвентаризации(тзВыгрузки, Корректировки, СозданныеВБазе);
		КонецЕсли;
		
		Если Результат Тогда 
			ВыгрузитьРасхожденияПоИнвентаризации(тзВыгрузки, ПоПлану);
		КонецЕсли;
		
		//Если Результат И Не СозданныеВБазе Тогда 			
		//	ВыгрузитьРасхожденияПоИнвентаризации(мДокументы, ПоПлану);		
		//Иначе			
		//	ВыгрузитьДокументыИнвентаризации(мДокументы, Корректировки, МассивНовыхИнвентаризаций);
		//КонецЕсли;		
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		ВыгрузитьДокументыПоступлений(мДокументы);
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
		
		ВыгрузитьДокументыВозвратПоставщику(мДокументы);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		
		ВыгрузитьДокументыПеремещенияПриход(мДокументы, ПараметрыВыгрузки);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'");
		
	КонецЕсли;
	
	РезультатОперации = Новый Структура;	
	//Если Не ПустаяСтрока(СообщениеЗавершения) Тогда 
	//	РезультатОперации.Вставить("СообщениеЗавершения", СообщениеЗавершения);
	//КонецЕсли;	
	//РезультатОперации.Вставить("ЕстьОшибки", Не ВсеОк);		
	РезультатОперации.Вставить("СообщенияПользователю", ПолучитьСообщенияПользователю(Истина));
	
	Возврат РезультатОперации;	
	
КонецФункции

Функция ПолучитьДеревоЗаказовЦенников(Параметры) Экспорт 
	
	Перем НачПер, КонПер, Подразделение;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры.Свойство("НачалоПериода", НачПер);
	Параметры.Свойство("КонецПериода", КонПер);
	Параметры.Свойство("Подразделение", Подразделение);	
	
	ДлительныеОперации.СообщитьПрогресс(0, "Подключаемся к внешнему источнику");
	
	ТекстСообщения = "";
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина, Подразделение, ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ЗаказыЦенников",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(Подразделение, Параметры);
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачПер),НачалоДня(НачПер),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонПер),КонецДня(КонПер),КонецДня(ТекущаяДата()));
	
	
	тзДерево = Новый ДеревоЗначений;
	тзДерево.Колонки.Добавить("СкладНоменклатура");
	тзДерево.Колонки.Добавить("ХарактеристикаНоменклатуры");
	тзДерево.Колонки.Добавить("ТипЦенника");
	тзДерево.Колонки.Добавить("Печатать");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCDATE КАК DOCDATE,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID КАК WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументыТовары.ARTID КАК ARTID,
	|	V_ЗагруженныеДокументыТовары.CHARGUID КАК CHARGUID,
	|	V_ЗагруженныеДокументы.ТипЦенника КАК ТипЦенника
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументыТовары КАК V_ЗагруженныеДокументыТовары
	|		ПО V_ЗагруженныеДокументы.DOCID = V_ЗагруженныеДокументыТовары.DOCID
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 1040
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &DOCDATE1 И &DOCDATE2
	|	И V_ЗагруженныеДокументы.WAREAHOUSEGUID В(&WAREAHOUSEGUID)";	
	
	Запрос.УстановитьПараметр("DOCDATE1", Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("DOCDATE2", Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));	
	Запрос.УстановитьПараметр("WAREAHOUSEGUID", ТаблицаСкладов.ВыгрузитьКолонку("guid"));
	
	тзРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ.DOCDATE КАК DOCDATE,
	|	ВТ.WAREAHOUSEGUID КАК WAREAHOUSEGUID,
	|	ВТ.ARTID КАК ARTID,
	|	ВТ.CHARGUID КАК CHARGUID,
	|	ВТ.ТипЦенника КАК ТипЦенника
	|ПОМЕСТИТЬ ВТ_Табл
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.WAREAHOUSEGUID КАК WAREAHOUSEGUID,
	|	ВТ.ARTID КАК Артикул,
	|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ВТ.CHARGUID КАК CHARGUID,
	|	ВТ.ТипЦенника КАК ТипЦенника,
	|	ВЫБОР
	|		КОГДА Номенклатура.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспХар
	|ИЗ
	|	ВТ_Табл КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.ARTID = Номенклатура.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ ПО
	|	WAREAHOUSEGUID";
	
	Запрос.УстановитьПараметр("ВТ", тзРезультатЗапроса);
	
	ВыборкаСклад = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклад.Следующий() Цикл 
		
		текСклад = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(ВыборкаСклад.WAREAHOUSEGUID)));
		ИспользоватьХарактеристики = Не Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(текСклад, ДатаДокументаКон);		
		
		текСтрСклад = тзДерево.Строки.Добавить();
		текСтрСклад.СкладНоменклатура = текСклад;
		текСтрСклад.ТипЦенника = "";
		текСтрСклад.Печатать = Ложь;
		
		ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			нСтрокаТовары = текСтрСклад.Строки.Добавить();
			
			ТоварНайден = ВыборкаНоменклатура.Номенклатура <> ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");			
			
			Если ТоварНайден Тогда 
				нСтрокаТовары.СкладНоменклатура = ВыборкаНоменклатура.Номенклатура;
			Иначе
				нСтрокаТовары.СкладНоменклатура = НСтр("ru = '<Номенклатура не найдена>'; uk = '<Номенклатура не знайдена>'") + "(арт. " + ВыборкаНоменклатура.Артикул + ")";
			КонецЕсли;			
			
			ГуидХарактеристика = СокрЛП(ВыборкаНоменклатура.CHARGUID);
			
			Если ИспользоватьХарактеристики И Не ПустаяСтрока(ГуидХарактеристика) И ГуидХарактеристика <> "00000000-0000-0000-0000-000000000000" Тогда 
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидХарактеристика));
				Если ОбщегоНазначения.СсылкаСуществует(Характеристика) Тогда 
					нСтрокаТовары.ХарактеристикаНоменклатуры = Характеристика;
				КонецЕсли;
			ИначеЕсли ИспользоватьХарактеристики И  ВыборкаНоменклатура.ИспХар Тогда
				нСтрокаТовары.ХарактеристикаНоменклатуры =  Справочники.ХарактеристикиНоменклатуры.ВернутьПоследнееАктивноеМРЦ(ВыборкаНоменклатура.Номенклатура);
			КонецЕсли;
			
			//нСтрокаТовары.ТипЦенника = ?(ВыборкаНоменклатура.ТипЦенника, НСтр("ru = 'Большой'; uk = 'Великий'"), НСтр("ru = 'Маленький'; uk = 'Маленький'"));			
			нСтрокаТовары.ТипЦенника = НСтр("ru = 'Большой'; uk = 'Великий'");			
			нСтрокаТовары.Печатать = ТоварНайден;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	Возврат Новый Структура("ДеревоЦенников", тзДерево);
	
КонецФункции


Функция ПолучитьТаблицуСкладовСКД(НастройкиФормы, Подразделение = Неопределено) Экспорт 
	
	СКД = ПолучитьМакет("ПоляШаблонаСклад");
	
	//СКД = Новый СхемаКомпоновкиДанных;
	
	Если ТипЗнч(НастройкиФормы) = Тип("НастройкиКомпоновкиДанных") Тогда 
		Настройки = НастройкиФормы;				
	Иначе
		Настройки = СКД.НастройкиПоУмолчанию;
	КонецЕсли;
	
	
	ПараметрыНастройки = Настройки.ПараметрыДанных; 
	ПараметрыНастройки.УстановитьЗначениеПараметра("Подразделения", ОбменФронтПовтИсп.МассивПодразделений(Подразделение));	
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД)); 
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); 
	
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки; 
	
	
	//Получим макет компоновки    
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	//Через процессор компоновки получим результат
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
	
	ТаблицаРезультат = Новый ТаблицаЗначений; 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	Возврат ТаблицаРезультат;	
КонецФункции

Функция ПолучитьТаблицуСнятыхЗетОтчетов(ПараметрыЗагрузки, Знач ТаблицаСнятыхЗетОтчетов) Экспорт 
	
	Перем НачалоПериода, КонецПериода, ОтборПоСкладам;	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	ТекстСообщения = "";
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ЖурналЗКС",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);		
	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА V_ЗетОтчеты_xml.isDOWNLOADED = 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Загружен,
	|	НАЧАЛОПЕРИОДА(V_ЗетОтчеты_xml.zreptime, ДЕНЬ) КАК Дата,
	|	V_ЗетОтчеты_xml.zreptime КАК ДатаЗетОтчета,
	|	V_ЗетОтчеты_xml.WORKDAYID,
	|	V_ЗетОтчеты_xml.ZREPFPSN,
	|	V_ЗетОтчеты_xml.ZREPFISCNUM,
	|	V_ЗетОтчеты_xml.SAREAID,
	|	V_ЗетОтчеты_xml.SYSTEMID,
	|	V_ЗетОтчеты_xml.SALESSUM / 100 КАК SALESSUM,
	|	V_ЗетОтчеты_xml.REFSSUM / 100 КАК REFSSUM,
	|	V_ЗетОтчеты_xml.SALESCOUNT,
	//|	"""" КАК ТорговаяПлощадка,
	|   V_ЗетОтчеты_xml.guid,
	|	V_ЗетОтчеты_xml.isRECALCULATED КАК ЧекиПосчитаны
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗетОтчеты_xml КАК V_ЗетОтчеты_xml
	|ГДЕ
	|	V_ЗетОтчеты_xml.zreptime МЕЖДУ &НачПериода И &КонПериода
	|"+	?(ТаблицаСкладов.Количество() = 0 ,""," И V_ЗетОтчеты_xml.guid В(&guid)")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("guid", ТаблицаСкладов.ВыгрузитьКолонку("Guid"));
	
	//тчСнятыеЗетОтчеты = Запрос.Выполнить().Выгрузить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ТекСклад = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.guid));
		ТекОбъект = ТекСклад.ТорговаяПлощадка;
		
		НоваяСтрока = ТаблицаСнятыхЗетОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ТорговаяПлощадка = ТекОбъект;
		НоваяСтрока.Склад = ТекСклад;
		
	КонецЦикла;
	
	//Для Каждого СтрСнятыеЗет Из тчСнятыеЗетОтчеты Цикл 
	//	нстр = ТаблицаСкладов.Найти(СокрЛП(СтрСнятыеЗет.guid),"guid");
	//	Если нстр <> Неопределено Тогда
	//		СтрСнятыеЗет.ТорговаяПлощадка = нстр.Склад;
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	Возврат Новый Структура("СнятыеЗетОтчеты", ТаблицаСнятыхЗетОтчетов);
	
КонецФункции

Процедура УстановитьНовуюДатуЗетОтчета(НоваяДата, Параметры) Экспорт
	
	Отказ = Ложь;
	Connection = ПолучитьСоединение();
	
	Если Connection = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.NEWTIME = Формат(НоваяДата, "ДФ=yyyyMMddЧЧммсс");
	
	ТекстЗапроса = "EXECUTE  [dbo].[MOVE_ZREP] "+Формат(Параметры.SAREAID,"ЧЦ=10; ЧГ=")
	+","+Формат(Параметры.SYSTEMID,"ЧЦ=10; ЧГ=")
	+","+Формат(Параметры.WORKDAYID,"ЧЦ=10; ЧГ=")
	+","+Параметры.NEWTIME+";";
	
	ВыполнитьЗапрос(Connection, Отказ, ТекстЗапроса);	
	
	Если Не Отказ Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Дата %1 установлена'; uk = 'Дата %1 встановлена'"),
		НоваяДата));
		
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьНовуюДатуИнвентаризации(НомерДокумента, НоваяДата) Экспорт
	
	Отказ = Ложь;
	Connection = ПолучитьСоединение();
	Если  Connection = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	//ТекстЗапроса = "EXECUTE  [dbo].[MOVE_ZREP] "+Формат(Параметры.SAREAID,"ЧЦ=10; ЧГ=")
	//+","+Формат(Параметры.SYSTEMID,"ЧЦ=10; ЧГ=")
	//+","+Формат(Параметры.WORKDAYID,"ЧЦ=10; ЧГ=")
	//+","+Параметры.NEWTIME+";";
	
	ТекстЗапроса = "use IntegrationTransit
	|declare @docnum varchar(50) = '"+НомерДокумента+"'
	|declare @newdocdate bigint = "+Формат(НоваяДата, "ДФ=yyyyMMddЧЧммсс")+"
	|
	|update IntegrationTransit.dbo.LOCALDOC set DOCDATE=@newdocdate where docid in (
	|select docid from LOCALDOC where DOCNUM like @docnum)
	|
	|update dataserver.dbo.LOCALDOCUPDATES set UPDATETIME=@newdocdate where docid in (
	|select docid from LOCALDOC where DOCNUM like @docnum)
	|
	|update IntegrationTransit.dbo.LOCALDOCSYNC set DOCSYNCTIME=@newdocdate where docid in (
	|select docid from LOCALDOC where DOCNUM like @docnum)";
	
	ВыполнитьЗапрос(Connection,Отказ,ТекстЗапроса);
	
	Возврат Не Отказ;
	
КонецФункции


#КонецОбласти



#Область СлужебныеПроцедурыИФункции


Функция ЗагрузитьТаблицуДокументовЗакрытиеСмены(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,ВидСравнения,ЗначениеОтбора, Проверка;
	
	ТекстСообщения = "";
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ЗКС",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Соединение не установлено: '; uk = 'З''єднання не встановлено: '") + ТекстСообщения);
		Возврат Новый Структура("ОК", Ложь);
	КонецЕсли;
	
	
	ТаблицаДокументов.Очистить();
	ТаблицаСнятыхЗетОтчетов.Очистить();
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);			
	
	Проверка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Проверка", Ложь);
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);	
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	V_ЗетОтчеты_xml.WORKDAYID,
	|	V_ЗетОтчеты_xml.guid,
	|	V_ЗетОтчеты_xml.ZREPFPSN,
	|	V_ЗетОтчеты_xml.ZREPFISCNUM,
	|	V_ЗетОтчеты_xml.zreptime,
	|	НАЧАЛОПЕРИОДА(V_ЗетОтчеты_xml.zreptime, ДЕНЬ) КАК Дата,
	|	V_ЗетОтчеты_xml.SAREAID,
	|	V_ЗетОтчеты_xml.SYSTEMID,
	|	V_ЗетОтчеты_xml.ZREPDATA,
	|	V_ЗетОтчеты_xml.SALESSUM,
	|	V_ЗетОтчеты_xml.REFSSUM,
	|	V_ЗетОтчеты_xml.SALESCOUNT,
	|	V_ЗетОтчеты_xml.isRECALCULATED КАК ЧекиПосчитаны,
	|	V_ЗетОтчеты_xml.isDOWNLOADED КАК ЗетЗагружен
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗетОтчеты_xml КАК V_ЗетОтчеты_xml
	|ГДЕ
	|	V_ЗетОтчеты_xml.zreptime МЕЖДУ &НачПериода И &КонПериода
	|	И V_ЗетОтчеты_xml.isRECALCULATED = 1
	|	"+?(Проверка," И V_ЗетОтчеты_xml.isDOWNLOADED = 0 ","")+"
	|	И ""Условие"" = 1";
	
	Если ОтборПоСкладам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1"," И V_ЗетОтчеты_xml.guid В (&WAREAHOUSEGUID)");
		
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("guid");	
		Запрос.УстановитьПараметр("WAREAHOUSEGUID",МассивСкладов);
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1","");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода",ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонПериода",ДатаДокументаКон);
	
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		нСклад = ТаблицаСкладов.Найти(НРег(СокрЛП(Выборка.guid)),"guid");
		Если нСклад = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		нЗетка = ТаблицаСнятыхЗетОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(нЗетка,Выборка);
		нЗетка.СкладКомпании = нСклад.СкладКомпании;
		
	КонецЦикла;
	
	Если ТаблицаСнятыхЗетОтчетов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Таблица Z-отчетов пустая'; uk = 'Таблиця Z-звітів порожня'");
		ЗаписьЖурналаРегистрации("Загрузка.ЗКС",УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		
		Возврат Новый Структура("СообщениеЗавершения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов", ТекстСообщения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
	КонецЕсли;
	
	тзСкладыЗетОтчетов = ТаблицаСнятыхЗетОтчетов.Скопировать(,"Дата,СкладКомпании");
	тзСкладыЗетОтчетов.Свернуть("Дата,СкладКомпании");
	тзСкладыЗетОтчетов.Сортировать("Дата Возр, СкладКомпании Убв");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеСмены.Ссылка КАК Документ,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Дата, ДЕНЬ) КАК ДатаДокумента,
	|	ЗакрытиеСмены.СкладКомпании КАК СкладКомпании,
	|	ЗакрытиеСмены.Проведен КАК Проведен
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеСмены.СкладКомпании В(&СкладКомпании)
	|	И ЗакрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ЗакрытиеСмены.РегламентированныйУчет"; // Временное решение - для того, чтобы не затирались созданые вручную Закрытия смены Vov41k 30.03.2022
	
	Запрос.УстановитьПараметр("КонецПериода", ДатаДокументаКон);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаДокументаНач);
	Запрос.УстановитьПараметр("СкладКомпании", тзСкладыЗетОтчетов.ВыгрузитьКолонку("СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзЗагруженныеДокументы = РезультатЗапроса.Выгрузить();
	тзЗагруженныеДокументы.Индексы.Добавить("ДатаДокумента,СкладКомпании");
	
	Для Каждого СнятаяЗетка Из тзСкладыЗетОтчетов Цикл 
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.Склад = СнятаяЗетка.СкладКомпании;
		нДокументЗагрузки.Дата  = СнятаяЗетка.Дата;
		мДокументЗакрытия =	тзЗагруженныеДокументы.НайтиСтроки(Новый Структура("ДатаДокумента,СкладКомпании",СнятаяЗетка.Дата, СнятаяЗетка.СкладКомпании));
		
		Если мДокументЗакрытия.Количество() = 0 Тогда
			ПредставлениеДокумента = "(Новый) " +Формат(СнятаяЗетка.Дата,"ДФ='<< yyyy-MM-dd >>'") +" "+ Строка(СнятаяЗетка.СкладКомпании);
			нДокументЗагрузки.Пометка = Истина;
			
		Иначе
			сДокумента = мДокументЗакрытия[0];
			нДокументЗагрузки.Документ  = сДокумента.Документ; 
			ПредставлениеДокумента = "(Загружен)";
			Если сДокумента.Проведен Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + " проведен";
				нДокументЗагрузки.Обработан = Истина;
			Иначе
				ПредставлениеДокумента = ПредставлениеДокумента + " не проведен" ;
				нДокументЗагрузки.Пометка = Истина;
			КонецЕсли;
			
			ПредставлениеДокумента =  ПредставлениеДокумента + " "+Формат(СнятаяЗетка.Дата,"ДФ='<< yyyy-MM-dd >>'")+" "+ Строка(СнятаяЗетка.СкладКомпании) + " документ: "+Строка(нДокументЗагрузки.Документ);
			
			
		КонецЕсли;	
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
		Если Проверка Тогда
			нДокументЗагрузки.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Проверка Тогда
		МассивСкладов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСнятыхЗетОтчетов.ВыгрузитьКолонку("guid"));
		
		ТаблицаСнятыхЗетОтчетов.Очистить();			
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	V_ЗетОтчеты_xml.WORKDAYID,
		|	V_ЗетОтчеты_xml.guid,
		|	V_ЗетОтчеты_xml.ZREPFPSN,
		|	V_ЗетОтчеты_xml.ZREPFISCNUM,
		|	V_ЗетОтчеты_xml.zreptime,
		|	НАЧАЛОПЕРИОДА(V_ЗетОтчеты_xml.zreptime, ДЕНЬ) КАК Дата,
		|	V_ЗетОтчеты_xml.SAREAID,
		|	V_ЗетОтчеты_xml.SYSTEMID,
		|	V_ЗетОтчеты_xml.ZREPDATA,
		|	V_ЗетОтчеты_xml.SALESSUM,
		|	V_ЗетОтчеты_xml.REFSSUM,
		|	V_ЗетОтчеты_xml.SALESCOUNT,
		|	V_ЗетОтчеты_xml.isRECALCULATED КАК ЧекиПосчитаны,
		|	V_ЗетОтчеты_xml.isDOWNLOADED КАК ЗетЗагружен
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗетОтчеты_xml КАК V_ЗетОтчеты_xml
		|ГДЕ
		|	V_ЗетОтчеты_xml.zreptime МЕЖДУ &НачПериода И &КонПериода
		|	И V_ЗетОтчеты_xml.guid В (&WAREAHOUSEGUID)";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("НачПериода",ДатаДокументаНач);
		Запрос.УстановитьПараметр("КонПериода",ДатаДокументаКон);
		Запрос.УстановитьПараметр("WAREAHOUSEGUID",МассивСкладов);
		
		Рез = Запрос.Выполнить();
		
		Выборка = Рез.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			нСклад = ТаблицаСкладов.Найти(НРег(СокрЛП(Выборка.guid)),"guid");
			Если нСклад = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			нЗетка = ТаблицаСнятыхЗетОтчетов.Добавить();
			ЗаполнитьЗначенияСвойств(нЗетка,Выборка);
			нЗетка.СкладКомпании = нСклад.СкладКомпании;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("ТаблицаСнятыхЗетОтчетов", ТаблицаСнятыхЗетОтчетов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьТаблицуДокументовИнвентаризация(ПараметрыЗагрузки, ТаблицаДокументов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,БезСозданныхНаТочках,МассивСкладов;
	
	ТекстСообщения = "";
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина, ПараметрыЗагрузки.Подразделение, ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.Инвентаризация",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);	
	ПараметрыЗагрузки.Свойство("БезСозданныхНаТочках" ,БезСозданныхНаТочках);
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);
	
	Если ОтборПоСкладам Тогда  
		ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("guid");
	КонецЕсли;
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	V_Инвентаризации.DOCGUID,
	|	V_Инвентаризации.PARENTDOCGUID,
	|	V_Инвентаризации.WAREAHOUSEGUID,
	|	V_Инвентаризации.DOCID,
	|	V_Инвентаризации.DOCDATE,
	|	V_Инвентаризации.DOCNUM,
	|	V_Инвентаризации.CALCTIME,
	|	V_Инвентаризации.DOCSYNCTIME
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_Инвентаризации КАК V_Инвентаризации
	|ГДЕ
	|	V_Инвентаризации.DOCTYPE = 3
	|	И V_Инвентаризации.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	V_Инвентаризации.DOCGUID,
	|	V_Инвентаризации.PARENTDOCGUID,
	|	V_Инвентаризации.WAREAHOUSEGUID,
	|	V_Инвентаризации.DOCID,
	|	V_Инвентаризации.DOCDATE,
	|	V_Инвентаризации.DOCNUM,
	|	V_Инвентаризации.CALCTIME,
	|	V_Инвентаризации.DOCSYNCTIME
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_Инвентаризации КАК V_Инвентаризации
	|ГДЕ
	|	V_Инвентаризации.DOCTYPE = 1003
	|	И V_Инвентаризации.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1";
	
	Если ОтборПоСкладам Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1"," И V_Инвентаризации.WAREAHOUSEGUID В (&WAREAHOUSEGUID)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода",Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("КонПериода",Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));
	Запрос.УстановитьПараметр("WAREAHOUSEGUID",МассивСкладов);
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Получаем данные'; uk = 'Отримуємо дані'"));
	
	Рез = Запрос.Выполнить();		//	Запрос.Выполнить().Выгрузить()
	
	Выборка = Рез.Выбрать();
	ТаблицаДокументов.Очистить();
	
	ТаблицаКорректировок = Новый ТаблицаЗначений;
	ТаблицаКорректировок.Колонки.Добавить("ID_Основания");
	
	КоличествоВыборки = Выборка.Количество();
	Ит = 0;
	
	Пока Выборка.Следующий() Цикл
		Ит = Ит + 1;	
		ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
		Ит, 
		КоличествоВыборки));				
		
		
		Если ПустаяСтрока(СокрЛП(Выборка.DOCGUID)) И БезСозданныхНаТочках Тогда
			Продолжить;
		КонецЕсли;
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.ID_Документа = СокрЛП(Выборка.DOCGUID);
		нДокументЗагрузки.ID_Основания = СокрЛП(Выборка.PARENTDOCGUID);
		
		нДокументЗагрузки.ID_Склада    = СокрЛП(Выборка.WAREAHOUSEGUID);
		нДокументЗагрузки.DOCID 	   = Выборка.DOCID;
		нДокументЗагрузки.Дата         = Дата(Формат(Выборка.CALCTIME,"ЧЦ=14; ЧГ="));
		нДокументЗагрузки.ДатаЗагрузки = Дата(Формат(Выборка.DOCSYNCTIME,"ЧЦ=14; ЧГ="));
		нДокументЗагрузки.Номер        = СокрЛП(Выборка.DOCNUM);
		нДокументЗагрузки.Склад        = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.WAREAHOUSEGUID)));
		нДокументЗагрузки.Розничный    = нДокументЗагрузки.Склад.Розничный;
		нДокументЗагрузки.ТипЦенРозничный = нДокументЗагрузки.Склад.ТипЦенРозничнойТорговли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&Дата, ТорговаяПлощадка = ВЫРАЗИТЬ(&Склад КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних");
		
		Запрос.УстановитьПараметр("Дата", нДокументЗагрузки.Дата);
		Запрос.УстановитьПараметр("Склад", нДокументЗагрузки.Склад);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда 
			нДокументЗагрузки.Организация = Результат.Организация;
		КонецЕсли;
		
		
		ПредставлениеДокумента = "";
		
		Если ЗначениеЗаполнено(нДокументЗагрузки.ID_Основания) Тогда
			ДокСсылкаОснование   = Документы.Инвентаризация.ПолучитьСсылку(Новый УникальныйИдентификатор(нДокументЗагрузки.ID_Основания));
			ПредставлениеДокумента = ПредставлениеДокумента + "(Корректировака) ";
			Если ДокСсылкаОснование.Проведен Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
				нДокументЗагрузки.Обработан = Истина;
			Иначе
				нДокументЗагрузки.Пометка = Истина;
			КонецЕсли;
			нДокументЗагрузки.Документ = ДокСсылкаОснование;
			нтзКорректировки = ТаблицаКорректировок.Добавить();
			нтзКорректировки.ID_Основания =  нДокументЗагрузки.ID_Основания
			
			
		ИначеЕсли ПустаяСтрока(нДокументЗагрузки.ID_Документа) Тогда
			
			ЗапросИН = Новый Запрос;
			ЗапросИН.Текст = 
			"ВЫБРАТЬ
			|	Инвентаризация.Ссылка
			|ИЗ
			|	Документ.Инвентаризация КАК Инвентаризация
			|ГДЕ
			|	Инвентаризация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И Инвентаризация.НомерRB = &НомерRB";
			
			ЗапросИН.УстановитьПараметр("НачалоПериода", НачалоДня(нДокументЗагрузки.Дата));
			ЗапросИН.УстановитьПараметр("КонецПериода", КонецДня(нДокументЗагрузки.Дата));
			ЗапросИН.УстановитьПараметр("НомерRB", нДокументЗагрузки.Номер);
			
			РезультатЗапросаИН = ЗапросИН.Выполнить();
			Если РезультатЗапросаИН.Пустой() Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				ВыборкаДетальныеЗаписиИН = РезультатЗапросаИН.Выбрать();
				
				ВыборкаДетальныеЗаписиИН.Следующий();
				ДокСсылка = ВыборкаДетальныеЗаписиИН.Ссылка;
				Если ДокСсылка.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
				нДокументЗагрузки.Документ = ДокСсылка;
			КонецЕсли;
			
			
		Иначе	
			ДокСсылка   = Документы.Инвентаризация.ПолучитьСсылку(Новый УникальныйИдентификатор(нДокументЗагрузки.ID_Документа));
			
			Если Не ОбщегоНазначения.СсылкаСуществует(ДокСсылка) Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				нДокументЗагрузки.Документ = ДокСсылка;	
				Если ДокСсылка.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					//Была выгружена корректировка, но еще не подтвердили.
					Если Найти(ДокСсылка.Комментарий,"Кор -") > 0 Тогда
						ПредставлениеДокумента = ПредставлениеДокумента + "(Выгружена корректировка)";
						нДокументЗагрузки.Обработан = Истина;
						
					Иначе
						ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
						нДокументЗагрузки.Пометка = Истина;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ПредставлениеДокумента  = ПредставлениеДокумента + " №" + Выборка.DOCNUM + " от "+ нДокументЗагрузки.ДатаЗагрузки + " => склад: " +Строка(нДокументЗагрузки.Склад);
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
	КонецЦикла;
	
	ТаблицаКорректировок.Свернуть("ID_Основания");
	Если ТаблицаКорректировок.Количество() > 0 Тогда
		Для Каждого стТаблицаКорректировок Из ТаблицаКорректировок Цикл 
			мСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("ID_Документа", стТаблицаКорректировок.ID_Основания));
			Для Каждого стрМСтроки Из мСтроки Цикл 
				стрМСтроки.Пометка   = Ложь;
				стрМСтроки.Обработан = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьТаблицуДокументовПоступлениеТоваров(ПараметрыЗагрузки, ТаблицаДокументов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,МассивСкладов;
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	ТекстСообщения = "";
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ПоступлениеТоваров",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТаблицаДокументов.Очистить();
	
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);	
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);
	
	Если ОтборПоСкладам Тогда 		
		ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("guid");
	КонецЕсли;
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCGUID,
	|	V_ЗагруженныеДокументы.DOCID,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументы.DOCDATE,
	|	V_ЗагруженныеДокументы.DOCNUM,
	|	V_ЗагруженныеДокументы.COMPANYGUID,
	|	V_ЗагруженныеДокументы.НомерВходящегоДокумента,
	|	V_ЗагруженныеДокументы.ДатаВходящегоДокумента
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 2
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCGUID,
	|	V_ЗагруженныеДокументы.DOCID,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументы.DOCDATE,
	|	V_ЗагруженныеДокументы.DOCNUM,
	|	V_ЗагруженныеДокументы.COMPANYGUID,
	|	V_ЗагруженныеДокументы.НомерВходящегоДокумента,
	|	V_ЗагруженныеДокументы.ДатаВходящегоДокумента
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 1002
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1";
	
	Если ОтборПоСкладам Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1"," И V_ЗагруженныеДокументы.WAREAHOUSEGUID В (&WAREAHOUSEGUID)");
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода", Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("КонПериода", Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));
	Запрос.УстановитьПараметр("WAREAHOUSEGUID", МассивСкладов);
	
	ДлительныеОперации.СообщитьПрогресс(1, НСтр("ru = 'Получаем данные'; uk = 'Отримуємо данні'"));
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	КоличествоВыборки = Выборка.Количество();
	Ит = 0;
	
	Пока Выборка.Следующий() Цикл 
		
		ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
		Ит, 
		КоличествоВыборки));
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.ID_Документа = СокрЛП(Выборка.DOCGUID);
		нДокументЗагрузки.ID_Склада    = СокрЛП(Выборка.WAREAHOUSEGUID);
		нДокументЗагрузки.DOCID 	   = Выборка.DOCID;
		нДокументЗагрузки.Дата         = Дата(Формат(Выборка.DOCDATE,"ЧЦ=14; ЧГ="));
		нДокументЗагрузки.Номер        = СокрЛП(Выборка.DOCNUM);
		нДокументЗагрузки.НомерВходящегоДокумента        = СокрЛП(Выборка.НомерВходящегоДокумента);
		нДокументЗагрузки.ДатаВходящегоДокумента         = Выборка.ДатаВходящегоДокумента;
		
		нДокументЗагрузки.Склад        = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.WAREAHOUSEGUID)));
		Если ЗначениеЗаполнено(Выборка.COMPANYGUID) Тогда
			нДокументЗагрузки.Контрагент =  Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.COMPANYGUID)));
		Иначе
			нДокументЗагрузки.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&Дата, ТорговаяПлощадка = ВЫРАЗИТЬ(&Склад КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних");
		
		Запрос.УстановитьПараметр("Дата", нДокументЗагрузки.Дата);
		Запрос.УстановитьПараметр("Склад", нДокументЗагрузки.Склад);
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда 
			нДокументЗагрузки.Организация = Результат.Организация;
		КонецЕсли;
		
		ПредставлениеДокумента = "";
		
		Если ПустаяСтрока(нДокументЗагрузки.ID_Документа) Тогда
			нДокументЗагрузки.Документ = Документы.ПоступлениеТоваров.ПустаяСсылка();
			ЗапросПТ = Новый Запрос;
			ЗапросПТ.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ПоступлениеТоваров.Ссылка КАК Ссылка,
			|	ПоступлениеТоваров.Контрагент КАК Контрагент,
			|	ПоступлениеТоваров.Проведен КАК Проведен
			|ИЗ
			|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			|ГДЕ
			|	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ПоступлениеТоваров.НомерRB = &НомерRB";
			
			ЗапросПТ.УстановитьПараметр("НачалоПериода", НачалоДня(нДокументЗагрузки.Дата - 864000));
			ЗапросПТ.УстановитьПараметр("КонецПериода", КонецДня(нДокументЗагрузки.Дата + 864000));
			ЗапросПТ.УстановитьПараметр("НомерRB", нДокументЗагрузки.Номер);
			
			РезультатЗапроса = ЗапросПТ.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка;
				Если ВыборкаДетальныеЗаписи.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
				нДокументЗагрузки.Документ = ДокСсылка;
			КонецЕсли;
			
		Иначе	
			
			ДокСсылка   = Документы.ПоступлениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(нДокументЗагрузки.ID_Документа));			
			
			Если Не ОбщегоНазначения.СсылкаСуществует(ДокСсылка) Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;				
			Иначе
				
				нДокументЗагрузки.Документ = ДокСсылка;	
				Если ДокСсылка.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеДокумента  = ПредставлениеДокумента + " № " + Выборка.DOCNUM + " от "+ нДокументЗагрузки.Дата + " => склад: " +Строка(нДокументЗагрузки.Склад);//+" Поставщик : "+Строка(нДокументЗагрузки.Документ.Контрагент);
		Если ЗначениеЗаполнено(нДокументЗагрузки.Документ) Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + "Поставщик: " + Строка(нДокументЗагрузки.Документ.Контрагент);
		КонецЕсли;
		
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
		Ит = Ит + 1;
	КонецЦикла;
	
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;	
	
КонецФункции

Функция ЗагрузитьТаблицуДокументовТКС(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаТКС)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,ВидСравнения,ЗначениеОтбора;
	
	ТекстСообщения = "";
	
	ДлительныеОперации.СообщитьПрогресс(0, "Подключаемся к внешнему источнику");
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ТКС",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Соединение не установлено: '; uk = 'З''єднання не встановлено: '") + ТекстСообщения);
		Возврат Новый Структура("ОК", Ложь);
	КонецЕсли;	
	
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);	
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	
	ТаблицаДокументов.Очистить();
	ТаблицаТКС.Очистить();
	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	V_ТКС.Дата,
	|	V_ТКС.МагазинГУИД,
	|	V_ТКС.МагазинИД КАК НомерМагазина,
	|	V_ТКС.КассаИД КАК НомерКассы,
	|	V_ТКС.СменаИД КАК НомерСмены,
	|	V_ТКС.ЧекИД КАК НомерЧека,
	|	V_ТКС.КартаОплаты КАК НомерКарты,
	|	V_ТКС.Возврат КАК ПризнакВозврата,
	|	V_ТКС.Сумма / 100 КАК Сумма,
	|	V_ТКС.Скидка / 100 КАК Скидка,
	|	V_ТКС.Строки КАК КоличествоСтрок
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ТКС КАК V_ТКС
	|ГДЕ
	|	V_ТКС.Дата МЕЖДУ &НачПериода И &КонПериода";
	
	Запрос.УстановитьПараметр("НачПериода",ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонПериода",ДатаДокументаКон);
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Получаем данные'; uk = 'Отримуємо дані'"));
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		нСклад = ТаблицаСкладов.Найти(НРег(СокрЛП(Выборка.МагазинГУИД)),"guid");
		Если нСклад = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		нТКС = ТаблицаТКС.Добавить();
		ЗаполнитьЗначенияСвойств(нТКС,Выборка);
		нТКС.СкладКомпании = нСклад.СкладКомпании;
		нТКС.GuidСистемыСоздания = Формат(Выборка.Дата,"ДФ=ddMMyyyyЧЧммсс")
		+Формат(Выборка.НомерМагазина,"ЧЦ=15; ЧГ=")
		+Формат(Выборка.НомерКассы,"ЧЦ=15; ЧГ=")
		+Формат(Выборка.НомерСмены,"ЧЦ=15; ЧГ=")
		+Формат(Выборка.НомерЧека,"ЧЦ=15; ЧГ=");				
		
	КонецЦикла;
	
	
	
	тзСкладыТКС = ТаблицаТКС.Скопировать(,"Дата,СкладКомпании");
	тзСкладыТКС.Свернуть("Дата,СкладКомпании");
	тзСкладыТКС.Сортировать("Дата Возр, СкладКомпании Убв");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Ссылка КАК Документ,
	|	НАЧАЛОПЕРИОДА(РеализацияТоваров.Дата, ДЕНЬ) КАК ДатаДокумента,
	|	РеализацияТоваров.СкладКомпании КАК СкладКомпании,
	|	РеализацияТоваров.Проведен КАК Проведен,
	|	РеализацияТоваров.GuidСистемыСоздания КАК GuidСистемыСоздания
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И РеализацияТоваров.СкладКомпании В(&СкладКомпании)
	|	И НЕ РеализацияТоваров.ПометкаУдаления
	|	И РеализацияТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровРозница)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателя.Ссылка,
	|	НАЧАЛОПЕРИОДА(ВозвратОтПокупателя.Дата, ДЕНЬ),
	|	ВозвратОтПокупателя.СкладКомпании,
	|	ВозвратОтПокупателя.Проведен,
	|	ВозвратОтПокупателя.GuidСистемыСоздания
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И ВозвратОтПокупателя.СкладКомпании В(&СкладКомпании)
	|	И НЕ ВозвратОтПокупателя.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КонПериода", ДатаДокументаКон);
	Запрос.УстановитьПараметр("НачПериода", ДатаДокументаНач);
	Запрос.УстановитьПараметр("СкладКомпании", тзСкладыТКС.ВыгрузитьКолонку("СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзЗагруженныеДокументы = РезультатЗапроса.Выгрузить();
	тзЗагруженныеДокументы.Индексы.Добавить("GuidСистемыСоздания");
	
	Для Каждого ЧекТКС Из ТаблицаТКС Цикл 
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.Склад = ЧекТКС.СкладКомпании;
		нДокументЗагрузки.Дата  = ЧекТКС.Дата;
		нДокументЗагрузки.GuidСистемыСоздания  = ЧекТКС.GuidСистемыСоздания;
		
		
		мДокументЗакрытия =	тзЗагруженныеДокументы.НайтиСтроки(Новый Структура("GuidСистемыСоздания",ЧекТКС.GuidСистемыСоздания));
		
		Если мДокументЗакрытия.Количество() = 0 Тогда
			ПредставлениеДокумента = "(Новый) " +Формат(ЧекТКС.Дата,"ДФ='<< yyyy-MM-dd >>'") +" "+ Строка(ЧекТКС.СкладКомпании);
			нДокументЗагрузки.Пометка = Истина;
			
		Иначе
			сДокумента = мДокументЗакрытия[0];
			нДокументЗагрузки.Документ  = сДокумента.Документ; 
			ПредставлениеДокумента = "(Загружен)";
			Если сДокумента.Проведен Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + " проведен";
				нДокументЗагрузки.Обработан = Истина;
			Иначе
				ПредставлениеДокумента = ПредставлениеДокумента + " не проведен" ;
				нДокументЗагрузки.Пометка = Истина;
			КонецЕсли;
			
			ПредставлениеДокумента =  ПредставлениеДокумента + " "+Формат(ЧекТКС.Дата,"ДФ='<< yyyy-MM-dd >>'")+" "+ Строка(ЧекТКС.СкладКомпании) + " документ: "+Строка(нДокументЗагрузки.Документ);
			
			
		КонецЕсли;	
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
	КонецЦикла;
	
	
	ТаблицаТКС.Сортировать("Дата Возр");
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("ТаблицаТКС", ТаблицаТКС);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;
	
	
КонецФункции

Функция ЗагрузитьТаблицуДокументовПеремещения(ПараметрыЗагрузки, ТаблицаДокументов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,МассивСкладов ;
	
	ТекстСообщения = "";
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.ПеремещениеТоваров",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);	
	МассивСкладов = Новый Массив;
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);
	
	Если ОтборПоСкладам Тогда 		
		ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("guid");
	КонецЕсли;
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCGUID КАК DOCGUID,
	|	V_ЗагруженныеДокументы.DOCID КАК DOCID,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID КАК WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументы.DOCDATE КАК DOCDATE,
	|	V_ЗагруженныеДокументы.DOCNUM КАК DOCNUM
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 18
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCGUID,
	|	V_ЗагруженныеДокументы.DOCID,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументы.DOCDATE,
	|	V_ЗагруженныеДокументы.DOCNUM
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 1018
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1";
	
	Если ОтборПоСкладам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1"," И (V_ЗагруженныеДокументы.WAREAHOUSEGUID В (&WAREAHOUSEGUID) ИЛИ V_ЗагруженныеДокументы.SECONDARYWHGUID В (&WAREAHOUSEGUID))");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1","");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода",Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("КонПериода",Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));
	Запрос.УстановитьПараметр("WAREAHOUSEGUID",МассивСкладов);
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		тСклад = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.WAREAHOUSEGUID)));
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();		
		нДокументЗагрузки.ID_Документа = СокрЛП(Выборка.DOCGUID);
		нДокументЗагрузки.ID_Склада    = СокрЛП(Выборка.WAREAHOUSEGUID);
		нДокументЗагрузки.DOCID 	   = Выборка.DOCID;
		нДокументЗагрузки.Дата         = Дата(Формат(Выборка.DOCDATE,"ЧЦ=14; ЧГ="));
		нДокументЗагрузки.Номер        = СокрЛП(Выборка.DOCNUM);
		нДокументЗагрузки.Склад        = тСклад;
		нДокументЗагрузки.Организация  = Справочники.СкладыКомпании.ОрганизацияСклада(тСклад, ?(ЗначениеЗаполнено(нДокументЗагрузки.Дата), нДокументЗагрузки.Дата, ТекущаяДата()));		
		нДокументЗагрузки.Розничный	   = тСклад.Розничный;
		
		ПредставлениеДокумента = "";
		
		Если ПустаяСтрока(нДокументЗагрузки.ID_Документа) Тогда
			
			ЗапросПТ = Новый Запрос;
			ЗапросПТ.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ПеремещениеТоваров.Ссылка КАК Ссылка,
			|	ПеремещениеТоваров.Проведен КАК Проведен
			|ИЗ
			|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			|ГДЕ
			|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ПеремещениеТоваров.НомерRB = &НомерRB";
			
			ЗапросПТ.УстановитьПараметр("НачалоПериода", НачалоДня(нДокументЗагрузки.Дата - 864000));
			ЗапросПТ.УстановитьПараметр("КонецПериода", КонецДня(нДокументЗагрузки.Дата + 864000));
			ЗапросПТ.УстановитьПараметр("НомерRB", нДокументЗагрузки.Номер);
			
			РезультатЗапроса = ЗапросПТ.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка;
				Если ВыборкаДетальныеЗаписи.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
				нДокументЗагрузки.Документ = ДокСсылка;
			КонецЕсли;
			
			
		Иначе	
			ДокСсылка   = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(нДокументЗагрузки.ID_Документа));
			
			Если Не ОбщегоНазначения.СсылкаСуществует(ДокСсылка) Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				нДокументЗагрузки.Документ = ДокСсылка;	
				Если ДокСсылка.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ПредставлениеДокумента  = ПредставлениеДокумента + " № " + Выборка.DOCNUM + " от "+ нДокументЗагрузки.Дата + " => склад: " +Строка(нДокументЗагрузки.Склад);//+" => склад получатель: "+Строка(нДокументЗагрузки.СкладПолучатель);
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;	
	
КонецФункции

Функция ЗагрузитьТаблицуДокументовВозвратПоставщику(ПараметрыЗагрузки, ТаблицаДокументов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,МассивСкладов;
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	ТекстСообщения = "";
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина,ПараметрыЗагрузки.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("ЗагрузкаСписка.ВозвратПоставщику",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТаблицаДокументов.Очистить();
	
	
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);	
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);
	
	Если ОтборПоСкладам Тогда 		
		ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.Подразделение, ПараметрыЗагрузки);
		МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("guid");
	КонецЕсли;
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	V_ЗагруженныеДокументы.DOCGUID КАК DOCGUID,
	|	V_ЗагруженныеДокументы.DOCID КАК DOCID,
	|	V_ЗагруженныеДокументы.WAREAHOUSEGUID КАК WAREAHOUSEGUID,
	|	V_ЗагруженныеДокументы.DOCDATE КАК DOCDATE,
	|	V_ЗагруженныеДокументы.DOCNUM КАК DOCNUM,
	|	V_ЗагруженныеДокументы.COMPANYGUID КАК COMPANYGUID,
	|	V_ЗагруженныеДокументы.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	V_ЗагруженныеДокументы.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументы КАК V_ЗагруженныеДокументы
	|ГДЕ
	|	V_ЗагруженныеДокументы.DOCTYPE = 1004
	|	И V_ЗагруженныеДокументы.DOCDATE МЕЖДУ &НачПериода И &КонПериода
	|	И ""Условие"" = 1";
	
	Если ОтборПоСкладам Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1"," И V_ЗагруженныеДокументы.WAREAHOUSEGUID В (&WAREAHOUSEGUID)");
	Иначе 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И ""Условие"" = 1", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода", Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("КонПериода", Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));
	Запрос.УстановитьПараметр("WAREAHOUSEGUID", МассивСкладов);
	
	ДлительныеОперации.СообщитьПрогресс(1, НСтр("ru = 'Получаем данные'; uk = 'Отримуємо данні'"));
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	КоличествоВыборки = Выборка.Количество();
	Ит = 0;
	
	Пока Выборка.Следующий() Цикл 
		
		ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
		Ит, 
		КоличествоВыборки));
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.ID_Документа = СокрЛП(Выборка.DOCGUID);
		нДокументЗагрузки.ID_Склада    = СокрЛП(Выборка.WAREAHOUSEGUID);
		нДокументЗагрузки.DOCID 	   = Выборка.DOCID;
		нДокументЗагрузки.Дата         = Дата(Формат(Выборка.DOCDATE,"ЧЦ=14; ЧГ="));
		нДокументЗагрузки.Номер        = СокрЛП(Выборка.DOCNUM);
		нДокументЗагрузки.НомерВходящегоДокумента        = СокрЛП(Выборка.НомерВходящегоДокумента);
		нДокументЗагрузки.ДатаВходящегоДокумента         = Выборка.ДатаВходящегоДокумента;
		
		нДокументЗагрузки.Склад        = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.WAREAHOUSEGUID)));
		Если ЗначениеЗаполнено(Выборка.COMPANYGUID) Тогда
			нДокументЗагрузки.Контрагент =  Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.COMPANYGUID)));
		Иначе
			нДокументЗагрузки.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
		нДокументЗагрузки.Организация = Справочники.СкладыКомпании.ОрганизацияСклада(нДокументЗагрузки.Склад, нДокументЗагрузки.Дата);
		
		ПредставлениеДокумента = "";
		
		Если ПустаяСтрока(нДокументЗагрузки.ID_Документа) Тогда
			нДокументЗагрузки.Документ = ПредопределенноеЗначение("Документ.ВозвратПоставщику.ПустаяСсылка");			
			ЗапросПТ = Новый Запрос;
			ЗапросПТ.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВозвратПоставщику.Ссылка КАК Ссылка,
			|	ВозвратПоставщику.Контрагент КАК Контрагент,
			|	ВозвратПоставщику.Проведен КАК Проведен
			|ИЗ
			|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
			|ГДЕ
			|	ВозвратПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ВозвратПоставщику.НомерRB = &НомерRB";
			
			ЗапросПТ.УстановитьПараметр("НачалоПериода", НачалоДня(нДокументЗагрузки.Дата - 864000));
			ЗапросПТ.УстановитьПараметр("КонецПериода", КонецДня(нДокументЗагрузки.Дата + 864000));
			ЗапросПТ.УстановитьПараметр("НомерRB", нДокументЗагрузки.Номер);
			
			РезультатЗапроса = ЗапросПТ.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;
			Иначе
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				ДокСсылка = ВыборкаДетальныеЗаписи.Ссылка;
				Если ВыборкаДетальныеЗаписи.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
				нДокументЗагрузки.Документ = ДокСсылка;
			КонецЕсли;
			
		Иначе	
			
			ДокСсылка   = Документы.ВозвратПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(нДокументЗагрузки.ID_Документа));			
			
			Если Не ОбщегоНазначения.СсылкаСуществует(ДокСсылка) Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + "(Новый)";
				нДокументЗагрузки.Пометка = Истина;				
			Иначе
				
				нДокументЗагрузки.Документ = ДокСсылка;	
				Если ДокСсылка.Проведен Тогда
					ПредставлениеДокумента = ПредставлениеДокумента + "(Проведен)";
					нДокументЗагрузки.Обработан = Истина;
				Иначе
					ПредставлениеДокумента = ПредставлениеДокумента + "(Не проведен)";
					нДокументЗагрузки.Пометка = Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеДокумента  = ПредставлениеДокумента + " № " + Выборка.DOCNUM + " от "+ нДокументЗагрузки.Дата + " => склад: " +Строка(нДокументЗагрузки.Склад);//+" Поставщик : "+Строка(нДокументЗагрузки.Документ.Контрагент);
		Если ЗначениеЗаполнено(нДокументЗагрузки.Документ) Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + "Поставщик: " + Строка(нДокументЗагрузки.Документ.Контрагент);
		КонецЕсли;
		
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
		Ит = Ит + 1;
	КонецЦикла;
	
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;	
	
КонецФункции



Процедура ЗагрузитьДокументЗакрытиеСмены(ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, СообщениеЗавершения, ВсеОкЗагрузка = Истина, ПараметрыПодключения = Неопределено, ПараметрыЗагрузки)
	
	Подразделение 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Подразделение", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	ЭтоПодразделениеФС		= ОбменФронтПовтИсп.ЭтоПодразделениеФабрикаСыра(Подразделение);
	ДокументыНаЗагрузку  	= ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов 	= ДокументыНаЗагрузку.Количество();
	СОшибками = 0;
	Параметры = Новый Структура;
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченых документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		Параметры.Вставить("ОК", ВсеОкЗагрузка);
		Возврат;
	КонецЕсли;
	
	
	///Продажи не из базы транзит
	Connection = ПолучитьСоединение(ПараметрыПодключения);
	//Connection = ПолучитьСоединение(ПараметрыПодключения,Истина);
	
	
	
	ТерминалПриватБанк = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("000000007");
	ТерминалДигма      = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("000000008");
	
	ЗагруженныеОбъекты = Новый Структура();
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = Строка(КоличествоДокументов);
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл
		ОбработаноДокументов = ОбработаноДокументов + 1;
		ВсеОк  = Истина;
		Ошибки = "";
		
		Если ЗначениеЗаполнено(тДокЗагрузки.Документ) Тогда
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();					
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(тДокЗагрузки.Склад)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
			
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ОплатаПлатежнымиКартами.Очистить();
			//ДокОбъект.СнятыеКассы.Очистить();
			
		Иначе
			ДокОбъект = Документы.ЗакрытиеСмены.СоздатьДокумент();
		КонецЕсли;
		тСклад = тДокЗагрузки.Склад;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 из %2 Обработка документа по складу: %3'; uk = '%1 з %2 Обрабка документа по складу: %3'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов, 
		Строка(тСклад)));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипЦенРозничнойТорговли КАК ТипЦенСклада,
		|	СкладыКомпании.Розничный КАК ТипСкладаРозничный,
		|	СкладыКомпании.ТипЦенРозничнойТорговли.ВалютаЦены КАК ВалютаЦеныСклада,
		|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ТорговаяПлощадка = ВЫРАЗИТЬ(&Склад КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
		|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
		|ГДЕ
		|	СкладыКомпании.Ссылка = &Склад";
		
		Запрос.УстановитьПараметр("Склад", тСклад);
		Запрос.УстановитьПараметр("НаДату", КонецДня(тДокЗагрузки.Дата));
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			тОрганизация      = ВыборкаДетальныеЗаписи.Организация;
			тПодразделение 	  = ВыборкаДетальныеЗаписи.Подразделение;
			ЭтоРозничныйСклад = ВыборкаДетальныеЗаписи.ТипСкладаРозничный;									
			тТипЦен       	  = ВыборкаДетальныеЗаписи.ТипЦенСклада;
			тВалюта       	  = ВыборкаДетальныеЗаписи.ВалютаЦеныСклада;
			тТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
		Иначе
			тОрганизация      = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
			тПодразделение 	  = ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка");
			ЭтоРозничныйСклад = Ложь;
			тТипЦен 		  = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");
			тВалюта 		  = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
			тТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(тВалюта) Тогда
			тВалюта = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		КонецЕсли;
		
		
		
		
		ДокОбъект.ХозОперация = Справочники.ХозОперации.ЗакрытиеСмены;
		ДокОбъект.СписыватьОстатки = Истина;
		ДокОбъект.РегламентированныйУчет = Ложь;
		ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Дата =  тДокЗагрузки.Дата;
		ДокОбъект.Организация = тОрганизация;
		ДокОбъект.ПодразделениеКомпании = тПодразделение;
		ДокОбъект.СкладКомпании = тСклад;
		ДокОбъект.ТорговаяПлощадка = тТорговаяПлощадка;
		ДокОбъект.ТипЦен = тТипЦен;
		ДокОбъект.ВалютаДокумента = тВалюта;
		ДокОбъект.КурсДокумента = 1;
		
		//ДокОбъект.АвтоматическиПриходоватьИзлишки = Истина;
		//ДокОбъект.АвтоПереоценка                  = ЭтоРозничныйСклад;
		//ДокОбъект.НомераЛенты = "OS";
		
		ДатаВДокумент =  тДокЗагрузки.Дата;
		
		мСнятыхЗетов =   ТаблицаСнятыхЗетОтчетов.НайтиСтроки(Новый Структура("Дата, СкладКомпании",тДокЗагрузки.Дата, тДокЗагрузки.Склад));
		
		ДокОбъект.СнятыеКассы.Очистить();
		
		//ТаблицаСнятыхКасс = Новый ТаблицаЗначений;
		//ТаблицаСнятыхКасс.Колонки.Добавить("КассоваяСмена");		
		//
		//ТаблицаТовары = ДокОбъект.Товары.Выгрузить();
		//ТаблицаТовары.Очистить();
		//
		//Заполнение документа по снятым зет отчетам
		
		Для Каждого СнаятаяЗетка Из мСнятыхЗетов Цикл 					
			
			Если СнаятаяЗетка.zreptime > ДатаВДокумент Тогда
				ДатаВДокумент =  СнаятаяЗетка.zreptime;
			КонецЕсли;
			
			Эмулятор = ВРег(СнаятаяЗетка.ZREPFPSN) = "ЭМУЛЯТОР";
			
			//Снятый зет
			Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	КассыККМ.Ссылка КАК КассаККМ,
			//|	КассыККМ.ЭквайринговыйТерминал КАК Терминал,
			//|	КассыККМ.Код КАК КодКассы
			//|ИЗ
			//|	Справочник.КассыККМ КАК КассыККМ
			//|ГДЕ
			//|	КассыККМ.ЗаводскойНомер = &ЗаводскойНомер
			//|	И КассыККМ.Подразделение = &Подразделение
			//|	И КассыККМ.Объект = &Объект
			//|	И НЕ КассыККМ.ПометкаУдаления";
			//
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КассыККМ.Ссылка КАК КассаККМ,
			|	ЭквайринговыеТерминалы.Ссылка КАК Терминал,
			|	КассыККМ.Код КАК КодКассы
			|ИЗ
			|	Справочник.КассыККМ КАК КассыККМ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_СчетаЭкваринга.СрезПоследних(&НаДату, ) КАК ТК_СчетаЭкварингаСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
			|			ПО ТК_СчетаЭкварингаСрезПоследних.Контрагент = ЭквайринговыеТерминалы.Эквайер
			|				И ТК_СчетаЭкварингаСрезПоследних.БанковскийСчет = ЭквайринговыеТерминалы.БанковскийСчет
			|		ПО КассыККМ.Объект = ТК_СчетаЭкварингаСрезПоследних.ТорговаяПлощадка
			|ГДЕ
			|	КассыККМ.ЗаводскойНомер = &ЗаводскойНомер
			|	И КассыККМ.Подразделение = &Подразделение
			|	И КассыККМ.Объект = &Объект
			|	И НЕ КассыККМ.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ЗаводскойНомер", СнаятаяЗетка.ZREPFPSN);			
			Запрос.УстановитьПараметр("Подразделение", тПодразделение);
			Запрос.УстановитьПараметр("Объект", тТорговаяПлощадка);
			Запрос.УстановитьПараметр("НаДату", тДокЗагрузки.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");
				Терминал = ТерминалПриватБанк;
				КодКассы = "000000";
			Иначе
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				КассаККМ = Выборка.КассаККМ;
				Терминал = ?(ЗначениеЗаполнено(Выборка.Терминал),Выборка.Терминал,ТерминалПриватБанк);
				КодКассы = СокрЛП(Выборка.КодКассы);
			КонецЕсли;
			
			тчСнятыеКассы = ДокОбъект.СнятыеКассы;			        
			
			НомерКассовойСменыСтарый = КодКассы + "-" + Формат(СнаятаяЗетка.ZREPFISCNUM, "ЧЦ=15; ЧГ=");
			НомерКассовойСменыНовый = НомерКассовойСменыСтарый + "-" + Формат(СнаятаяЗетка.WORKDAYID, "ЧЦ=10; ЧГ=");
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ТК_КассоваяСмена.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ТК_КассоваяСмена КАК ТК_КассоваяСмена
			|ГДЕ
			|	(ТК_КассоваяСмена.Номер = &НомерСтарый
			|			ИЛИ ТК_КассоваяСмена.Номер = &НомерНовый)";
			
			Запрос.УстановитьПараметр("НомерСтарый", НомерКассовойСменыСтарый);
			Запрос.УстановитьПараметр("НомерНовый", НомерКассовойСменыНовый);
			
			РезКассоваяСмена = Запрос.Выполнить();			
			Если Не РезКассоваяСмена.Пустой() Тогда 				
				ВыборкаКассоваяСмена = РезКассоваяСмена.Выбрать();
				ВыборкаКассоваяСмена.Следующий();
				
				ДокКассоваяСмена = ВыборкаКассоваяСмена.Ссылка.ПолучитьОбъект();				
			Иначе				
				ДокКассоваяСмена = Документы.ТК_КассоваяСмена.СоздатьДокумент();								
			КонецЕсли;
			
			ДокКассоваяСмена.Номер = НомерКассовойСменыНовый;
			
			ЗаполнитьЗначенияСвойств(ДокКассоваяСмена, ДокОбъект, "Организация, ПодразделениеКомпании, ТорговаяПлощадка");	
			
			ДокКассоваяСмена.Дата = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.КассаККМ = КассаККМ;			
			ДокКассоваяСмена.ДатаZотчета = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.НачалоКассовойСмены = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.ОкончаниеКассовойСмены = СнаятаяЗетка.Дата;
			ДокКассоваяСмена.НомерZотчета = СнаятаяЗетка.ZREPFISCNUM;			
			ДокКассоваяСмена.КоличествоЧеков = СнаятаяЗетка.SALESCOUNT;
			ДокКассоваяСмена.НомерСменыККМ = СнаятаяЗетка.SYSTEMID;
			
			ДокКассоваяСмена.СуммаДокумента = СнаятаяЗетка.SALESSUM/100;
			ДокКассоваяСмена.СуммаВозврат = СнаятаяЗетка.REFSSUM/100;
			ДокКассоваяСмена.СуммаСкидки = 0;										
			
			//Товары зет отчета
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	V_Продажи.ARTID КАК ARTID,
			|	V_Продажи.PACKGUID КАК PACKGUID,
			|	V_Продажи.CHARGUID КАК CHARGUID,
			|	V_Продажи.LOSSGRPGUID КАК LOSSGRPGUID,
			|	ВЫБОР
			|		КОГДА V_Продажи.SALESREFUND = 1
			|				ИЛИ V_Продажи.SALESREFUND = 2
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Возврат,
			|	V_Продажи.PACKCOUNT / 1000 КАК Коэффициент,
			|	V_Продажи.SALESPRICE / 100 КАК Цена,
			|	ВЫБОР
			|		КОГДА V_Продажи.SALESREFUND = 1
			|			ТОГДА V_Продажи.SALESCOUNT * -1
			|		ИНАЧЕ V_Продажи.SALESCOUNT
			|	КОНЕЦ КАК Количество,
			|	ВЫБОР
			|		КОГДА V_Продажи.SALESREFUND = 1
			|				ИЛИ V_Продажи.SALESREFUND = 2
			|			ТОГДА V_Продажи.salesdisc / 100 * -1
			|		ИНАЧЕ V_Продажи.salesdisc / 100
			|	КОНЕЦ КАК СуммаСкидки,
			|	ВЫБОР
			|		КОГДА V_Продажи.SALESREFUND = 1
			|				ИЛИ V_Продажи.SALESREFUND = 2
			|			ТОГДА V_Продажи.salessum / 100 * -1
			|		ИНАЧЕ V_Продажи.salessum / 100
			|	КОНЕЦ КАК СуммаВсего
			|ИЗ
			|	ВнешнийИсточникДанных.OpenStore.Таблица.V_Продажи КАК V_Продажи
			|ГДЕ
			|	V_Продажи.SAREAID = &SAREAID
			|	И V_Продажи.SYSTEMID = &SYSTEMID
			|	И V_Продажи.WORKDAYID = &WORKDAYID
			|	И V_Продажи.WORKDAYEND МЕЖДУ &WORKDAYEND1 И &WORKDAYEND2";
			
			Запрос.УстановитьПараметр("SAREAID", СнаятаяЗетка.SAREAID);
			Запрос.УстановитьПараметр("SYSTEMID", СнаятаяЗетка.SYSTEMID);
			Запрос.УстановитьПараметр("WORKDAYEND1", Число(Формат(СнаятаяЗетка.Дата,"ДФ=yyyyMMdd000000")));
			Запрос.УстановитьПараметр("WORKDAYEND2", Число(Формат(СнаятаяЗетка.Дата,"ДФ=yyyyMMdd235959")));
			Запрос.УстановитьПараметр("WORKDAYID", СнаятаяЗетка.WORKDAYID);
			РезультатЗапросаПоТоварам =  Запрос.Выполнить();
			
			
			тзПродажи = РезультатЗапросаПоТоварам.Выгрузить();
			тзПродажи.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			тзПродажи.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			тзПродажи.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
			тзПродажи.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
			тзПродажи.Колонки.Добавить("КлассификаторПродажи",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));
			тзПродажи.Колонки.Добавить("Ставка",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(2,0)));
			тзПродажи.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			тзПродажи.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			
			ОбработатьТабличнуюЧасть("Товары",тзПродажи,ЗагруженныеОбъекты,Истина);
			ДокКассоваяСмена.СуммаСкидки = тзПродажи.Итог("СуммаСкидки");
			Если Эмулятор Тогда
				СуммаПродаж =  0;
				СуммаВозвратов = 0;
				
				мСтрокиПродажи = тзПродажи.НайтиСтроки(Новый Структура("Возврат",Ложь));
				Для Каждого мстПродажи Из мСтрокиПродажи Цикл 
					СуммаПродаж = СуммаПродаж + мстПродажи.СуммаВсего;
				КонецЦикла;
				
				мСтрокиПродажи = тзПродажи.НайтиСтроки(Новый Структура("Возврат",Истина));
				Для Каждого мстПродажи Из мСтрокиПродажи Цикл 
					СуммаВозвратов = СуммаВозвратов + мстПродажи.СуммаВсего;
				КонецЦикла;
				ДокКассоваяСмена.СуммаДокумента  = СуммаПродаж;
				ДокКассоваяСмена.СуммаВозврат	 = СуммаВозвратов;
			КонецЕсли;
			
			
			//Проведем измененный документ "ТК_КассоваяСмена"
			Попытка
				ДокКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВсеОкЗагрузка = Ложь;
				СОшибками = СОшибками + 1;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось проверсти Кассовую смену %1 от %2 по складу %3, кол-во чеков - %4
				|Ошибки: %5'; uk = 'Не вдалося провести Касову зміну %1 від %2 по складу %3, кіль-ть чеків - %4
				|Помилки: %5'"),
				СокрЛП(СнаятаяЗетка.ZREPFISCNUM),
				Формат(СнаятаяЗетка.Дата, "ДФ=dd.MM.yyyy"),
				тСклад,
				СнаятаяЗетка.SALESCOUNT,
				ОписаниеОшибки()));
				
				ДокКассоваяСмена.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
			Если ДокКассоваяСмена.Ссылка <> ПредопределенноеЗначение("Документ.ТК_КассоваяСмена.ПустаяСсылка") Тогда 
				НовСтрСК = ДокОбъект.СнятыеКассы.Добавить();				
				НовСтрСК.КассоваяСмена = ДокКассоваяСмена.Ссылка;
			КонецЕсли;
			
			ЗаполнитьТовары(ДокОбъект,тзПродажи);				
			
			//Оплаты баноком 
			Запрос.Текст =  "ВЫБРАТЬ
			|	СУММА(V_ОплатыТерминал.salessum / 100) КАК Сумма,
			|	V_ОплатыТерминал.Bank
			|ИЗ
			|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ОплатыТерминал КАК V_ОплатыТерминал
			|ГДЕ
			|	V_ОплатыТерминал.SAREAID = &SAREAID
			|	И V_ОплатыТерминал.SYSTEMID = &SYSTEMID
			|	И V_ОплатыТерминал.WORKDAYID = &WORKDAYID
			|	И V_ОплатыТерминал.WORKDAYEND МЕЖДУ &WORKDAYEND1 И &WORKDAYEND2
			|
			|СГРУППИРОВАТЬ ПО
			|	V_ОплатыТерминал.Bank";
			РезультатЗапросаТерминал = Запрос.Выполнить();
			
			Если РезультатЗапросаТерминал.Пустой() Тогда
				Продолжить;
			КонецЕсли;  
			
			тчПлатежныеКарты = ДокОбъект.ОплатаПлатежнымиКартами;
			Выборка = РезультатЗапросаТерминал.Выбрать();
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = тчПлатежныеКарты.Добавить();
				НоваяСтрока.КассаККМ = КассаККМ;
				НоваяСтрока.Сумма    = Выборка.Сумма;
				НоваяСтрока.ЭквайринговыйТерминал = ? (Выборка.Bank = 1, Терминал, ТерминалДигма);
			КонецЦикла;				
			
		КонецЦикла;
		
		//Нет товаров, пропустим загрузку, документ догрузится при проверке если дойдут товары.
		Если ДокОбъект.Товары.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ %1 по складу %2 не загружен. Таблица ""Товары"" пустая'; uk = 'Документ %1 по складу %2 не завантажений. Таблиця ""Товари"" порожня'"),
			Строка(ДокОбъект),
			тСклад));
			
			ВсеОк = Ложь;
			ВсеОкЗагрузка = Ложь;
			СОшибками = СОшибками + 1;
			Продолжить;
		КонецЕсли;
		
		тчТовары = ДокОбъект.Товары;
		
		Если Не ЭтоПодразделениеФС Тогда 
			тчТовары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,Цена,СтавкаНДС,Возврат,КлассификаторПродажи","Количество,Сумма,СуммаНДС,СуммаВсего,СуммаСкидки");
		КонецЕсли;
		
		СкидкаОкругления = Справочники.КлассификаторПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор("974757a9-f0d4-11e9-a2a9-005056a18470"));
		Для Каждого СтрокаТаблицы Из тчТовары Цикл 
			СтрокаТаблицы.ПроцентСкидки = ?(СтрокаТаблицы.СуммаВсего=0,0,(СтрокаТаблицы.СуммаСкидки*100)/СтрокаТаблицы.СуммаВсего);
			текКоличество = СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент;
			СтрокаТаблицы.КоличествоБазовое = текКоличество;
			Если текКоличество = 0 Тогда
				СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма;
			Иначе
				СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма / текКоличество;
			КонецЕсли;
			
			Если СтрокаТаблицы.СуммаСкидки <> 0  И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КлассификаторПродажи) Тогда
				СтрокаТаблицы.КлассификаторПродажи = СкидкаОкругления;
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		//Обработка наборов ПФ
		//ОбработатьНаборыДокумента(ДокОбъект);
		
		
		//Проведение
		ДокОбъект.Дата = ДатаВДокумент;
		
		текстЗапроса = Новый ТекстовыйДокумент;
		Для Каждого сЗет Из мСнятыхЗетов Цикл 
			тЗапрос = "EXECUTE [Integration1C].[dbo].[spZREP_SETLOADED] 
			|@SAREAID = "+Формат(сЗет.SAREAID,"ЧДЦ=; ЧГ=")+",
			|@SYSTEMID="+Формат(сЗет.SYSTEMID,"ЧДЦ=; ЧГ=")+",
			|@WORKDAYID="+Формат(сЗет.WORKDAYID,"ЧДЦ=; ЧГ=")+",
			|@ZREPFISCNUM='"+СокрЛП(сЗет.ZREPFISCNUM)+"'";
			текстЗапроса.ДобавитьСтроку(тЗапрос);
		КонецЦикла;
		
		
		Отказ = Ложь;
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,текстЗапроса.ПолучитьТекст());
		
		//Заполнить выпуски кофе
		ДокВыпускПродукции = ЗаполнитьВыпускКофе(ДатаВДокумент, ДокОбъект, тСклад, ВсеОк, Ошибки);
		
		Попытка
			Если ДокОбъект.ПроверитьЗаполнение() Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				СОшибками = СОшибками + 1;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
				ДокОбъект.Ссылка,
				тСклад),
				ДокОбъект.Ссылка);
			КонецЕсли;
			
			ДокСписание = СписаниеКассовойЛенты(ДокОбъект.Ссылка);
			
			МассивСписанийДопМатериалов = СписаниеДопМатериалов(ДокОбъект, Ошибки); //Vov41k 17.08.2023
			
			ДокЗКС = Неопределено;
			//Если СоздаватьЗКС Тогда 
			//	ДокЗКС = ПолучитьДокументЗКС(ДокОбъект.Ссылка, ВсеОк, Ошибки);
			//КонецЕсли;
		Исключение
			
			ОписаниеОшибки = ОписаниеОшибки() + " по складу "+ тСклад; 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);			
			Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки);
			
			ВсеОк = Ложь;
			ВсеОкЗагрузка = Ложь;
			СОшибками = СОшибками + 1;
			
			Попытка
				Если НЕ ДокОбъект.Проведен тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки() + " по складу " + тСклад; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);								
				Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки);
			КонецПопытки;
			
			Если ДокВыпускПродукции <> Неопределено Тогда 
				Попытка
					ДокВыпускПродукции.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось отменить проведение документа '; uk = 'Не вдалося відмінити проведення документу '") + ДокВыпускПродукции);
				КонецПопытки;
			КонецЕсли;
			
			Если ДокСписание <> Неопределено Тогда 
				Попытка
					ДокСписание.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось отменить проведение документа '; uk = 'Не вдалося відмінити проведення документу '") + ДокСписание);
				КонецПопытки;
			КонецЕсли;
			
			Если МассивСписанийДопМатериалов.Количество() > 0 Тогда 
				Для Каждого ДокСписаниеДопМатериалов Из МассивСписанийДопМатериалов Цикл 
					Попытка
						ДокСписаниеДопМатериалов.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Исключение
						Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось отменить проведение списания доп. материалов '; uk = 'Не вдалося відмінити документ списаня дод. матеріалів '") + ДокСписаниеДопМатериалов);
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокЗКС <> Неопределено Тогда 
				Попытка
					ДокЗКС.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось отменить проведение документа '; uk = 'Не вдалося відмінити проведення документу '") + ДокЗКС);
				КонецПопытки;
			КонецЕсли;
		КонецПопытки;
				
		Если ВсеОк И НЕ Отказ Тогда
			Зафиксировать_Транзакцию(Connection);
		Иначе
			Откатить_Транзакцию(Connection);
		КонецЕсли;		
		
	КонецЦикла;	
	
	Параметры.Вставить("ОК",ВсеОкЗагрузка);
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	сКоличествоДокументов);
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;							
	
КонецПроцедуры

Процедура ЗагрузитьДокументИнвентаризация(ПараметрыЗагрузки, ТаблицаДокументов, СообщениеЗавершения, ВсеОк = Истина)
	
	Перем ПроводитьДокументы, Connection;
	
	СОшибками = 0;
	КассоваяЛента = Справочники.Номенклатура.НайтиПоКоду("D0787766");
	
	ДокументыНаЗагрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	сКоличествоДокументов = ДокументыНаЗагрузку.Количество();
	Если сКоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченных документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		ВсеОк = Ложь;
		Возврат;
	КонецЕсли;
	
	Connection = ПолучитьСоединение(, Истина);
	Если Connection = Неопределено Тогда
		ВызватьИсключение "Не удалось подключится к серверу OS!"; 
	КонецЕсли;
	
	ПроводитьДокументы = Ложь;
	Если ТипЗнч(ПараметрыЗагрузки) = Тип("Структура") Тогда 
		ПроводитьДокументы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Проводить", Ложь);
	КонецЕсли;		
	
	ОбработаноДокументов = 0;
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 из %2 Обработка документа по складу: %3'; uk = '%1 з %2 Обрабка документа по складу: %3'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов, 
		Строка(тДокЗагрузки.Склад)));		
		
		Если ЗначениеЗаполнено(тДокЗагрузки.Документ) Тогда
			
			Если Не ОбщегоНазначения.СсылкаСуществует(тДокЗагрузки.Документ) Тогда 								
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найден документ ""Инвентаризация"" с идентификатором: %1 (%2)'; uk = 'Не знайдений документ ""Інвентаризація"" з ідентифікатором: %1 (%2)'"),
				НСтр(тДокЗагрузки.ID_Документа),
				тДокЗагрузки.Склад));				
				
				СОшибками = СОшибками + 1;												
				Продолжить;
			КонецЕсли;
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();					
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(тДокЗагрузки.Склад)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
			
			
		Иначе
			ДокОбъект = Документы.Инвентаризация.СоздатьДокумент();
		КонецЕсли;
		тСклад     = тДокЗагрузки.Склад;
		тРозничный = тДокЗагрузки.Розничный;
		тОтдел     = ДокОбъект.Отдел;
		ОтделыСклада = РегистрыСведений.НоменклатураОтделов.ПроверитьНаНаличиеОтдела(тСклад);
		
		КорректировкаИН = ЗначениеЗаполнено(тДокЗагрузки.ID_Основания);
		
		
		ДокОбъектТовары = ДокОбъект.Товары;
		Отказ = Ложь;
		
		Если Не КорректировкаИН Тогда	
			
			ДокОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ИнвентаризацияТоваров");
			ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ДокОбъект.Дата =  тДокЗагрузки.ДатаЗагрузки;
			ДокОбъект.Организация = тДокЗагрузки.Организация;
			ДокОбъект.ПодразделениеКомпании = тСклад.Подразделение;
			ДокОбъект.СкладКомпании = тСклад;	
			ДокОбъект.ТипЦенИтогов = тСклад.ТипЦенРозничнойТорговли;
			ДокОбъект.ТорговаяПлощадка = тСклад.ТорговаяПлощадка;
			//ДокОбъект.НомерRB = тДокЗагрузки.Номер; ????
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЗакрытиеСмены.Дата КАК Дата
			|ИЗ
			|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
			|ГДЕ
			|	ЗакрытиеСмены.Проведен
			|	И ЗакрытиеСмены.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ЗакрытиеСмены.СкладКомпании = &СкладКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(тДокЗагрузки.ДатаЗагрузки)-60*60*24);
			Запрос.УстановитьПараметр("КонецПериода", КонецДня(тДокЗагрузки.ДатаЗагрузки));
			Запрос.УстановитьПараметр("СкладКомпании", тСклад);
			
			Рез = Запрос.Выполнить();
			Если Рез.Пустой() Тогда
				ДокОбъект.Дата =  КонецДня(тДокЗагрузки.ДатаЗагрузки);
				CALCTIME = Формат(ДокОбъект.Дата,"ДФ=yyyyMMddЧЧммсс");	
			Иначе
				Выборка = Рез.Выбрать();
				Выборка.Следующий();
				ДокОбъект.Дата = Выборка.Дата+1;
				CALCTIME = Формат(ДокОбъект.Дата,"ДФ=yyyyMMddЧЧммсс");
			КонецЕсли;
			тСтрокаЗапроса = "EXECUTE [IntegrationTransit].[dbo].[INV_CALC] @DOCID="+Формат(тДокЗагрузки.DOCID,"ЧЦ=15; ЧГ=")+" ,@CALCTIME="+CALCTIME+"";
			ВыполнитьЗапрос(Connection,Отказ,тСтрокаЗапроса);
			
			Если Отказ Тогда				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось рассчитать дельту по ИН склад: '; uk = 'Не вдалося розрахувати дельту по ІН склад: '") + Строка(тСклад));
				ВсеОк = Ложь;
				СОшибками = СОшибками + 1;
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	НоменклатураОтделов.Номенклатура КАК рНоменклатура,
			|	НоменклатураОтделов.Отдел КАК Отдел
			|ПОМЕСТИТЬ ВТ_ОтборНоменклатура
			|ИЗ
			|	РегистрСведений.НоменклатураОтделов КАК НоменклатураОтделов
			|ГДЕ
			|	НоменклатураОтделов.Склад = &Склад
			|
			|СГРУППИРОВАТЬ ПО
			|	НоменклатураОтделов.Номенклатура,
			|	НоменклатураОтделов.Отдел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
			|	НоменклатураСоставНабора.Ссылка КАК НоменклатураНабора,
			|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоКнижн,
			|	ВЫБОР
			|		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток < 0
			|			ТОГДА 0
			|		ИНАЧЕ -ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
			|	КОНЕЦ КАК Количество,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) = 0
			|			ТОГДА ЕСТЬNULL(ПартииТоваровКомпанииОстатки.СуммаОстаток, 0)
			|		ИНАЧЕ ЕСТЬNULL(ПартииТоваровКомпанииОстатки.СуммаОстаток, 0) / ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
			|	КОНЕЦ КАК Цена,
			|	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаКнижн
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОстатков, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаОстатков, СкладКомпании = &Склад) КАК ПартииТоваровКомпанииОстатки
			|		ПО ОстаткиТоваровКомпанииОстатки.СкладКомпании = ПартииТоваровКомпанииОстатки.СкладКомпании
			|			И ОстаткиТоваровКомпанииОстатки.Номенклатура = ПартииТоваровКомпанииОстатки.Номенклатура
			|			И ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.СоставНабора КАК НоменклатураСоставНабора
			|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = НоменклатураСоставНабора.Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТК_КассоваяЛента КАК ТК_КассоваяЛента
			|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура <> ТК_КассоваяЛента.Номенклатура %1";
			
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,?(ОтделыСклада, 
			 " 
			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтборНоменклатура КАК ВТ_ОтборНоменклатура
               |		ПО (ВЫБОР
               |				КОГДА &Отдел = ЗНАЧЕНИЕ(Справочник.Отделы.ПустаяСсылка)
               |					ТОГДА НЕ ОстаткиТоваровКомпанииОстатки.Номенклатура В ИЕРАРХИИ
			   |					(ВЫБРАТЬ
			   |					ВТ_ОтборНоменклатура.рНоменклатура КАК рНоменклатура
			   |				ИЗ
			   |					ВТ_ОтборНоменклатура КАК ВТ_ОтборНоменклатура)
               |				ИНАЧЕ ОстаткиТоваровКомпанииОстатки.Номенклатура В Иерархии
               |						(ВЫБРАТЬ
               |							ВТ_ОтборНоменклатура.рНоменклатура КАК рНоменклатура
               |						ИЗ
               |							ВТ_ОтборНоменклатура КАК ВТ_ОтборНоменклатура
               |						ГДЕ
               |							ВТ_ОтборНоменклатура.Отдел В (&Отдел))
               |			КОНЕЦ)",""));

			Запрос.УстановитьПараметр("ДатаОстатков", ДокОбъект.Дата);
			Запрос.УстановитьПараметр("Склад", тСклад);
			Запрос.УстановитьПараметр("Отдел", тОтдел);
			
			РезультатЗапроса = Запрос.Выполнить();
			ДокОбъектТовары.Загрузить(РезультатЗапроса.Выгрузить());
			
			
		Иначе
			
			тСтрокаЗапроса = "EXECUTE [IntegrationTransit].[dbo].[INV_CORR] @DOCID="+Формат(тДокЗагрузки.DOCID,"ЧЦ=15; ЧГ=")+"";
			ВыполнитьЗапрос(Connection,Отказ,тСтрокаЗапроса);
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось рассчитать дельту по ИН склад: '; uk = 'Не вдалося розрахувати дельту по ІН склад: '") + Строка(тСклад));
				ВсеОк = Ложь;
				СОшибками = СОшибками + 1;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	V_ИнвентаризацииДвижения.ARTID КАК Артикул,
		|	V_ИнвентаризацииДвижения.PACKQUANT КАК PACKQUANT,
		|	СУММА(V_ИнвентаризацииДвижения.QUANTITY) КАК QUANTITY,
		|	СУММА(V_ИнвентаризацииДвижения.DELTAQTY) КАК DELTAQTY,		
		|	V_ИнвентаризацииДвижения.CHARGUID КАК CHARGUID
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ИнвентаризацииДвижения КАК V_ИнвентаризацииДвижения
		|ГДЕ
		|	V_ИнвентаризацииДвижения.DOCID = &DOCID
		|
		|СГРУППИРОВАТЬ ПО
		|	V_ИнвентаризацииДвижения.ARTID,
		|	V_ИнвентаризацииДвижения.PACKQUANT,
		|	V_ИнвентаризацииДвижения.CHARGUID,
		|	V_ИнвентаризацииДвижения.PACKGUID";
		
		Запрос.УстановитьПараметр("DOCID", тДокЗагрузки.DOCID);
		
		тзТоварыДокумента = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст =   "ВЫБРАТЬ
		|	ТоварыОС.Артикул КАК Артикул,
		|	ТоварыОС.PACKQUANT КАК PACKQUANT,
		|	ТоварыОС.QUANTITY КАК QUANTITY,
		|	ТоварыОС.DELTAQTY КАК DELTAQTY,
		|	ТоварыОС.CHARGUID КАК CHARGUID
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТоварыОС КАК ТоварыОС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Номенклатура,
		|	ВТ.PACKQUANT КАК PACKQUANT,
		|	ВТ.QUANTITY КАК QUANTITY,
		|	ВТ.DELTAQTY КАК DELTAQTY,
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОснКоэффициент,
		|	ВТ.CHARGUID КАК CHARGUID
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО ВТ.Артикул = спрНоменклатура.Артикул";
		
		Запрос.УстановитьПараметр("ТоварыОС",тзТоварыДокумента);
		
		РезультатИН = Запрос.Выполнить();
		
		Выборка   = РезультатИН.Выбрать();
		МассивНоменклатуры = Новый Массив;
		НоменклатураОтделов = РегистрыСведений.НоменклатураОтделов.ПолучитьНоменклатуруОтделовСклада(тСклад);
		ПустаяСсылкаХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		сКоличество = ?(КорректировкаИН,"Выборка.QUANTITY*Выборка.PACKQUANT+Выборка.DELTAQTY","Выборка.QUANTITY*Выборка.PACKQUANT+Выборка.DELTAQTY");
		
		Пока Выборка.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(Выборка.CHARGUID) Тогда 
				ТекХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.CHARGUID));
				Если Не ОбщегоНазначения.СсылкаСуществует(ТекХарактеристика) Тогда 
					ТекХарактеристика = ПустаяСсылкаХарактеристика;
				КонецЕсли;
			Иначе
				ТекХарактеристика = ПустаяСсылкаХарактеристика;
			КонецЕсли;
			
			КолВо =  Вычислить(сКоличество);
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
			нСтрокиДокумента = ДокОбъектТовары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры", Выборка.Номенклатура, ТекХарактеристика));
			тНоменклатураОтдела = НоменклатураОтделов.Найти(Выборка.Номенклатура);
			Если нСтрокиДокумента.Количество() = 0 Тогда
				Если Выборка.Номенклатура <> КассоваяЛента И Не ЗначениеЗаполнено(тОтдел) и тНоменклатураОтдела = Неопределено Тогда
					нСтрокаТовары = ДокОбъектТовары.Добавить();
					нСтрокаТовары.Номенклатура = Выборка.Номенклатура;
					нСтрокаТовары.ХарактеристикаНоменклатуры = ТекХарактеристика;
					нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
					нСтрокаТовары.Коэффициент                = Выборка.ОснКоэффициент;
					нСтрокаТовары.КоличествоФакт             = ?(КолВо<0,0,КолВо);
				КонецЕсли;	
			Иначе
				нСтрокаТовары = нСтрокиДокумента[0];
				нСтрокаТовары.КоличествоФакт = ?(КолВо<0,0,КолВо);
			КонецЕсли;	
			
		КонецЦикла;
		
		ПараметрыЗаполненияОстатков = Новый Структура;
		ПараметрыЗаполненияОстатков.Вставить("Команда", "ПересчитатьКоличествоКнижн");
		ПараметрыЗаполненияОстатков.Вставить("Момент", Новый МоментВремени(ДокОбъект.Дата, ДокОбъект.Ссылка));
		ПараметрыЗаполненияОстатков.Вставить("СкладКомпании", ДокОбъект.СкладКомпании);
		
		Документы.Инвентаризация.ЗаполнитьТоварыПоОстаткамНаСкладе(ДокОбъект.Товары, ПараметрыЗаполненияОстатков);
		
		
		Попытка
			Если ПроводитьДокументы Тогда
				Если ДокОбъект.ПроверитьЗаполнение() Тогда 
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				Иначе 
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					СОшибками = СОшибками + 1;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
					ДокОбъект.Ссылка,
					тСклад),
					ДокОбъект.Ссылка);
					
				КонецЕсли;
			Иначе	
				Если ДокОбъект.Проведен тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
			КонецЕсли;
		Исключение
			СОшибками = СОшибками + 1;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ %1 (%2) не загружен.
			|Ошибки: %3'; uk = 'Документ %1 (%2) не завантажений.
			|Помилки: %3'"),
			ДокОбъект,
			тСклад,
			ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	ДокументыНаЗагрузку.Количество());
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;								
	
	
КонецПроцедуры

Процедура ЗагрузитьДокументПоступлениеТоваров(ТаблицаДокументов, СообщениеЗавершения, ВсеОк = Истина)
	
	СОшибками = 0;
	ДокументыНаЗагрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаЗагрузку.Количество();	
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченных документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		ВсеОк = Ложь;
		Возврат;
	КонецЕсли;
	
	ИтДок = 0;
	
	//Для Индекс = 0 По ДокументыНаЗагрузку.ВГраница() Цикл
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл 
		ИтДок = ИтДок + 1;
		
		тСклад = тДокЗагрузки.Склад;
		ИспользоватьХарактеристики = Не Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(тСклад, тДокЗагрузки.Дата); 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ИтДок/КоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"),
		ИтДок,
		КоличествоДокументов));
		
		
		НовыйДокумент = НЕ ЗначениеЗаполнено(тДокЗагрузки.Документ);
		
		Если НЕ НовыйДокумент Тогда
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(ДокОбъект.СкладКомпании)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
		Иначе
			
			ДокОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();			
			ДокОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров");
			ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ДокОбъект.Организация = тДокЗагрузки.Организация;
			ДокОбъект.ПодразделениеКомпании = тСклад.Подразделение;
			ДокОбъект.СкладКомпании = тСклад;
			ДокОбъект.ТорговаяПлощадка = тСклад.ТорговаяПлощадка;
			ДокОбъект.ТипЦен = тСклад.ТипЦенСебестоимости;
			ДокОбъект.ВалютаДокумента = ДокОбъект.ТипЦен.ВалютаЦены;
			ДокОбъект.НомерRB = тДокЗагрузки.Номер;
			ДокОбъект.СтатусRB = ПредопределенноеЗначение("Перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется");
			ДокОбъект.КурсДокумента = 1;
			ДокОбъект.Контрагент =  тДокЗагрузки.Контрагент;
			ДокОбъект.РегламентированныйУчет = Не ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(ДокОбъект.Контрагент);
			ДокОбъект.ВхДокНомер = тДокЗагрузки.НомерВходящегоДокумента;	
			ДокОбъект.ВхДокДата  = ?(тДокЗагрузки.ДатаВходящегоДокумента <> Дата("19000101"), тДокЗагрузки.ДатаВходящегоДокумента, Неопределено);			
			
			
			МенеджерСправочника = Справочники.ДоговорыКонтрагентов;		
			СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(ДокОбъект.Ссылка, ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров"));
			Договор = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(тДокЗагрузки.Контрагент, тДокЗагрузки.Организация, ДокОбъект.ПодразделениеКомпании, СписокВидовДоговоров, , тДокЗагрузки.Дата);	
			
			ДокОбъект.ДоговорВзаиморасчетов = Договор;
			
		КонецЕсли;					
		
		ДокОбъект.Дата =  тДокЗагрузки.Дата;
		
		//1 - возврат по акту 2 - Замена накладных
		ФормаРаботыСПоставщиком =  ДокОбъект.Контрагент.ФормаРаботы; 
		ТаблицаВозврата = Новый ТаблицаЗначений;
		ТаблицаВозврата.Колонки.Добавить("Номенклатура");
		ТаблицаВозврата.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ТаблицаВозврата.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаВозврата.Колонки.Добавить("Коэффициент");
		ТаблицаВозврата.Колонки.Добавить("КоличествоБазовое");
		ТаблицаВозврата.Колонки.Добавить("Количество");
		ТаблицаВозврата.Колонки.Добавить("Цена");
		ТаблицаВозврата.Колонки.Добавить("ЦенаБезНалогов");
		ТаблицаВозврата.Колонки.Добавить("СтавкаНДС");
		
		
		
		ДокОбъект.Комментарий = "Загружен из ОС: " + ТекущаяДата();
		ДокОбъектТовары = ДокОбъект.Товары;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 	"ВЫБРАТЬ
		|	V_ЗагруженныеДокументыТовары.ARTID КАК Артикул, "+?(ИспользоватьХарактеристики," V_ЗагруженныеДокументыТовары.CHARGUID КАК CHARGUID,","")+"
		|	V_ЗагруженныеДокументыТовары.PACKQUANT КАК Коэффициент,
		|	СУММА(V_ЗагруженныеДокументыТовары.QUANTITY) КАК Количество
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументыТовары КАК V_ЗагруженныеДокументыТовары
		|ГДЕ
		|	V_ЗагруженныеДокументыТовары.DOCID = &DOCID
		|
		|СГРУППИРОВАТЬ ПО
		|	V_ЗагруженныеДокументыТовары.ARTID, "+?(ИспользоватьХарактеристики," V_ЗагруженныеДокументыТовары.CHARGUID,","")+"
		|	V_ЗагруженныеДокументыТовары.PACKQUANT";
		
		Запрос.Текст = ТекстЗапроса;
		
		
		Запрос.УстановитьПараметр("DOCID", тДокЗагрузки.DOCID);
		
		тзТоварыДокумента = Запрос.Выполнить().Выгрузить();
		
		Для Каждого стСтрокаДокТовары Из ДокОбъектТовары Цикл 
			Если ФормаРаботыСПоставщиком <> 1 Тогда
				стСтрокаДокТовары.Количество = 0;
				стСтрокаДокТовары.КоличествоБазовое = 0;
			КонецЕсли;
			
			стСтрокаДокТовары.Сумма = 0;
			стСтрокаДокТовары.СуммаБезНалогов = 0;
			стСтрокаДокТовары.СуммаВсего = 0;
			стСтрокаДокТовары.СуммаНДС = 0;
			//стСтрокаДокТовары.СуммаРозничная = 0;
			стСтрокаДокТовары.СуммаСкидки = 0;
			
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =   "ВЫБРАТЬ
		|	ТоварыОС.Артикул, "+?(ИспользоватьХарактеристики," ТоварыОС.CHARGUID,","")+"
		|	ТоварыОС.Коэффициент,
		|	ТоварыОС.Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТоварыОС КАК ТоварыОС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Номенклатура, "+?(ИспользоватьХарактеристики," ВТ.CHARGUID,","")+"
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения,
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОснКоэффициент,
		|	ВТ.Коэффициент,
		|	ВТ.Количество
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО ВТ.Артикул = спрНоменклатура.Артикул";
		
		Запрос.УстановитьПараметр("ТоварыОС",тзТоварыДокумента);
		
		
		Результат = Запрос.Выполнить();
		
		Выборка   = Результат.Выбрать();
		
		ПустаяСсылкаХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
		МассивНоменклатуры = Новый Массив;
		
		
		
		Если НЕ ИспользоватьХарактеристики Тогда
			Для Каждого СтрТовары Из ДокОбъектТовары Цикл 
				Если ЗначениеЗаполнено(СтрТовары.ХарактеристикаНоменклатуры) Тогда
					СтрТовары.ХарактеристикаНоменклатуры = ПустаяСсылкаХарактеристика;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//
		Пока Выборка.Следующий() Цикл 
			КолВо = Выборка.Количество * Выборка.Коэффициент;
			
			Если ИспользоватьХарактеристики И СокрЛП(Выборка.CHARGUID) <> "00000000-0000-0000-0000-000000000000"  Тогда
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.CHARGUID)));	
				нСтрокиДокумента = ДокОбъектТовары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Выборка.Номенклатура,Характеристика));
				
			Иначе
				нСтрокиДокумента = ДокОбъектТовары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Выборка.Номенклатура,ПустаяСсылкаХарактеристика));
			КонецЕсли;
			
			Если нСтрокиДокумента.Количество() = 0 Тогда
				нСтрокаТовары = ДокОбъектТовары.Добавить();
				нСтрокаТовары.Номенклатура = Выборка.Номенклатура;
				нСтрокаТовары.ХарактеристикаНоменклатуры = ?(ИспользоватьХарактеристики,Характеристика,ПустаяСсылкаХарактеристика);
				нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
				нСтрокаТовары.Коэффициент                = Выборка.ОснКоэффициент;
				нСтрокаТовары.КоличествоБазовое          = КолВо;
				нСтрокаТовары.Количество                 = КолВо;
				
			Иначе
				нСтрокаТовары = нСтрокиДокумента[0];
				
				Если ФормаРаботыСПоставщиком = 1 Тогда
					КоличествоБазовое = нСтрокаТовары.КоличествоБазовое;
					КолВоКорректировка = КоличествоБазовое - КолВо;
					
					Если КолВоКорректировка > 0 Тогда
						КолВо =  КоличествоБазовое;
						
						СтрВоз = ТаблицаВозврата.Добавить();
						СтрВоз.Номенклатура               = нСтрокаТовары.Номенклатура;
						СтрВоз.ХарактеристикаНоменклатуры = ?(ИспользоватьХарактеристики,Характеристика,ПустаяСсылкаХарактеристика);
						СтрВоз.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;							
						СтрВоз.Коэффициент				  = Выборка.ОснКоэффициент; 
						СтрВоз.Количество                 = КолВоКорректировка;
						
					КонецЕсли;
					
					
				КонецЕсли;
				нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
				нСтрокаТовары.Коэффициент                = Выборка.ОснКоэффициент;
				нСтрокаТовары.КоличествоБазовое          = КолВо;
				нСтрокаТовары.Количество                 = КолВо;
			КонецЕсли;
			
		КонецЦикла;
		
		//Если ДокОбъект.СкладКомпании.Розничный Тогда
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЦеныСрезПоследних.Номенклатура,
		//	|	ЦеныСрезПоследних.Характеристика,
		//	|	ЦеныСрезПоследних.Цена
		//	|ИЗ
		//	|	РегистрСведений.Цены.СрезПоследних(
		//	|			&ДатаЦены,
		//	|			ТипЦен = &ТипЦен
		//	|				И Номенклатура В (&МассивТоваров)) КАК ЦеныСрезПоследних";
		//	
		//	Запрос.УстановитьПараметр("ДатаЦены", ДокОбъект.Дата);
		//	Запрос.УстановитьПараметр("ТипЦен", ДокОбъект.СкладКомпании.ТипЦенРозничнойТорговли);
		//	
		//	Запрос.УстановитьПараметр("МассивТоваров", ДокОбъектТовары.ВыгрузитьКолонку("Номенклатура"));
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	тзРознЦены = РезультатЗапроса.Выгрузить();
		//	
		//	Для Каждого СтрТовар Из  ДокОбъектТовары Цикл 
		//		тОтбор = Новый Структура("Номенклатура,Характеристика",СтрТовар.Номенклатура,СтрТовар.ХарактеристикаНоменклатуры);
		//		
		//		нРозЦены = тзРознЦены.НайтиСтроки(тОтбор);
		//		Если нРозЦены.Количество()>0 Тогда
		//			СтрТовар.ЦенаРозничная =  нРозЦены[0].Цена;
		//			
		//			//ДокОбъект.ОбработкаРеквизита("Товары.ЦенаРозничная",СтрТовар);
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
		МассивСтрокДляУдаления = Новый Массив;	
		Для Каждого СтрТЧ Из ДокОбъектТовары Цикл 
			Если СтрТЧ.Количество = 0 Тогда
				МассивСтрокДляУдаления.Добавить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСтрокДляУдаления.Количество() > 0 Тогда
			Для Каждого СтрУд Из МассивСтрокДляУдаления Цикл 
				ДокОбъектТовары.Удалить(СтрУд);
			КонецЦикла;
		КонецЕсли;
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокОбъект));								
		
		Для Каждого СтрТЧ Из ДокОбъектТовары Цикл 			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтрТЧ.ХарактеристикаНоменклатуры);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", СтрТЧ.ЕдиницаИзмерения);				
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокОбъект.Контрагент,ДокОбъект.Организация,ДокОбъект.ТорговаяПлощадка,"Закупка"));			
			СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
			
			Если СтрТЧ.Цена = 0 Тогда 
				СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
			КонецЕсли;
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрТЧ, СтруктураДействий, Неопределено);
		КонецЦикла;
		
		Ок = Истина;
		////НачатьТранзакцию();
		
		Попытка			
			Если ДокОбъект.ПроверитьЗаполнение() Тогда 
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);			
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ ''%1'' не проведен.'; uk = 'Документ ''%1'' не проведений.'"),
				Строка(ДокОбъект.Ссылка)), ДокОбъект.Ссылка);
			КонецЕсли;			
			
			Если ТаблицаВозврата.Количество() > 0 Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВозвратПоставщику.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
				|ГДЕ
				|	ВозвратПоставщику.ПометкаУдаления = ЛОЖЬ
				|	И ВозвратПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|	И ВозвратПоставщику.ДокументОснование = &ДокументОснование";
				
				Запрос.УстановитьПараметр("ДокументОснование", ДокОбъект.Ссылка);
				Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДокОбъект.Дата));
				Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДокОбъект.Дата));
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					Док = Выборка.Ссылка.ПолучитьОбъект();
					Док.Товары.Очистить();
				Иначе
					Док = Документы.ВозвратПоставщику.СоздатьДокумент();
				КонецЕсли;			
				
				Док.Заполнить(ДокОбъект.Ссылка);
				Док.Комментарий = НСтр("ru = 'Создан автоматически при загрузке из OS '; uk = 'Створений автоматично при завантаженні із OS '") + ТекущаяДата();
				Док.Дата = ДокОбъект.Дата + 1;
				Док.Товары.Очистить();
				
				СтруктураПолейДляЗаполненияЦен = Новый Структура;	
				СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Док));
				
				Для Каждого СтТовары Из ТаблицаВозврата Цикл 
					СтрДок = Док.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрДок, СтТовары);
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтТовары.ХарактеристикаНоменклатуры);
					СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", СтТовары.ЕдиницаИзмерения);
					СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
					СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
					СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
					СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
					СтруктураДействий.Вставить("ПересчитатьСумму");
					СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
					
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрДок, СтруктураДействий, Неопределено);					
				КонецЦикла;
				
				Док.Записать();
			КонецЕсли;
			
		Исключение
			Ок = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось загрузить документ Поступление %1 от %2 (%3)
			|Ошибки: %4'; uk = 'Не вдалося завантажити документ Надходження %1 від %2 (%3)
			|Помилки: %4'"),
			тДокЗагрузки.НомерВходящегоДокумента,
			тДокЗагрузки.ДатаВходящегоДокумента,
			ДокОбъект.Контрагент,
			ОписаниеОшибки()));			
		КонецПопытки;
		
		//Если Ок Тогда
		//	ЗафиксироватьТранзакцию();
		//Иначе			
		//	ОтменитьТранзакцию();
		//	Если ТаблицаВозврата.Количество() = 0 Тогда
		//		Попытка
		//			ДокОбъект.Записать();
		//		Исключение	
		//		КонецПопытки;
		//	КонецЕсли;
		//	ВсеОк = Ложь;
		//КонецЕсли;
		
	КонецЦикла;
	
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	КоличествоДокументов);															
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;								
	
КонецПроцедуры

Процедура ЗагрузитьДокументПеремещениеТоваров(ТаблицаДокументов, ПараметрыЗагрузки, СообщениеЗавершения, ВсеОк = Истина)
	
	СОшибками = 0;
	ДокументыНаЗагрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаЗагрузку.Количество();	
	
	Если ТипЗнч(ПараметрыЗагрузки) <> Тип("Структура") Тогда 
		ПараметрыЗагрузки = Новый Структура;
	КонецЕсли;
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченных документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		ВсеОк = Ложь;
		Возврат;
	КонецЕсли;
	
	ИтДок = 0;
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл
		ИтДок = ИтДок + 1;
		
		тСклад = тДокЗагрузки.Склад;
		ИспользоватьХарактеристики = НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(тСклад, тДокЗагрузки.Дата);
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ИтДок/КоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"),
		ИтДок,
		КоличествоДокументов));
		
		
		НовыйДокумент = НЕ ЗначениеЗаполнено(тДокЗагрузки.Документ);
		
		Если НЕ НовыйДокумент Тогда
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();
			
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(тСклад)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
			
		Иначе
			
			ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;
			ДокОбъект.РегламентированныйУчет = Ложь;
			ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ДокОбъект.Дата =  тДокЗагрузки.Дата;
			ДокОбъект.Организация = тДокЗагрузки.Организация;
			ДокОбъект.ПодразделениеКомпании = тСклад.Подразделение;
			ДокОбъект.Комментарий = "Документ загружен из OS " + ТекущаяДата();
			
			ДокОбъект.СкладКомпании = тСклад;
			ДокОбъект.ТорговаяПлощадка = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(тСклад);
			ДокОбъект.ТипЦен = Справочники.СкладыКомпании.ТипЦенРозничный(тСклад);
			ДокОбъект.ВалютаДокумента = ДокОбъект.ТипЦен.ВалютаЦены;
			ДокОбъект.НомерRB = тДокЗагрузки.Номер;
			ДокОбъект.СтатусRB = ПредопределенноеЗначение("Перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется");
			ДокОбъект.КурсДокумента = 1;
			
			//ДокОбъект.СкладПолучатель = ДокОбъект.ПодразделениеКомпании; 
			ТорговаяПлощадкаПолучатель = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(тСклад);
			Если Не ТорговаяПлощадкаПолучатель.Пустая() И Не ТорговаяПлощадкаПолучатель.Родитель.Пустая() Тогда 
				ТорговаяПлощадкаПолучатель = ТорговаяПлощадкаПолучатель.Родитель;
			КонецЕсли;
			
			ДокОбъект.ТорговаяПлощадкаПолучатель = ТорговаяПлощадкаПолучатель;
			
		КонецЕсли;
		
		
		ДокОбъект.Дата =  тДокЗагрузки.Дата;
		
		ЗагружатьКорректировкиПеремещения = Ложь;
		
		Если ПараметрыЗагрузки.Свойство("ЗагружатьКорректировкиПеремещения") Тогда 
			ЗагружатьКорректировкиПеремещения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ЗагружатьКорректировкиПеремещения", Ложь);		
		Иначе
			Если ПараметрыЗагрузки.Свойство("Подразделение") 
				И ТипЗнч(ПараметрыЗагрузки.Подразделение) = Тип("СправочникСсылка.ПодразделенияКомпании") 
				И Не ПараметрыЗагрузки.Подразделение.Пустая() Тогда 
				
				ЗагружатьКорректировкиПеремещения = ПараметрыЗагрузки.Подразделение.РежимЗагрузкиПеремещенийOS = 1;
			КонецЕсли;
		КонецЕсли;
		
		ПеремещениеТоваровВФилал = ДокОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;				
		ФормаРаботыСНедовозами = (ДокОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала) И Не ЗагружатьКорректировкиПеремещения;
		ПолучательБезХарактеристик = ЗначениеЗаполнено(ДокОбъект.СкладКомпанииПолучатель) И Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокОбъект.СкладКомпанииПолучатель, ДокОбъект.Дата);		
		
		Если Не НовыйДокумент И ФормаРаботыСНедовозами И Не ДокОбъект.ДокументОтгрузки.Пустая() Тогда 
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
			|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ПеремещениеТоваровТовары.Коэффициент КАК Коэффициент,
			|	ПеремещениеТоваровТовары.Количество КАК Количество,
			|	ПеремещениеТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
			|	ПеремещениеТоваровТовары.Цена КАК Цена,
			|	ПеремещениеТоваровТовары.Сумма КАК Сумма,
			|	ПеремещениеТоваровТовары.СуммаВсего КАК СуммаВсего,
			|	ПеремещениеТоваровТовары.СтавкаНДС КАК СтавкаНДС,
			|	ПеремещениеТоваровТовары.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			|ГДЕ
			|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ДокОбъект.ДокументОтгрузки);
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда 
				тчТовары = Результат.Выгрузить();
				ДокОбъект.Товары.Загрузить(тчТовары);
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);			
		КонецЕсли;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	V_ЗагруженныеДокументыТовары.ARTID КАК Артикул,
		|	V_ЗагруженныеДокументыТовары.CHARGUID КАК CHARGUID,
		|	V_ЗагруженныеДокументыТовары.PACKQUANT КАК Коэффициент,
		|	V_ЗагруженныеДокументыТовары.QUANTITY КАК Количество,
		|	V_ЗагруженныеДокументыТовары.PACKGUID КАК PACKGUID
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументыТовары КАК V_ЗагруженныеДокументыТовары
		|ГДЕ
		|	V_ЗагруженныеДокументыТовары.DOCID = &DOCID";
		
		Запрос.УстановитьПараметр("DOCID", тДокЗагрузки.DOCID);		
		тзТоварыДокумента = Запрос.Выполнить().Выгрузить();				
		
		ДокОбъект.Комментарий = "Загружен из ОС: " + ТекущаяДата();		
		ДокОбъектТовары = ДокОбъект.Товары;
		ПустаяСсылкаХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();		
		
		Если Не ФормаРаботыСНедовозами Тогда //Перемещение товаров в филиал
			
			ОтправительБезХарактеристик = ПеремещениеТоваровВФилал И ЗначениеЗаполнено(ДокОбъект.СкладКомпании) И Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокОбъект.СкладКомпании, ДокОбъект.Дата);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТоварыОС.Артикул КАК Артикул,
			               |	ТоварыОС.CHARGUID КАК CHARGUID,
			               |	ТоварыОС.Коэффициент КАК Коэффициент,
			               |	ТоварыОС.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	&ТоварыОС КАК ТоварыОС
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	спрНоменклатура.Ссылка КАК Номенклатура,
			               |	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
			               |	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК ОснКоэффициент,
			               |	ВТ.Коэффициент КАК Коэффициент,
			               |	СУММА(ВТ.Количество) КАК Количество,
			               |	спрНоменклатура.СтавкаНДС КАК СтавкаНДС,
			               |	ВЫБОР
			               |		КОГДА спрНоменклатура.ИспользованиеХарактеристик
			               |				И НЕ &ОтправительБезХарактеристик
			               |			ТОГДА ВТ.CHARGUID
			               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
			               |	КОНЕЦ КАК CHARGUID,
			               |	ЕСТЬNULL(спрНоменклатура.ТипНоменклатуры.Весовой, ЛОЖЬ) КАК Весовой
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
			               |		ПО ВТ.Артикул = спрНоменклатура.Артикул
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	спрНоменклатура.Ссылка,
			               |	ВТ.Коэффициент,
			               |	спрНоменклатура.ОсновнаяЕдиницаИзмерения,
			               |	спрНоменклатура.СтавкаНДС,
			               |	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1),
			               |	ВЫБОР
			               |		КОГДА спрНоменклатура.ИспользованиеХарактеристик
			               |				И НЕ &ОтправительБезХарактеристик
			               |			ТОГДА ВТ.CHARGUID
			               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
			               |	КОНЕЦ,
			               |	ЕСТЬNULL(спрНоменклатура.ТипНоменклатуры.Весовой, ЛОЖЬ)";
			
			Запрос.УстановитьПараметр("ТоварыОС", тзТоварыДокумента);		
			Запрос.УстановитьПараметр("ОтправительБезХарактеристик", ОтправительБезХарактеристик);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			ДокОбъектТовары.Очистить();
			
			Пока Выборка.Следующий() Цикл 				
				Если Не ОтправительБезХарактеристик И ЗначениеЗаполнено(Выборка.CHARGUID) Тогда 
					Попытка
						ГУИД_Характеристика = Новый УникальныйИдентификатор(СокрЛП(Выборка.CHARGUID));
						Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ГУИД_Характеристика);
						
						Если Не ОбщегоНазначения.СсылкаСуществует(Характеристика) Тогда 
							Характеристика = ПустаяСсылкаХарактеристика;
						КонецЕсли;
					Исключение
						ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки()); 
					КонецПопытки;
				Иначе
					Характеристика = ПустаяСсылкаХарактеристика;
				КонецЕсли;
				
				ОсновнойКоэффициент = ?(Выборка.ОснКоэффициент <> 0, Выборка.ОснКоэффициент, 1);
				БазКолВо = Выборка.Количество * Выборка.Коэффициент;				
				
				Если Выборка.Весовой Тогда 
					КолВо = БазКолВо/ОсновнойКоэффициент;
				Иначе
					КолВо = Цел(БазКолВо/ОсновнойКоэффициент);
				КонецЕсли;
				
				Если КолВо = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				нСтрокаТовары = ДокОбъектТовары.Добавить();
				нСтрокаТовары.Номенклатура 				 = Выборка.Номенклатура;
				нСтрокаТовары.ХарактеристикаНоменклатуры = Характеристика;
				нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
				нСтрокаТовары.Коэффициент                = ОсновнойКоэффициент;
				нСтрокаТовары.КоличествоБазовое          = КолВо * ОсновнойКоэффициент;
				нСтрокаТовары.Количество                 = КолВо;
				нСтрокаТовары.СтавкаНДС                  = Выборка.СтавкаНДС;												
			КонецЦикла;
			
		Иначе // Перемещение товаров из филиала
			
			ПолучательБезХарактеристик = ЗначениеЗаполнено(ДокОбъект.СкладКомпанииПолучатель) И Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокОбъект.СкладКомпанииПолучатель, ДокОбъект.Дата);
			
			ТаблицаВозврата = Новый ТаблицаЗначений;
			ТаблицаВозврата.Колонки.Добавить("Номенклатура");
			ТаблицаВозврата.Колонки.Добавить("ХарактеристикаНоменклатуры");
			ТаблицаВозврата.Колонки.Добавить("ЕдиницаИзмерения");
			ТаблицаВозврата.Колонки.Добавить("Коэффициент");
			ТаблицаВозврата.Колонки.Добавить("Количество");
			ТаблицаВозврата.Колонки.Добавить("КоличествоБазовое");
			ТаблицаВозврата.Колонки.Добавить("СтавкаНДС");		
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТоварыОС.Артикул КАК Артикул,
			               |	ТоварыОС.CHARGUID КАК CHARGUID,
			               |	ТоварыОС.Коэффициент КАК Коэффициент,
			               |	ТоварыОС.Количество КАК Количество
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	&ТоварыОС КАК ТоварыОС
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	спрНоменклатура.Ссылка КАК Номенклатура,
			               |	ВТ.CHARGUID КАК CHARGUID,
			               |	спрНоменклатура.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
			               |	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
			               |	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК ОснКоэффициент,
			               |	ВТ.Коэффициент КАК Коэффициент,
			               |	ВТ.Количество КАК Количество,
			               |	спрНоменклатура.СтавкаНДС КАК СтавкаНДС,
			               |	ЕСТЬNULL(спрНоменклатура.ТипНоменклатуры.Весовой, ЛОЖЬ) КАК Весовой
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
			               |		ПО ВТ.Артикул = спрНоменклатура.Артикул";
			
			Запрос.УстановитьПараметр("ТоварыОС", тзТоварыДокумента);		
			
			Результат = Запрос.Выполнить();
			
			Выборка   = Результат.Выбрать();
			
			МассивНоменклатуры = Новый Массив;
			
			Если Не ФормаРаботыСНедовозами Тогда
				Для Каждого СтрТовары Из ДокОбъектТовары Цикл
					СтрТовары.Количество = 0;
					СтрТовары.КоличествоБазовое = 0;
				КонецЦикла;
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл 
				ОсновнойКоэффициент = ?(Выборка.ОснКоэффициент <> 0, Выборка.ОснКоэффициент, 1);
				БазКолВо = Выборка.Количество * Выборка.Коэффициент;
				
				СтруктураОтбор = Новый Структура;
				СтруктураОтбор.Вставить("Номенклатура", Выборка.Номенклатура);
				
				Если Не ПолучательБезХарактеристик 
					И Выборка.ИспользованиеХарактеристик 
					И ЗначениеЗаполнено(Выборка.CHARGUID) 
					И СокрЛП(Выборка.CHARGUID) <> "00000000-0000-0000-0000-000000000000" Тогда 
					
					Попытка
						ГУИД_Характеристика = Новый УникальныйИдентификатор(СокрЛП(Выборка.CHARGUID));
						Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(ГУИД_Характеристика);
						
						Если ОбщегоНазначения.СсылкаСуществует(Характеристика) Тогда 
							СтруктураОтбор.Вставить("ХарактеристикаНоменклатуры", Характеристика);
						Иначе
							ОбщегоНазначения.СообщитьПользователю(
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не найдена Характеристика для ""%1"" с идентификатором - ""%2""'; uk = 'Не знайдена Характеристика для ""%1"" з ідентифікатором - ""%2""'"),
							Выборка.Номенклатура,
							СокрЛП(Выборка.CHARGUID)));
						КонецЕсли;
					Исключение
						ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки()); 
					КонецПопытки;
					
				КонецЕсли;
				
				нСтрокиДокумента = ДокОбъектТовары.НайтиСтроки(СтруктураОтбор);
				Если нСтрокиДокумента.Количество() = 0 Тогда
					Если Выборка.Весовой Тогда
						КолВо = БазКолВо/ОсновнойКоэффициент;
					Иначе
						КолВо = Цел(БазКолВо/ОсновнойКоэффициент);
					КонецЕсли;
					
					Если КолВо > 0 Тогда 
						нСтрокаТовары = ДокОбъектТовары.Добавить();
						нСтрокаТовары.Номенклатура 				 = СтруктураОтбор.Номенклатура;
						нСтрокаТовары.ХарактеристикаНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтбор, "ХарактеристикаНоменклатуры", ПустаяСсылкаХарактеристика);
						нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
						нСтрокаТовары.Коэффициент                = ОсновнойКоэффициент;
						нСтрокаТовары.КоличествоБазовое          = КолВо * ОсновнойКоэффициент;
						нСтрокаТовары.Количество                 = КолВо;
						нСтрокаТовары.СтавкаНДС                  = Выборка.СтавкаНДС;				
					КонецЕсли;
				Иначе
					нСтрокаТовары = нСтрокиДокумента[0];
					
					Если ФормаРаботыСНедовозами Тогда
						КолВоКорректировка = нСтрокаТовары.КоличествоБазовое - БазКолВо;
						
						Если КолВоКорректировка > 0 Тогда
							Если Выборка.Весовой Тогда 
								КолВо = КолВоКорректировка/ОсновнойКоэффициент;
							Иначе
								КолВо = Цел(КолВоКорректировка/ОсновнойКоэффициент);
							КонецЕсли;
							
							СтрВоз = ТаблицаВозврата.Добавить();
							ЗаполнитьЗначенияСвойств(СтрВоз, нСтрокаТовары, "Номенклатура, ХарактеристикаНоменклатуры");
							СтрВоз.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
							СтрВоз.Коэффициент				  = ОсновнойКоэффициент;
							СтрВоз.КоличествоБазовое		  = КолВо * ОсновнойКоэффициент;
							СтрВоз.Количество                 = КолВо;
							СтрВоз.СтавкаНДС				  = Выборка.СтавкаНДС; 
						КонецЕсли;
						
					Иначе
						Если Выборка.Весовой Тогда
							КолВо = БазКолВо / ОсновнойКоэффициент;
						Иначе
							КолВо = Цел(БазКолВо/ОсновнойКоэффициент);
						КонецЕсли;
						
						нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
						нСтрокаТовары.Коэффициент                = ОсновнойКоэффициент;
						нСтрокаТовары.КоличествоБазовое          = КолВо * ОсновнойКоэффициент;
						нСтрокаТовары.Количество                 = КолВо;
						нСтрокаТовары.СтавкаНДС                  = Выборка.СтавкаНДС;					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ФормаРаботыСНедовозами Тогда
				
				втТовары = ДокОбъектТовары.Выгрузить();							
				МассивСтрокУдаления = Новый Массив;
				
				Для Каждого СтрТовары Из втТовары Цикл
					Если СтрТовары.КоличествоБазовое = 0 Тогда 
						МассивСтрокУдаления.Добавить(СтрТовары);
					КонецЕсли;
				КонецЦикла;
				
				Если МассивСтрокУдаления.Количество() > 0 Тогда 
					Для Каждого СтрУд Из МассивСтрокУдаления Цикл 
						втТовары.Удалить(СтрУд);
					КонецЦикла;
					
					ДокОбъектТовары.Загрузить(втТовары);
				КонецЕсли;		
			КонецЕсли;			
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокОбъект));		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		Если ПолучательБезХарактеристик Тогда 
			СтруктураДействий.Вставить("ЦеныБезХарактеристики", Истина);
		КонецЕсли;
		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокОбъектТовары, СтруктураДействий, Неопределено);
		
		ОК = Истина;
		Попытка
			Если ДокОбъект.ПроверитьЗаполнение() Тогда 
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				СОшибками = СОшибками + 1;
				
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
				ДокОбъект.Ссылка,
				тСклад),
				ДокОбъект.Ссылка);
				
			КонецЕсли;
			
			Если ФормаРаботыСНедовозами Тогда 
				Если ТаблицаВозврата.Количество() > 0 Тогда
					
					//ОМ.ПолучитьПодчиненныеПоВиду(ДокОбъект.Ссылка, "ПеремещениеТоваров",,Ложь);				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	СвязанныеДокументы.Ссылка КАК Ссылка
					|ИЗ
					|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
					|ГДЕ
					|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
					|	И НЕ ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.ПеремещениеТоваров).ПометкаУдаления";
					
					Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
					
					Рез = Запрос.Выполнить().Выгрузить();
					
					Если Рез.Количество()>0 тогда
						Док = Рез[0].Ссылка.ПолучитьОбъект();					
					Иначе 
						Док = Документы.ПеремещениеТоваров.СоздатьДокумент();   
					КонецЕсли;
					
					Док.Дата = ДокОбъект.Дата + 1;
					Док.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
					Док.РегламентированныйУчет = Ложь;
					Док.Автор = ПараметрыСеанса.ТекущийПользователь;
					Док.Организация = ДокОбъект.Организация;
					Док.ПодразделениеКомпании = ДокОбъект.ПодразделениеКомпании;			
					
					Док.СкладКомпании = ДокОбъект.СкладКомпанииПолучатель;
					Док.ТорговаяПлощадка = ?(ЗначениеЗаполнено(ДокОбъект.ТорговаяПлощадкаПолучатель),
					ДокОбъект.ТорговаяПлощадкаПолучатель, 
					Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(ДокОбъект.СкладКомпанииПолучатель));
					
					Док.ТипЦен = Док.СкладКомпании.ТипЦенСебестоимости;
					Док.ВалютаДокумента = ДокОбъект.ТипЦен.ВалютаЦены;
					Док.СтатусRB = ПредопределенноеЗначение("Перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется");
					Док.КурсДокумента = 1;
					Док.СкладКомпанииПолучатель = ДокОбъект.СкладКомпании;
					Док.ТорговаяПлощадкаПолучатель = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(ДокОбъект.СкладКомпании);
					Док.ДокументОснование = ДокОбъект.Ссылка;
					Док.Комментарий = "Создан автоматически при загрузке из ОС " + ТекущаяДата();
					
					ДокТовары = Док.Товары;
					ДокТовары.Очистить();
					
					Для Каждого СтТовары Из ТаблицаВозврата Цикл 
						СтрДок = ДокТовары.Добавить();					
						ЗаполнитьЗначенияСвойств(СтрДок, СтТовары);					
					КонецЦикла;
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
					|	ЦеныСрезПоследних.Характеристика КАК Характеристика,
					|	ЦеныСрезПоследних.Цена КАК Цена
					|ИЗ
					|	РегистрСведений.Цены.СрезПоследних(
					|			&ДатаЦены,
					|			ТипЦен = &ТипЦен
					|				И Номенклатура В (&МассивТоваров)) КАК ЦеныСрезПоследних";
					
					Запрос.УстановитьПараметр("ДатаЦены", Док.Дата);
					Если Док.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал") Тогда
						Запрос.УстановитьПараметр("ТипЦен", Док.СкладКомпании.ТипЦенСебестоимости);
					Иначе
						Запрос.УстановитьПараметр("ТипЦен", Док.СкладКомпанииПолучатель.ТипЦенСебестоимости);
					КонецЕсли;
					
					Запрос.УстановитьПараметр("МассивТоваров", ДокТовары.ВыгрузитьКолонку("Номенклатура"));
					
					РезультатЗапроса = Запрос.Выполнить();
					тзЦены = РезультатЗапроса.Выгрузить();
					
					Для Каждого СтрТовар Из  ДокТовары Цикл 
						тОтбор = Новый Структура("Номенклатура,Характеристика",СтрТовар.Номенклатура,СтрТовар.ХарактеристикаНоменклатуры);
						
						нЦены = тзЦены.НайтиСтроки(тОтбор);
						Если нЦены.Количество()>0 Тогда
							СтрТовар.Цена =  нЦены[0].Цена;
							//Док.ОбработкаРеквизита("Товары.Цена",СтрТовар);
						КонецЕсли;
						
					КонецЦикла;
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
					СтруктураДействий.Вставить("ПересчитатьСумму");
					СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
					
					ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Док.Товары, СтруктураДействий, Неопределено);
					
					Если Док.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал") Тогда
						СкладРозничный = Док.СкладКомпании.Розничный;
					Иначе
						СкладРозничный = Док.СкладКомпанииПолучатель.Розничный;
					КонецЕсли;
					
					//Попытка
					Если Док.ПроверитьЗаполнение() Тогда 
						Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					Иначе
						Док.Записать(РежимЗаписиДокумента.Запись);
						
						ОК = Ложь;
						СОшибками = СОшибками + 1;
						
						ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
						Док.Ссылка,
						тСклад),
						Док.Ссылка);
					КонецЕсли;
					//Исключение
					//	СОшибками = СОшибками + 1;
					//	ОК = Ложь;
					//	ОбщегоНазначения.СообщитьПользователю(
					//		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					//			НСтр("ru = 'Не удалось записать Перемещение возврат (вычерки) по складу %1.
					//                  |Ошибки: %2'; uk = 'Не вдалося записати Переміщення повернення (виправлення) по складу %1.
					//                  |Помилки: %2'"),
					//			тСклад,
					//			ОписаниеОшибки()));
					//КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		Исключение									
			ОК = Ложь;			
			ОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);			
			СОшибками = СОшибками + 1;
			
			Попытка
				ДокОбъект.Комментарий = ОписаниеОшибки;
				ДокОбъект.Записать();
				
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
				ДокОбъект.Ссылка,
				тСклад),
				ДокОбъект.Ссылка);
			Исключение
			КонецПопытки;	
			
		КонецПопытки;
		
	КонецЦикла;
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	КоличествоДокументов);
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;								
	
	
КонецПроцедуры

Процедура ЗагрузитьДокументТКС(ТаблицаДокументов, ТаблицаТКС, СообщениеЗавершения, ВсеОкЗагрузка = Истина)
	
	СОшибками = 0;
	ДокументыНаЗагрузку  = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаЗагрузку.Количество();
	
	ВсеОкЗагрузка  = Истина;
	Параметры = Новый Структура;
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченых документов для выгрузки'; uk = 'Немає відмічених документів для вивантаження'"));
		Параметры.Вставить("ОК", ВсеОкЗагрузка);
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОбъекты = Новый Структура();
	ТаблицаСоответствийДоговоров =  Новый ТаблицаЗначений;
	ТаблицаСоответствийДоговоров.Колонки.Добавить("Подразделение");
	ТаблицаСоответствийДоговоров.Колонки.Добавить("Контрагент");
	ТаблицаСоответствийДоговоров.Колонки.Добавить("Договор");
	
	сКоличествоДокументов = Строка(КоличествоДокументов);
	ОбработаноДокументов = 0;
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов/КоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"),
		ОбработаноДокументов,
		КоличествоДокументов));
		
		
		
		ВсеОк                = Истина;
		Ошибки               = "";
		тGuidСистемыСоздания = тДокЗагрузки.GuidСистемыСоздания;
		сДанныеДокумента     = ТаблицаТКС.Найти(тGuidСистемыСоздания, "GuidСистемыСоздания");
		
		Если сДанныеДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		тПризнакВозврата     = сДанныеДокумента.ПризнакВозврата;
		ДатаВДокумент        = тДокЗагрузки.Дата;
		тСклад 		         = тДокЗагрузки.Склад;
		тНомерКарты          = Формат(сДанныеДокумента.НомерКарты,"ЧЦ=20; ЧГ=");
		
		Если ЗначениеЗаполнено(тДокЗагрузки.Документ) Тогда
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();						
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(тСклад)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
			
			ДокОбъект.Товары.Очистить();
		Иначе
			Если тПризнакВозврата = 0 Тогда
				ДокОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
				ДокОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РеализацияТоваровРозница");			
			Иначе
				ДокОбъект = Документы.ВозвратОтПокупателя.СоздатьДокумент();
				ДокОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровОтПокупателя");					
			КонецЕсли;
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Карточки.Ссылка КАК Карта
		|ИЗ
		|	Справочник.Карточки КАК Карточки
		|ГДЕ
		|	Карточки.ШтрихКод = &ШтрихКод";
		
		Запрос.УстановитьПараметр("ШтрихКод", тНомерКарты);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			тКарта      = ВыборкаДетальныеЗаписи.Карта;			
		Иначе
			тКарта      = ПредопределенноеЗначение("Справочник.Карточки.ПустаяСсылка");
		КонецЕсли;	
		
		тКонтрагент = Справочники.Контрагенты.НайтиПоКоду("D31149163"); // Деметра ЧП
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипЦенРозничнойТорговли КАК ТипЦенСклада,
		|	СкладыКомпании.Розничный КАК ТипСкладаРозничный,
		|	СкладыКомпании.ТипЦенРозничнойТорговли.ВалютаЦены КАК ВалютаЦеныСклада,
		|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ТорговаяПлощадка = ВЫРАЗИТЬ(&Склад КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
		|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
		|ГДЕ
		|	СкладыКомпании.Ссылка = &Склад";
		
		
		Запрос.УстановитьПараметр("НаДату", ДатаВДокумент);
		Запрос.УстановитьПараметр("Склад", тСклад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			тОрганизация      = ВыборкаДетальныеЗаписи.Организация;
			тПодразделение 	  = ВыборкаДетальныеЗаписи.Подразделение;
			тТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
			ЭтоРозничныйСклад = ВыборкаДетальныеЗаписи.ТипСкладаРозничный;
			
			Если ЭтоРозничныйСклад Тогда
				тТипЦен       = ВыборкаДетальныеЗаписи.ТипЦенСклада;
				тВалюта       = ВыборкаДетальныеЗаписи.ВалютаЦеныСклада;
			Иначе
				тТипЦен       = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");	//ВыборкаДетальныеЗаписи.ТипЦенПодразделения; 
				тВалюта       = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");		//ВыборкаДетальныеЗаписи.ВалютаЦеныПодразделения;
			КонецЕсли;
		Иначе
			тОрганизация      = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
			тПодразделение 	  = ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка");
			тТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка");
			ЭтоРозничныйСклад = Ложь;
			тТипЦен 		  = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");
			тВалюта 		  = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		КонецЕсли;
		
		ДокОбъект.Автор		  = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Дата 		  = ДатаВДокумент;
		ДокОбъект.Организация = тОрганизация;
		ДокОбъект.ПодразделениеКомпании    = тПодразделение;
		//ДокОбъект.ПодразделениеКонтрагента = тПодразделение;
		ДокОбъект.СкладКомпании            = тСклад;
		ДокОбъект.ТорговаяПлощадка		   = тТорговаяПлощадка;
		ДокОбъект.Контрагент               = тКонтрагент;
		ДокОбъект.Карта                    = тКарта;
		ДокОбъект.Комментарий			   = "Документ загружен из OS " + ТекущаяДата();				
		ДокОбъект.GuidСистемыСоздания = тGuidСистемыСоздания;
		
		ДокОбъект.ТипЦен              = тТипЦен;
		ДокОбъект.ВалютаДокумента     = тВалюта;
		//ДокОбъект.КурсВалютыУпр = 1;
		ДокОбъект.КурсДокумента = 1;
		ДокОбъект.РегламентированныйУчет = Ложь;
		ДокОбъект.ПроведенПоКарте        = Истина;
		
		нтзДоступныйДоговор = ТаблицаСоответствийДоговоров.НайтиСтроки(Новый Структура("Подразделение,Контрагент",тПодразделение,тКонтрагент));
		
		Если нтзДоступныйДоговор.Количество()  = 0 Тогда
			
			//?????
			//тзДоступныеДоговора = ОМ.ПолучитьДоступныеДоговоры((Новый Структура("Дата,Владелец,Организация,Подразделение,ВидыДоговоровСправочник", ДатаВДокумент,тКонтрагент,тОрганизация,тПодразделение,Справочники.ВидыДоговоров.ПродажаПоКартам)),Истина);
			
			//тзДоступныеДоговора = Новый Массив;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ДоговорыКонтрагентов.Ссылка КАК Договор
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
			|	И ДоговорыКонтрагентов.Организация = &Организация
			|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
			|	И ДоговорыКонтрагентов.Подразделение = &Подразделение
			|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &Дата
			|	И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &Дата";
			
			Запрос.УстановитьПараметр("Организация", тОрганизация);
			Запрос.УстановитьПараметр("Контрагент", тКонтрагент);
			Запрос.УстановитьПараметр("Подразделение", тПодразделение);
			Запрос.УстановитьПараметр("Дата", ДатаВДокумент);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда 
				текДоговор = Выборка.Договор;
				
				ДокОбъект.ДоговорВзаиморасчетов = текДоговор;
				
				нСоотДоговор = ТаблицаСоответствийДоговоров.Добавить();
				нСоотДоговор.Подразделение = тПодразделение;
				нСоотДоговор.Контрагент    = тКонтрагент;
				нСоотДоговор.Договор       = текДоговор;
				
			Иначе				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'ВНИМАНИЕ! Не удалось получить ни доного актуального договора с контрагентом '''; uk = 'УВАГА! Не вдалося отримати жодного актуального договору з контрагентом '''") + тКонтрагент + "'");
				ВсеОкЗагрузка = Ложь;				
			КонецЕсли;			
			
		Иначе
			
			ДокОбъект.ДоговорВзаиморасчетов = нтзДоступныйДоговор[0].Договор;
			
		КонецЕсли;
		
		
		//Если тПризнакВозврата = 0 Тогда
		//	ДокОбъект.ДатаФакт = ДатаВДокумент;
		//	ДокОбъект.НеПересчитыватьЦены = Истина;
		//	ДокОбъект.НеФормироватьДвиженияПоБонусам = Истина;
		//КонецЕсли;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	V_ТКС_Товары.Артикул КАК ARTID,
		|	V_ТКС_Товары.ЕдИзмГУИД КАК PACKGUID,
		|	V_ТКС_Товары.ХарГУИД КАК CHARGUID,
		|	V_ТКС_Товары.Коэф / 1000 КАК Коэффициент,
		|	V_ТКС_Товары.Цена / 100 КАК Цена,
		|	V_ТКС_Товары.Кол КАК Количество,
		|	V_ТКС_Товары.Кол * V_ТКС_Товары.Коэф / 1000 КАК КоличествоБазовое,
		|	V_ТКС_Товары.Скидка / 100 КАК СуммаСкидки,
		|	V_ТКС_Товары.Сумма / 100 КАК СуммаВсего,
		|	V_ТКС_Товары.БонусНач,
		|	V_ТКС_Товары.БонусОпл
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ТКС_Товары КАК V_ТКС_Товары
		|ГДЕ
		|	V_ТКС_Товары.SAREAID = &SAREAID
		|	И V_ТКС_Товары.SYSTEMID = &SYSTEMID
		|	И V_ТКС_Товары.SESSID = &SESSID
		|	И V_ТКС_Товары.SRECNUM = &SRECNUM";
		
		Запрос.УстановитьПараметр("SAREAID", сДанныеДокумента.НомерМагазина);
		Запрос.УстановитьПараметр("SYSTEMID", сДанныеДокумента.НомерКассы);
		Запрос.УстановитьПараметр("SESSID", сДанныеДокумента.НомерСмены);
		Запрос.УстановитьПараметр("SRECNUM", сДанныеДокумента.НомерЧека);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		тзПродажи = РезультатЗапроса.Выгрузить();
		тзПродажи.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзПродажи.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		тзПродажи.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		тзПродажи.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		тзПродажи.Колонки.Добавить("КлассификаторПродажи",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));
		тзПродажи.Колонки.Добавить("Ставка",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(2,0)));
		тзПродажи.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
		тзПродажи.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
		
		ОбработатьТабличнуюЧасть("Товары",тзПродажи,ЗагруженныеОбъекты);
		
		ЗаполнитьТовары(ДокОбъект,тзПродажи);
		
		СтруктураДействий = Новый Структура;		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокОбъект.Товары, СтруктураДействий, Неопределено);
		
		
		//Обработка наборов ПФ
		//ОбработатьНаборыДокумента(ДокОбъект);
		
		Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваров") Тогда 
			ДокВыпускПродукции = ЗаполнитьВыпускКофе(ДатаВДокумент, ДокОбъект, тСклад, ВсеОк, Ошибки);		
		КонецЕсли;
		
		Попытка
			
			Если ДокОбъект.ПроверитьЗаполнение() Тогда 
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);						
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				СОшибками = СОшибками + 1;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
				ДокОбъект.Ссылка,
				тСклад),
				ДокОбъект.Ссылка);
				
			КонецЕсли;
			
		Исключение
			СОшибками = СОшибками + 1;
			ОписаниеОшибки = ОписаниеОшибки(); 		
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки + " по складу "+ тСклад);
			
			Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки + " по складу "+ тСклад);
			
			ВсеОк = Ложь;
			ВсеОкЗагрузка = Ложь;
			СОшибками = СОшибками + 1;
			
			Попытка
				Если НЕ ДокОбъект.Проведен тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				иначе
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки(); 							
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки + " по складу "+ тСклад);			
				Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки + " по складу " + тСклад);
			КонецПопытки;
			
			Если ДокВыпускПродукции <> Неопределено Тогда 
				Попытка
					ДокВыпускПродукции.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось отменить проведение документа '; uk = 'Не вдалося відмінити проведення документу '") + ДокВыпускПродукции);
				КонецПопытки;
			КонецЕсли;
			
		КонецПопытки;
		
		Если НЕ ВсеОк тогда
			Если НЕ Параметры.Свойство("Ошибки") тогда Параметры.Вставить("Ошибки");КонецЕсли;
			Параметры.Ошибки = ДобавитьНовуюСтроку("Ошибка загрузки ТКС : ", Ошибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Параметры.Вставить("ОК", ВсеОкЗагрузка);
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	КоличествоДокументов);
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;								
	
КонецПроцедуры

Процедура ЗагрузитьДокументВозвратПоставщику(ТаблицаДокументов, СообщениеЗавершения, ВсеОк = Истина)
	
	СОшибками = 0;
	ДокументыНаЗагрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаЗагрузку.Количество();	
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченных документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		ВсеОк = Ложь;
		Возврат;
	КонецЕсли;
	
	ИтДок = 0;
	
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл 
		ИтДок = ИтДок + 1;
		
		тСклад = тДокЗагрузки.Склад;
		ИспользоватьХарактеристики = НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(тСклад, тДокЗагрузки.Дата);
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ИтДок/КоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"),
		ИтДок,
		КоличествоДокументов));
		
		
		НовыйДокумент = НЕ ЗначениеЗаполнено(тДокЗагрузки.Документ);
		
		Если НЕ НовыйДокумент Тогда
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(ДокОбъект.СкладКомпании)),
				тДокЗагрузки.Документ);
				
				СОшибками = СОшибками + 1;
				Продолжить;
			КонецЕсли;
		Иначе
			
			ДокОбъект = Документы.ВозвратПоставщику.СоздатьДокумент();			
			ДокОбъект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщику");
			ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ДокОбъект.Организация = тДокЗагрузки.Организация;
			ДокОбъект.ПодразделениеКомпании = тСклад.Подразделение;
			ДокОбъект.СкладКомпании = тСклад;
			ДокОбъект.ТорговаяПлощадка = тСклад.ТорговаяПлощадка;
			ДокОбъект.ТипЦен = тСклад.ТипЦенСебестоимости;
			ДокОбъект.ВалютаДокумента = ДокОбъект.ТипЦен.ВалютаЦены;
			ДокОбъект.НомерRB = тДокЗагрузки.Номер;
			ДокОбъект.СтатусRB = ПредопределенноеЗначение("Перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется");
			ДокОбъект.КурсДокумента = 1;
			ДокОбъект.Контрагент =  тДокЗагрузки.Контрагент;
			ДокОбъект.РегламентированныйУчет = Не ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(ДокОбъект.Контрагент);
			//ДокОбъект.ВхДокНомер = тДокЗагрузки.НомерВходящегоДокумента;	
			//ДокОбъект.ВхДокДата  = ?(тДокЗагрузки.ДатаВходящегоДокумента <> Дата("19000101"), тДокЗагрузки.ДатаВходящегоДокумента, Неопределено);			
			
			
			МенеджерСправочника = Справочники.ДоговорыКонтрагентов;		
			СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(ДокОбъект.Ссылка, ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров"));
			Договор = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(тДокЗагрузки.Контрагент, тДокЗагрузки.Организация, ДокОбъект.ПодразделениеКомпании, СписокВидовДоговоров, , тДокЗагрузки.Дата);	
			
			ДокОбъект.ДоговорВзаиморасчетов = Договор;
			
		КонецЕсли;					
		
		ДокОбъект.Дата =  тДокЗагрузки.Дата;
		
		ДокОбъект.Комментарий = "Загружен из ОС: " + ТекущаяДата();
		ДокОбъектТовары = ДокОбъект.Товары;
		
		Запрос = Новый Запрос;
		ТекстЗапроса = 	"ВЫБРАТЬ
		|	V_ЗагруженныеДокументыТовары.ARTID КАК Артикул, "+?(ИспользоватьХарактеристики," V_ЗагруженныеДокументыТовары.CHARGUID КАК CHARGUID,","")+"
		|	V_ЗагруженныеДокументыТовары.PACKQUANT КАК Коэффициент,
		|	СУММА(V_ЗагруженныеДокументыТовары.QUANTITY) КАК Количество
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗагруженныеДокументыТовары КАК V_ЗагруженныеДокументыТовары
		|ГДЕ
		|	V_ЗагруженныеДокументыТовары.DOCID = &DOCID
		|
		|СГРУППИРОВАТЬ ПО
		|	V_ЗагруженныеДокументыТовары.ARTID, "+?(ИспользоватьХарактеристики," V_ЗагруженныеДокументыТовары.CHARGUID,","")+"
		|	V_ЗагруженныеДокументыТовары.PACKQUANT";
		
		Запрос.Текст = ТекстЗапроса;			
		Запрос.УстановитьПараметр("DOCID", тДокЗагрузки.DOCID);		
		тзТоварыДокумента = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст =   "ВЫБРАТЬ
		|	ТоварыОС.Артикул, "+?(ИспользоватьХарактеристики," ТоварыОС.CHARGUID,","")+"
		|	ТоварыОС.Коэффициент,
		|	ТоварыОС.Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТоварыОС КАК ТоварыОС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Номенклатура, "+?(ИспользоватьХарактеристики," ВТ.CHARGUID,","")+"
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения,
		|	спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОснКоэффициент,
		|	ВТ.Коэффициент,
		|	ВТ.Количество
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО ВТ.Артикул = спрНоменклатура.Артикул";
		
		Запрос.УстановитьПараметр("ТоварыОС",тзТоварыДокумента);
		
		Результат = Запрос.Выполнить();		
		Выборка   = Результат.Выбрать();
		
		ПустаяСсылкаХарактеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");		
		
		СтруктураДействий = Новый Структура;	
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");			
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "Сумма");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокОбъект));												
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
		
		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		ДокОбъектТовары.Очистить();
		
		Пока Выборка.Следующий() Цикл 
			КолВо = Выборка.Количество * Выборка.Коэффициент;
			
			Если ИспользоватьХарактеристики И СокрЛП(Выборка.CHARGUID) <> "00000000-0000-0000-0000-000000000000"  Тогда
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Выборка.CHARGUID)));	
			КонецЕсли;
			
			нСтрокаТовары = ДокОбъектТовары.Добавить();
			нСтрокаТовары.Номенклатура = Выборка.Номенклатура;
			нСтрокаТовары.ХарактеристикаНоменклатуры = ?(ИспользоватьХарактеристики,Характеристика,ПустаяСсылкаХарактеристика);
			нСтрокаТовары.ЕдиницаИзмерения           = Выборка.ОсновнаяЕдиницаИзмерения;
			нСтрокаТовары.Коэффициент                = Выборка.ОснКоэффициент;
			нСтрокаТовары.КоличествоБазовое          = КолВо;
			нСтрокаТовары.Количество                 = КолВо / ?(Выборка.ОснКоэффициент > 0, Выборка.ОснКоэффициент, 1);
			
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", нСтрокаТовары.ЕдиницаИзмерения);				
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(нСтрокаТовары, СтруктураДействий, КэшированныеЗначения);		
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);						
		Исключение			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось загрузить документ Поступление %1 от %2 (%3)
			|Ошибки: %4'; uk = 'Не вдалося завантажити документ Надходження %1 від %2 (%3)
			|Помилки: %4'"),
			тДокЗагрузки.НомерВходящегоДокумента,
			тДокЗагрузки.ДатаВходящегоДокумента,
			ДокОбъект.Контрагент,
			ОписаниеОшибки()));	
			
			СОшибками = СОшибками + 1;
		КонецПопытки;
	КонецЦикла;
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	КоличествоДокументов);															
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;								
	
КонецПроцедуры



Функция СформироватьОтчетПоЦенамОС(Параметры) 
	
	Перем ОтборПоТоварам, ОтборВидСравненияНоменклатура, ОтборНоменклатура;
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТекстСообщения = "";
	ДлительныеОперации.СообщитьПрогресс(0, "Подключаемся к внешнему источнику");
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Истина, Параметры.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("ФормированиеОтчета." + Параметры.ВидОтчета, УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОтборПоТоварам 					= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборПоТоварам", Ложь);
	ОтборВидСравненияНоменклатура 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВидСравненияНоменклатура", ВидСравнения.Равно);
	ОтборНоменклатура				= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборНоменклатура", Ложь);
	//ОтборПоСкладам					= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборПоСкладам", Ложь);
	
	Запрос = Новый Запрос;
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	dbo_PACKPRCHISTORY.PRCLEVELID КАК ИД_ТипЦен,
	|	dbo_PRCLEVEL.PRCLEVELNAME КАК ТипЦен,
	|	Товары.Код_Товара,
	|	Товары.Наименование_Краткое КАК НаименованиеКраткоеТовара,
	|	Товары.Наименование КАК НаименованиеТовара,
	|	Упаковки.УпаковкаБазовая КАК БазоваяЕдИзм,
	|	dbo_PACKPRCHISTORY.PACKID КАК ИД_ЕдИзм,
	|	Упаковки.Наименование КАК НаименованиеЕдИзме,
	|	Упаковки.Количество КАК КофЕдИзм,
	|	dbo_PACKPRCHISTORY.ENTITYDATE КАК ДатаЦены,
	|	dbo_PACKPRCHISTORY.PACKPRICE / 100 КАК Цена,
	|	dbo_PACKPRCHISTORY.DELFLAG КАК ПометкаУдаленияЦены,
	|	dbo_PACKPRCHISTORY.UPDATENUM КАК НомерОбновленияЦены,
	|	Упаковки.Удален КАК Упаковка_Удален
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.dbo_PACKPRCHISTORY КАК dbo_PACKPRCHISTORY
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.OpenStore.Таблица.Упаковки КАК Упаковки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.OpenStore.Таблица.Товары КАК Товары
	|			ПО Упаковки.Артикул_Товара = Товары.Ссылка
	|		ПО dbo_PACKPRCHISTORY.PACKID = Упаковки.Артикул
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.OpenStore.Таблица.dbo_PRCLEVEL КАК dbo_PRCLEVEL
	|		ПО dbo_PACKPRCHISTORY.PRCLEVELID = dbo_PRCLEVEL.PRCLEVELID
	|ГДЕ
	|	1 = 1
	|	И 2 = 2";		
	
	МассивАртикулов = Новый Массив; 	
	Если ОтборПоТоварам Тогда
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.Текст = 
		"ВЫБРАТЬ
		|	спрНоменклатура.Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК спрНоменклатура
		|ГДЕ
		|	спрНоменклатура.ЭтоГруппа = ЛОЖЬ
		|{ГДЕ
		|	спрНоменклатура.Ссылка.* КАК Номенклатура}";
		
		ПостроительЗапроса.Отбор.Добавить("Номенклатура");
		ПостроительЗапроса.Отбор.Номенклатура.Использование = Истина;
		ПостроительЗапроса.Отбор.Номенклатура.ВидСравнения  = ОтборВидСравненияНоменклатура;
		ПостроительЗапроса.Отбор.Номенклатура.Значение      = ОтборНоменклатура;
		
		ПостроительЗапроса.Выполнить();
		
		ВыборкаТовары = ПостроительЗапроса.Результат.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл 
			МассивАртикулов.Добавить(Число(ВыборкаТовары.Артикул));
		КонецЦикла;
		
		ЗапросТекст = СтрЗаменить(ЗапросТекст,"1 = 1","Товары.Код_Товара В (&Код_Товара)");
		Запрос.УстановитьПараметр("Код_Товара", МассивАртикулов);
		
	КонецЕсли;
	//   "И dbo_PRCLEVEL.PRCLEVELNAME В (&PRCLEVELNAME)"
	
	
	Запрос.Текст = ЗапросТекст;
	
	//	Запрос.УстановитьПараметр("PRCLEVELNAME", PRCLEVELNAME);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЦен = РезультатЗапроса.Выгрузить();
	
	СхемаКомпоновки = ПолучитьМакет("OS_Цены");
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,Настройки);	
	
	ВнешнийНаборДанных = Новый Структура("ТЗ_Цены", ТаблицаЦен); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных); 	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ТабДок); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчетДоприход(Параметры)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,ВидСравнения,ЗначениеОтбора;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Параметры.Свойство("НачалоПериода"  ,НачалоПериода);	
	Параметры.Свойство("КонецПериода"   ,КонецПериода);	
	
	Параметры.Свойство("ВидСравнения" 	,ВидСравнения);
	Параметры.Свойство("ЗначениеОтбора" ,ЗначениеОтбора);
	
	
	ДатаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ОтчетДоприход   = ПолучитьМакет("Доприходы");
	Настройки       = ОтчетДоприход.НастройкиПоУмолчанию;
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанных.Найти("НачалоПериода");
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = ДатаНач;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("КонецПериода");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение =	 ДатаКон;
	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(Неопределено, Параметры);
	СписокСкладов = Новый СписокЗначений;
	Для Каждого Стр Из ТаблицаСкладов Цикл 
		СписокСкладов.Добавить(Стр.СкладКомпании);
	КонецЦикла;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("Склады");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение = СписокСкладов;	
	
	
	Компоновщик  = Новый  КомпоновщикМакетаКомпоновкиДанных;
	Макет = Компоновщик.Выполнить(ОтчетДоприход,Настройки,ДанныеРасшифровкиОтчета);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,,ДанныеРасшифровкиОтчета);
	
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);	
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчетПриходыОС(Параметры)
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,ВидСравнения,ЗначениеОтбора;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Параметры.Свойство("НачалоПериода"  ,НачалоПериода);	
	Параметры.Свойство("КонецПериода"   ,КонецПериода);	
	Параметры.Свойство("ОтборПоСкладам" ,ОтборПоСкладам);
	
	
	ДатаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	
	
	ОтчетДоприход   = ПолучитьМакет("Приходы");
	Настройки       = ОтчетДоприход.НастройкиПоУмолчанию;
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанных.Найти("НачалоПериода");
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = ДатаНач;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("КонецПериода");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение =	 ДатаКон;
	
	Компоновщик  = Новый  КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Макет = Компоновщик.Выполнить(ОтчетДоприход,Настройки,ДанныеРасшифровки);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,,ДанныеРасшифровки,Истина);
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);	
	
КонецФункции

Функция СформироватьОтчетОбъектыБезЗС(Параметры)
	Перем НачалоПериода,КонецПериода, МассивСкладов;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Параметры.Свойство("НачалоПериода"  ,НачалоПериода);	
	Параметры.Свойство("КонецПериода"   ,КонецПериода);	
	Параметры.Свойство("ОтборПоСкладам" ,МассивСкладов);
	
	
	ДатаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	Отчет   = ПолучитьМакет("СкладыБезЗКС");
	Настройки       = Отчет.НастройкиПоУмолчанию;
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанных.Найти("НачалоПериода");
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = ДатаНач;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("КонецПериода");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение =	 ДатаКон;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("Склады");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение = МассивСкладов;
	
	
	Компоновщик  = Новый  КомпоновщикМакетаКомпоновкиДанных;
	Макет = Компоновщик.Выполнить(Отчет,Настройки,ДанныеРасшифровкиОтчета);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет,,ДанныеРасшифровкиОтчета);
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчетРасхожденияЯкобз(Параметры)
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,МассивСкладов;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	
	
	Параметры.Свойство("НачалоПериода"  , НачалоПериода);	
	Параметры.Свойство("КонецПериода"   , КонецПериода);	
	
	ОтборПоСкладам = Параметры.Свойство("ОтборПоСкладам" , МассивСкладов);	
	
	ДатаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;	
	
	ТаблДанныеАвтомата = ПоискФайловПоHTTP(НачалоПериода, КонецПериода);
	
	СписокНоменклатуры = Справочники.Номенклатура.НайтиПоКоду("777880");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Дата КАК Дата,
	|	Таблица.СкладКомпании КАК СкладКомпании,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Количество КАК Количество
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Дата КАК Дата,
	|	Таб.СкладКомпании КАК СкладКомпании,
	|	Таб.Номенклатура КАК Номенклатура,
	|	0 КАК КоличествоПродажПоЗКС,
	|	СУММА(Таб.Количество) КАК КоличествоПродажПоАвтомату
	|ПОМЕСТИТЬ Обьединенные
	|ИЗ
	|	Таб КАК Таб
	|ГДЕ
	|	"+ ?(ОтборПоСкладам, "Таб.СкладКомпании В(&Склады)", "ИСТИНА") +" 
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.СкладКомпании,
	|	Таб.Дата,
	|	Таб.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ),
	|	ПродажиОбороты.СкладКомпании,
	|	ПродажиОбороты.Номенклатура,
	|	СУММА(ПродажиОбороты.КоличествоОборот),
	|	0
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериодаПродаж,
	|			&КонецПериодаПродаж,
	|			День,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|			И "+ ?(ОтборПоСкладам, "СкладКомпании В(&Склады)", " ИСТИНА") +") КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.СкладКомпании,
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СписаниеТоваровТовары.Ссылка.Дата, ДЕНЬ),
	|	СписаниеТоваровТовары.Ссылка.СкладКомпании,
	|	СписаниеТоваровТовары.Номенклатура,
	|	СписаниеТоваровТовары.Количество,
	|	0
	|ИЗ
	|	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	|ГДЕ
	|	СписаниеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериодаПродаж И &КонецПериодаПродаж
	|	И СписаниеТоваровТовары.Ссылка.Проведен
	|	И "+ ?(ОтборПоСкладам, "СписаниеТоваровТовары.Ссылка.СкладКомпании В(&Склады)", "ИСТИНА") +"
	|	И СписаниеТоваровТовары.Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обьединенные.Дата КАК Дата,
	|	Обьединенные.СкладКомпании КАК СкладКомпании,
	|	Обьединенные.Номенклатура КАК Номенклатура,
	|	СУММА(Обьединенные.КоличествоПродажПоЗКС) КАК КоличествоПродажПоЗКС,
	|	СУММА(Обьединенные.КоличествоПродажПоАвтомату) КАК КоличествоПродажПоАвтомату
	|ИЗ
	|	Обьединенные КАК Обьединенные
	|
	|СГРУППИРОВАТЬ ПО
	|	Обьединенные.Номенклатура,
	|	Обьединенные.СкладКомпании,
	|	Обьединенные.Дата";
	
	Запрос.УстановитьПараметр("КонецПериодаПродаж", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериодаПродаж", НачалоПериода);
	Запрос.УстановитьПараметр("Таблица", ТаблДанныеАвтомата);
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры);
	
	Если ОтборПоСкладам Тогда 
		Запрос.УстановитьПараметр("Склады", МассивСкладов);
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	
	Отчет   = ПолучитьМакет("ПродажиСАвтомата");
	Настройки       = Отчет.НастройкиПоУмолчанию;
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанных.Найти("НачалоПериода");
	ЭлементНачалоПериода.Использование = Истина;
	ЭлементНачалоПериода.Значение = ДатаНач;
	
	ЭлементКонецПериода = ПараметрыДанных.Найти("КонецПериода");
	ЭлементКонецПериода.Использование = Истина;
	ЭлементКонецПериода.Значение =	 ДатаКон;
	
	Компоновщик  = Новый  КомпоновщикМакетаКомпоновкиДанных;
	Макет = Компоновщик.Выполнить(Отчет,Настройки,ДанныеРасшифровкиОтчета);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет, Новый Структура("тзТаблица", ТаблицаРезультат), ДанныеРасшифровкиОтчета);		
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаОСКД.УстановитьДокумент(ТабДок);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчетСверкаПродажOS(Параметры)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам, ТаблицаСверки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Параметры.Свойство("ТаблицаСверки", ТаблицаСверки) ИЛИ ТипЗнч(ТаблицаСверки) <> Тип("ТаблицаЗначений") Тогда 
		//ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не передана таблица сверки'; uk = 'Не передана таблиця звірки'"));	
		ВызватьИсключение НСтр("ru = 'Не передана таблица сверки'; uk = 'Не передана таблиця звірки'");
	КонецЕсли;
	
	ТекстСообщения = "";	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь, Параметры.Подразделение,ТекстСообщения);
	
	Если Не Успешно Тогда
		ЗаписьЖурналаРегистрации("Загрузка.СверкаПродажOS",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Соединение не установлено: '; uk = 'З''єднання не встановлено: '") + ТекстСообщения);
		Возврат Новый Структура("ОК", Ложь);
	КонецЕсли;
	
	Параметры.Свойство("НачалоПериода",	НачалоПериода);	
	Параметры.Свойство("КонецПериода" ,	КонецПериода);			
	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(Параметры.Подразделение, Параметры);	
	
	МассивГУИД = ТаблицаСкладов.ВыгрузитьКолонку("guid");
	МассивСкладов = ТаблицаСкладов.ВыгрузитьКолонку("СкладКомпании");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаСкладов.guid КАК guid,
	|	ТаблицаСкладов.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаСкладов КАК ТаблицаСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.guid КАК guid,
	|	ВТ.СкладКомпании КАК СкладКомпании,
	|	ВЫРАЗИТЬ(ВТ.СкладКомпании КАК Справочник.СкладыКомпании).Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(ВТ.СкладКомпании КАК Справочник.СкладыКомпании).ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТаблицаСкладов", ТаблицаСкладов);
	
	ТаблицаСкладовРасширенная = Запрос.Выполнить().Выгрузить();
	ТаблицаСкладовРасширенная.Индексы.Добавить("guid");	
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));	
	
	
	// Загрузка продаж по ТКС
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Этап 1 из 6. Получаем список продаж по ТКС'; uk = 'Етап 1 із 6. Отримуємо список продажів по ТКС'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	V_ТКС.Дата КАК Дата,
	|	V_ТКС.МагазинГУИД КАК МагазинГУИД,
	|	V_ТКС.МагазинИД КАК НомерМагазина,
	|	V_ТКС.КассаИД КАК НомерКассы,
	|	V_ТКС.СменаИД КАК НомерСмены,
	|	V_ТКС.ЧекИД КАК НомерЧека,
	|	V_ТКС.КартаОплаты КАК НомерКарты,
	|	V_ТКС.Возврат КАК ПризнакВозврата,
	|	V_ТКС.Сумма / 100 КАК Сумма
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ТКС КАК V_ТКС
	|ГДЕ
	|	V_ТКС.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И V_ТКС.МагазинГУИД В(&МассивГУИД)";
	
	Запрос.УстановитьПараметр("НачПериода",ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонПериода",ДатаДокументаКон);
	Запрос.УстановитьПараметр("МассивГУИД", МассивГУИД);
	
	ВыборкаТКС = Запрос.Выполнить().Выбрать();		
	Пока ВыборкаТКС.Следующий() Цикл 
		нСклад = ТаблицаСкладов.Найти(НРег(СокрЛП(ВыборкаТКС.МагазинГУИД)),"guid");
		Если нСклад = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСверки.Добавить();
		НоваяСтрока.Период = ВыборкаТКС.Дата;
		НоваяСтрока.Склад = нСклад;
		//НоваяСтрока.Касса = текКасса;
		НоваяСтрока.ПродажиOS = ?(Не ВыборкаТКС.ПризнакВозврата, ВыборкаТКС.Сумма, 0);
		НоваяСтрока.ВозвратыOS = ?(ВыборкаТКС.ПризнакВозврата, ВыборкаТКС.Сумма, 0);
		НоваяСтрока.ТерминалOS = 0;
		НоваяСтрока.Документ = Неопределено;
		НоваяСтрока.Тип = "ТКС";
		НоваяСтрока.GuidСистемыСоздания = Формат(ВыборкаТКС.Дата,"ДФ=ddMMyyyyЧЧммсс")
		+Формат(ВыборкаТКС.НомерМагазина,"ЧЦ=15; ЧГ=")
		+Формат(ВыборкаТКС.НомерКассы,"ЧЦ=15; ЧГ=")
		+Формат(ВыборкаТКС.НомерСмены,"ЧЦ=15; ЧГ=")
		+Формат(ВыборкаТКС.НомерЧека,"ЧЦ=15; ЧГ=");				
		
	КонецЦикла;	
	
	// Загрузка данных по Z-отчетам 
	ДлительныеОперации.СообщитьПрогресс(10, НСтр("ru = 'Этап 2 из 6. Получаем список Z-отчетов'; uk = 'Етап 2 із 6. Отримуємо список Z-звітів'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	V_ЗетОтчеты_xml.guid КАК guid,
	|	V_ЗетОтчеты_xml.SAREAID КАК SAREAID,
	|	V_ЗетОтчеты_xml.SYSTEMID КАК SYSTEMID,
	|	V_ЗетОтчеты_xml.WORKDAYID КАК WORKDAYID,
	|	V_ЗетОтчеты_xml.ZREPFPSN КАК ZREPFPSN,
	|	V_ЗетОтчеты_xml.zreptime КАК zreptime,
	|	НАЧАЛОПЕРИОДА(V_ЗетОтчеты_xml.zreptime, ДЕНЬ) КАК Дата,
	|	СУММА(V_ЗетОтчеты_xml.SALESSUM / 100) КАК SALESSUM,
	|	СУММА(V_ЗетОтчеты_xml.REFSSUM / 100) КАК REFSSUM
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ЗетОтчеты_xml КАК V_ЗетОтчеты_xml
	|ГДЕ
	|	V_ЗетОтчеты_xml.zreptime МЕЖДУ &НачПериода И &КонПериода
	|	И V_ЗетОтчеты_xml.guid В(&WAREAHOUSEGUID)
	|
	|СГРУППИРОВАТЬ ПО
	|	V_ЗетОтчеты_xml.WORKDAYID,
	|	V_ЗетОтчеты_xml.guid,
	|	V_ЗетОтчеты_xml.zreptime,
	|	НАЧАЛОПЕРИОДА(V_ЗетОтчеты_xml.zreptime, ДЕНЬ),
	|	V_ЗетОтчеты_xml.SAREAID,
	|	V_ЗетОтчеты_xml.SYSTEMID,
	|	V_ЗетОтчеты_xml.ZREPFPSN";
	
	
	Запрос.УстановитьПараметр("WAREAHOUSEGUID",МассивГУИД);		
	Запрос.УстановитьПараметр("НачПериода",ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонПериода",ДатаДокументаКон);	
	
	тзЗетОтчетов = Запрос.Выполнить().Выгрузить();		
	
	// Загрузка продаж по терминалам
	ДлительныеОперации.СообщитьПрогресс(20, НСтр("ru = 'Этап 3 из 6. Получаем продажи по терминалу'; uk = 'Етап 3 із 6. Отримуємо продажі по терміналу'"));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	V_ОплатыТерминал.SAREAID КАК SAREAID,
	|	V_ОплатыТерминал.SYSTEMID КАК SYSTEMID,
	|	V_ОплатыТерминал.WORKDAYID КАК WORKDAYID,
	|	V_ОплатыТерминал.WORKDAYEND КАК WORKDAYEND,
	|	СУММА(V_ОплатыТерминал.salessum / 100) КАК salessum
	|ИЗ
	|	ВнешнийИсточникДанных.OpenStore.Таблица.V_ОплатыТерминал КАК V_ОплатыТерминал
	|ГДЕ
	|	V_ОплатыТерминал.SAREAID В (&SAREAID)
	|			И V_ОплатыТерминал.SYSTEMID В (&SYSTEMID)
	|			И V_ОплатыТерминал.WORKDAYID В (&WORKDAYID)
	|	И V_ОплатыТерминал.WORKDAYEND МЕЖДУ &WORKDAYEND1 И &WORKDAYEND2
	|
	|СГРУППИРОВАТЬ ПО
	|	V_ОплатыТерминал.SAREAID,
	|	V_ОплатыТерминал.SYSTEMID,
	|	V_ОплатыТерминал.WORKDAYID,
	|	V_ОплатыТерминал.WORKDAYEND";
	
	Запрос.УстановитьПараметр("SAREAID", ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзЗетОтчетов.ВыгрузитьКолонку("SAREAID")));
	Запрос.УстановитьПараметр("SYSTEMID", ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзЗетОтчетов.ВыгрузитьКолонку("SYSTEMID")));
	Запрос.УстановитьПараметр("WORKDAYID", ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзЗетОтчетов.ВыгрузитьКолонку("WORKDAYID")));
	
	Запрос.УстановитьПараметр("WORKDAYEND1", Число(Формат(ДатаДокументаНач,"ДФ=yyyyMMdd000000")));
	Запрос.УстановитьПараметр("WORKDAYEND2", Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959")));
	
	тзТерминалы = Запрос.Выполнить().Выгрузить();
	тзТерминалы.Индексы.Добавить("SAREAID, WORKDAYID, SYSTEMID");
	
	
	// кэш Касс ККМ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	КассыККМ.Подразделение КАК Подразделение,
	|	КассыККМ.Объект КАК Объект,
	|	КассыККМ.ЗаводскойНомер КАК ЗаводскойНомер
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И НЕ КассыККМ.ЭтоГруппа
	|	И КассыККМ.ЗаводскойНомер В(&ЗаводскиеНомера)
	|	И КассыККМ.Подразделение В(&Подразделения)
	|	И КассыККМ.Объект В(&Объекты)";
	
	Запрос.УстановитьПараметр("ЗаводскиеНомера", ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзЗетОтчетов.ВыгрузитьКолонку("ZREPFPSN")));
	Запрос.УстановитьПараметр("Подразделения", ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСкладовРасширенная.ВыгрузитьКолонку("Подразделение")));
	Запрос.УстановитьПараметр("Объекты", ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСкладовРасширенная.ВыгрузитьКолонку("ТорговаяПлощадка")));
	
	тзКассыККМ = Запрос.Выполнить().Выгрузить();
	тзКассыККМ.Индексы.Добавить("ЗаводскойНомер");
	
	КолВоЗО = тзЗетОтчетов.Количество();
	текЗО = 0;
	
	// Заполняем таблицу сверки данными ЗКС
	Для Каждого СнятыйОтчет Из тзЗетОтчетов Цикл 
		текЗО = текЗО + 1;
		
		ДлительныеОперации.СообщитьПрогресс(30 + Цел((текЗО/КолВоЗО*100) * 0.3), НСтр("ru = 'Этап 4 из 6. Заполнение таблицы сверки...'; uk = 'Етап 4 із 6. Заповнення таблиці звірки...'"));	
		
		стрСклад = ТаблицаСкладовРасширенная.Найти(НРег(СокрЛП(СнятыйОтчет.guid)), "guid");
		Если стрСклад = Неопределено Тогда 
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка! Не найден склад с guid = %1'; uk = 'Помилка! Не знайдений склад з guid = %1'"),
			СнятыйОтчет.guid));
			Продолжить;
		КонецЕсли;
		
		СуммаПродажи = 0;
		СуммаВозвраты = 0;
		СуммаТерминал = 0;		
		
		Эмулятор = ВРег(СнятыйОтчет.ZREPFPSN) = "ЭМУЛЯТОР";
		НачДата = Число(Формат(СнятыйОтчет.Дата, "ДФ=yyyyMMdd000000"));
		КонДата = Число(Формат(СнятыйОтчет.Дата, "ДФ=yyyyMMdd235959"));
		
		текКасса = Неопределено;	
		
		нКассы = тзКассыККМ.НайтиСтроки(Новый Структура("ЗаводскойНомер, Подразделение, Объект",
		СнятыйОтчет.ZREPFPSN,
		стрСклад.Подразделение,
		стрСклад.ТорговаяПлощадка));																														
		
		Если нКассы.Количество() > 0 Тогда 
			текКасса = нКассы[0].КассаККМ;
		Иначе
			текКасса = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка"); //СнятыйОтчет.ZREPFPSN;
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найдена Касса ККМ с номером [%1] по объекту %2 (%3)'; uk = 'Не знайдена Каса ККМ з номером [%1] по об''єкту %2 (%3)'"),
			СнятыйОтчет.ZREPFPSN,
			стрСклад.ТорговаяПлощадка,
			стрСклад.Подразделение));
		КонецЕсли;
		
		Если Не Эмулятор Тогда 
			СуммаПродажи = СнятыйОтчет.SALESSUM;
			СуммаВозвраты = СнятыйОтчет.REFSSUM;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА V_Продажи.SALESREFUND = 0
			|				ТОГДА V_Продажи.salessum / 100
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК SALESSUM,
			|	СУММА(ВЫБОР
			|			КОГДА V_Продажи.SALESREFUND = 1
			|					ИЛИ V_Продажи.SALESREFUND = 2
			|				ТОГДА V_Продажи.salessum / 100
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК REFSSUM
			|ИЗ
			|	ВнешнийИсточникДанных.OpenStore.Таблица.V_Продажи КАК V_Продажи
			|ГДЕ
			|	V_Продажи.SAREAID = &SAREAID
			|	И V_Продажи.SYSTEMID = &SYSTEMID
			|	И V_Продажи.WORKDAYID = &WORKDAYID
			|	И V_Продажи.WORKDAYEND МЕЖДУ &WORKDAYEND1 И &WORKDAYEND2";
			
			Запрос.УстановитьПараметр("SAREAID", СнятыйОтчет.SAREAID);
			Запрос.УстановитьПараметр("SYSTEMID", СнятыйОтчет.SYSTEMID);
			Запрос.УстановитьПараметр("WORKDAYEND1", НачДата);
			Запрос.УстановитьПараметр("WORKDAYEND2", КонДата);
			Запрос.УстановитьПараметр("WORKDAYID", СнятыйОтчет.WORKDAYID);
			
			ПродажиЭмулятор =  Запрос.Выполнить().Выгрузить();
			
			СуммаПродажи = ПродажиЭмулятор.Итог("SALESSUM");
			СуммаВозвраты = ПродажиЭмулятор.Итог("REFSSUM");
		КонецЕсли;
		
		//Получим продажи по терминалам
		нПродажиТерминал = тзТерминалы.НайтиСтроки(Новый Структура("SAREAID, WORKDAYID, SYSTEMID", СнятыйОтчет.SAREAID, СнятыйОтчет.WORKDAYID, СнятыйОтчет.SYSTEMID));				
		Если нПродажиТерминал.Количество() > 0 Тогда 
			МассивСтрокТ = Новый Массив;
			
			Для Каждого Стр Из нПродажиТерминал Цикл 
				Если Стр.WORKDAYEND >= НачДата И Стр.WORKDAYEND <= КонДата Тогда 
					МассивСтрокТ.Добавить(Стр);	
				КонецЕсли;
			КонецЦикла;
			
			Если МассивСтрокТ.Количество() > 0 Тогда 
				СуммаТерминал = тзТерминалы.Скопировать(МассивСтрокТ, "salessum").Итог("salessum");	
				Для Каждого Стр Из МассивСтрокТ Цикл 
					тзТерминалы.Удалить(Стр);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСверки.Добавить();
		НоваяСтрока.Период = СнятыйОтчет.Дата;
		НоваяСтрока.Склад = стрСклад.СкладКомпании;
		НоваяСтрока.Касса = текКасса;
		НоваяСтрока.ПродажиOS = СуммаПродажи;
		НоваяСтрока.ВозвратыOS = СуммаВозвраты;
		НоваяСтрока.ТерминалOS = СуммаТерминал;
		НоваяСтрока.Документ = Неопределено;
		НоваяСтрока.Тип = "ЗКС";
	КонецЦикла;
	
	ТаблицаСверки.Свернуть("Период, Склад, Касса, Тип, Документ, ЕстьРасхождения, GuidСистемыСоздания", "ПродажиOS, ВозвратыOS, ТерминалOS, Продажи1С, Возвраты1С, Терминал1С, РазницаПродажи, РазницаВозвраты, РазницаТерминал");
	ТаблицаСверки.Индексы.Добавить("Период, Склад, Касса, Тип, GuidСистемыСоздания");
	
	// Получаем данные из базы
	ДлительныеОперации.СообщитьПрогресс(60, НСтр("ru = 'Этап 5 из 6. Получаем данные для сверки из базы...'; uk = 'Етап 5 із 6. Отримуємо дані для звірки із бази'"));		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Дата, ДЕНЬ) КАК Период,
	|	ЗакрытиеСмены.Ссылка КАК ДокументЗКС,
	|	ЗакрытиеСмены.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ втЗКС
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеСмены.Проведен
	|	И ЗакрытиеСмены.СкладКомпании В(&МассивСкладов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗКС.Период КАК Период,
	|	втЗКС.ДокументЗКС КАК ДокументЗКС,
	|	втЗКС.СкладКомпании КАК Склад,
	|	ЗакрытиеСменыСнятыеКассы.КассоваяСмена.КассаККМ КАК Касса,
	|	ЗакрытиеСменыСнятыеКассы.КассоваяСмена.СуммаДокумента КАК Продажи1С,
	|	ЗакрытиеСменыСнятыеКассы.КассоваяСмена.СуммаВозврат КАК Возвраты1С,
	|	0 КАК Терминал1С
	|ПОМЕСТИТЬ втСуммыПродаж
	|ИЗ
	|	втЗКС КАК втЗКС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеСмены.СнятыеКассы КАК ЗакрытиеСменыСнятыеКассы
	|		ПО втЗКС.ДокументЗКС = ЗакрытиеСменыСнятыеКассы.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗКС.Период,
	|	втЗКС.ДокументЗКС,
	|	втЗКС.СкладКомпании,
	|	ЗакрытиеСменыОплатаПлатежнымиКартами.КассаККМ,
	|	0,
	|	0,
	|	ЗакрытиеСменыОплатаПлатежнымиКартами.Сумма
	|ИЗ
	|	втЗКС КАК втЗКС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеСмены.ОплатаПлатежнымиКартами КАК ЗакрытиеСменыОплатаПлатежнымиКартами
	|		ПО втЗКС.ДокументЗКС = ЗакрытиеСменыОплатаПлатежнымиКартами.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСуммыПродаж.Период КАК Период,
	|	втСуммыПродаж.ДокументЗКС КАК Документ,
	|	втСуммыПродаж.Склад КАК Склад,
	|	втСуммыПродаж.Касса КАК Касса,
	|	СУММА(втСуммыПродаж.Продажи1С) КАК Продажи1С,
	|	СУММА(втСуммыПродаж.Возвраты1С) КАК Возвраты1С,
	|	СУММА(втСуммыПродаж.Терминал1С) КАК Терминал1С,
	|	""ЗКС"" КАК Тип
	|ИЗ
	|	втСуммыПродаж КАК втСуммыПродаж
	|
	|СГРУППИРОВАТЬ ПО
	|	втСуммыПродаж.Касса,
	|	втСуммыПродаж.ДокументЗКС,
	|	втСуммыПродаж.Склад,
	|	втСуммыПродаж.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваров.Дата КАК Период,
	|	РеализацияТоваров.Ссылка КАК Документ,
	|	РеализацияТоваров.СкладКомпании КАК Склад,
	|	РеализацияТоваров.СуммаДокумента КАК Продажи1С,
	|	0 КАК Возвраты1С,
	|	""ТКС"" КАК Тип,
	|	РеализацияТоваров.GuidСистемыСоздания КАК GuidСистемыСоздания,
	|	ЛОЖЬ КАК Возврат
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваров.Проведен
	|	И РеализацияТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровРозница)
	|	И РеализацияТоваров.GuidСистемыСоздания <> """"
	|	И РеализацияТоваров.СкладКомпании В(&МассивСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателя.Дата,
	|	ВозвратОтПокупателя.Ссылка,
	|	ВозвратОтПокупателя.СкладКомпании,
	|	0,
	|	ВозвратОтПокупателя.СуммаДокумента,
	|	""ТКС"",
	|	ВозвратОтПокупателя.GuidСистемыСоздания,
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратОтПокупателя.Проведен
	|	И ВозвратОтПокупателя.GuidСистемыСоздания <> """"
	|	И ВозвратОтПокупателя.СкладКомпании В(&МассивСкладов)";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонецПериода", ДатаДокументаКон);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаЗКС = МассивРезультатов[2].Выбрать();	
	ВыборкаТКС = МассивРезультатов[3].Выбрать();
	
	КолВоДанные = ВыборкаЗКС.Количество() + ВыборкаТКС.Количество();
	текДанные = 0;
	
	Пока ВыборкаЗКС.Следующий() Цикл 
		текДанные = текДанные + 1;
		ДлительныеОперации.СообщитьПрогресс(70 + Цел((текДанные/КолВоДанные*100) * 0.3), НСтр("ru = 'Этап 6 из 6. Заполнение таблицы сверки...'; uk = 'Етап 6 із 6. Заповнення таблиці звірки...'"));
		
		нСтроки = ТаблицаСверки.НайтиСтроки(Новый Структура("Период, Склад, Касса, Тип, Документ",
		ВыборкаЗКС.Период,
		ВыборкаЗКС.Склад,
		ВыборкаЗКС.Касса,
		ВыборкаЗКС.Тип,
		Неопределено));
		Если нСтроки.Количество() > 0 Тогда 
			ТекСтрока = нСтроки[0];
		Иначе
			ТекСтрока = ТаблицаСверки.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаЗКС);
	КонецЦикла;
	
	Пока ВыборкаТКС.Следующий() Цикл 		
		текДанные = текДанные + 1;
		ДлительныеОперации.СообщитьПрогресс(70 + Цел((текДанные/КолВоДанные*100) * 0.3), НСтр("ru = 'Этап 6 из 6. Заполнение таблицы сверки...'; uk = 'Етап 6 із 6. Заповнення таблиці звірки...'"));		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("GuidСистемыСоздания", ВыборкаТКС.GuidСистемыСоздания);
		СтруктураОтбора.Вставить("Тип", "ТКС");
		СтруктураОтбора.Вставить("Документ", Неопределено);
		
		Если ВыборкаТКС.Возврат Тогда 
			СтруктураОтбора.Вставить("ПродажиOS", 0);
		Иначе
			СтруктураОтбора.Вставить("ВозвратыOS", 0);
		КонецЕсли;
		
		нСтроки = ТаблицаСверки.НайтиСтроки(СтруктураОтбора);
		Если нСтроки.Количество() > 0 Тогда 
			ТекСтрока = нСтроки[0];
		Иначе
			ТекСтрока = ТаблицаСверки.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, ВыборкаТКС);
	КонецЦикла;
	
	ТаблицаСверки.Сортировать("Период, Склад, Касса, Тип");
	
	Для Каждого Стр Из ТаблицаСверки Цикл 
		Стр.РазницаПродажи 	= Стр.Продажи1С - Стр.ПродажиOS;
		Стр.РазницаВозвраты = Стр.Возвраты1С - Стр.ВозвратыOS;
		Стр.РазницаТерминал	= Стр.Терминал1С - Стр.ТерминалOS;
		Стр.ЕстьРасхождения = Стр.РазницаПродажи <> 0 ИЛИ Стр.РазницаВозвраты <> 0 ИЛИ Стр.РазницаТерминал <> 0;
	КонецЦикла;
	
	Возврат Новый Структура("ТаблицаСверки", ТаблицаСверки);
	
КонецФункции



Процедура ЗаполнитьТаблицуПеремещений(Знач Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов, ИзПланаОбмена, ПланОбмена = Неопределено)
		
	Если ИзПланаОбмена Тогда		
		Если ПланОбмена = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПланОбмена", ПланОбмена);
		
		ТекстЗапроса =	"ВЫБРАТЬ
		              	|	ПеремещениеТоваров.Ссылка КАК Документ,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|				И НЕ ПеремещениеТоваров.ДокументОснование = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
		              	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).Номер
		              	|		ИНАЧЕ ПеремещениеТоваров.Номер
		              	|	КОНЕЦ КАК Номер,
		              	|	ПеремещениеТоваров.Проведен КАК Проведен,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадка)
		              	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпании)
		              	|	КОНЕЦ КАК СкладКомпанииПредставление,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпанииПолучатель)
		              	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадкаПолучатель)
		              	|	КОНЕЦ КАК СкладКомпанииПолучательПредставление
		              	|ИЗ
		              	|	Документ.ПеремещениеТоваров.Изменения КАК ПеремещениеТоваровИзменения
		              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		              	|		ПО ПеремещениеТоваровИзменения.Ссылка = ПеремещениеТоваров.Ссылка
		              	|			И (ПеремещениеТоваровИзменения.Узел = &ПланОбмена)
		              	|ГДЕ
		              	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		              	|	И НЕ ПеремещениеТоваров.ПометкаУдаления
		              	|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|	И ПеремещениеТоваров.СкладКомпанииПолучатель В(&мСкладКомпании)";
	Иначе
		
		ТекстЗапроса =	"ВЫБРАТЬ
		              	|	ПеремещениеТоваров.Ссылка КАК Документ,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|				И НЕ ПеремещениеТоваров.ДокументОснование = ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
		              	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).Номер
		              	|		ИНАЧЕ ПеремещениеТоваров.Номер
		              	|	КОНЕЦ КАК Номер,
		              	|	ПеремещениеТоваров.Проведен КАК Проведен,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадка)
		              	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпании)
		              	|	КОНЕЦ КАК СкладКомпанииПредставление,
		              	|	ВЫБОР
		              	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпанииПолучатель)
		              	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадкаПолучатель)
		              	|	КОНЕЦ КАК СкладКомпанииПолучательПредставление
		              	|ИЗ
		              	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		              	|ГДЕ
		              	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		              	|	И НЕ ПеремещениеТоваров.ПометкаУдаления
		              	|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		              	|	И ПеремещениеТоваров.СкладКомпанииПолучатель В(&мСкладКомпании)";		
				
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ЗапросВыгруженныеДокументы = Новый Запрос;
		ЗапросВыгруженныеДокументы.Текст =	"ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM КАК DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS КАК DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 18
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 1018
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2";		
		
		
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE1",DOCDATE1);
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE2",DOCDATE2);
		
		ТаблицаВыгруженныхДокументов = ЗапросВыгруженныеДокументы.Выполнить().Выгрузить();
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();		
		Пока Выборка.Следующий() Цикл			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если ТаблицаВыгруженныхДокументов.Найти(Выборка.Номер,"DOCNUM") = Неопределено Тогда
				Строка.Обработан = Ложь;
				Строка.Пометка = НЕ Выборка.Проведен;
				тПредставление = "(Не выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " склад получатель => "+Выборка.СкладКомпанииПолучательПредставление;
			Иначе
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " склад получатель => "+Выборка.СкладКомпанииПолучательПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
		Если ИзПланаОбмена Тогда 
			ТаблицаДокументов.ЗаполнитьЗначения(Истина, "Пометка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуВозвратов(Знач Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов)
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	ВозвратПоставщику.Ссылка КАК Документ,
	|	ВозвратПоставщику.Номер,
	|	ВозвратПоставщику.Проведен,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВозвратПоставщику.СкладКомпании) КАК СкладКомпанииПредставление
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратПоставщику.СкладКомпании В(&мСкладКомпании)
	|	И ВозвратПоставщику.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ВозвратПоставщику.СкладКомпании.ТочкаДоставки = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	|	И НЕ ВозвратПоставщику.СкладКомпании.ТорговаяПлощадка = ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	|	И НЕ ВозвратПоставщику.СкладКомпании.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)";
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ЗапросВыгруженныеДокументы = Новый Запрос;
		ЗапросВыгруженныеДокументы.Текст =	"ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 20
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 1020
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2";
		
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE1",DOCDATE1);
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE2",DOCDATE2);
		
		ТаблицаВыгруженныхДокументов = ЗапросВыгруженныеДокументы.Выполнить().Выгрузить();
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();		
		
		Пока Выборка.Следующий() Цикл
			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если ТаблицаВыгруженныхДокументов.Найти(Выборка.Номер,"DOCNUM") = Неопределено Тогда
				Строка.Обработан = Ложь;
				Строка.Пометка = НЕ Выборка.Проведен;
				тПредставление = "(Не выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			Иначе
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПоступлений(Знач Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов)
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Документ,
	|	ПоступлениеТоваров.Номер,
	|	ПоступлениеТоваров.Проведен,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваров.СкладКомпании) КАК СкладКомпанииПредставление
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеТоваров.СкладКомпании В(&мСкладКомпании)
	//|	И ПоступлениеТоваров.СкладКомпании.ТочкаДоставки <> ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	//|	И ПоступлениеТоваров.СкладКомпании.ТорговаяПлощадка <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	//|	И ПоступлениеТоваров.СкладКомпании.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	|	И ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваров.СтатусRB <> ЗНАЧЕНИЕ(Перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется)";
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ЗапросВыгруженныеДокументы = Новый Запрос;
		ЗапросВыгруженныеДокументы.Текст =	"ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 2
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 1002
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2";
		
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE1",DOCDATE1);
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE2",DOCDATE2);
		
		ТаблицаВыгруженныхДокументов = ЗапросВыгруженныеДокументы.Выполнить().Выгрузить();
		ТаблицаВыгруженныхДокументов.Индексы.Добавить("DOCNUM");
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
					Ит, 
					КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если ТаблицаВыгруженныхДокументов.Найти(Выборка.Номер,"DOCNUM") = Неопределено Тогда
				Строка.Обработан = Ложь;
				Строка.Пометка = НЕ Выборка.Проведен;
				тПредставление = "(Не выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			Иначе
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуИнвентаризаций(Знач Запрос, НачалоПериода, DOCDATE1,DOCDATE2, ТаблицаДокументов, ВыгружатьКорректировкиИнвентаризации)
	
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	Инвентаризация.Ссылка КАК Документ,
	              	|	Инвентаризация.Номер КАК Номер,
	              	|	Инвентаризация.Проведен КАК Проведен,
	              	|	Инвентаризация.СкладКомпании КАК Склад,
	              	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Инвентаризация.СкладКомпании) КАК СкладКомпанииПредставление,
	              	|	ВЫБОР
	              	|		КОГДА Инвентаризация.Комментарий ПОДОБНО ""Кор%""
	              	|			ТОГДА ИСТИНА
	              	|		ИНАЧЕ ЛОЖЬ
	              	|	КОНЕЦ КАК Корректировка
	              	|ПОМЕСТИТЬ ИН
	              	|ИЗ
	              	|	Документ.Инвентаризация КАК Инвентаризация
	              	|ГДЕ
	              	|	Инвентаризация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	              	|	И Инвентаризация.СкладКомпании В(&мСкладКомпании)
	              	|	И НЕ Инвентаризация.СкладКомпании.ТочкаДоставки = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
	              	|	И НЕ Инвентаризация.СкладКомпании.ТорговаяПлощадка = ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	              	|	И НЕ Инвентаризация.СкладКомпании.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	              	|	И Инвентаризация.ПометкаУдаления = ЛОЖЬ
	              	|	И НЕ Инвентаризация.Проведен
	              	|	И НЕ Инвентаризация.РевизионнаяИнвентаризация
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ИН.Документ КАК Документ,
	              	|	ИН.Номер КАК Номер,
	              	|	ИН.Проведен КАК Проведен,
	              	|	ИН.Склад КАК Склад,
	              	|	ИН.СкладКомпанииПредставление КАК СкладКомпанииПредставление,
	              	|	ИН.Корректировка КАК Корректировка,
	              	|	СУММА(ВЫБОР
	              	|			КОГДА &ВыгружатьКорректировки
	              	|				ТОГДА ВЫБОР
	              	|						КОГДА ИнвентаризацияТовары.Количество <> 0
	              	|							ТОГДА 1
	              	|						ИНАЧЕ 0
	              	|					КОНЕЦ
	              	|			ИНАЧЕ 1
	              	|		КОНЕЦ) КАК Строк
	              	|ИЗ
	              	|	ИН КАК ИН
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	              	|		ПО ИН.Документ = ИнвентаризацияТовары.Ссылка
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	ИН.Корректировка,
	              	|	ИН.СкладКомпанииПредставление,
	              	|	ИН.Проведен,
	              	|	ИН.Документ,
	              	|	ИН.Номер,
	              	|	ИН.Склад";
	//Если НЕ ВыгружатьКорректировкиИнвентаризации Тогда
	//	ТекстЗапроса = ТекстЗапроса + " И НЕ Инвентаризация.Комментарий ПОДОБНО ""Кор""";
	//КонецЕсли;
	//
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыгружатьКорректировки",ВыгружатьКорректировкиИнвентаризации);	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ЗапросВыгруженныеДокументы = Новый Запрос;
		ЗапросВыгруженныеДокументы.Текст =	"ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS,
		|	ВыгруженныеДокументы.PARENTDOCID
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 3
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS,
		|	ВыгруженныеДокументы.PARENTDOCID
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 1003
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2";
		
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE1",DOCDATE1);
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE2",DOCDATE2);
		
		ТаблицаВыгруженныхДокументов = ЗапросВыгруженныеДокументы.Выполнить().Выгрузить();
		
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Строка.Склад    = Выборка.Склад;
			Если  ВыгружатьКорректировкиИнвентаризации Тогда
				Строка.Обработан = Выборка.Корректировка;
				Строка.Пометка = Ложь;
				тПредставление = Строка(Выборка.Строк)+" (Выгрузка корректировок по документу): "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			Иначе
				Если ТаблицаВыгруженныхДокументов.Найти(Выборка.Номер,"DOCNUM") = Неопределено Тогда
					Строка.Обработан = Ложь;
					Строка.Пометка = НЕ Выборка.Проведен;
					тПредставление =  Строка(Выборка.Строк)+" (Не выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
				Иначе
					Строка.Обработан = Истина;
					тПредставление =  Строка(Выборка.Строк)+" (Выгружен) "+?(Выборка.Корректировка,"<<Корректировка>> ","")+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
				КонецЕсли;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ВыгружатьКорректировкиИнвентаризации Тогда
		
		мСклады = ТаблицаДокументов.ВыгрузитьКолонку("Склад");
		Запрос.УстановитьПараметр("МассивСкладов", мСклады);
		//Запрос.УстановитьПараметр("ИнформационнаяБаза", ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ИнформационнаяБаза);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	спСкладыКомпании.Ссылка КАК Склад,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спСкладыКомпании.Ссылка) КАК СкладКомпанииПредставление,
		|	ЗНАЧЕНИЕ(Справочник.Отделы.пустаяСсылка) КАК Отдел
		|ИЗ
		|	Справочник.СкладыКомпании КАК спСкладыКомпании
		|ГДЕ
		|	спСкладыКомпании.Ссылка В(&мСкладКомпании)
		|	И НЕ спСкладыКомпании.ТорговаяПлощадка = ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
		|	И НЕ спСкладыКомпании.ТочкаДоставки = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
		|	И спСкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|	И НЕ спСкладыКомпании.Ссылка В (&МассивСкладов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураОтделов.Склад,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(НоменклатураОтделов.Склад),
		|	НоменклатураОтделов.Отдел
		|ИЗ
		|	РегистрСведений.НоменклатураОтделов КАК НоменклатураОтделов
		|ГДЕ
		|	НоменклатураОтделов.Склад В(&мСкладКомпании)
		|	И НЕ НоменклатураОтделов.Склад.ТорговаяПлощадка = ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
		|	И НЕ НоменклатураОтделов.Склад.ТочкаДоставки = ЗНАЧЕНИЕ(Справочник.ТочкиДоставки.ПустаяСсылка)
		|	И НоменклатураОтделов.Склад.ПометкаУдаления = ЛОЖЬ
		|	И НЕ НоменклатураОтделов.Склад В (&МассивСкладов)";
		

		Запрос.Текст = ТекстЗапроса;
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		фДата = Формат(НачалоПериода,"ДФ=yyyy-MM-dd");
		Пока Выборка.Следующий() Цикл
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Документы.Инвентаризация.ПустаяСсылка();
			Строка.Склад    = Выборка.Склад;
			Строка.Отдел    = Выборка.Отдел;
			Строка.Пометка  = Истина;
			Строка.Дата     = НачалоПериода;
			Строка.ПредставлениеДокумента = "<<Новый>> от " +фДата+" => склад " + Выборка.СкладКомпанииПредставление +?(ЗначениеЗаполнено(Выборка.Отдел)," отдел "+ Выборка.Отдел,"");
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуИнвентаризацийРезультат(Знач Запрос, DOCDATE1, DOCDATE2, ТаблицаДокументов, ПараметрыВыгрузки)
	
	ПоПлану 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПоПлану", Ложь);
	СозданныеВБазе	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "СозданныеВБазе", Ложь);
	
	Если ПоПлану Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ИнвентаризацияИзменения.Ссылка КАК СсылкаДокумент,
		|	ИнвентаризацияИзменения.Ссылка.Номер КАК Номер,
		|	ИнвентаризацияИзменения.Ссылка.Дата КАК Дата,
		|	ИнвентаризацияИзменения.Ссылка.СкладКомпании КАК СкладКомпании,
		|	ИнвентаризацияИзменения.Ссылка.СкладКомпании.НеВестиУчетПоХарактеристикам КАК НеВестиУчетПоХарактеристикам
		|ИЗ
		|	Документ.Инвентаризация.Изменения КАК ИнвентаризацияИзменения
		|ГДЕ
		|	ИнвентаризацияИзменения.Узел = &Узел
		|	И ИнвентаризацияИзменения.НомерСообщения = &НомерСообщения
		|	И ИнвентаризацияИзменения.Ссылка.Проведен
		|	И ИнвентаризацияИзменения.Ссылка.СкладКомпании В
		|			(ВЫБРАТЬ
		|				СоответствиеОбъектов.Объект
		|			ИЗ
		|				РегистрСведений.СоответствиеОбъектов КАК СоответствиеОбъектов
		|			ГДЕ
		|				СоответствиеОбъектов.Источник = ""ОС_Активные""
		|				И СоответствиеОбъектов.ТипОбъекта = ""СкладыКомпании"")";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ИСТИНА КАК Пометка,
		|	Инвентаризация.Ссылка КАК Документ,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Инвентаризация.Ссылка) КАК ПредставлениеСсылки,
		|	Инвентаризация.Проведен КАК Проведен,
		|	Инвентаризация.Номер КАК Номер,
		|	Инвентаризация.Дата КАК Дата,
		|	Инвентаризация.СкладКомпании КАК Склад
		|ИЗ
		|	Документ.Инвентаризация КАК Инвентаризация
		|ГДЕ
		|	Инвентаризация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Инвентаризация.Проведен
		|	И Инвентаризация.СкладКомпании В(&мСкладКомпании)";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Если СозданныеВБазе Тогда 
		ЗапросВыгруженныеДокументы = Новый Запрос;
		ЗапросВыгруженныеДокументы.Текст =	"ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 3
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыгруженныеДокументы.DOCNUM,
		|	ВыгруженныеДокументы.DOCSTATUS
		|ИЗ
		|	ВнешнийИсточникДанных.OpenStore.Таблица.ВыгруженныеДокументы КАК ВыгруженныеДокументы
		|ГДЕ
		|	ВыгруженныеДокументы.DOCTYPE = 1003
		|	И ВыгруженныеДокументы.DOCDATE >= &DOCDATE1
		|	И ВыгруженныеДокументы.DOCDATE <= &DOCDATE2";
		
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE1",DOCDATE1);
		ЗапросВыгруженныеДокументы.УстановитьПараметр("DOCDATE2",DOCDATE2);
		
		ТаблицаВыгруженныхДокументов = ЗапросВыгруженныеДокументы.Выполнить().Выгрузить();
		ТаблицаВыгруженныхДокументов.Индексы.Добавить("DOCNUM");		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Ит = 0;
	КоличествоВыборки = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл 
		Ит = Ит + 1;
		
		ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
		Ит, 
		КоличествоВыборки));		
		
		НоваяСтрока = ТаблицаДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если СозданныеВБазе И ТаблицаВыгруженныхДокументов.Найти(Выборка.Номер,"DOCNUM") = Неопределено Тогда
			НоваяСтрока.Обработан = Ложь;
			НоваяСтрока.Пометка = Выборка.Проведен;
			тПредставление = "(Не выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.Склад;
		ИначеЕсли СозданныеВБазе Тогда 
			НоваяСтрока.Обработан = Истина;
			НоваяСтрока.Пометка = Ложь;
			тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.Склад;
		Иначе
			тПредставление = Выборка.ПредставлениеСсылки + " => склад " + Выборка.Склад;
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеДокумента = тПредставление;				
	КонецЦикла;
	
КонецПроцедуры


Процедура ВыгрузитьДокументыИнвентаризации(тзВыгрузки, Корректировка, БезПраваРедактирования)
	
	мДокументы = Новый Массив;
	МассивНовыхИнвентаризаций = Новый Массив;
	
	Для Каждого Стр Из тзВыгрузки Цикл 
		ЕстьДокумент = ЗначениеЗаполнено(Стр.Документ);
		
		Если ЕстьДокумент И Не Стр.Обработан Тогда 			
			мДокументы.Добавить(Стр.Документ);
		ИначеЕсли Не ЕстьДокумент Тогда 
			МассивНовыхИнвентаризаций.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;	
	
	Если мДокументы.Количество() = 0 И МассивНовыхИнвентаризаций.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Connection = ПолучитьСоединение();
	Если  Connection = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивНовыхИнвентаризаций = Неопределено Тогда 
		МассивНовыхИнвентаризаций = Новый Массив;
	КонецЕсли;
	
	Если МассивНовыхИнвентаризаций.Количество() > 0 Тогда 
		Автор = Пользователи.ТекущийПользователь();
		
		Для Каждого Стр Из МассивНовыхИнвентаризаций Цикл 
			докИнв = Документы.Инвентаризация.СоздатьДокумент();
			докИнв.СкладКомпании = Стр.Склад;
			докИнв.ТипЦенИтогов = Стр.Склад.ТипЦенРозничнойТорговли;
			докИнв.Дата = КонецДня(Стр.Дата);
			докИнв.Автор = Автор;
			докИнв.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ИнвентаризацияТоваров");
			докИнв.Организация = Справочники.СкладыКомпании.ОрганизацияСклада(Стр.Склад);
			докИнв.ТорговаяПлощадка = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(Стр.Склад);
			докИнв.ПодразделениеКомпании = докИнв.СкладКомпании.Подразделение;
			докИнв.Отдел = стр.Отдел;
			
			ПараметрыЗаполненияОстатков = Новый Структура;
			ПараметрыЗаполненияОстатков.Вставить("Момент", КонецДня(Стр.Дата));
			ПараметрыЗаполненияОстатков.Вставить("СкладКомпании", Стр.Склад);
			ПараметрыЗаполненияОстатков.Вставить("Команда", "ЗаполнитьПоОстаткамНаСкладеОС");
			Если РегистрыСведений.НоменклатураОтделов.ПроверитьНаНаличиеОтдела(Стр.Склад) Тогда 
				ПараметрыЗаполненияОстатков.Вставить("Отдел", стр.Отдел);
			Иначе
				ПараметрыЗаполненияОстатков.Вставить("Отдел", Неопределено);
			КонецЕсли;
		
			
			Документы.Инвентаризация.ЗаполнитьТоварыПоОстаткамНаСкладе(докИнв.Товары, ПараметрыЗаполненияОстатков);
			
			Если докИнв.Товары.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого стрТов Из докИнв.Товары Цикл 
				стрТов.КоличествоФакт = стрТов.КоличествоКнижн;
				стрТов.Количество = стрТов.КоличествоФакт - стрТов.КоличествоФакт;
			КонецЦикла;
			
			Попытка
				докИнв.Записать(РежимЗаписиДокумента.Запись);
				мДокументы.Добавить(докИнв.Ссылка);
				
				Стр.Документ = докИнв.Ссылка;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инвентаризация.Ссылка КАК Документ,
	|	Инвентаризация.Организация КАК Организация,
	|	Инвентаризация.СкладКомпании КАК СкладКомпании,
	|	Инвентаризация.СкладКомпании.ТипЦенРозничнойТорговли КАК ТипЦенРозница,
	|	Инвентаризация.СкладКомпании.ТорговаяПлощадка КАК Адрес,
	|	3 КАК ТипДокумента,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Дата КАК Дата,
	|	0 КАК СтатусДокумента,
	|	ВЫБОР
	|		КОГДА Инвентаризация.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПометкаУдаления,
	|	Инвентаризация.Автор КАК Автор,
	|	Инвентаризация.Отдел КАК Отдел,
	|	Инвентаризация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Артикул КАК Артикул,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА Инвентаризация.Товары.Номенклатура.ТипНоменклатуры.Весовой
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ТипУпаковки,
	|		ВЫБОР
	|			КОГДА Инвентаризация.Товары.ЕдиницаИзмерения.НеВыгружатьВОборудование
	|					ИЛИ Инвентаризация.Товары.ЕдиницаИзмерения.ПометкаУдаления
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК Удален,
	|		Инвентаризация.Товары.КоличествоКнижн * 1000 КАК КоличествоКнижн,
	|		Коэффициент КАК Коэффициент,
	|		0 КАК Количество
	|	) КАК Товары
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка В(&мДокументы)"+?(Корректировка," И Инвентаризация.Товары.Количество <> 0 ","")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	// "+?(Корректировка," И Инвентаризация.Товары.Количество <> 0 ","")+"
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	//GUID	binary(16)	binary(16)	уникальный идентификатор документа 1С
	//DOCID	INTEGER	INTEGER	Идентификатор Документа	сформирует БД	
	//FIRMID	binary(16)	INTEGER	Идентификатор Фирмы(Организации)	передаем ссылку, заполнит ИД	
	//PARENTDOCID	binary(16)	INTEGER	Идентификатор Документа-основания	передаем ссылку, заполнит ИД
	//DOCTYPE	INTEGER	INTEGER	Тип документа (см Таблица 2 Типы документов)
	//DOCNUM	VARCHAR(30)	VARCHAR(30)	Номер документа	
	//DOCDATE	BIGINT	BIGINT	Дата документа	
	//REQUESTDATE	BIGINT	BIGINT	Дата/время заявки с точностью до миллисекунды (17 знаков)	
	//DOCSTATUS	INTEGER	INTEGER	Статус документа (см. Таблица 8)	
	//DOCVERSION	INTEGER	INTEGER	Версия изменений документа	
	//HEADERQTY	INTEGER	INTEGER	Число строк шапки документа без учета delflag. Используется для контроля целостности документа
	//STATUSHEADERQTY	INTEGER	INTEGER	Число строк шапки статусов документа без учета delflag	
	//ITEMSQTY	INTEGER	INTEGER	"Число строк фактуры документа без учета delflag. Используется для контроля целостности документа"	
	//DELFLAG	INTEGER	INTEGER	Признак удаления (0 - запись не удалена, 1 - запись удалена).	
	//UPDATENUM	INTEGER	INTEGER	Номер версии записи. Служебное поле.	заполнит процедура	
	
	
	Если ТекущаяДата()>= Дата('20190325') Тогда
		DOCTYPE = "1003";
	Иначе
		DOCTYPE = "3";
	КонецЕсли;
	
	КоличествоСтрок = ВыборкаДокумент.Количество();
	ОбработаноСтрок = 0;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Отказ = Ложь;	
		
		ОбработаноСтрок = ОбработаноСтрок + 1;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноСтрок / КоличествоСтрок * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноСтрок, 
		КоличествоСтрок));
		
		
		тзВыборкаТовары = ВыборкаДокумент.Товары.Выгрузить();
		датаКорректна  = Истина;
		ДатаВДокумент = ПолучитьДатуВыгрузкиДокумента(ВыборкаДокумент.СкладКомпании,ВыборкаДокумент.Дата,датаКорректна);
		
		Если НЕ датаКорректна Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пропускаем выгрузку Инвентаризацию по складу '; uk = 'Пропускаємо вивантаження Інвентаризації по складу '") + Строка(ВыборкаДокумент.СкладКомпании) + НСтр("ru = ' проверьте загрузку продаж'; uk = ' перевірте завантаження продажів'"));			
			Продолжить;
		КонецЕсли;			
		
		
		тзТовары = тзВыборкаТовары;
		
		Если тзТовары = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//Если тзТовары.Количество() = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		
		
		
		
		GUIDДокумента     = ПолучитьВнутрСсылку(ВыборкаДокумент.Документ);
		Если Корректировка Тогда
			GUID ="0x"+ГуидУид(Новый УникальныйИдентификатор());
		Иначе
			GUID = GUIDДокумента;
		КонецЕсли;
		
		//	DOCID = 3;
		FIRMID = ПолучитьВнутрСсылку(ВыборкаДокумент.Организация);
		FIRMIDUUID =  "'"+Строка(ВыборкаДокумент.Организация.УникальныйИдентификатор())+ "'";//ПолучитьВнутрСсылку(ВыборкаДокумент.Организация); 
		PrimaryWarehouseID ="'"+ Строка(ВыборкаДокумент.СкладКомпании.УникальныйИдентификатор())+"'";///ПолучитьВнутрСсылку(ВыборкаДокумент.СкладКомпании);
		LocationID =  "'"+ Строка(ВыборкаДокумент.Адрес.УникальныйИдентификатор())+"'";
		ОтделИД   = ?(ЗначениеЗаполнено(ВыборкаДокумент.Отдел), "'"+ Строка(ВыборкаДокумент.Отдел.УникальныйИдентификатор())+"'","NULL");  // отдел группы товаров

		PARENTDOCID = ?(Корректировка,GUIDДокумента,"NULL");
		//DOCTYPE = 3;                              
		DOCNUM = "'"+ВыборкаДокумент.Номер+"'";
		DOCDATE  = Формат(ДатаВДокумент, "ДФ=yyyyMMddЧЧммсс");
		//REQUESTDATE = DOCDATE +"000";
		DOCSTATUS = 0;
		DOCVERSION = ?(БезПраваРедактирования, "2", "1");
		HEADERQTY = 1;
		STATUSHEADERQTY = 0;
		DELFLAG = ВыборкаДокумент.ПометкаУдаления;
		IsReadOnly = ?(БезПраваРедактирования, 1, 0);
		
		ПараметрыДокумента = Новый ТекстовыйДокумент;
		//Организация 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"2"+","+ DOCDATE+","+FIRMIDUUID+","+DELFLAG+";";
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//Склад
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"14"+","+ DOCDATE+","+PrimaryWarehouseID+","+DELFLAG+";";
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"300"+","+ DOCDATE+",'',"+DELFLAG+";";  //Сообщение о результате проведения документа 
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"16"+","+ DOCDATE+",1,"+DELFLAG+";";  //Идентификатор пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"17"+","+ DOCDATE+",'Супервизор',"+DELFLAG+";";  //ФИО пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"301"+","+ DOCDATE+",'',"+DELFLAG+";";  //Идентификатор пользователя, проводившего документ   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"302"+","+ DOCDATE+",'',"+DELFLAG+";";  //ФИО пользователя, проводившего документ  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"336"+","+ DOCDATE+",0,"+DELFLAG+";";  //Признак наличия расхождений по количеству товара с учетом допустимой границы расхождений 
		//		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"1"+","+ DOCDATE+",NULL,"+DELFLAG+";";  //Идентификатор контрагента 
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"320"+","+ DOCDATE+","+ОтделИД+","+DELFLAG+";";  //Идентификатор группы товаров 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"321"+","+ DOCDATE+",0,"+DELFLAG+";";  //Тип инвентаризации 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"10"+","+ DOCDATE+",'',"+DELFLAG+";";  //Комментарий 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"54"+","+ DOCDATE+",0,"+DELFLAG+";";  //Сумма документа без НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"55"+","+ DOCDATE+",0,"+DELFLAG+";";  //Сумма документа c НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"322"+","+ DOCDATE+",'',"+DELFLAG+";";  //Глава комиссии   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"323"+","+ DOCDATE+",'',"+DELFLAG+";";  //Член комиссии №1    
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"324"+","+ DOCDATE+",'',"+DELFLAG+";";  //Член комиссии №2    
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"325"+","+ DOCDATE+",'',"+DELFLAG+";";  //Член комиссии №3   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"326"+","+ DOCDATE+",'',"+DELFLAG+";";  //Тот, кто провел контрольную проверку 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"336"+","+ DOCDATE+","+LocationID+","+DELFLAG+","+IsReadOnly+";";  //Идентификатор месторасположения + выдача разрешения на редактирование документа на точке
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"330"+","+ DOCDATE+",0,"+DELFLAG+";";   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTSTATUSHEADER] "+GUID+","+DOCTYPE+","+"1"+","+DOCDATE+",0,0,0,NULL,"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//
		//
		Строк = 0;
		СтрокиДокумента = Новый ТекстовыйДокумент;
		СуммаДокументаБезНДС = 0;
		СуммаДокументаСНДС   = 0;
		ОтключитьХарактеристику = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ВыборкаДокумент.СкладКомпании, ВыборкаДокумент.Дата); //ВыборкаДокумент.ОтключитьХарактеристику;
		
		ТекстЗапроса = "if(select object_id('tempdb.dbo.#docitems_raw')) is not null
		|drop table #docitems_raw
		|create table #docitems_raw (
		|DOCTYPE int,
		|GUID binary(16),
		|DOCITEMNUM int ,
		|ARTID binary(16), 
		|PACKID binary(32),
		|REQUESTDATE bigint ,
		|PACKDTYPE int,
		|QUANTMASK int ,
		|QUANTITY bigint, 
		|EXPECTEDQUANTITY bigint ,
		|LOWDIFFERENCEBOUND bigint, 
		|HIDIFFERENCEBOUND bigint ,
		|PRICE decimal(18,6) ,
		|PRICEVAT decimal(18,6) ,
		|ITEMSUM decimal(18,6) ,
		|ITEMSUMVAT decimal(18,6) ,
		|DISCSUM decimal(18,6) ,
		|TAXGRPRATE int ,
		|DELFLAG tinyint )
		|";
		
		СтрокиДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ВсегоСтрок = тзТовары.Количество();
		
		Для Каждого ВыборкаТовары Из тзТовары Цикл 
			Строк = Строк + 1;
			Если ОтключитьХарактеристику Тогда
				ИД_Упаковки  = ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения);
			Иначе
				ИД_Упаковки  = ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения) +?(ЗначениеЗаполнено(ВыборкаТовары.ХарактеристикаНоменклатуры),Прав(ПолучитьВнутрСсылку(ВыборкаТовары.ХарактеристикаНоменклатуры),32),"") //PACKID   - Идентификатор упаковки товара.
			КонецЕсли;
			
			Если ВыборкаТовары.Удален Тогда
				Отказ = Истина;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '[%1] %2, ед. изм. %3 установлен запрет на выгрузку!'; uk = '[%1] %2, од. вим. %3 встановлено заборону на вивантаження!'"),
				ВыборкаТовары.Артикул,
				Строка(ВыборкаТовары.Номенклатура),
				Строка(ВыборкаТовары.ЕдиницаИзмерения)));
			КонецЕсли;
			
			
			//ТекстЗапроса = "EXECUTE [dbo].[UPSERT_DOCREQUESTITEMS] "
			ТекстЗапроса = "insert into #docitems_raw values ("
			+DOCTYPE         //DOCTYPE - Тип документа
			+","+GUID        //DOCID - Идентификатор документа. Должен быть уникальным для всех выгружаемых документов. 
			+","+Формат(Строк,"ЧЦ=100; ЧГ=") //DOCITEMNUM  - Номер позиции фактуры документа. Уникальный в пределах документа 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.Номенклатура)  //ARTID - Идентификатор товара. 
			+","+ИД_Упаковки 
			+","+DOCDATE            //DOCDATE Дата/время заявки с точностью до миллисекунды (17 знаков) 
			+","+ВыборкаТовары.ТипУпаковки //PACKDTYPE - Тип упаковки 
			+","+"0"			           //QUANTMASK - Маска делимости упаковки 
			+","+"0" //QUANTITY - Количество упаковок товара 
			+","+Формат(ВыборкаТовары.КоличествоКнижн,"ЧЦ=10; ЧН=; ЧГ=")  //EXPECTEDQUANTITY   - Ожидаемое количество упаковок товара 
			+","+"0"  //LOWDIFFERENCEBOUND - Нижняя граница расхождений количества 
			+","+"0"  //HIDIFFERENCEBOUND - Верхняя граница расхождений количества 
			+","+"0"  //PRICE       - Цена упаковки товара без НДС 
			
			+","+"0"  //Формат(ВыборкаТовары.ЦенаОтпускная*100,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=")//"0"  //PRICEVAT    - Цена упаковки товара с НДС - УДАЛЕНО В БАЗЕ TK_SSL
			
			+","+"0"  //ITEMSUM     - Сумма позиции товара без НДС 
			
			+","+"0"  //Формат(ВыборкаТовары.СуммаОтпускнаяКнижн*100,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=")//"0"  //ITEMSUMVAT  - Сумма позиции товара с НДС - УДАЛЕНО В БАЗЕ TK_SSL
			
			+","+"0"  //DISCSUM  - Сумма скидки на позицию фактуры 
			+","+"0"  //TAXGRPRATE - Значение налоговой ставки 
			+","+DELFLAG  //DELFLAG  Признак удаления (0 - запись не удалена, 1 - запись удалена). 
			+");";
			//
			//Если ВсегоСтрок <> Строк Тогда
			//	ТекстЗапроса = ТекстЗапроса + ",";	
			//КонецЕсли;
			
			
			//+";";
			СтрокиДокумента.ДобавитьСтроку(ТекстЗапроса);
			
		КонецЦикла;
		
		СтрокиДокумента.ДобавитьСтроку(ПроверкаСтрокИН());
		
		СтрокаЗапросаШапка = "EXECUTE [dbo].[UPSERT_DOCREQUEST] "
		+GUID       		//GUID  - Уникальный идентификатор документа 1С
		//+","+DOCID   		//DOCID - Идентификатор Документа	сформирует БД	
		+","+FIRMID         //FIRMID - Идентификатор Фирмы(Организации)
		+","+PARENTDOCID    //PARENTDOCID - Идентификатор Документа-основания
		+","+DOCTYPE        //DOCTYPE     -	Тип документа
		+","+DOCNUM         //DOCNUM     - Номер документа	 
		+","+DOCDATE        //DOCDATE    - Дата документа
		+","+DOCDATE    //REQUESTDATE -  Дата/время заявки с точностью до миллисекунды (17 знаков)
		+","+DOCSTATUS      //DOCSTATUS -	Статус документа
		+","+DOCVERSION     //DOCVERSION - Версия изменений документа
		+","+Формат(ПараметрыДокумента.КоличествоСтрок()-1,"ЧЦ=15; ЧГ=")            //HEADERQTY  - Число строк шапки статусов документа 
		+","+"1"            //STATUSHEADERQTY - Число строк шапки статусов документа 
		+","+Формат(Строк,"ЧЦ=10; ЧН=; ЧГ=")  //ITEMSQTY - Число строк фактуры документа
		+","+DELFLAG        //DELFLAG	- Признак удаления (0 - запись не удалена, 1 - запись удалена).
		+";";
		
		
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,СтрокаЗапросаШапка);
		ВыполнитьЗапрос(Connection,Отказ,ПараметрыДокумента.ПолучитьТекст());
		
		Если СтрокиДокумента.КоличествоСтрок() > 0 Тогда
			ВыполнитьЗапрос(Connection,Отказ,СтрокиДокумента.ПолучитьТекст());
		КонецЕсли;
		
		Если Отказ Тогда
			Откатить_Транзакцию(Connection);
		Иначе
			Зафиксировать_Транзакцию(Connection);
		КонецЕсли;
		
		Если Не Отказ И Корректировка Тогда 
			ДокОбъект =  ВыборкаДокумент.Документ.ПолучитьОбъект();
			ДокОбъект.Комментарий ="Кор - "+GUID;
			Попытка 
				ДокОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		мСтр = тзВыгрузки.НайтиСтроки(Новый Структура("Документ", ВыборкаДокумент.Документ));
		Если мСтр.Количество() > 0 Тогда 
			мСтр[0].Обработан = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьРасхожденияПоИнвентаризации(тзВыгрузки, ПоПлану)	
	
	мДокументы = тзВыгрузки.ВыгрузитьКолонку("Документ");
	
	ТекстСообщений = Новый ТекстовыйДокумент;
	Connection = ПолучитьСоединение();
	
	Если Connection = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Инвентаризация.Ссылка КАК СсылкаДокумент,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Дата КАК Дата,
	|	Инвентаризация.СкладКомпании КАК СкладКомпании,
	//|	Инвентаризация.СкладКомпании.НеВестиУчетПоХарактеристикам КАК НеВестиУчетПоХарактеристикам,
	|	Инвентаризация.СкладКомпании.ТипЦенРозничнойТорговли КАК ТипЦен
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", мДокументы);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	
	Выборка = Результат.Выбрать();
	ВсегоДокументов = Строка(Выборка.Количество());	
	//	
	//EXECUTE [dbo].[UPSERT_INVENTORYRESULT] 
	//   @OPERATION       -- вид операции 0-подготовка,1-выгрузка строки,2-отправка на синхронизацию
	//  ,@DOCGUID         --ГУИД документа, обязательный для всех видов операций
	//  ,@WAREHOUSEGUID   --ГУИД склада, для операции 1
	//  ,@ENTITYDATE      --Дата инвентаризации в формате ггггММддччммсс, для операции 1
	//  ,@DOCNUM          -- Номер документа, строка в одинарных кавычках, не более 50 сим. 'XEP-0000069', для операции 1
	//  ,@ITEMNUM         --Номер строки документа, должен быть уникален в переделах @WAREHOUSEGUID и @ENTITYDATE, для операции 1
	//  ,@ARTGUID         --ГУИД артикула, для операции 1
	//  ,@PACKGUID        --ГУИД упаковки+ГУИД характеристики, для операции 1
	//  ,@EXQTY           --Учетное кол-во, для операции 1
	//  ,@QTY             --Фактическое кол-во, для операции 1
	//  ,@PRICE           --Цена, для операции 1
	Сч = 0;
	Отказ = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Сч = Сч+1;
		
		ОтклХарактерисика = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(Выборка.СкладКомпании, Выборка.Дата);
		Отказ = Ложь;
		ЗапросНаВыгрузку = Новый ТекстовыйДокумент;
		
		DOCGUID     = ПолучитьВнутрСсылку(Выборка.СсылкаДокумент);
		ЗапросНаВыгрузку.ДобавитьСтроку("EXECUTE  [dbo].[UPSERT_INVENTORYRESULT] 0,"+DOCGUID+";");
		WAREHOUSEGUID = ПолучитьВнутрСсылку(Выборка.СкладКомпании);
		ENTITYDATE    = Формат(Выборка.Дата,"ДФ=yyyyMMddЧЧммсс");
		DOCNUM        = "'"+СокрЛП(Выборка.Номер)+"'";
		
		//ТаблицаИтогов = СформироватьТаблицуИтоговПоИнвентаризации(Выборка.СсылкаДокумент, Выборка.Дата, Выборка.СкладКомпании, Выборка.ТипЦен);
		ТаблицаИтогов = Документы.Инвентаризация.СформироватьТаблицуИтоговПоИнвентаризации(Выборка.СсылкаДокумент,Выборка.Дата,Выборка.ТипЦен);
		нпп = 0;
		Для Каждого СтрИтог Из ТаблицаИтогов Цикл 
			Если (СтрИтог.ОстатокПоУчету - СтрИтог.Фактически) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			нпп = нпп + 1;
			ITEMNUM = Формат(нпп,"ЧЦ=10; ЧГ=");  
			ARTGUID = ПолучитьВнутрСсылку(СтрИтог.НоменклатураСсылка); 
			Если ОтклХарактерисика Тогда
				PACKGUID = ПолучитьВнутрСсылку(СтрИтог.ЕдиницаИзмерения);
			Иначе
				PACKGUID = ПолучитьВнутрСсылку(СтрИтог.ЕдиницаИзмерения) +?(ЗначениеЗаполнено(СтрИтог.ХарактеристикаНоменклатуры),Прав(ПолучитьВнутрСсылку(СтрИтог.ХарактеристикаНоменклатуры),32),"")
			КонецЕсли;
			EXQTY  = Формат(СтрИтог.ОстатокПоУчету,"ЧЦ=10; ЧН=; ЧГ=");
			QTY    = Формат(СтрИтог.Фактически,"ЧЦ=10; ЧН=; ЧГ=");
			PRICE  = Формат(СтрИтог.Цена*100,"ЧЦ=15; ЧРД=.; ЧН=; ЧГ=");
			
			ТекстЗапроса ="EXECUTE  [dbo].[UPSERT_INVENTORYRESULT]  1"
			+","+DOCGUID
			+","+WAREHOUSEGUID
			+","+ENTITYDATE
			+","+DOCNUM
			+","+ITEMNUM
			+","+ARTGUID
			+","+PACKGUID
			+","+EXQTY
			+","+QTY
			+","+PRICE
			+";";
			
			ЗапросНаВыгрузку.ДобавитьСтроку(ТекстЗапроса);
		КонецЦикла;
		ЗапросНаВыгрузку.ДобавитьСтроку("EXECUTE  [dbo].[UPSERT_INVENTORYRESULT] 2,"+DOCGUID+";");
		
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,ЗапросНаВыгрузку.ПолучитьТекст(),ТекстСообщений);
		
		Если Отказ Тогда
			Откатить_Транзакцию(Connection);
			Если ПоПлану Тогда
				Прервать;
			КонецЕсли;
			
		Иначе
			Зафиксировать_Транзакцию(Connection);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузитьДокументыПоступлений(мДокументы)
	
	Connection = ПолучитьСоединение();
	Если  Connection = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Документ,
	|	ПоступлениеТоваров.Организация КАК Организация,
	|	ПоступлениеТоваров.Контрагент КАК Контрагент,
	|	ПоступлениеТоваров.СкладКомпании КАК СкладКомпании,
	|	ПоступлениеТоваров.СкладКомпании.ТорговаяПлощадка КАК Адрес,
	|	2 КАК ТипДокумента,
	|	ПоступлениеТоваров.Номер КАК Номер,
	|	ПоступлениеТоваров.Дата КАК Дата,
	|	ПоступлениеТоваров.ВхДокНомер КАК ВхДокНомер,
	|	ПоступлениеТоваров.ВхДокДата КАК ВхДокДата,
	|	0 КАК СтатусДокумента,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваров.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ПоступлениеТоваров.Автор КАК Автор,
	//|	ПоступлениеТоваров.СкладКомпании.НеВестиУчетПоХарактеристикам КАК ОтклХарактеристика,
	|	ПоступлениеТоваров.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЕСТЬNULL(ПоступлениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	|		ВЫБОР
	|			КОГДА ПоступлениеТоваров.Товары.Номенклатура.ТипНоменклатуры.Весовой
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ТипУпаковки,
	|		ПоступлениеТоваров.Товары.Цена * ЕСТЬNULL(ПоступлениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) * 100 КАК Цена,
	|		ПоступлениеТоваров.Товары.Сумма * 100 КАК Сумма,
	|		ПоступлениеТоваров.Товары.ЦенаБезНалогов * ЕСТЬNULL(ПоступлениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) * 100 КАК ЦенаБезНалогов,
	|		ПоступлениеТоваров.Товары.СуммаВсего * 100 КАК СуммаВсего,
	|		ПоступлениеТоваров.Товары.КоличествоБазовое * 1000 КАК Количество,
	|		ПоступлениеТоваров.Товары.СуммаБезНалогов * 100 КАК СуммаВсегоБезНалогов
	|	) КАК Товары
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка В(&мДокументы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	//GUID	binary(16)	binary(16)	уникальный идентификатор документа 1С
	//DOCID	INTEGER	INTEGER	Идентификатор Документа	сформирует БД	
	//FIRMID	binary(16)	INTEGER	Идентификатор Фирмы(Организации)	передаем ссылку, заполнит ИД	
	//PARENTDOCID	binary(16)	INTEGER	Идентификатор Документа-основания	передаем ссылку, заполнит ИД
	//DOCTYPE	INTEGER	INTEGER	Тип документа (см Таблица 2 Типы документов)
	//DOCNUM	VARCHAR(30)	VARCHAR(30)	Номер документа	
	//DOCDATE	BIGINT	BIGINT	Дата документа	
	//REQUESTDATE	BIGINT	BIGINT	Дата/время заявки с точностью до миллисекунды (17 знаков)	
	//DOCSTATUS	INTEGER	INTEGER	Статус документа (см. Таблица 8)	
	//DOCVERSION	INTEGER	INTEGER	Версия изменений документа	
	//HEADERQTY	INTEGER	INTEGER	Число строк шапки документа без учета delflag. Используется для контроля целостности документа
	//STATUSHEADERQTY	INTEGER	INTEGER	Число строк шапки статусов документа без учета delflag	
	//ITEMSQTY	INTEGER	INTEGER	"Число строк фактуры документа без учета delflag. Используется для контроля целостности документа"	
	//DELFLAG	INTEGER	INTEGER	Признак удаления (0 - запись не удалена, 1 - запись удалена).	
	//UPDATENUM	INTEGER	INTEGER	Номер версии записи. Служебное поле.	заполнит процедура	
	
	Если ТекущаяДата()>= Дата('20190325') Тогда
		DOCTYPE = "1002";
	Иначе
		DOCTYPE = "2";
	КонецЕсли;
	
	//Отказ = Ложь;
	
	
	сКоличествоДокументов = ВыборкаДокумент.Количество();
	ОбработаноДокументов = 0;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		
		GUID   = ПолучитьВнутрСсылку(ВыборкаДокумент.Документ);
		//	DOCID = 3;
		FIRMID = ПолучитьВнутрСсылку(ВыборкаДокумент.Организация);
		FIRMIDUUID =  "'"+ Строка(ВыборкаДокумент.Организация.УникальныйИдентификатор())+ "'";//ПолучитьВнутрСсылку(ВыборкаДокумент.Организация); 
		CompanyID  =  "'"+ Строка(ВыборкаДокумент.Контрагент.УникальныйИдентификатор())+ "'";
		PrimaryWarehouseID ="'"+ Строка(ВыборкаДокумент.СкладКомпании.УникальныйИдентификатор())+"'";///ПолучитьВнутрСсылку(ВыборкаДокумент.СкладКомпании);
		LocationID =  "'"+ Строка(ВыборкаДокумент.Адрес.УникальныйИдентификатор())+"'";
		PARENTDOCID = "NULL";
		DOCNUM 		      = "'"+СокрЛП(ВыборкаДокумент.Номер)+"'";
		DOCDATE           = Формат(ВыборкаДокумент.Дата, "ДФ=yyyyMMddЧЧммсс");
		Если ЗначениеЗаполнено(ВыборкаДокумент.ВхДокДата)Тогда
			SupplierDocDate =  Формат(ВыборкаДокумент.ВхДокДата, "ДФ=yyyyMMddЧЧммсс")  
		Иначе
			SupplierDocDate = "''";
		КонецЕсли;
		
		SupplierDocNumber = "'"+СокрЛП(ВыборкаДокумент.ВхДокНомер)+"'";
		
		//REQUESTDATE = DOCDATE +"000";
		DOCSTATUS = 0;
		DOCVERSION = 0;
		HEADERQTY = 1;
		STATUSHEADERQTY = 0;
		DELFLAG = ВыборкаДокумент.ПометкаУдаления;
		
		ПараметрыДокумента = Новый ТекстовыйДокумент;
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"1"+","+ DOCDATE+","+CompanyID+","+DELFLAG+";";  //Идентификатор контрагента 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//
		////Организация 
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"2"+","+ DOCDATE+","+FIRMIDUUID+","+DELFLAG+";";   //Идентификатор фирмы, на которую заводится документ 
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		//Номер расходной напрокладной поставщика
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"3"+","+ DOCDATE+","+SupplierDocNumber+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер документа ЗНП, на основе которого выполнялся приход товара 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"7"+","+ DOCDATE+",'',"+DELFLAG+";";
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		//Комментарий
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"10"+","+ DOCDATE+",'',"+DELFLAG+";";  //Сообщение о результате проведения документа 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Название валюты
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"13"+","+ DOCDATE+",'',"+DELFLAG+";";  //Сообщение о результате проведения документа 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Склад
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"14"+","+ DOCDATE+","+PrimaryWarehouseID+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Ожидаемая дата поставки. Строка в формате ГГГГММДДччммсс 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"15"+","+ DOCDATE+","+SupplierDocDate+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Идентификатор пользователя, создавшего документ 		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"16"+","+ DOCDATE+",1,"+DELFLAG+";";  //Идентификатор пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ФИО пользователя, создавшего документ 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"17"+","+ DOCDATE+",'Супервизор',"+DELFLAG+";";  //ФИО пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Тип документа-основания 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"52"+","+ DOCDATE+",'',"+DELFLAG+";";  //ФИО пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"300"+","+ DOCDATE+",'',"+DELFLAG+";";  //Сообщение о результате проведения документа 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"301"+","+ DOCDATE+",'',"+DELFLAG+";";  //Идентификатор пользователя, проводившего документ   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"302"+","+ DOCDATE+",'',"+DELFLAG+";";  //ФИО пользователя, проводившего документ  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"330"+","+ DOCDATE+",0,"+DELFLAG+";";      //Признак того, что документ был хотя бы раз отправлен на синхронизацию 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"336"+","+ DOCDATE+","+LocationID+","+DELFLAG+";";  //Идентификатор месторасположения  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTSTATUSHEADER] "+GUID+","+DOCTYPE+","+"1"+","+DOCDATE+",0,0,0,NULL,"+DELFLAG+";"; //Идентификатор контрагента 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//тзВыборкаТовары = ВыборкаДокумент.Товары.Выгрузить();
		//
		//тзТовары = ОбработатьНаборыТоваров(тзВыборкаТовары);
		
		тзТовары = ВыборкаДокумент.Товары.Выгрузить();
		
		Строк = 0;
		СтрокиДокумента = Новый ТекстовыйДокумент;
		СуммаДокументаБезНДС = 0;
		СуммаДокументаСНДС   = 0;
		
		ОтклХарактерисика = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ВыборкаДокумент.СкладКомпании, ВыборкаДокумент.Дата);  //ВыборкаДокумент.ОтклХарактеристика;
		Для Каждого ВыборкаТовары Из тзТовары Цикл 
			Если ВыборкаТовары.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если ОтклХарактерисика Тогда
				PACKID = ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения);
			Иначе
				PACKID = ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения) +?(ЗначениеЗаполнено(ВыборкаТовары.Характеристика),Прав(ПолучитьВнутрСсылку(ВыборкаТовары.Характеристика),32),"") //PACKID   - Идентификатор упаковки товара. 
			КонецЕсли;
			Строк = Строк + 1;
			
			Если ВыборкаТовары.Коэффициент > 1 Тогда
				КоличествоВыгрузки = Цел(КоличествоВыгрузки / ВыборкаТовары.Коэффициент);
			Иначе
				КоличествоВыгрузки = ВыборкаТовары.Количество;
			КонецЕсли;
			
			
			ТекстЗапроса = "EXECUTE [dbo].[UPSERT_DOCREQUESTITEMS] "
			+DOCTYPE         //DOCTYPE - Тип документа
			+","+GUID        //DOCID - Идентификатор документа. Должен быть уникальным для всех выгружаемых документов. 
			+","+Формат(Строк,"ЧЦ=100; ЧГ=") //DOCITEMNUM  - Номер позиции фактуры документа. Уникальный в пределах документа 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.Номенклатура)  //ARTID - Идентификатор товара. 
			+","+PACKID
			+","+DOCDATE            //DOCDATE Дата/время заявки с точностью до миллисекунды (17 знаков) 
			+","+ВыборкаТовары.ТипУпаковки //PACKDTYPE - Тип упаковки 
			+","+"0"			           //QUANTMASK - Маска делимости упаковки 
			+","+ Формат(КоличествоВыгрузки,"ЧЦ=10; ЧН=; ЧГ=") //QUANTITY - Количество упаковок товара 
			+","+"0"  //EXPECTEDQUANTITY   - Ожидаемое количество упаковок товара 
			+","+"0"  //LOWDIFFERENCEBOUND - Нижняя граница расхождений количества 
			+","+"0"  //HIDIFFERENCEBOUND - Верхняя граница расхождений количества 
			+","+"0"+  Формат(ВыборкаТовары.ЦенаБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=") //PRICE       - Цена упаковки товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //PRICEVAT    - Цена упаковки товара с НДС 
			+","+"0"+  Формат(ВыборкаТовары.СуммаВсегоБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //ITEMSUM     - Сумма позиции товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")//ITEMSUMVAT  - Сумма позиции товара с НДС 
			+","+"0"  //DISCSUM  - Сумма скидки на позицию фактуры 
			+","+"0"  //TAXGRPRATE - Значение налоговой ставки 
			+","+DELFLAG  //DELFLAG  Признак удаления (0 - запись не удалена, 1 - запись удалена). 
			+";";
			СтрокиДокумента.ДобавитьСтроку(ТекстЗапроса);
			СуммаДокументаБезНДС = СуммаДокументаБезНДС + ВыборкаТовары.СуммаВсегоБезНалогов;
			СуммаДокументаСНДС   = СуммаДокументаСНДС + ВыборкаТовары.СуммаВсего;
			
		КонецЦикла;
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"54"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаБезНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа без НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"55"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаСНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа c НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		СтрокаЗапросаШапка = "EXECUTE [dbo].[UPSERT_DOCREQUEST] "
		+GUID       		//GUID  - Уникальный идентификатор документа 1С
		//+","+DOCID   		//DOCID - Идентификатор Документа	сформирует БД	
		+","+FIRMID         //FIRMID - Идентификатор Фирмы(Организации)
		+","+PARENTDOCID    //PARENTDOCID - Идентификатор Документа-основания
		+","+DOCTYPE        //DOCTYPE     -	Тип документа
		+","+DOCNUM         //DOCNUM     - Номер документа	 
		+","+DOCDATE        //DOCDATE    - Дата документа
		+","+DOCDATE    //REQUESTDATE -  Дата/время заявки с точностью до миллисекунды (17 знаков)
		+","+DOCSTATUS      //DOCSTATUS -	Статус документа
		+","+"1"            //DOCVERSION - Версия изменений документа
		+","+Формат(ПараметрыДокумента.КоличествоСтрок()-1,"ЧЦ=15; ЧГ=")//HEADERQTY  - Число строк шапки статусов документа 
		+","+"1"            //STATUSHEADERQTY - Число строк шапки статусов документа 
		+","+Формат(Строк,"ЧЦ=10; ЧГ=")  //ITEMSQTY - Число строк фактуры документа
		+","+DELFLAG        //DELFLAG	- Признак удаления (0 - запись не удалена, 1 - запись удалена).
		+";";
		
		
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,СтрокаЗапросаШапка);
		ВыполнитьЗапрос(Connection,Отказ,ПараметрыДокумента.ПолучитьТекст());
		
		Если СтрокиДокумента.КоличествоСтрок() > 0 Тогда
			ВыполнитьЗапрос(Connection,Отказ,СтрокиДокумента.ПолучитьТекст());
		КонецЕсли;
		
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документу: '") + Строка(ВыборкаДокумент.Документ), ВыборкаДокумент.Документ);
			
			Откатить_Транзакцию(Connection);
		Иначе
			Зафиксировать_Транзакцию(Connection);
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыВозвратПоставщику(мДокументы)
	
	Отказ = Ложь;
	Connection = ПолучитьСоединение();
	Если  Connection = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратПоставщику.Ссылка КАК Документ,
	|	ВозвратПоставщику.Организация КАК Организация,
	|	ВозвратПоставщику.Контрагент КАК Контрагент,
	|	ВозвратПоставщику.СкладКомпании КАК СкладКомпании,
	|	ВозвратПоставщику.СкладКомпании.ТорговаяПлощадка КАК Адрес,
	|	ВозвратПоставщику.Номер КАК Номер,
	|	ВозвратПоставщику.Дата КАК Дата,
	|	0 КАК СтатусДокумента,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщику.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВозвратПоставщику.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА ВозвратПоставщику.Товары.Номенклатура.ТипНоменклатуры.Весовой
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ТипУпаковки,
	|		ВозвратПоставщику.Товары.Цена * ВозвратПоставщику.Товары.Коэффициент * 100 КАК Цена,
	|		ВозвратПоставщику.Товары.Сумма * 100 КАК Сумма,
	|		ВозвратПоставщику.Товары.ЦенаБезНалогов * ВозвратПоставщику.Товары.Коэффициент * 100 КАК ЦенаБезНалогов,
	|		ВозвратПоставщику.Товары.Количество * 1000 КАК Количество,
	|		ВозвратПоставщику.Товары.СуммаБезНалогов * 100 КАК СуммаВсегоБезНалогов
	|	) КАК Товары
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Ссылка В(&мДокументы)";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	//GUID	binary(16)	binary(16)	уникальный идентификатор документа 1С
	//DOCID	INTEGER	INTEGER	Идентификатор Документа	сформирует БД	
	//FIRMID	binary(16)	INTEGER	Идентификатор Фирмы(Организации)	передаем ссылку, заполнит ИД	
	//PARENTDOCID	binary(16)	INTEGER	Идентификатор Документа-основания	передаем ссылку, заполнит ИД
	//DOCTYPE	INTEGER	INTEGER	Тип документа (см Таблица 2 Типы документов)
	//DOCNUM	VARCHAR(30)	VARCHAR(30)	Номер документа	
	//DOCDATE	BIGINT	BIGINT	Дата документа	
	//REQUESTDATE	BIGINT	BIGINT	Дата/время заявки с точностью до миллисекунды (17 знаков)	
	//DOCSTATUS	INTEGER	INTEGER	Статус документа (см. Таблица 8)	
	//DOCVERSION	INTEGER	INTEGER	Версия изменений документа	
	//HEADERQTY	INTEGER	INTEGER	Число строк шапки документа без учета delflag. Используется для контроля целостности документа
	//STATUSHEADERQTY	INTEGER	INTEGER	Число строк шапки статусов документа без учета delflag	
	//ITEMSQTY	INTEGER	INTEGER	"Число строк фактуры документа без учета delflag. Используется для контроля целостности документа"	
	//DELFLAG	INTEGER	INTEGER	Признак удаления (0 - запись не удалена, 1 - запись удалена).	
	//UPDATENUM	INTEGER	INTEGER	Номер версии записи. Служебное поле.	заполнит процедура	
	Если ТекущаяДата()>= Дата('20190325') Тогда
		DOCTYPE = "1020";
	Иначе
		DOCTYPE = "20";
	КонецЕсли;
	
	
	Пока ВыборкаДокумент.Следующий() Цикл
		GUID   = ПолучитьВнутрСсылку(ВыборкаДокумент.Документ);
		//	DOCID = 3;
		FIRMID = ПолучитьВнутрСсылку(ВыборкаДокумент.Организация);
		FIRMIDUUID =  "'"+ Строка(ВыборкаДокумент.Организация.УникальныйИдентификатор())+ "'";//ПолучитьВнутрСсылку(ВыборкаДокумент.Организация); 
		CompanyID  =  "'"+ Строка(ВыборкаДокумент.Контрагент.УникальныйИдентификатор())+ "'";
		PrimaryWarehouseID ="'"+ Строка(ВыборкаДокумент.СкладКомпании.УникальныйИдентификатор())+"'";///ПолучитьВнутрСсылку(ВыборкаДокумент.СкладКомпании);
		LocationID =  "'"+ Строка(ВыборкаДокумент.Адрес.УникальныйИдентификатор())+"'";
		PARENTDOCID = "NULL";
		//DOCTYPE = 20;                              
		DOCNUM 		      = "'"+СокрЛП(ВыборкаДокумент.Номер)+"'";
		DOCDATE           = Формат(ВыборкаДокумент.Дата, "ДФ=yyyyMMddЧЧммсс");
		//SupplierDocDate      = Формат(ВыборкаДокумент.ВхДокДата, "ДФ=yyyyMMddччммсс");
		//SupplierDocNumber = "'"+СокрЛП(ВыборкаДокумент.ВхДокНомер)+"'";
		//
		//REQUESTDATE = DOCDATE +"000";
		DOCSTATUS = 0;
		DOCVERSION = 0;
		HEADERQTY = 1;
		STATUSHEADERQTY = 0;
		DELFLAG = ВыборкаДокумент.ПометкаУдаления;
		
		ПараметрыДокумента = Новый ТекстовыйДокумент;
		
		//Идентификатор контрагента 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"1"+","+ DOCDATE+","+CompanyID+","+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Организация 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"2"+","+ DOCDATE+","+FIRMIDUUID+","+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер расходной напрокладной поставщика
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"3"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер документа ЗНП, на основе которого выполнялся приход товара 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"7"+","+ DOCDATE+",'',"+DELFLAG+";";
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Комментарий
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"10"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Название валюты 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"13"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Склад
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"14"+","+ DOCDATE+","+PrimaryWarehouseID+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Дата расходной накладной поставщика 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"15"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Идентификатор пользователя, создавшего документ 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"16"+","+ DOCDATE+",1,"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ФИО пользователя, создавшего документ 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"17"+","+ DOCDATE+",'Супервизор',"+DELFLAG+";";  //ФИО пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер доверенности  
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"33"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер доверенности  
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"34"+","+ DOCDATE+",'Йоулупукки',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Дата доверенности  
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"35"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Тип документа-основания  
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"52"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"300"+","+ DOCDATE+",'',"+DELFLAG+";";   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"301"+","+ DOCDATE+",'',"+DELFLAG+";";   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"302"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"330"+","+ DOCDATE+",0,"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"336"+","+ DOCDATE+","+LocationID+","+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTSTATUSHEADER] "+GUID+","+DOCTYPE+","+"1"+","+DOCDATE+",0,0,0,NULL,"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		тзТовары = ВыборкаДокумент.Товары.Выгрузить();
		
		Строк = 0;
		СтрокиДокумента = Новый ТекстовыйДокумент;
		СуммаДокументаБезНДС = 0;
		СуммаДокументаСНДС   = 0;
		
		Для Каждого ВыборкаТовары Из тзТовары Цикл 
			
			Строк = Строк + 1;
			
			ТекстЗапроса = "EXECUTE [dbo].[UPSERT_DOCREQUESTITEMS] "
			+DOCTYPE         //DOCTYPE - Тип документа
			+","+GUID        //DOCID - Идентификатор документа. Должен быть уникальным для всех выгружаемых документов. 
			+","+Формат(Строк,"ЧЦ=100; ЧГ=") //DOCITEMNUM  - Номер позиции фактуры документа. Уникальный в пределах документа 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.Номенклатура)  //ARTID - Идентификатор товара. 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения) +?(ЗначениеЗаполнено(ВыборкаТовары.Характеристика),Прав(ПолучитьВнутрСсылку(ВыборкаТовары.Характеристика),32),"") //PACKID   - Идентификатор упаковки товара. 
			+","+DOCDATE            //DOCDATE Дата/время заявки с точностью до миллисекунды (17 знаков) 
			+","+ВыборкаТовары.ТипУпаковки //PACKDTYPE - Тип упаковки 
			+","+"0"			           //QUANTMASK - Маска делимости упаковки 
			+","+ Формат(ВыборкаТовары.Количество,"ЧЦ=10; ЧН=; ЧГ=") //QUANTITY - Количество упаковок товара 
			+","+"0"  //EXPECTEDQUANTITY   - Ожидаемое количество упаковок товара 
			+","+"0"  //LOWDIFFERENCEBOUND - Нижняя граница расхождений количества 
			+","+"0"  //HIDIFFERENCEBOUND - Верхняя граница расхождений количества 
			+","+"0"+  Формат(ВыборкаТовары.ЦенаБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=") //PRICE       - Цена упаковки товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //PRICEVAT    - Цена упаковки товара с НДС 
			+","+"0"+  Формат(ВыборкаТовары.СуммаВсегоБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //ITEMSUM     - Сумма позиции товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.Сумма,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")//ITEMSUMVAT  - Сумма позиции товара с НДС 
			+","+"0"  //DISCSUM  - Сумма скидки на позицию фактуры 
			+","+"0"  //TAXGRPRATE - Значение налоговой ставки 
			+","+DELFLAG  //DELFLAG  Признак удаления (0 - запись не удалена, 1 - запись удалена). 
			+";";
			СтрокиДокумента.ДобавитьСтроку(ТекстЗапроса);
			СуммаДокументаБезНДС = СуммаДокументаБезНДС + ВыборкаТовары.СуммаВсегоБезНалогов;
			СуммаДокументаСНДС   = СуммаДокументаСНДС + ВыборкаТовары.Сумма;
			
		КонецЦикла;
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"54"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаБезНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа без НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"55"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаСНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа c НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		СтрокаЗапросаШапка = "EXECUTE [dbo].[UPSERT_DOCREQUEST] "
		+GUID       		//GUID  - Уникальный идентификатор документа 1С
		//+","+DOCID   		//DOCID - Идентификатор Документа	сформирует БД	
		+","+FIRMID         //FIRMID - Идентификатор Фирмы(Организации)
		+","+PARENTDOCID    //PARENTDOCID - Идентификатор Документа-основания
		+","+DOCTYPE        //DOCTYPE     -	Тип документа
		+","+DOCNUM         //DOCNUM     - Номер документа	 
		+","+DOCDATE        //DOCDATE    - Дата документа
		+","+DOCDATE    //REQUESTDATE -  Дата/время заявки с точностью до миллисекунды (17 знаков)
		+","+DOCSTATUS      //DOCSTATUS -	Статус документа
		+","+"1"            //DOCVERSION - Версия изменений документа
		+","+Формат(ПараметрыДокумента.КоличествоСтрок()-1,"ЧЦ=15; ЧГ=")//HEADERQTY  - Число строк шапки статусов документа 
		+","+"1"            //STATUSHEADERQTY - Число строк шапки статусов документа 
		+","+Формат(Строк,"ЧЦ=10; ЧГ=")  //ITEMSQTY - Число строк фактуры документа
		+","+DELFLAG        //DELFLAG	- Признак удаления (0 - запись не удалена, 1 - запись удалена).
		+";";
		
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,СтрокаЗапросаШапка);
		ВыполнитьЗапрос(Connection,Отказ,ПараметрыДокумента.ПолучитьТекст());
		
		Если СтрокиДокумента.КоличествоСтрок() > 0 Тогда
			ВыполнитьЗапрос(Connection,Отказ,СтрокиДокумента.ПолучитьТекст());
		КонецЕсли;
		
		Если Отказ Тогда
			Откатить_Транзакцию(Connection);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документу: '") + Строка(ВыборкаДокумент.Документ));
		Иначе
			Зафиксировать_Транзакцию(Connection);
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыПеремещенияПриход(мДокументы, ПараметрыВыгрузки)
	
	Connection = ПолучитьСоединение();
	Если  Connection = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыВыгрузки) = Тип("Структура") Тогда 
		ИзПланаОбмена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ИзПланаОбмена", Ложь);
		ПланОбмена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПланОбмена", Неопределено);
	Иначе
		ИзПланаОбмена = Ложь;
		ПланОбмена = Неопределено;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Документ,
	|	ПеремещениеТоваров.ИДДокументаОтгрузки КАК ИДДокументаОтгрузки,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация.Контрагент КАК Контрагент,
	|	ПеремещениеТоваров.СкладКомпанииПолучатель.ТорговаяПлощадка КАК Адрес,
	|	ПеремещениеТоваров.СкладКомпании КАК СкладКомпании,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).СкладКомпании
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|	КОНЕЦ КАК ДокументОснованиеСкладКомпании,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДокументОснованиеНомер,
	|	ПеремещениеТоваров.СкладКомпанииПолучатель КАК СкладКомпанииПолучатель,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	0 КАК СтатусДокумента,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПометкаУдаления,
	//|	ПеремещениеТоваров.СкладКомпанииПолучатель.НеВестиУчетПоХарактеристикам КАК ПолучательБезХарактеристик,
	|	ПеремещениеТоваров.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ТипНоменклатуры.Весовой
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ТипУпаковки,
	|		ПеремещениеТоваров.Товары.КоличествоБазовое * 1000 КАК Количество,
	|		0 КАК ЦенаБезНалогов,
	|		0 КАК Цена,
	|		0 КАК СуммаВсегоБезНалогов,
	|		0 КАК СуммаВсего
	|	) КАК Товары
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&мДокументы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	//GUID	binary(16)	binary(16)	уникальный идентификатор документа 1С
	//DOCID	INTEGER	INTEGER	Идентификатор Документа	сформирует БД	
	//FIRMID	binary(16)	INTEGER	Идентификатор Фирмы(Организации)	передаем ссылку, заполнит ИД	
	//PARENTDOCID	binary(16)	INTEGER	Идентификатор Документа-основания	передаем ссылку, заполнит ИД
	//DOCTYPE	INTEGER	INTEGER	Тип документа (см Таблица 2 Типы документов)
	//DOCNUM	VARCHAR(30)	VARCHAR(30)	Номер документа	
	//DOCDATE	BIGINT	BIGINT	Дата документа	
	//REQUESTDATE	BIGINT	BIGINT	Дата/время заявки с точностью до миллисекунды (17 знаков)	
	//DOCSTATUS	INTEGER	INTEGER	Статус документа (см. Таблица 8)	
	//DOCVERSION	INTEGER	INTEGER	Версия изменений документа	
	//HEADERQTY	INTEGER	INTEGER	Число строк шапки документа без учета delflag. Используется для контроля целостности документа
	//STATUSHEADERQTY	INTEGER	INTEGER	Число строк шапки статусов документа без учета delflag	
	//ITEMSQTY	INTEGER	INTEGER	"Число строк фактуры документа без учета delflag. Используется для контроля целостности документа"	
	//DELFLAG	INTEGER	INTEGER	Признак удаления (0 - запись не удалена, 1 - запись удалена).	
	//UPDATENUM	INTEGER	INTEGER	Номер версии записи. Служебное поле.	заполнит процедура	
	Если ТекущаяДата()>= Дата('20190325') Тогда
		DOCTYPE = "1018";
	Иначе
		DOCTYPE = "18";
	КонецЕсли;
	
	КоличествоДокументов = ВыборкаДокумент.Количество();
	
	ОбработаноДокументов = 0;
	Пока ВыборкаДокумент.Следующий() Цикл
		Отказ = Ложь;
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / КоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		КоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;		
		
		
		ДокОснование = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыборкаДокумент.ИДДокументаОтгрузки));
		
		СкладКомпанииДокОснование = ВыборкаДокумент.ДокументОснованиеСкладКомпании;
		
		Если Не ЗначениеЗаполнено(СкладКомпанииДокОснование.ВидСклада) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(				
			НСтр("ru = 'Не корректный склад отгрузки %1.
			|Документ %2 не выгружен.'; uk = 'Не коректний склад відвантаження %1.
			|Документ %2 не відвантажений'"),
			Строка(СкладКомпанииДокОснование),
			ВыборкаДокумент.Документ),
			ВыборкаДокумент.Документ);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДокумент.Организация) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДокумент.Контрагент) Тогда
			
			СтрокаОшибки = "";
			Если Не ЗначениеЗаполнено(ВыборкаДокумент.Организация) Тогда
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документе %1 не заполнено поле ""Организация""'; uk = 'В документі %1 не заповнене поле ""Організація""'"), ВыборкаДокумент.Документ);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаДокумент.Контрагент) Тогда 
				СтрокаОшибки = ?(Не ПустаяСтрока(СтрокаОшибки), СтрокаОшибки + Символы.ПС, "") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документе %1 не заполнено поле ""Контрагент""'; uk = 'В документі %1 не заповнене поле ""Контрагент""'"), ВыборкаДокумент.Документ);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(				
			НСтр("ru = '%1
			|Документ %2 не выгружен.'; uk = '%1
			|Документ %2 не відвантажений'"),
			Строка(СкладКомпанииДокОснование),
			ВыборкаДокумент.Документ),
			ВыборкаДокумент.Документ);						
			Продолжить;;
		КонецЕсли;
		
		
		
		GUID  				 = ПолучитьВнутрСсылку(ВыборкаДокумент.Документ);
		FIRMID 				 = ПолучитьВнутрСсылку(ВыборкаДокумент.Организация);
		//	FIRMIDUUID 			 = "'"+ Строка(ВыборкаДокумент.Организация.УникальныйИдентификатор())+ "'";
		CompanyID  			 = "'"+ Строка(ВыборкаДокумент.Контрагент.УникальныйИдентификатор())+ "'";
		
		//Т.к. была ошибка загрузки поменяю склады местами Vov41k 01.10.2020 Begin...
		PrimaryWarehouseID   = "'"+ Строка(СкладКомпанииДокОснование.УникальныйИдентификатор())+"'";
		SecondaryWarehouseID = "'"+ Строка(ВыборкаДокумент.СкладКомпанииПолучатель.УникальныйИдентификатор())+"'";
		
		//PrimaryWarehouseID   = "'"+ Строка(ВыборкаДокумент.СкладКомпанииПолучатель.УникальныйИдентификатор())+"'";		
		//SecondaryWarehouseID = "'"+ Строка(СкладКомпанииДокОснование.УникальныйИдентификатор())+"'";		
		//Vov41k 01.10.2020 End...
		
		LocationID 			 = "'"+ Строка(ВыборкаДокумент.Адрес.УникальныйИдентификатор())+"'";
		PARENTDOCID 		 = "NULL";
		//DOCTYPE 			 = 18;                              
		DOCNUM 		    	 = "'"+СокрЛП(ВыборкаДокумент.ДокументОснованиеНомер)+"'"; //Номер из документа основания, тетя будет по нему искать 26.11.19
		DOCDATE         	 = Формат(ВыборкаДокумент.Дата, "ДФ=yyyyMMddЧЧммсс");
		DOCSTATUS 			 = 0;
		DOCVERSION 			 = 0;
		HEADERQTY 			 = 1;
		STATUSHEADERQTY 	 = 0;
		DELFLAG = ВыборкаДокумент.ПометкаУдаления;
		
		ПараметрыДокумента = Новый ТекстовыйДокумент;
		
		//Идентификатор контрагента 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"1"+","+ DOCDATE+","+CompanyID+","+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		////Организация 
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"2"+","+ DOCDATE+","+FIRMIDUUID+","+DELFLAG+";"; 
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//
		////Номер расходной напрокладной поставщика
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"3"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Номер документа ЗНП, на основе которого выполнялся приход товара 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"7"+","+ DOCDATE+",'',"+DELFLAG+";";
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Комментарий
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"10"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Название валюты 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"13"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Склад
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"14"+","+ DOCDATE+","+PrimaryWarehouseID+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		////Дата расходной накладной поставщика 
		//ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"15"+","+ DOCDATE+",'',"+DELFLAG+";";  
		//ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Идентификатор пользователя, создавшего документ 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"16"+","+ DOCDATE+",1,"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//ФИО пользователя, создавшего документ 
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"17"+","+ DOCDATE+",'Супервизор',"+DELFLAG+";";  //ФИО пользователя, создавшего документ 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//		//Номер доверенности  
		//		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"33"+","+ DOCDATE+",'',"+DELFLAG+";";  
		//		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		//	
		//		//Номер доверенности  
		//		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"34"+","+ DOCDATE+",'Йоулупукки',"+DELFLAG+";";  
		//		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//		//Дата доверенности  
		//		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"35"+","+ DOCDATE+",'',"+DELFLAG+";";  
		//		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Тип документа-основания  
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"52"+","+ DOCDATE+",'',"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		//Склад получатель
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"65"+","+ DOCDATE+","+SecondaryWarehouseID+","+DELFLAG+";"; //Идентификатор основного склада товара 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"300"+","+ DOCDATE+",'',"+DELFLAG+";";   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"301"+","+ DOCDATE+",'',"+DELFLAG+";";   
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"302"+","+ DOCDATE+",'',"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"330"+","+ DOCDATE+",0,"+DELFLAG+";";  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"336"+","+ DOCDATE+","+LocationID+","+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTSTATUSHEADER] "+GUID+","+DOCTYPE+","+"1"+","+DOCDATE+",0,0,0,NULL,"+DELFLAG+";"; 
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		тзВыборкаТовары = ВыборкаДокумент.Товары.Выгрузить();		
		тзТовары = тзВыборкаТовары;
		
		Строк = 0;
		СтрокиДокумента = Новый ТекстовыйДокумент;
		СуммаДокументаБезНДС = 0;
		СуммаДокументаСНДС   = 0;
		
		ПолучательБезХарактеристик = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ВыборкаДокумент.СкладКомпанииПолучатель, ВыборкаДокумент.Дата);
		
		Для Каждого ВыборкаТовары Из тзТовары Цикл 
			
			Строк = Строк + 1;
			
			Если Не ЗначениеЗаполнено(ВыборкаТовары.ЕдиницаИзмерения) Тогда 
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(				
				НСтр("ru = 'Строка %1. Для товара ""%2"" не заполнена основная единица измерения'; uk = 'Рядок %1. Для товару ""%2"" не заповнена головна одиниця виміру'"),
				ВыборкаДокумент.НомерСтроки,
				ВыборкаДокумент.Номенклатура),
				ВыборкаДокумент.Документ);						
				Прервать;
			КонецЕсли;
			
			Если ВыборкаТовары.Коэффициент > 1 Тогда
				КоличествоВыгрузки = Цел(КоличествоВыгрузки / ВыборкаТовары.Коэффициент);
			Иначе
				КоличествоВыгрузки = ВыборкаТовары.Количество;
			КонецЕсли;
			
			ТекстЗапроса = "EXECUTE [dbo].[UPSERT_DOCREQUESTITEMS] "
			+DOCTYPE         //DOCTYPE - Тип документа
			+","+GUID        //DOCID - Идентификатор документа. Должен быть уникальным для всех выгружаемых документов. 
			+","+Формат(Строк,"ЧЦ=100; ЧГ=") //DOCITEMNUM  - Номер позиции фактуры документа. Уникальный в пределах документа 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.Номенклатура)  //ARTID - Идентификатор товара. 
			+","+ПолучитьВнутрСсылку(ВыборкаТовары.ЕдиницаИзмерения) +?(ЗначениеЗаполнено(ВыборкаТовары.Характеристика) И Не ПолучательБезХарактеристик,Прав(ПолучитьВнутрСсылку(ВыборкаТовары.Характеристика),32),"") //PACKID   - Идентификатор упаковки товара. 
			+","+DOCDATE            //DOCDATE Дата/время заявки с точностью до миллисекунды (17 знаков) 
			+","+ВыборкаТовары.ТипУпаковки //PACKDTYPE - Тип упаковки 
			+","+"0"			           //QUANTMASK - Маска делимости упаковки 
			+","+ Формат(КоличествоВыгрузки,"ЧЦ=10; ЧН=; ЧГ=") //QUANTITY - Количество упаковок товара 
			+","+"0"  //EXPECTEDQUANTITY   - Ожидаемое количество упаковок товара 
			+","+"0"  //LOWDIFFERENCEBOUND - Нижняя граница расхождений количества 
			+","+"0"  //HIDIFFERENCEBOUND - Верхняя граница расхождений количества 
			+","+"0"+  Формат(ВыборкаТовары.ЦенаБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=") //PRICE       - Цена упаковки товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //PRICEVAT    - Цена упаковки товара с НДС 
			+","+"0"+  Формат(ВыборкаТовары.СуммаВсегоБезНалогов,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")  //ITEMSUM     - Сумма позиции товара без НДС 
			+","+"0"+  Формат(ВыборкаТовары.СуммаВсего,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")//ITEMSUMVAT  - Сумма позиции товара с НДС 
			+","+"0"  //DISCSUM  - Сумма скидки на позицию фактуры 
			+","+"0"  //TAXGRPRATE - Значение налоговой ставки 
			+","+DELFLAG  //DELFLAG  Признак удаления (0 - запись не удалена, 1 - запись удалена). 
			+";";
			СтрокиДокумента.ДобавитьСтроку(ТекстЗапроса);
			СуммаДокументаБезНДС = СуммаДокументаБезНДС + ВыборкаТовары.СуммаВсегоБезНалогов;
			СуммаДокументаСНДС   = СуммаДокументаСНДС + ВыборкаТовары.СуммаВсего;
			
		КонецЦикла;
		
		Если Отказ Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(				
			НСтр("ru = '%1
			|Документ %2 не выгружен.'; uk = '%1
			|Документ %2 не відвантажений'"),
			Строка(СкладКомпанииДокОснование),
			ВыборкаДокумент.Документ),
			ВыборкаДокумент.Документ);										
			Продолжить;
		КонецЕсли;		
		
		Если Строк = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(				
			НСтр("ru = 'Документ %1 (%2) не выгружен . Табличная часть ""Товары"" пустая.'; uk = 'Документ %1 (%2) не відвантажений. Табличная частина ""Товари"" пуста.'"),
			ВыборкаДокумент.Документ,
			Строка(СкладКомпанииДокОснование)),
			ВыборкаДокумент.Документ);						
			Продолжить;
		КонецЕсли;
		
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"54"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаБезНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа без НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		ТекстЗапроса = "EXECUTE  [dbo].[UPSERT_DOCREQUESTHEADERS] "+GUID+","+DOCTYPE+","+"55"+","+ DOCDATE+","+ Формат(Окр(СуммаДокументаСНДС),"ЧЦ=15; ЧДЦ=; ЧН=; ЧГ=")+","+DELFLAG+";";  //Сумма документа c НДС с учетом скидки  
		ПараметрыДокумента.ДобавитьСтроку(ТекстЗапроса);
		
		
		СтрокаЗапросаШапка = "EXECUTE [dbo].[UPSERT_DOCREQUEST] "
		+GUID       		//GUID  - Уникальный идентификатор документа 1С
		//+","+DOCID   		//DOCID - Идентификатор Документа	сформирует БД	
		+","+FIRMID         //FIRMID - Идентификатор Фирмы(Организации)
		+","+PARENTDOCID    //PARENTDOCID - Идентификатор Документа-основания
		+","+DOCTYPE        //DOCTYPE     -	Тип документа
		+","+DOCNUM         //DOCNUM     - Номер документа	 
		+","+DOCDATE        //DOCDATE    - Дата документа
		+","+DOCDATE    //REQUESTDATE -  Дата/время заявки с точностью до миллисекунды (17 знаков)
		+","+DOCSTATUS      //DOCSTATUS -	Статус документа
		+","+"1"            //DOCVERSION - Версия изменений документа
		+","+Формат(ПараметрыДокумента.КоличествоСтрок()-1,"ЧЦ=15; ЧГ=")//HEADERQTY  - Число строк шапки статусов документа 
		+","+"1"            //STATUSHEADERQTY - Число строк шапки статусов документа 
		+","+Формат(Строк,"ЧЦ=10; ЧГ=")  //ITEMSQTY - Число строк фактуры документа
		+","+DELFLAG        //DELFLAG	- Признак удаления (0 - запись не удалена, 1 - запись удалена).
		+";";
		
		Начать_Транзакцию(Connection);
		
		ВыполнитьЗапрос(Connection,Отказ,СтрокаЗапросаШапка);
		ВыполнитьЗапрос(Connection,Отказ,ПараметрыДокумента.ПолучитьТекст());
		
		Если СтрокиДокумента.КоличествоСтрок() > 0 Тогда
			ВыполнитьЗапрос(Connection,Отказ,СтрокиДокумента.ПолучитьТекст());
		КонецЕсли;
		
		Если Отказ Тогда
			Откатить_Транзакцию(Connection);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документів: '") + Строка(ВыборкаДокумент.Документ), ВыборкаДокумент.Документ);			
		Иначе
			Зафиксировать_Транзакцию(Connection);
		КонецЕсли;
		
		Если ИзПланаОбмена И Не Отказ И ПланОбмена <> Неопределено Тогда 
			Попытка
				ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена, ВыборкаДокумент.Документ);
			Исключение
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка отмены регистрации документа ""%1"" из плана обмена ""%2""'; uk = 'Помилка відміни реєстрації документу ""%1"" із плану обміну ""%2""'"),
						Строка(ВыборкаДокумент.Документ),
						Строка(ПланОбмена)),
					ВыборкаДокумент.Документ);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры


#КонецОбласти



#Область ПрочиеПроцедурыИФункции

#Область ВыпускКофе

Функция ЗаполнитьВыпускКофе(ДатаЗагрузки, ДокОбъект, Склад, ВсеОк, Ошибки)
	
	Товары = ДокОбъект.Товары.Выгрузить();
	ТипОбъекта = ТипЗнч(ДокОбъект);
	
	ГУИД = ДокОбъект.Ссылка.УникальныйИдентификатор();
	Если Не ЗначениеЗаполнено(ГУИД) Тогда 
		ГУИД = Новый УникальныйИдентификатор;
		ТипОбъектаДокумента = ТипЗнч(ДокОбъект);
		
		НоваяСсылка = Неопределено;
		Если ТипОбъектаДокумента = Тип("ДокументОбъект.РеализацияТоваров") Тогда 		
			НоваяСсылка = Документы.РеализацияТоваров.ПолучитьСсылку(ГУИД);
		ИначеЕсли ТипОбъектаДокумента = Тип("ДокументОбъект.ЗакрытиеСмены") Тогда 
			НоваяСсылка = Документы.ЗакрытиеСмены.ПолучитьСсылку(ГУИД);
		КонецЕсли;
		
		Если НоваяСсылка <> Неопределено Тогда 
			ДокОбъект.УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;
	КонецЕсли;
	
	стрГУИД = Строка(ГУИД);	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаЗагрузки);
	Запрос.УстановитьПараметр("ТаблицаТовары", Товары);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Подразделение", ДокОбъект.ПодразделениеКомпании);
	
	Если ТипОбъекта = Тип("ДокументОбъект.ЗакрытиеСмены") Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Возврат КАК Возврат
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Возврат КАК Возврат
		|ПОМЕСТИТЬ ТоварыДляВыпуска
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|ГДЕ
		|	ТаблицаТовары.Номенклатура В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				СписокРецептур.Номенклатура КАК Номенклатура
		|			ИЗ
		|				СписокРецептур КАК СписокРецептур)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыДляВыпуска.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыДляВыпуска.Количество * ТоварыДляВыпуска.Коэффициент) КАК Количество
		|ПОМЕСТИТЬ СписокТоваров
		|ИЗ
		|	ТоварыДляВыпуска КАК ТоварыДляВыпуска
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыДляВыпуска.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыДляВыпуска.Количество) > 0";
		
		
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваров") Тогда 
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
		|ПОМЕСТИТЬ СписокТоваров
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаТовары.Номенклатура КАК Номенклатура,
		|		СУММА(ТаблицаТовары.Количество * ТаблицаТовары.Коэффициент) КАК Количество
		|	ИЗ
		|		ТаблицаТовары КАК ТаблицаТовары
		|	ГДЕ
		|		ТаблицаТовары.Номенклатура В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					СписокРецептур.Номенклатура КАК Номенклатура
		|				ИЗ
		|					СписокРецептур КАК СписокРецептур)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаТовары.Номенклатура
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВозвратОтПокупателяТовары.Номенклатура,
		|		СУММА(-1 * (ВозвратОтПокупателяТовары.Количество * ВозвратОтПокупателяТовары.Коэффициент))
		|	ИЗ
		|		Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
		|	ГДЕ
		|		Ложь
		|		И ВозвратОтПокупателяТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|		И ВозвратОтПокупателяТовары.Ссылка.Проведен
		|		И ВозвратОтПокупателяТовары.Ссылка.СкладКомпании = &Склад
		|		И ВозвратОтПокупателяТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВозвратТоваровОтПокупателя)
		|		И ВозвратОтПокупателяТовары.Номенклатура В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					СписокРецептур.Номенклатура КАК Номенклатура
		|				ИЗ
		|					СписокРецептур КАК СписокРецептур)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВозвратОтПокупателяТовары.Номенклатура) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаТовары";
		
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
	ОснТекстЗапроса = "ВЫБРАТЬ
	|	Рецептура.Ссылка КАК Рецептура,
	|	Рецептура.Продукция КАК Номенклатура,
	|	Рецептура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Рецептура.Коэффициент КАК Коэффициент,					  
	|	ВЫБОР
	|		КОГДА Рецептура.ОсновнаяРецептура
	|			ТОГДА 100000000000 + РАЗНОСТЬДАТ(Рецептура.Дата, &ТекДата, СЕКУНДА)
	|		ИНАЧЕ 200000000000 + РАЗНОСТЬДАТ(Рецептура.Дата, &ТекДата, СЕКУНДА)
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ СписокРецептур
	|ИЗ
	|	Документ.Рецептура КАК Рецептура
	|ГДЕ
	|	Рецептура.Проведен
	|	И Рецептура.ПодразделениеКомпании = &Подразделение
	|	И Рецептура.Актуальная
	|	И Рецептура.ФормироватьВыпускПриЗагрузке
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|%1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СписокРецептур.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СписокРецептур.Коэффициент КАК Коэффициент,					  
	|	СписокТоваров.Количество КАК Количество,
	|	СписокТоваров.Количество * СписокРецептур.Коэффициент КАК КоличествоБазовое,					  
	|	СписокРецептур.Рецептура КАК Рецептура
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокРецептур.Номенклатура КАК Номенклатура,
	|		МИНИМУМ(СписокРецептур.Порядок) КАК Порядок
	|	ИЗ
	|		СписокРецептур КАК СписокРецептур
	|	ГДЕ
	|		СписокРецептур.Номенклатура В
	|				(ВЫБРАТЬ
	|					СписокТоваров.Номенклатура КАК Номенклатура
	|				ИЗ
	|					СписокТоваров КАК СписокТоваров)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокРецептур.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокТоваров КАК СписокТоваров
	|		ПО ВложенныйЗапрос.Номенклатура = СписокТоваров.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокРецептур КАК СписокРецептур
	|		ПО ВложенныйЗапрос.Номенклатура = СписокРецептур.Номенклатура
	|			И ВложенныйЗапрос.Порядок = СписокРецептур.Порядок";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОснТекстЗапроса, ТекстЗапроса);
	
	РезультатТовары = Запрос.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИДДокумента", стрГУИД);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаЗагрузки));
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка КАК Ссылка,
	|	ВыпускПродукции.Проведен КАК Проведен
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.СкладКомпании = &Склад
	|	И НЕ ВыпускПродукции.ПометкаУдаления
	|	И ВыпускПродукции.ИДДокументаПродажи = &ИДДокумента
	|	И ВыпускПродукции.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -30) И ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, 30)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукции.Дата УБЫВ";
	
	ВыборкаВыпуск = Запрос.Выполнить().Выбрать();
	
	ДокВыпуск = Неопределено;
	Пока ВыборкаВыпуск.Следующий() Цикл 
		Попытка
			ВыпускОбъект = ВыборкаВыпуск.Ссылка.ПолучитьОбъект();
		Исключение
			ВсеОк = Ложь;
			Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось получить документ '; uk = 'Не вдалося отримати документ '") + ВыборкаВыпуск.Ссылка);
			Продолжить;
		КонецПопытки;
		
		Если ДокВыпуск = Неопределено Тогда 
			ДокВыпуск = ВыпускОбъект;
		Иначе
			Попытка
				ВыпускОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ВсеОк = Ложь;
				Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось установить пометку удаления '; uk = 'Не вдалося встановити відмітку видалення '") + ВыпускОбъект);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатТовары.Пустой() Тогда 
		Если ДокВыпуск <> Неопределено Тогда 
			Попытка
				ДокВыпуск.УстановитьПометкуУдаления(Истина);
			Исключение
				ВсеОк = Ложь;
				Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось установить пометку удаления '; uk = 'Не вдалося встановити відмітку видалення '") + ДокВыпуск);
			КонецПопытки;
		КонецЕсли;
		
		Возврат Неопределено;		
	КонецЕсли;
	
	Если ДокВыпуск = Неопределено Тогда 
		ДокВыпуск = Документы.ВыпускПродукции.СоздатьДокумент();
	КонецЕсли;
	
	ДокВыпуск.Дата = ДокОбъект.Дата-1;
	ДокВыпуск.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокВыпуск.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВыпускПродукции");
	ДокВыпуск.ИДДокументаПродажи = стрГУИД;
	ДокВыпуск.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сформировано автоматически <%1>'; uk = 'Сформовано автоматично <%1>'"), ТекущаяДата());
	
	ДокВыпуск.РежимРасчетаСписанияВПроизводство = Перечисления.РежимыРасчетаСписанияВПроизводство.ПоФакту;
	ДокВыпуск.ВидПроизводства = Перечисления.ВидыПроизводства.ЗаготовкиНеГотовятся;
	
	ЗаполнитьЗначенияСвойств(ДокВыпуск, ДокОбъект, "Организация, ПодразделениеКомпании, ТорговаяПлощадка, СкладКомпании, РегламентированныйУчет");
	
	ВыборкаТовары = РезультатТовары.Выбрать();
	
	ДокВыпуск.Продукция.Очистить();
	
	Пока ВыборкаТовары.Следующий() Цикл 
		НоваяСтрока = ДокВыпуск.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТовары);
	КонецЦикла;
	
	Документы.ВыпускПродукции.ПерезаполнитьИнгридиенты(ДокВыпуск);
	
	Попытка
		ДокВыпуск.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВсеОк = Ложь;
		Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось провести документ '; uk = 'Не вдалося провести документ '") + ДокВыпуск);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокВыпуск;	
	
КонецФункции

#КонецОбласти


#Область КассоваяЛента

Функция СписаниеКассовойЛенты(ДокументЗКС)
	
	Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ТЗ_КЛ.КассоваяСмена КАК Документ.ТК_КассоваяСмена).КоличествоЧеков КАК КоличествоЧеков
	//|ПОМЕСТИТЬ КассоваяСмена
	//|ИЗ
	//|	&ТЗ_КЛ КАК ТЗ_КЛ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТК_КассоваяЛента.Номенклатура КАК Номенклатура,
	//|	ТК_КассоваяЛента.ДлинаЧека КАК ДлинаЧека,
	//|	ЕСТЬNULL(СУММА(КассоваяСмена.КоличествоЧеков), 0) КАК КоличествоЧеков
	//|ИЗ
	//|	РегистрСведений.ТК_КассоваяЛента КАК ТК_КассоваяЛента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ОграничениеАссортиментаСрезПоследних
	//|		ПО ТК_КассоваяЛента.Номенклатура = ОграничениеАссортиментаСрезПоследних.Номенклатура,
	//|	КассоваяСмена КАК КассоваяСмена
	//|ГДЕ
	//|	ОграничениеАссортиментаСрезПоследних.Состояние = 1
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТК_КассоваяЛента.Номенклатура,
	//|	ТК_КассоваяЛента.ДлинаЧека";
	//
	//Запрос.УстановитьПараметр("НаДату", ДокументЗКС.Дата);
	//Запрос.УстановитьПараметр("ТЗ_КЛ", ДокументЗКС.СнятыеКассы.Выгрузить());
	//Запрос.УстановитьПараметр("ТорговаяПлощадка", ДокументЗКС.ТорговаяПлощадка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_КассоваяЛента.Номенклатура КАК Номенклатура,
	|	ТК_КассоваяЛента.ДлинаЧека КАК ДлинаЧека,
	|	ТК_КассоваяЛента.ДлинаОтчетов КАК ДлинаОтчетов,
	|	ЕСТЬNULL(СУММА(ЗакрытиеСменыСнятыеКассы.КассоваяСмена.КоличествоЧеков), 0) КАК КоличествоЧеков
	|ИЗ
	|	РегистрСведений.ТК_КассоваяЛента КАК ТК_КассоваяЛента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ОграничениеАссортиментаСрезПоследних
	|		ПО ТК_КассоваяЛента.Номенклатура = ОграничениеАссортиментаСрезПоследних.Номенклатура,
	|	Документ.ЗакрытиеСмены.СнятыеКассы КАК ЗакрытиеСменыСнятыеКассы
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние = 1
	|	И ЗакрытиеСменыСнятыеКассы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТК_КассоваяЛента.Номенклатура,
	|	ТК_КассоваяЛента.ДлинаЧека,
	|	ТК_КассоваяЛента.ДлинаОтчетов";
	
	Запрос.УстановитьПараметр("НаДату", ДокументЗКС.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументЗКС);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ДокументЗКС.ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДлинаЧека		= ВыборкаДетальныеЗаписи.ДлинаЧека;
		ДлинаОтчетов	= ВыборкаДетальныеЗаписи.ДлинаОтчетов;
		КассоваяЛента	= ВыборкаДетальныеЗаписи.Номенклатура;
		КоличествоЧеков	= ВыборкаДетальныеЗаписи.КоличествоЧеков;
	Иначе
		КоличествоЧеков = 0;
	КонецЕсли;
	
	
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЕСТЬNULL(СУММА(ЗакрытиеСменыСнятыеКассы.КассоваяСмена.КоличествоЧеков), 0) КАК КоличествоЧеков
	//	|ИЗ
	//	|	Документ.ЗакрытиеСмены.СнятыеКассы КАК ЗакрытиеСменыСнятыеКассы
	//	|ГДЕ
	//	|	ЗакрытиеСменыСнятыеКассы.Ссылка = &Ссылка";
	//	
	//	Запрос.УстановитьПараметр("Ссылка", ДокументЗКС);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		КоличествоЧеков = ВыборкаДетальныеЗаписи.КоличествоЧеков;
	//	Иначе
	//		КоличествоЧеков = 0;
	//	КонецЕсли;
	
	Если КоличествоЧеков = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.СписаниеТоваров
	|	И ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.СписаниеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеТоваров)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗКС);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокСписание = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ДокСписание.ПометкаУдаления Тогда
			ДокСписание.УстановитьПометкуУдаления(Ложь);	
		КонецЕсли;
	Иначе
		ДокСписание = Документы.СписаниеТоваров.СоздатьДокумент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокСписание,ДокументЗКС,"Организация,ПодразделениеКомпании,ТорговаяПлощадка,СкладКомпании,ТипЦен,ВалютаДокумента,КурсДокумента");
	
	ДокСписание.Дата = ДокументЗКС.Дата + 1;
	ДокСписание.ХозОперация = Справочники.ХозОперации.СписаниеТоваров;
	//ДокСписание.РегламентированныйУчет = Истина;
	ДокСписание.ДокументОснование = ДокументЗКС;
	ДокСписание.ТорговаяПлощадкаСписания = ДокументЗКС.ТорговаяПлощадка;
	ДокСписание.СтатьяСписанияТМЦ = Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("YY000252");		//	Потребление кассовых лент и термоэтикеток
	ДокСписание.Комментарий = "Списание кассовой ленты ("+КоличествоЧеков+" чеков)";
	
	ДокСписание.Товары.Очистить();
	стрТовары = ДокСписание.Товары.Добавить();
	стрТовары.Номенклатура = КассоваяЛента;
	стрТовары.Количество = КоличествоЧеков * ДлинаЧека + ДлинаОтчетов;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, Неопределено);
	
	Попытка
		ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВсеОк = Ложь;
		Ошибки = ДобавитьНовуюСтроку(Ошибки, НСтр("ru = 'Не удалось провести документ '; uk = 'Не вдалося провести документ '") + ДокСписание);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокСписание;
	
КонецФункции

#КонецОбласти

Функция СписаниеДопМатериалов(ОбъектЗКС, Ошибки)
	
	МассивСписаний = Новый Массив;
	
	ДокументЗКС = ОбъектЗКС.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ОбъектЗКС.Дата);
	Запрос.УстановитьПараметр("Ссылка", ДокументЗКС);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ПравилаСписанияДопМатериаловСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ТК_ПравилаСписанияДопМатериаловСрезПоследних.ДопМатериал КАК ДопМатериал,
	               |	ТК_ПравилаСписанияДопМатериаловСрезПоследних.Количество КАК Количество,
	               |	ТК_ПравилаСписанияДопМатериаловСрезПоследних.СтатьяСписания КАК СтатьяСписания
	               |ПОМЕСТИТЬ втДопМатериалы
	               |ИЗ
	               |	РегистрСведений.ТК_ПравилаСписанияДопМатериалов.СрезПоследних(&Период, ) КАК ТК_ПравилаСписанияДопМатериаловСрезПоследних
	               |ГДЕ
	               |	ТК_ПравилаСписанияДопМатериаловСрезПоследних.Статус <> 0
	               |	И ТК_ПравилаСписанияДопМатериаловСрезПоследних.Количество > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДопМатериалы.ДопМатериал КАК ДопМатериал,
	               |	втДопМатериалы.ДопМатериал.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЕСТЬNULL(втДопМатериалы.ДопМатериал.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	СУММА(втДопМатериалы.Количество * ЗакрытиеСменыТовары.КоличествоБазовое) КАК КоличествоБазовое,
	               |	втДопМатериалы.СтатьяСписания КАК СтатьяСписания
	               |ИЗ
	               |	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДопМатериалы КАК втДопМатериалы
	               |		ПО ЗакрытиеСменыТовары.Номенклатура = втДопМатериалы.Номенклатура
	               |ГДЕ
	               |	ЗакрытиеСменыТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДопМатериалы.СтатьяСписания,
	               |	втДопМатериалы.ДопМатериал,
	               |	ЕСТЬNULL(втДопМатериалы.ДопМатериал.ОсновнаяЕдиницаИзмерения.Коэффициент, 1),
	               |	втДопМатериалы.ДопМатериал.ОсновнаяЕдиницаИзмерения
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(втДопМатериалы.Количество * ЗакрытиеСменыТовары.КоличествоБазовое) > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтатьяСписания,
	               |	ДопМатериал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка КАК ДокСписание,
	               |	ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.СписаниеТоваров).Проведен КАК Проведен,
	               |	ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.СписаниеТоваров).ПометкаУдаления КАК ПометкаУдаления,
	               |	ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.СписаниеТоваров).СтатьяСписанияТМЦ КАК СтатьяСписания
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.СписаниеТоваров
	               |	И ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.СписаниеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеДополнительныхМатериалов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтатьяСписания,
	               |	Проведен УБЫВ,
	               |	ПометкаУдаления";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ГраницаРез = МассивРезультатов.ВГраница();
	
	резДопМатериалы = МассивРезультатов[ГраницаРез-1];
	резСписания = МассивРезультатов[ГраницаРез];
	
	Если резДопМатериалы.Пустой() И резСписания.Пустой() Тогда 
		Возврат МассивСписаний;
	КонецЕсли;
	
	тзДопМатериалы = резДопМатериалы.Выгрузить();
	тзСписания = резСписания.Выгрузить();	
	мСписанияИсключить = Новый Массив;
	
	мСтатьиСписания = ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзДопМатериалы.ВыгрузитьКолонку("СтатьяСписания"));
		
	Для Каждого СтатьяСписания Из мСтатьиСписания Цикл 
		тзТовары = тзДопМатериалы.Скопировать(Новый Структура("СтатьяСписания", СтатьяСписания));		
		мСписания = тзСписания.НайтиСтроки(Новый Структура("СтатьяСписания", СтатьяСписания));
		
		Если мСписания.Количество() > 0 Тогда 
			ДокСписание = мСписания[0].ДокСписание.ПолучитьОбъект();
			Если ДокСписание.ПометкаУдаления Тогда
				ДокСписание.УстановитьПометкуУдаления(Ложь);	
			КонецЕсли;
			
			мСписанияИсключить.Добавить(мСписания[0]);
		Иначе
			ДокСписание = Документы.СписаниеТоваров.СоздатьДокумент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокСписание, ДокументЗКС, "Организация,ПодразделениеКомпании,ТорговаяПлощадка,СкладКомпании,ТипЦен,ВалютаДокумента,КурсДокумента");
		
		ДокСписание.Дата = ДокументЗКС.Дата + 1;
		ДокСписание.ХозОперация = Справочники.ХозОперации.СписаниеДополнительныхМатериалов;		
		ДокСписание.ДокументОснование = ДокументЗКС;
		ДокСписание.ТорговаяПлощадкаСписания = ДокументЗКС.ТорговаяПлощадка;
		ДокСписание.СтатьяСписанияТМЦ = СтатьяСписания;
		ДокСписание.Комментарий = "Списание доп материалов создано автоматически " + ТекущаяДата();
		
		ДокСписание.Товары.Очистить();
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
		СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");		
		
		Для Каждого Стр Из тзТовары Цикл 
			НоваяСтрока = ДокСписание.Товары.Добавить();
			НоваяСтрока.Номенклатура = Стр.ДопМатериал;
			НоваяСтрока.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = Стр.Коэффициент;
			НоваяСтрока.Количество = Стр.КоличествоБазовое / ?(Стр.Коэффициент <> 0, Стр.Коэффициент, 1);
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		КонецЦикла;
				
		Попытка
			ДокСписание.Записать(РежимЗаписиДокумента.Проведение);			
			МассивСписаний.Добавить(ДокСписание);
		Исключение
			Ошибки = ДобавитьНовуюСтроку(Ошибки, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось провести списание доп материалов %1
                        |Ошибки: %2'; uk = 'Не вдалося провести списання дод. матеріалів %1
                        |Помилки: %2'"), ДокСписание, ОписаниеОшибки()));					
		КонецПопытки;				
		
	КонецЦикла;
	
	Для Каждого Стр Из мСписанияИсключить Цикл 
		тзСписания.Удалить(Стр);
	КонецЦикла;
	
	Для Каждого Стр Из тзСписания Цикл 
		Если Не Стр.ПометкаУдаления Тогда 
			Попытка
				ДокСписание = Стр.ДокСписание.ПолучитьОбъект();
				ДокСписание.УстановитьПометкуУдаления(Истина);	
			Исключение
				Ошибки = ДобавитьНовуюСтроку(Ошибки, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось пометить на удаление документ %1
                              |Ошибка: %2'; uk = 'Не вдалося встановити поітку видалення на документ %1.
                              |Помилка: %2'"), Стр.ДокСписание, ОписаниеОшибки()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
		
	Возврат МассивСписаний;
КонецФункции


Функция ПолучитьДокументЗКС(ЗакрытиеСмены, ВсеОк, Ошибки)
	
	ДокументЗКС = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка КАК ДокументЗКС
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&Документ) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ТК_ЗакрытиеСменыЗКС";
	
	Запрос.УстановитьПараметр("Документ", ЗакрытиеСмены);
		
	ВыборкаЗКС = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗКС.Следующий() Тогда 
		ДокументЗКС = ВыборкаЗКС.ДокументЗКС.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументЗКС = Неопределено Тогда 
		ДокументЗКС = Документы.ТК_ЗакрытиеСменыЗКС.СоздатьДокумент();	
	Иначе
		Если ДокументЗКС.ПометкаУдаления Тогда 
			ДокументЗКС.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ДокументЗКС.Заполнить(ЗакрытиеСмены);
	
	Попытка
		ДокументЗКС.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ВсеОк = Ложь;
		Ошибки = ДобавитьНовуюСтроку(Ошибки, 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось провести документ ЗКС %1'; uk = 'Не вдалося провести документ ЗКС %1'"),
						ДокументЗКС));
	КонецПопытки;
	
	Возврат ДокументЗКС;
КонецФункции


//Функция ПолучитьТаблицуСкладовДляОтбора(Подразделение, ОтборПоСкладам, ПараметрыОтбора, ЗначениеОтбора = Неопределено)
//	
//	ТаблицаСкладов = Новый ТаблицаЗначений;
//	ТаблицаСкладов.Колонки.Добавить("СкладКомпании");
//	ТаблицаСкладов.Колонки.Добавить("guid");
//	
//	ПостроительЗапроса = Новый ПостроительЗапроса;
//	ПостроительЗапроса.Текст = 
//	"ВЫБРАТЬ
//	|	спрСкладыКомпании.Ссылка КАК СкладыКомпании
//	|ИЗ
//	|	Справочник.СкладыКомпании КАК спрСкладыКомпании
//	|ГДЕ
//	|	спрСкладыКомпании.ЭтоГруппа = ЛОЖЬ";
//	
//	//|	И спрСкладыКомпании.Подразделение = &Подразделение";
//	ПостроительЗапроса.Параметры.Вставить("Подразделение",Подразделение);	
//	
//	ПостроительЗапроса.ЗаполнитьНастройки();
//	
//	//Если ОтборПоСкладам И ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда 
//	//	
//	//	НовОтбор = ПостроительЗапроса.Отбор.Добавить("СкладыКомпании", "СкладыКомпании");		
//	//	
//	//	ОбщегоНазначения.ВидОбъектаПоТипу(
//	//	
//	//	
//	//	ПараметрыОтбора.ВидСравнения 
//	//	ЗаполнитьЗначенияСвойств(НовОтбор, ПараметрыОтбора);		
//	//	
//	//КонецЕсли;
//	
//	ПостроительЗапроса.Выполнить();
//	
//	Результат = ПостроительЗапроса.Результат;
//	Выборка = Результат.Выбрать();
//	Пока Выборка.Следующий() Цикл 
//		НоваяСтрока = ТаблицаСкладов.Добавить();
//		НоваяСтрока.СкладКомпании = Выборка.СкладыКомпании;
//		НоваяСтрока.guid          = Строка(Выборка.СкладыКомпании.УникальныйИдентификатор());
//	КонецЦикла;
//	
//	ТаблицаСкладов.Индексы.Добавить("guid");
//	
//	Возврат ТаблицаСкладов;
//	
//КонецФункции

Функция ПолучитьТаблицуСкладовДляОтбораИзПараметров(Подразделение, ПараметрыОперации)
	
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаСкладов.Колонки.Добавить("guid", Новый ОписаниеТипов("Строка", ,,, Новый КвалификаторыСтроки(40)));
	
	МассивСкладов = Неопределено;
	
	Если (ПараметрыОперации.Свойство("МассивСкладов", МассивСкладов) ИЛИ ПараметрыОперации.Свойство("ОтборПоСкладам", МассивСкладов)) И ТипЗнч(МассивСкладов) = Тип("Массив") Тогда 
		
		Для Каждого Склад Из МассивСкладов Цикл 
			
			НоваяСтрока = ТаблицаСкладов.Добавить();
			НоваяСтрока.СкладКомпании = Склад;
			НоваяСтрока.guid = Строка(Склад.УникальныйИдентификатор());
			
		КонецЦикла;
		
	Иначе
		Запрос = Новый Запрос;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДополнительныеСведения.Объект КАК Склад,
		               |	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).Подразделение КАК Подразделение,
		               |	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).ТорговаяПлощадка КАК ТорговаяПлощадка
		               |ИЗ
		               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |ГДЕ
		               |	ДополнительныеСведения.Объект ССЫЛКА Справочник.СкладыКомпании
		               |	И ДополнительныеСведения.Свойство.Имя = ""OS_АктивныеСклады""
		               |	И ДополнительныеСведения.Значение = ИСТИНА
		               |	И ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).Подразделение В (&Подразделения)";
		
		Запрос.УстановитьПараметр("Подразделения", ОбменФронтПовтИсп.МассивПодразделений(Подразделение));
				
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			НоваяСтрока = ТаблицаСкладов.Добавить();
			НоваяСтрока.СкладКомпании = Выборка.Склад;
			НоваяСтрока.guid = Строка(Выборка.Склад.УникальныйИдентификатор());
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаСкладов.Индексы.Добавить("guid");
	
	Возврат ТаблицаСкладов;
	
КонецФункции

Функция ПолучитьТаблицуСкладовДляОтбораИзПараметров_старая(Подразделение, ПараметрыОперации)
	
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаСкладов.Колонки.Добавить("guid", Новый ОписаниеТипов("Строка", ,,, Новый КвалификаторыСтроки(40)));
	ТаблицаСкладов.Колонки.Добавить("Отдел", Новый ОписаниеТипов("СправочникСсылка.Отделы"));
	
	МассивСкладов = Неопределено;
	
	Если (ПараметрыОперации.Свойство("МассивСкладов", МассивСкладов) ИЛИ ПараметрыОперации.Свойство("ОтборПоСкладам", МассивСкладов)) И ТипЗнч(МассивСкладов) = Тип("Массив") Тогда 
		
		Для Каждого Склад Из МассивСкладов Цикл 
			
			НоваяСтрока = ТаблицаСкладов.Добавить();
			НоваяСтрока.СкладКомпании = Склад;
			НоваяСтрока.guid = Строка(Склад.УникальныйИдентификатор());
			
		КонецЦикла;
		
	Иначе
		Запрос = Новый Запрос;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Объект КАК Склад,
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).Подразделение КАК Подразделение,
		|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).ТорговаяПлощадка КАК ТорговаяПлощадка
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.СкладыКомпании
		|	И ДополнительныеСведения.Свойство.Имя = ""OS_АктивныеСклады""
		|	И ДополнительныеСведения.Значение = ИСТИНА
		|	И ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.СкладыКомпании).Подразделение В (&Подразделения)";
		
		Запрос.УстановитьПараметр("Подразделения", ОбменФронтПовтИсп.МассивПодразделений(Подразделение));
				
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			НоваяСтрока = ТаблицаСкладов.Добавить();
			НоваяСтрока.СкладКомпании = Выборка.Склад;
			НоваяСтрока.guid = Строка(Выборка.Склад.УникальныйИдентификатор());
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаСкладов.Индексы.Добавить("guid");
	
	Возврат ТаблицаСкладов;
	
КонецФункции

/// Данченко - перенесено в  модуль менеджера документа ИН
//Функция СформироватьТаблицуИтоговПоИнвентаризации(ДокСсылка, тДата, тСклад, ТипЦен)
//	
//	тНачДата =Дата("00010101");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ИнвентаризацияТовары.Номенклатура КАК НоменклатураСсылка,
//	|	ИнвентаризацияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	|	СУММА(ВЫБОР
//	|			КОГДА ИнвентаризацияТовары.Номенклатура.ТипНоменклатуры.Весовой
//	|				ТОГДА ИнвентаризацияТовары.КоличествоКнижн * 1000
//	|			ИНАЧЕ ИнвентаризацияТовары.КоличествоКнижн
//	|		КОНЕЦ) КАК ОстатокПоУчету,
//	|	СУММА(ВЫБОР
//	|			КОГДА ИнвентаризацияТовары.Номенклатура.ТипНоменклатуры.Весовой
//	|				ТОГДА ИнвентаризацияТовары.КоличествоФакт * 1000
//	|			ИНАЧЕ ИнвентаризацияТовары.КоличествоФакт
//	|		КОНЕЦ) КАК Фактически,
//	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена
//	|ИЗ
//	|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
//	|		ПО ИнвентаризацияТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
//	|			И ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
//	|ГДЕ
//	|	ИнвентаризацияТовары.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
//	|	ИнвентаризацияТовары.Номенклатура,
//	|	ИнвентаризацияТовары.ЕдиницаИзмерения,
//	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)";
//	
//	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
//	Запрос.УстановитьПараметр("Дата", тДата);
//	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
//	//Запрос.УстановитьПараметр("СпособРасчетаЦены", Перечисления.СпособыРасчетаЦены.КакРазницу);
//	
//	Результат1 = Запрос.Выполнить().Выгрузить();
//	//Результат1.Свернуть("НоменклатураСсылка,ЕдиницаИзмерения,ХарактеристикаНоменклатуры","ОстатокПоУчету,Фактически,Цена");
//	
//	
//	//Запрос = Новый Запрос;
//	//Запрос.Текст = 
//	//"ВЫБРАТЬ
//	//|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
//	//|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	//|	МАКСИМУМ(ИнвентаризацияТовары.Ссылка.Дата) КАК ДатаПоследней
//	//|ПОМЕСТИТЬ ИнвентаризацияМаксимум
//	//|ИЗ
//	//|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
//	//|ГДЕ                           
//	//|	ИнвентаризацияТовары.Ссылка.Проведен
//	//|	И ИнвентаризацияТовары.Ссылка.Дата < &НаДату
//	//|	И ИнвентаризацияТовары.Ссылка.СкладКомпании = &Склад
//	//|	И ИнвентаризацияТовары.Номенклатура В
//	//|			(ВЫБРАТЬ
//	//|				ИнвентаризацияТовары.Номенклатура
//	//|			ИЗ
//	//|				Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
//	//|			ГДЕ
//	//|				ИнвентаризацияТовары.Ссылка = &Ссылка)
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ИнвентаризацияТовары.Номенклатура,
//	//|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ИнвентаризацияТовары.Номенклатура,
//	//|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
//	//|	ЕСТЬNULL(ИнвентаризацияМаксимум.ДатаПоследней, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИнвентаризации
//	//|ИЗ
//	//|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
//	//|		ЛЕВОЕ СОЕДИНЕНИЕ ИнвентаризацияМаксимум КАК ИнвентаризацияМаксимум
//	//|		ПО ИнвентаризацияТовары.Номенклатура = ИнвентаризацияМаксимум.Номенклатура
//	//|			И ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ИнвентаризацияМаксимум.ХарактеристикаНоменклатуры
//	//|ГДЕ
//	//|	ИнвентаризацияТовары.Ссылка = &Ссылка";
//	//
//	//Запрос.УстановитьПараметр("НаДату", тДата);
//	//Запрос.УстановитьПараметр("Склад", тСклад);
//	//Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
//	//
//	//тзвДоприход = Запрос.Выполнить().Выгрузить();
//	//
//	//
//	//тзПериодДоприход = тзвДоприход.Скопировать(,"ДатаИнвентаризации");
//	//тзПериодДоприход.Свернуть("ДатаИнвентаризации");
//	//
//	//ИтогДоприход = Новый ТаблицаЗначений;
//	//ИтогДоприход.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	//ИтогДоприход.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	//ИтогДоприход.Колонки.Добавить("КоличествоДоприход");
//	//Для Каждого ДатаИн Из тзПериодДоприход Цикл 
//	//	
//	//	массивТоваров = тзвДоприход.Скопировать(тзвДоприход.НайтиСтроки(Новый Структура("ДатаИнвентаризации", ДатаИн.ДатаИнвентаризации))).ВыгрузитьКолонку("Номенклатура");
//	//	
//	//	Если ДатаИн.ДатаИнвентаризации = тНачДата Тогда
//	//		НачПериода = НачалоДня(тДата- 86400*180);
//	//	Иначе
//	//		НачПериода =  ДатаИн.ДатаИнвентаризации;
//	//	КонецЕсли;
//	//	
//	//	ЗапросД = Новый Запрос;
//	//	ЗапросД.Текст = "ВЫБРАТЬ
//	//	               |	ПриходованиеТоваровОбороты.Номенклатура КАК Номенклатура,
//	//	               |	ПриходованиеТоваровОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	//	               |	ПриходованиеТоваровОбороты.КоличествоОборот КАК КоличествоДоприход
//	//	               |ИЗ
//	//	               |	РегистрНакопления.ПриходованиеТоваров.Обороты(
//	//	               |			&НачалоПериода,
//	//	               |			&КонецПериода,
//	//	               |			Авто,
//	//	               |			СкладКомпании = &СкладКомпании
//	//	               |				И Номенклатура В (&Номенклатура)) КАК ПриходованиеТоваровОбороты";
//	//	
//	//	ЗапросД.УстановитьПараметр("КонецПериода", тДата);
//	//	ЗапросД.УстановитьПараметр("НачалоПериода", НачПериода);
//	//	ЗапросД.УстановитьПараметр("Номенклатура", массивТоваров);
//	//	ЗапросД.УстановитьПараметр("СкладКомпании", тСклад);
//	//	
//	//	РезД = ЗапросД.Выполнить();
//	//	ВыборкаД =  РезД.Выбрать();
//	//	Пока ВыборкаД.Следующий() Цикл 
//	//		ндСтрока = ИтогДоприход.Добавить();
//	//		ЗаполнитьЗначенияСвойств(ндСтрока,ВыборкаД);
//	//	КонецЦикла;
//	//	
//	//КонецЦикла;
//	//
//	//Для Каждого ВыборкаДетальныеЗаписи Из Результат1 Цикл
//	//	нСтрки =  ИтогДоприход.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",ВыборкаДетальныеЗаписи.НоменклатураСсылка,ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры));
//	//	Если нСтрки.Количество() > 0 Тогда
//	//		КоличествоДоприход =  нСтрки[0].КоличествоДоприход;
//	//		ОстатокПоУчету = ВыборкаДетальныеЗаписи.ОстатокПоУчету;
//	//		ВыборкаДетальныеЗаписи.ОстатокПоУчету = ОстатокПоУчету-КоличествоДоприход;
//	//	КонецЕсли;
//	//	
//	//КонецЦикла;
//	//
//	
//	Возврат Результат1;
//	
//	
//КонецФункции

Процедура Пауза(ИнтервалОжидания)
	ПараметрыЗапуска = ФайловаяСистема.ПараметрыЗапускаПрограммы();
	ПараметрыЗапуска.ДождатьсяЗавершения = Истина;
	ФайловаяСистема.ЗапуститьПрограмму("timeout /t " + Формат(ИнтервалОжидания, "ЧГ=0"), ПараметрыЗапуска);
КонецПроцедуры

Процедура ЗаполнитьТовары(ДокОбъект,ТаблицаПродаж)
	
	тчТовары = ДокОбъект.Товары;
	Если тчТовары.Количество() = 0 Тогда
		тчТовары.Загрузить(ТаблицаПродаж);
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаПродаж Цикл 
			НоваяСтрока = тчТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработатьТабличнуюЧасть(ТаблицаДокумента,тзРезультатЗапроса,ЗагруженныеОбъекты,ЗетПродажи = Ложь)
	
	Если ТаблицаДокумента = "Товары" Тогда
		
		Для Каждого СтрокаТаблицы Из тзРезультатЗапроса Цикл 
			Артикул = Формат(СтрокаТаблицы.ARTID, "ЧЦ=6; ЧДЦ=; ЧГ=");
			ЕдИзм   = СокрЛП(СтрокаТаблицы.PACKGUID);
			Характ  = СокрЛП(СтрокаТаблицы.CHARGUID);
			
			КлючТовара = СтрЗаменить("А"+Артикул+""+ЕдИзм+""+Характ,"-","");
			ДанныеПоТовару =   Неопределено;
			
			ЗагруженныеОбъекты.Свойство(КлючТовара,ДанныеПоТовару);
			
			Если ДанныеПоТовару = Неопределено Тогда
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	спрНоменклатура.Ссылка КАК Номенклатура,
				|	спрНоменклатура.СтавкаНДС,
				|	спрНоменклатура.СтавкаНДС.Ставка КАК Ставка
				|ИЗ
				|	Справочник.Номенклатура КАК спрНоменклатура
				|ГДЕ
				|	спрНоменклатура.Артикул = &Артикул
				|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Артикул", Артикул);
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					нНоменклатура     = ВыборкаДетальныеЗаписи.Номенклатура;
					нСтавкаНДС        = ВыборкаДетальныеЗаписи.СтавкаНДС;
					нСтавка           = ВыборкаДетальныеЗаписи.Ставка;
				Иначе
					нНоменклатура     = Справочники.Номенклатура.ПустаяСсылка();
					нСтавкаНДС        = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					нСтавка           = 20;
				КонецЕсли;
				
				нЕденицаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(Новый УникальныйИдентификатор(ЕдИзм));
				Если Не ОбщегоНазначения.СсылкаСуществует(нЕденицаИзмерения) Тогда 
					Если ЗначениеЗаполнено(нНоменклатура.ОсновнаяЕдиницаИзмерения) Тогда
						нЕденицаИзмерения = нНоменклатура.ОсновнаяЕдиницаИзмерения;	
					Иначе
						нЕденицаИзмерения = Справочники.ЕдиницыИзмерения.НайтиЕдиницуИзмеренийПоБазовой(нНоменклатура);
					КонецЕсли;
					
					
				КонецЕсли;
				
				Если Характ = "00000000-0000-0000-0000-000000000000" Тогда
					нХарактеристика   = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				Иначе
					нХарактеристика   = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(Характ));
				КонецЕсли;	
				Если ЗетПродажи И ЗначениеЗаполнено(СтрокаТаблицы.LOSSGRPGUID) Тогда
					Если СтрокаТаблицы.LOSSGRPGUID <> "00000000-0000-0000-0000-000000000000" Тогда
						СтрокаТаблицы.КлассификаторПродажи = Справочники.КлассификаторПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.LOSSGRPGUID));
						
					КонецЕсли;
				КонецЕсли;
				
				
				СтрокаТаблицы.Номенклатура               = нНоменклатура;
				СтрокаТаблицы.ХарактеристикаНоменклатуры = нХарактеристика;
				СтрокаТаблицы.ЕдиницаИзмерения           = нЕденицаИзмерения;
				СтрокаТаблицы.СтавкаНДС                  = нСтавкаНДС;
				СтрокаТаблицы.Ставка                     = нСтавка;
				ЗагруженныеОбъекты.Вставить(КлючТовара,Новый Структура("Номенклатура,ЕденицаИзмерения,Характеристика,СтавкаНДС,Ставка",нНоменклатура,нЕденицаИзмерения,нХарактеристика,нСтавкаНДС,нСтавка));
			Иначе
				СтрокаТаблицы.Номенклатура               = ДанныеПоТовару["Номенклатура"];
				СтрокаТаблицы.ХарактеристикаНоменклатуры = ДанныеПоТовару["Характеристика"];
				СтрокаТаблицы.ЕдиницаИзмерения           = ДанныеПоТовару["ЕденицаИзмерения"];
				СтрокаТаблицы.СтавкаНДС                  = ДанныеПоТовару["СтавкаНДС"];
				СтрокаТаблицы.Ставка                     = ДанныеПоТовару["Ставка"];
				
				Если ЗетПродажи И ЗначениеЗаполнено(СтрокаТаблицы.LOSSGRPGUID) Тогда
					Если СтрокаТаблицы.LOSSGRPGUID <> "00000000-0000-0000-0000-000000000000" Тогда
						СтрокаТаблицы.КлассификаторПродажи = Справочники.КлассификаторПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.LOSSGRPGUID));
						
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			
			
			СтрокаТаблицы.Сумма	   = СтрокаТаблицы.Цена * СтрокаТаблицы.Количество ;
			СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.СуммаВсего * СтрокаТаблицы.Ставка / (100 + СтрокаТаблицы.Ставка);
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьВнутрСсылку(лСсылка)
	Если лСсылка = Неопределено ИЛИ лСсылка ="NULL" Тогда
		Возврат "NULL";
	КонецЕсли;
	Зн = ЗначениеВСтрокуВнутр(лСсылка);
	Зн = "0x" + Лев(Прав(Зн, 33), 32);
	Возврат Зн;
КонецФункции

Функция ПолучитьДатуВыгрузкиДокумента(СкладКомпании,Знач Дата,Отказ)
	датаВДокумент = Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗакрытиеСмены.Дата КАК Дата
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|	И ЗакрытиеСмены.Дата < &Дата
	|	И ЗакрытиеСмены.СкладКомпании = &СкладКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат датаВДокумент;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	датаВДокумент = ВыборкаДетальныеЗаписи.Дата;
	
	Если (НачалоДня(Дата)-НачалоДня(датаВДокумент)) > 86400 Тогда
		датаВДокумент = Дата;
		Отказ = Истина;
	Иначе
		датаВДокумент = датаВДокумент +1;
	КонецЕсли;
	
	Возврат датаВДокумент;
	
КонецФункции

Функция ПолучитьСоединение(ПараметрыСоединения = Неопределено,Загрузка = Ложь) Экспорт
	
	Если ПараметрыСоединения = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Загрузка",Загрузка);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА &Загрузка
		|			ТОГДА ОбменФронт.БазаДанныхТранзит
		|		ИНАЧЕ ОбменФронт.БазаДанных
		|	КОНЕЦ КАК СтрокаБазаДанных,
		|	ОбменФронт.АдресСервера КАК СтрокаСервер,
		|	ОбменФронт.ИмяПользователя КАК СтрокаПользователь,
		|	ОбменФронт.Пароль КАК СтрокаПароль
		|ИЗ
		|	ПланОбмена.ОбменФронт КАК ОбменФронт
		|ГДЕ
		|	НЕ ОбменФронт.ЭтотУзел
		|	И ОбменФронт.ПодразделениеКомпании = &ПодразделениеКомпании";
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Пользователи.ТекущийПользователь()));
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ВызватьИсключение НСтр("ru = 'Нет настроек для подключения к базе OS'; uk = 'Немає налаштувань для підключення до бази OS'");
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтрокаБазаДанных = Выборка.СтрокаБазаДанных;
		СтрокаСервер = Выборка.СтрокаСервер;
		СтрокаПользователь = Выборка.СтрокаПользователь;
		СтрокаПароль = Выборка.СтрокаПароль;
		
	Иначе
		
		СтрокаБазаДанных = Неопределено;//"Integration1C";
		СтрокаСервер = Неопределено;//"os-root-test";
		СтрокаПользователь = Неопределено;//"mp";
		СтрокаПароль = Неопределено;//"mp";
		
		//	ПараметрыСоединения = Новый Структура;
		Если Загрузка Тогда
			ПараметрыСоединения.Свойство("БазаДанныхТранзит",СтрокаБазаДанных);
		Иначе
			ПараметрыСоединения.Свойство("БазаДанных",СтрокаБазаДанных);
		КонецЕсли;
		ПараметрыСоединения.Свойство("АдресСервера",СтрокаСервер);
		ПараметрыСоединения.Свойство("ИмяПользователя",СтрокаПользователь);
		ПараметрыСоединения.Свойство("Пароль",СтрокаПароль);
		
	КонецЕсли;
	
	СтрокаПодключенияКБазе = "Provider=SQLNCLI11;Server="+СокрЛП(СтрокаСервер) + ";Database="+СокрЛП(СтрокаБазаДанных) + ";Uid="+СокрЛП(СтрокаПользователь) + ";Pwd="+СокрЛП(СтрокаПароль) +";";
	
	Попытка
		Connection = Новый COMObject("ADODB.Connection"); 	
		Connection.ConnectionTimeOut = 2500;//1200;
		Connection.CommandTimeout = 1000;
		Connection.CursorLocation = 1; 
		Connection.Mode = 1; 
		//	
		Connection.Open(СтрокаПодключенияКБазе);  
		//	
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Connection;
	
КонецФункции

Процедура ВыполнитьЗапрос(Connection, Отказ, Query,ТекстСообщений = Неопределено) 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Запрос.OS",УровеньЖурналаРегистрации.Информация,,,Query);
	
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command");
	ЗапросАДО.CommandText = Query;
	ЗапросАДО.ActiveConnection = Connection;	
	
	
	Попытка
		ЗапросАДО.Execute(Query);
		//objRecordset = Connection.Execute(Query);
		
	Исключение
		тОшибка = "Невозможно выполнить SQL запрос " + ОписаниеОшибки() + Символы.ПС + Query;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(тОшибка);
		
		Отказ = Истина;
		
		Если ТекстСообщений <> Неопределено Тогда
			ТекстСообщений.ДобавитьСтроку(тОшибка);
			ТекстСообщений.ДобавитьСтроку("-------------ЗАПРОС------------");
			ТекстСообщений.ДобавитьСтроку(Query);
			ТекстСообщений.ДобавитьСтроку("-------------------------------");
		КонецЕсли;
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура Начать_Транзакцию(Connection)Экспорт 
	Connection.BeginTrans();
КонецПроцедуры

Процедура Зафиксировать_Транзакцию(Connection)Экспорт 
	Connection.CommitTrans();
КонецПроцедуры

Процедура Откатить_Транзакцию(Connection)Экспорт
	Connection.RollbackTrans();
КонецПроцедуры

Функция ПроверкаСтрокИН()
	Текст = "if(select count(*) from #docitems_raw where GUID is null)>0
	|      raiserror('Null values not allowed for GUID', 16, 1)
	|if(select count(*) from #docitems_raw where DOCTYPE is null)>0
	|       raiserror('Null values not allowed for DOCTYPE', 16, 1)
	|if(select count(*) from #docitems_raw where DOCITEMNUM is null)>0
	|       raiserror('Null values not allowed for DOCITEMNUM', 16, 1)
	|if(select count(*) from #docitems_raw where REQUESTDATE is null)>0
	|       raiserror('Null values not allowed for REQUESTDATE', 16, 1)
	|if(select count(*) from #docitems_raw where PACKID is null)>0
	|       raiserror('Null values not allowed for PACKID', 16, 1)
	|if(select count(*) from #docitems_raw where PACKDTYPE is null)>0
	|       raiserror('Null values not allowed for PACKDTYPE', 16, 1)
	|if(select count(*) from #docitems_raw where QUANTMASK is null)>0
	|       raiserror('Null values not allowed for QUANTMASK', 16, 1)
	|if(select count(*) from #docitems_raw where QUANTITY is null)>0
	|       raiserror('Null values not allowed for QUANTITY', 16, 1)
	|if(select count(*) from #docitems_raw where EXPECTEDQUANTITY is null)>0
	|       raiserror('Null values not allowed for EXPECTEDQUANTITY', 16, 1)
	|if(select count(*) from #docitems_raw where LOWDIFFERENCEBOUND is null)>0
	|       raiserror('Null values not allowed for LOWDIFFERENCEBOUND', 16, 1)
	|if(select count(*) from #docitems_raw where HIDIFFERENCEBOUND is null)  >0
	|       raiserror('Null values not allowed for HIDIFFERENCEBOUND', 16, 1)
	|if(select count(*) from #docitems_raw where PRICE is null)>0
	|       raiserror('Null values not allowed for PRICE', 16, 1)
	|if(select count(*) from #docitems_raw where PRICEVAT is null)>0
	|       raiserror('Null values not allowed for PRICEVAT', 16, 1)
	|if(select count(*) from #docitems_raw where ITEMSUM is null)>0
	|       raiserror('Null values not allowed for ITEMSUM', 16, 1)
	|if(select count(*) from #docitems_raw where ITEMSUMVAT is null)>0
	|       raiserror('Null values not allowed for ITEMSUMVAT', 16, 1)
	|if(select count(*) from #docitems_raw where DISCSUM is null)>0
	|       raiserror('Null values not allowed for DISCSUM', 16, 1)
	|if(select count(*) from #docitems_raw where TAXGRPRATE is null)>0
	|       raiserror('Null values not allowed for TAXGRPRATE', 16, 1)
	|if(select count(*) from #docitems_raw where DELFLAG is null)>0
	|       raiserror('Null values not allowed for DELFLAG', 16, 1)
	|
	|/* подготовка временной таблицы  */
	|declare @qmultuplier int = 1000000
	|if(select object_id('tempdb.dbo.#docitems')) is not null
	|drop table #docitems
	|
	|create table #docitems  
	| (  [DOCID] [int] NOT NULL,
	|       [DOCITEMNUM] [int] NOT NULL,
	|       [REQUESTDATE] [bigint] NOT NULL,
	|       [ARTID] [int] NULL,
	|       [PACKID] [int] NOT NULL,
	|       [PACKDTYPE] [int] NOT NULL,
	|       [QUANTMASK] [int] NOT NULL,
	|       [QUANTITY] [bigint] NOT NULL,
	|       [EXPECTEDQUANTITY] [bigint] NOT NULL,
	|       [LOWDIFFERENCEBOUND] [bigint] NOT NULL,
	|       [HIDIFFERENCEBOUND] [bigint] NOT NULL,
	|       [PRICE] [decimal](18, 6) NOT NULL,
	|       [PRICEVAT] [decimal](18, 6) NOT NULL,
	|       [ITEMSUM] [decimal](18, 6) NOT NULL,
	|       [ITEMSUMVAT] [decimal](18, 6) NOT NULL,
	|       [DISCSUM] [decimal](18, 6) NOT NULL,
	|       [TAXGRPRATE] [int] NOT NULL,
	|       [DELFLAG] [tinyint] NOT NULL
	|PRIMARY KEY CLUSTERED 
	|(
	|       [DOCID] ASC,
	|       [DOCITEMNUM] ASC
	|))
	|
	|insert into #docitems
	|select 
	|       DOCREQUEST.DOCID,
	|       r.DOCITEMNUM,
	|       r.REQUESTDATE,
	|       ART.ARTID,
	|       PACK.PACKID,
	|       3 PACKDTYPE,
	|       r.QUANTMASK,
	|       r.QUANTITY*@qmultuplier QUANTITY,
	|       EXPECTEDQUANTITY*@qmultuplier EXPECTEDQUANTITY,
	|       LOWDIFFERENCEBOUND,
	|       HIDIFFERENCEBOUND,
	|       PRICE,
	|       PRICEVAT,
	|       ITEMSUM,
	|       ITEMSUMVAT,
	|       DISCSUM,
	|       TAXGRPRATE,
	|       r.DELFLAG
	|from #docitems_raw r
	|left join Integration1C.dbo.DOCREQUEST on DOCREQUEST.DOCTYPE=r.DOCTYPE and DOCREQUEST.GUID=r.GUID
	|left join Integration1C.dbo.ART on ART.GUID=r.ARTID
	|left join Integration1C.dbo.PACK on PACK.GUID=r.PACKID
	|option(recompile)
	|
	|/* слияние целевой таблицы с временной */
	|declare @UPDATENUM int = (select recordnum from DATAPUMP where DIRNAME = 'DOCREQUESTITEMS')+1
	|
	|merge integration1C.dbo.DOCREQUESTITEMS t
	|using #docitems s on t.[DOCID]=s.DOCID and t.DOCITEMNUM=s.DOCITEMNUM 
	|when matched then update set [REQUESTDATE]= s.REQUESTDATE,
	|             
	|             [ARTID] = s.ARTID ,
	|             [PACKID]= s.PACKID,
	|             [PACKDTYPE] = 3,
	|             [QUANTMASK] = s.QUANTMASK,
	|             [QUANTITY] = s.QUANTITY,
	|             [EXPECTEDQUANTITY] = s.EXPECTEDQUANTITY,
	|             [LOWDIFFERENCEBOUND] = s.LOWDIFFERENCEBOUND,
	|             [HIDIFFERENCEBOUND]= s.HIDIFFERENCEBOUND,
	|             [PRICE] = s.PRICE,
	|             [PRICEVAT] = s.PRICEVAT,
	|             [ITEMSUM] = s.ITEMSUM,
	|             [ITEMSUMVAT] = s.ITEMSUMVAT,
	|             [DISCSUM] = s.DISCSUM,
	|             [TAXGRPRATE] = s.TAXGRPRATE,
	|          DELFLAG = s.DELFLAG,
	|          UPDATENUM = @UPDATENUM
	|when not matched then insert 
	|([DOCID],[DOCITEMNUM],[REQUESTDATE],[ARTID],[PACKID],[PACKDTYPE],[QUANTMASK],[QUANTITY],
	|[EXPECTEDQUANTITY],[LOWDIFFERENCEBOUND],[HIDIFFERENCEBOUND],[PRICE],[PRICEVAT],[ITEMSUM],[ITEMSUMVAT],[DISCSUM],[TAXGRPRATE],[DELFLAG],[UPDATENUM])
	|values
	|(s.[DOCID],s.[DOCITEMNUM],s.[REQUESTDATE],s.[ARTID],s.[PACKID],s.[PACKDTYPE],s.[QUANTMASK],s.[QUANTITY],
	|s.[EXPECTEDQUANTITY],s.[LOWDIFFERENCEBOUND],s.[HIDIFFERENCEBOUND],s.[PRICE],s.[PRICEVAT],s.[ITEMSUM],s.[ITEMSUMVAT],s.[DISCSUM],s.[TAXGRPRATE],s.[DELFLAG],@UPDATENUM);
	|
	|UPDATE integration1C.dbo.DATAPUMP set RECORDNUM = @UPDATENUM where DIRNAME = 'DOCREQUESTITEMS'
	|
	|
	|if(select object_id('tempdb.dbo.#docitems')) is not null
	|drop table #docitems
	|if(select object_id('tempdb.dbo.#docitems_raw')) is not null
	|drop table #docitems_raw
	|";
	
	Возврат Текст;	
КонецФункции


Функция УидГуид(UUID) Экспорт
	
	Возврат Прав(UUID, 8) + "-" + Сред(UUID, 21, 4) + "-" + Сред(UUID, 17, 4) + "-" + Лев(UUID, 4) + "-" + Сред(UUID, 5, 12);
	
КонецФункции

Функция ГуидУид(GUID) Экспорт 
	
	Возврат Сред(GUID, 20, 4) + Прав(GUID, 12) + Сред(GUID, 15, 4) + Сред(GUID, 10, 4) + Лев(GUID, 8);
	
КонецФункции


//Пустая операция
Процедура Пустышка()
	
	ДлительностьРасчета = 10;	
	
	ВремяНачала = ТекущаяДатаСеанса();
	Для Счетчик = 1 По ДлительностьРасчета Цикл
		Пауза(1);
		Процент = Цел(Счетчик / ДлительностьРасчета * 100);
		Этап = Мин(Цел(Счетчик / (ДлительностьРасчета / 3)) + 1, 3); // Имитация операции в 3 этапа.
		
		//ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru = '%1 операция %2 выполнена на %3 % (этап %4)'"),
		//	ТекущаяДатаСеанса(), ТипДокумента, Процент, Этап));
		
		ДлительныеОперации.СообщитьПрогресс(Процент);
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьНовуюСтроку(Знач ИсходнаяСтрока = "", Знач НоваяСтрока = "")
	
	Если Не ПустаяСтрока(ИсходнаяСтрока) И Не ПустаяСтрока(НоваяСтрока) Тогда 
		
		Возврат ИсходнаяСтрока + Символы.ПС + НоваяСтрока;
		
	ИначеЕсли ПустаяСтрока(ИсходнаяСтрока) Тогда 
		
		Возврат НоваяСтрока;
		
	Иначе
		
		Возврат ИсходнаяСтрока;
		
	КонецЕсли;
	
КонецФункции


Функция ПоискНоменклатуры(АртикулЯкобс)
	
	АртикулЯкобс = Число(АртикулЯкобс);
	Если АртикулЯкобс = 447089962 ИЛИ АртикулЯкобс =938245922 Тогда
		тНом = "ТехРаботы";
		Возврат тНом;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодаКофеЯкобс.Номенклатура
	|ИЗ
	|	РегистрСведений.КодаКофеЯкобс КАК КодаКофеЯкобс
	|ГДЕ
	|	КодаКофеЯкобс.АртикулЯкобс = &АртикулЯкобс";
	
	Запрос.УстановитьПараметр("АртикулЯкобс", АртикулЯкобс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если  РезультатЗапроса.Пустой() ТОгда
		тНом = Справочники.Номенклатура.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			тНом = ВыборкаДетальныеЗаписи.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	Возврат тНом;
КонецФункции

Функция ПоискФайловПоFTP(НачалоПериода, КонецПериода) Экспорт
	КонецПериода = КонецДня(КонецПериода);
	ssl = Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено);
	Адрес= "obsf.digma.ua";
	Логин = "coffe";
	Пароль = "6YrTU2Rn9yef67";
	
	Соединение = Новый FTPСоединение(Адрес,21,Логин,Пароль, Неопределено,Истина, 0, ssl);
	
	Соединение.УстановитьТекущийКаталог("/Inbox");
	
	ТекДата = НачалоПериода;
	//МассивФайлов = новый Массив;
	ТочкиДоставки = Новый Соответствие;
	Номенклатура = Новый Соответствие;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ТочкаДоставки", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Пока ТекДата <= КонецПериода Цикл
		
		ТекущаяДата = Формат(ТекДата, "ДФ=yyyyMMdd");
		НайденныеФайлы = Соединение.НайтиФайлы(Соединение.ТекущийКаталог(), ТекущаяДата+"*.xml", Истина);
		
		
		Для Каждого Файл Из НайденныеФайлы Цикл
			ВремФайл = ПолучитьИмяВременногоФайла("xml");
			Соединение.Получить(Файл.ПолноеИмя, ВремФайл);
			
			//МассивФайлов.Добавить();
			
			
			Парсер = Новый ЧтениеXML;
			Парсер.ОткрытьФайл(ВремФайл);
			
			Построитель = Новый ПостроительDOM;
			Документ = Построитель.Прочитать(Парсер);
			
			Для  Каждого ЭлементДата Из Документ.ЭлементДокумента.ДочерниеУзлы Цикл
				Если НЕ (ЭлементДата.ТипУзла = ТипУзлаDOM.Элемент и ЭлементДата.ИмяУзла = "data") Тогда
					Продолжить;
				КонецЕсли;
				
				нСтрока = Таблица.Добавить();
				нСтрока.Дата = ТекДата;
				
				Для Каждого СтрокаДатаРеквизиты Из ЭлементДата.ДочерниеУзлы Цикл 
					
					Если СтрокаДатаРеквизиты.ИмяУзла = "place_name" Тогда
						Точка = СтрокаДатаРеквизиты.ТекстовоеСодержимое;
						ТТ= "A"+ Точка;
						Если ТочкиДоставки.Получить(Точка) = Неопределено Тогда
							тТочка = Справочники.СкладыКомпании.НайтиПоКоду(ТТ);
							Если тТочка = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
								Сообщить("Не найдена точка доставки с ID "+ Точка);
								Таблица.Удалить(нСтрока);
								Прервать;
							Иначе
								ТочкиДоставки.Вставить(Точка, тТочка);
								нСтрока.ТочкаДоставки = тТочка;
							КонецЕсли;
						Иначе
							нСтрока.ТочкаДоставки = ТочкиДоставки.Получить(Точка); 
						КонецЕсли;
						
					ИначеЕсли СтрокаДатаРеквизиты.ИмяУзла = "portion_type_id" Тогда
						Ном = СтрокаДатаРеквизиты.ТекстовоеСодержимое;
						Если Ном = 0 Тогда
							Сообщить("Не определена номенклатура "+Ном +" на точке "+Точка+ " за дату "+ ТекДата);
							Таблица.Удалить(нСтрока);
							Прервать;
						ИначеЕсли Номенклатура.Получить(Ном) = Неопределено Тогда
							тНом = ПоискНоменклатуры(Формат(Ном, "ЧДЦ=; ЧГ="));
							Если тНом = Справочники.Номенклатура.ПустаяСсылка() Тогда
								Сообщить("Не определена номенклатура "+Ном +" на точке "+Точка+ " за дату "+ ТекДата);
								Таблица.Удалить(нСтрока);
								Прервать;
							ИначеЕсли тНом = "ТехРаботы" Тогда
								Таблица.Удалить(нСтрока);
								Прервать;
							Иначе
								Номенклатура.Вставить(Ном, тНом);
								нСтрока.Номенклатура = тНом; 
							КонецЕсли;
						Иначе
							нСтрока.Номенклатура = Номенклатура.Получить(Ном); 
						КонецЕсли;
					ИначеЕсли СтрокаДатаРеквизиты.ИмяУзла = "cups" Тогда
						Текст = СтрокаДатаРеквизиты.ТекстовоеСодержимое;
						Количество = XMLЗначение(Тип("Число"), Текст);
						Если Количество=0 Тогда
							Таблица.Удалить(нСтрока);
							Прервать;
						Иначе
							нСтрока.Количество = Количество;
						КонецЕсли;
						
					КонецЕсли;	
				КонецЦикла;
				
			КонецЦикла;	
		КонецЦикла;
		
		ТекДата = КонецДня(ТекДата)+1;
	КонецЦикла;
	
	Таблица.Свернуть("Дата, ТочкаДоставки, Номенклатура" , "Количество");
	
	Возврат Таблица;
	
КонецФункции

Функция ПоискФайловПоHTTP(НачалоПериода, КонецПериода) Экспорт
	
	Защищенное = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("dashboard.prostopay.net",443,,,,,Защищенное,);
	
	ОСклад = Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании");    
	Чис = Новый ОписаниеТипов("Число");
	Ном = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ДТ = Новый ОписаниеТипов("Дата");
	
	ТабП = Новый ТаблицаЗначений;
	ТабП.Колонки.Добавить("Дата", ДТ);
	ТабП.Колонки.Добавить("СкладКомпании", ОСклад);
	ТабП.Колонки.Добавить("Номенклатура", Ном);
	ТабП.Колонки.Добавить("Количество", Чис);
	
	ТекДата = НачалоПериода;
	Пока ТекДата<=КонецПериода Цикл;
		
		НачДата = Формат(ТекДата, "ДФ=yyyy-MM-dd");
		
		HTTPЗапрос = Новый HTTPЗапрос("/api/dfsales/85ff8b6f-b453-4b15-ad78-7eddac84f70e?date="+ НачДата);
		
		Ответ = Соединение.Получить(HTTPЗапрос);
		Если Ответ.КодСостояния = 200 ТОгда
		Иначе
			ОписаниеОшибки = "Ошибка получения данных. Код состояния "+ Ответ.КодСостояния;
		КонецЕсли;
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON= Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
		Результат = ПрочитатьJSON(ЧтениеJSON);
		
		Для Каждого СтрокаМассива из Результат Цикл
			НоваяСтрока = ТабП.Добавить();
			тДата = Дата(СтрЗаменить(СтрокаМассива.d,"-",""));
			НоваяСтрока.Дата = тДата;
			
			тСклад = Справочники.СкладыКомпании.НайтиПоКоду(СокрЛП(СтрокаМассива.posName));
			Если  тСклад = Справочники.СкладыКомпании.ПустаяСсылка() ТОгда
				Сообщить("Не найдена точка доставки с кодом "+ СтрокаМассива.posName);
			КонецЕсли;
			
			НоваяСтрока.СкладКомпании = тСклад;
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СокрЛП(СтрокаМассива.giName_id));
			Если Номенклатура= Справочники.Номенклатура.ПустаяСсылка() ТОгда
				Сообщить("Не найдена номенклатура с артикулом"+ СтрокаМассива.giName_id);
			КонецЕсли;
			
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Количество = Число(СокрЛП(СтрокаМассива.quantity));
		КонецЦикла;
		ТекДата = КонецДня(ТекДата) + 1;
		
	КонецЦикла;
	
	Возврат	ТабП;
	
КонецФункции

#КонецОбласти

	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
