
Функция РядыЯчеек(Рядов)	Экспорт
	РядыЯчеек = Новый Соответствие;
	Для Ряд = 0 По Рядов - 1 Цикл
		РядыЯчеек.Вставить(Ряд,Символ(65+Ряд));
	КонецЦикла;
	Возврат РядыЯчеек;
КонецФункции

Функция ИмяЯчейки(Рядов,Ячеек,НомерЯчейки)	Экспорт
	РядыЯчеек = РядыЯчеек(Рядов); 
	Если НомерЯчейки = 0 Тогда
		ИмяЯчейки =  "";
	Иначе
		НомерРядя = Цел((НомерЯчейки - 1) / Ячеек);
		Ряд = РядыЯчеек.Получить(НомерРядя);
		Ячейка = НомерЯчейки - НомерРядя * Ячеек;
		ИмяЯчейки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 - %2",Ряд,Формат(Ячейка,"ЧЦ=2; ЧВН="));
	КонецЕсли;
	Возврат ИмяЯчейки;
КонецФункции

Функция ВендингСоединениеНТТР()
	//https://attica.customintegrator.net/api
	//api-vendiboard.digma.ua
	//login: attica
	//пароль: c91d3be9-53d0-43e3-b9cc-348699802853
	//Сервер = "attica.customintegrator.net";
	Сервер = "api-vendiboard.digma.ua";
	ЗащищенноеСоединение = Истина;
	Таймаут = 120;
	SSL =  ?(ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
	
	СоединениеНТТР = Новый HTTPСоединение(Сервер, , , , , Таймаут, SSL);
	
	Возврат СоединениеНТТР;
КонецФункции

Функция ПолучитьДанные_GET(Команда)	Экспорт
	СоединениеНТТР = ВендингСоединениеНТТР();
	
	АдресРесурса = "/api/"+Команда;
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Basic YXR0aWNhOmM5MWQzYmU5LTUzZDAtNDNlMy1iOWNjLTM0ODY5OTgwMjg1Mw==");
	ОтветHTTP = СоединениеНТТР.Получить(ЗапросHTTP);
	
	jsonОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(jsonОтвет);
	ОтветДанные = ПрочитатьJSON(Чтение);
	
	Возврат Новый Структура("КодСостояния,Данные,Команда",ОтветHTTP.КодСостояния,ОтветДанные,Команда);
КонецФункции

Функция СоздатьЭлемент_POST(Команда,Данные)	Экспорт
	СтрокаJSON = СтрокаJSON(Данные);
	
	СоединениеНТТР = ВендингСоединениеНТТР();
	
	АдресРесурса = "/api/"+Команда;
	//	Создаем запрос данных методом POST
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	//ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Basic YXR0aWNhOmM5MWQzYmU5LTUzZDAtNDNlMy1iOWNjLTM0ODY5OTgwMjg1Mw==");
	//Устанавливает строку, из которого будет прочитано тело POST-запроса.
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	//	Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
	ОтветHTTP = СоединениеНТТР.ОтправитьДляОбработки(ЗапросHTTP);
	ОтветJSON = ОтветHTTP.ПолучитьТелоКакСтроку();
	СоединениеНТТР = Неопределено;
	
	jsonОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(jsonОтвет);
	ОтветДанные = ПрочитатьJSON(Чтение);
	
	Возврат Новый Структура("КодСостояния,Данные,Команда",ОтветHTTP.КодСостояния,ОтветДанные,Команда);
КонецФункции

Функция ИзменитьЭлемент_PUT(Команда,Данные)	Экспорт
	СтрокаJSON = СтрокаJSON(Данные);
	
	СоединениеНТТР = ВендингСоединениеНТТР();
	
	АдресРесурса = "/api/"+Команда;
	//	Создаем запрос данных методом POST
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	//ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Basic YXR0aWNhOmM5MWQzYmU5LTUzZDAtNDNlMy1iOWNjLTM0ODY5OTgwMjg1Mw==");
	//Устанавливает строку, из которого будет прочитано тело POST-запроса.
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	//	Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
	ОтветHTTP = СоединениеНТТР.ВызватьHTTPМетод("PUT",ЗапросHTTP);
	//ОтветHTTP = СоединениеНТТР.ОтправитьДляОбработки(ЗапросHTTP);
	ОтветJSON = ОтветHTTP.ПолучитьТелоКакСтроку();
	СоединениеНТТР = Неопределено;
	
	jsonОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(jsonОтвет);
	ОтветДанные = ПрочитатьJSON(Чтение);
	
	Возврат Новый Структура("КодСостояния,Данные,Команда",ОтветHTTP.КодСостояния,ОтветДанные,Команда);
	
КонецФункции

Функция ИзменитьЭлемент_PATCH(Команда,Данные)	Экспорт
	СтрокаJSON = СтрокаJSON(Данные);
	
	СоединениеНТТР = ВендингСоединениеНТТР();
	
	АдресРесурса = "/api/"+Команда;
	//	Создаем запрос данных методом POST
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	//ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Basic YXR0aWNhOmM5MWQzYmU5LTUzZDAtNDNlMy1iOWNjLTM0ODY5OTgwMjg1Mw==");
	//Устанавливает строку, из которого будет прочитано тело POST-запроса.
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	//	Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
	ОтветHTTP = СоединениеНТТР.ВызватьHTTPМетод("PATCH",ЗапросHTTP);
	//ОтветHTTP = СоединениеНТТР.ОтправитьДляОбработки(ЗапросHTTP);
	ОтветJSON = ОтветHTTP.ПолучитьТелоКакСтроку();
	СоединениеНТТР = Неопределено;
	
	jsonОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(jsonОтвет);
	ОтветДанные = ПрочитатьJSON(Чтение);
	
	Возврат Новый Структура("КодСостояния,Данные,Команда",ОтветHTTP.КодСостояния,ОтветДанные,Команда);
	
КонецФункции


Функция СтрокаJSON(МассивДанных)
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивДанных); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаДляОтвета;
	
КонецФункции


Функция ЗаполнитьТаблицуДокументовДляВыгрузи(ТипДокумента, ПараметрыВыгрузки, Знач ТаблицаДокументов) Экспорт 
	
	Перем НачалоПериода, КонецПериода, ОтборПоСкладам, МассивСкладов, Подразделение;
	
	УстановитьПривилегированныйРежим(Истина);
	ВсеОк = Истина;
	
	ПараметрыВыгрузки.Свойство("НачалоПериода",	НачалоПериода);	
	ПараметрыВыгрузки.Свойство("КонецПериода",	КонецПериода);		
	ПараметрыВыгрузки.Свойство("Подразделение", Подразделение);
	ПараметрыВыгрузки.Свойство("МассивСкладов", МассивСкладов);
	
	ТекстСообщения = "";
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ОтборПоСкладам", Ложь);
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	DOCDATE1         = Число(Формат(ДатаДокументаНач-60*60*24,"ДФ=yyyyMMdd000000"));
	DOCDATE2         = Число(Формат(ДатаДокументаКон,"ДФ=yyyyMMdd235959"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",	ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонецПериода", 	ДатаДокументаКон);
	Запрос.УстановитьПараметр("мСкладКомпании", МассивСкладов);		
	
	
	Если ТипДокумента = "Инвентаризация" Тогда 		
		
		ЗаполнитьТаблицуИнвентаризаций(Запрос, ТаблицаДокументов);	
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 		
		
		ЗаполнитьТаблицуПоступлений(Запрос, ТаблицаДокументов);		
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровПриход" Тогда 				
		
		ЗаполнитьТаблицуПеремещенийПриход(Запрос, ТаблицаДокументов);		
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровРасход" Тогда 				
		
		ЗаполнитьТаблицуПеремещенийРасход(Запрос, ТаблицаДокументов);		
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документа ""'") + ТипДокумента + """";
		
	КонецЕсли;	
	
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	РезультатОперации.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Найдено %1 документ(ов)'; uk = 'Знайдено %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	РезультатОперации.Вставить("ЕстьОшибки", Не ВсеОк);	
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ЗагрузитьТаблицуДокументов(ТипДокумента = "", ПараметрыЗагрузки, Знач ТаблицаДокументов = Неопределено, 
	Знач ТаблицаСнятыхЗетОтчетов = Неопределено, Знач ТаблицаТКС = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);			
	
	Если ТипДокумента = "ЗакрытиеСмены" Тогда 
		
		Возврат ЗагрузитьТаблицуДокументовЗакрытиеСмены(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
		
	Иначе 
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'"));
		Возврат Неопределено;
		
	КонецЕсли;
	
	
КонецФункции

Функция СформироватьОтчет(ПараметрыОтчета) Экспорт 
	
	ВидОтчета = "";
	ПараметрыОтчета.Свойство("ВидОтчета", ВидОтчета);
	
	Если ВидОтчета = "Планограмма" Тогда 
		
		Возврат СформироватьОтчет_Планограмма(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "Переоценка" Тогда 
		
		Возврат ВыполнитьПереоценкуОстатков(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "Продажи" Тогда 
		
		Возврат СформироватьОтчет_Продажи(ПараметрыОтчета);
		
	ИначеЕсли ВидОтчета = "Остатки" Тогда 
		
		Возврат СформироватьОтчет_Остатки(ПараметрыОтчета);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не известный вид отчета ""'; uk = 'Невідомий вид звіту ""'") + ВидОтчета + """";		
		
	КонецЕсли;
	
КонецФункции


Функция ВыполнитьВыгрузкуДокументов(ТипДокумента, ПараметрыВыгрузки, Знач ТаблицаДокументов) Экспорт 
	
	ДокументыНаВыгрузку = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов = ДокументыНаВыгрузку.Количество();	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Если КоличествоДокументов = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Нет отмеченных документов для выгрузки'; uk = 'Немає відмічених документів для вивантаження'");
	КонецЕсли;
	
	тзВыгрузки = ТаблицаДокументов.Скопировать(ДокументыНаВыгрузку);
	
	мДокументы = тзВыгрузки.ВыгрузитьКолонку("Документ");
	
	ДлительныеОперации.СообщитьПрогресс(0, "Подключаемся к внешнему источнику");	
	
	
	Если ТипДокумента = "Инвентаризация" Тогда 
		
		ВыгрузитьДокументыИнвентаризации(мДокументы);
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		ВыгрузитьДокументыПоступлений(мДокументы);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровПриход" Тогда 
		
		ВыгрузитьДокументыПеремещенияПриход(мДокументы);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровРасход" Тогда 
		
		ВыгрузитьДокументыПеремещенияРасход(мДокументы);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'");
		
	КонецЕсли;
	
	РезультатОперации = Новый Структура;	
	РезультатОперации.Вставить("СообщенияПользователю", ПолучитьСообщенияПользователю(Истина));
	
	Возврат РезультатОперации;	
	
КонецФункции

Функция ВыполнитьЗагрузкуДокументов(ТипДокумента,СтатусДокумента, ПараметрыЗагрузки = Неопределено,  	
	Знач ТаблицаДокументов = Неопределено, Знач ТаблицаСнятыхЗетОтчетов = Неопределено, Знач ТаблицаТКС = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеОк = Истина;                        
	СообщениеЗавершения = "";
	
	Если ТипДокумента = "ЗакрытиеСмены" Тогда 
		
		ЗагрузитьДокументЗакрытиеСмены(ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, СообщениеЗавершения, ВсеОк, ПараметрыЗагрузки);
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не известный тип документа ""'; uk = 'Невідомий тип документу ""'") + ТипДокумента + """" + Символы.ПС + НСтр("ru = 'Обратитесь к разработчику...'; uk = 'Звернітся до розробника...'"));
		ВсеОк = Ложь;
		
	КонецЕсли;	
	
	РезультатОперации = Новый Структура;	
	Если Не ПустаяСтрока(СообщениеЗавершения) Тогда 
		РезультатОперации.Вставить("СообщениеЗавершения", СообщениеЗавершения);
	КонецЕсли;	
	РезультатОперации.Вставить("ЕстьОшибки", Не ВсеОк);		
	РезультатОперации.Вставить("СообщенияПользователю", ПолучитьСообщенияПользователю(Истина));
	
	Возврат РезультатОперации;
	
КонецФункции


Процедура ЗаполнитьТаблицуПоступлений(Знач Запрос, ТаблицаДокументов)
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Документ,
	|	ПоступлениеТоваров.Номер КАК Номер,
	|	ПоступлениеТоваров.Проведен КАК Проведен,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваров.СкладКомпании) КАК СкладКомпанииПредставление,
	|	ЕСТЬNULL(ДокументыВендинг.Обработан, ЛОЖЬ) КАК Обработан
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВендинг КАК ДокументыВендинг
	|		ПО ПоступлениеТоваров.Ссылка = ДокументыВендинг.Объект
	|ГДЕ
	|	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеТоваров.СкладКомпании В(&мСкладКомпании)
	|	И ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ";
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если Выборка.Обработан Тогда
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			Иначе
				Строка.Обработан = Ложь;
				Строка.Пометка = Выборка.Проведен;
				Строка.Проведен = Выборка.Проведен;
				тПредставление = "(Не выгружен "+?(Не Выборка.Проведен,"Не проведен","")+") "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПеремещенийПриход(Знач Запрос, ТаблицаДокументов)
	
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Документ,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадка)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпании)
	|	КОНЕЦ КАК СкладКомпанииПредставление,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпанииПолучатель)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадкаПолучатель)
	|	КОНЕЦ КАК СкладКомпанииПолучательПредставление,
	|	ЕСТЬNULL(ДокументыВендинг.Обработан, ЛОЖЬ) КАК Обработан
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВендинг КАК ДокументыВендинг
	|		ПО ПеремещениеТоваров.Ссылка = ДокументыВендинг.Объект
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ПеремещениеТоваров.ПометкаУдаления
	|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			И ПеремещениеТоваров.СкладКомпанииПолучатель В (&мСкладКомпании)";		
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();		
		Пока Выборка.Следующий() Цикл			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если Выборка.Обработан Тогда
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " => склад получатель "+Выборка.СкладКомпанииПолучательПредставление;
			Иначе
				Строка.Обработан = Ложь;
				Строка.Пометка = Выборка.Проведен;
				Строка.Проведен = Выборка.Проведен;
				тПредставление = "(Не выгружен "+?(Не Выборка.Проведен,"Не проведен","")+") "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " => склад получатель "+Выборка.СкладКомпанииПолучательПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПеремещенийРасход(Знач Запрос, ТаблицаДокументов)
	
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Документ,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадка)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпании)
	|	КОНЕЦ КАК СкладКомпанииПредставление,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.СкладКомпанииПолучатель)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадкаПолучатель)
	|	КОНЕЦ КАК СкладКомпанииПолучательПредставление,
	|	ЕСТЬNULL(ДокументыВендинг.Обработан, ЛОЖЬ) КАК Обработан
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВендинг КАК ДокументыВендинг
	|		ПО ПеремещениеТоваров.Ссылка = ДокументыВендинг.Объект
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ПеремещениеТоваров.ПометкаУдаления
	|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			И ПеремещениеТоваров.СкладКомпании В (&мСкладКомпании)";		
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();		
		Пока Выборка.Следующий() Цикл			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			Если Выборка.Обработан Тогда
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " => склад получатель "+Выборка.СкладКомпанииПолучательПредставление;
			Иначе
				Строка.Обработан = Ложь;
				Строка.Пометка = Выборка.Проведен;
				Строка.Проведен = Выборка.Проведен;
				тПредставление = "(Не выгружен "+?(Не Выборка.Проведен,"Не проведен","")+") "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление+ " => склад получатель "+Выборка.СкладКомпанииПолучательПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуИнвентаризаций(Знач Запрос, ТаблицаДокументов)
	
	ТекстЗапроса =	"ВЫБРАТЬ
	|	Инвентаризация.Ссылка КАК Документ,
	|	Инвентаризация.Номер КАК Номер,
	|	Инвентаризация.Проведен КАК Проведен,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Инвентаризация.СкладКомпании) КАК СкладКомпанииПредставление,
	|	ЕСТЬNULL(ДокументыВендинг.Обработан, ЛОЖЬ) КАК Обработан
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВендинг КАК ДокументыВендинг
	|		ПО Инвентаризация.Ссылка = ДокументыВендинг.Объект
	|ГДЕ
	|	Инвентаризация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Инвентаризация.СкладКомпании В(&мСкладКомпании)
	|	И Инвентаризация.ПометкаУдаления = ЛОЖЬ";
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Идет получение данных'; uk = 'Іде отримання даних'"));
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		
		
		Ит = 0;
		КоличествоВыборки = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл			
			Ит = Ит + 1;
			
			ДлительныеОперации.СообщитьПрогресс(Цел((Ит/КоличествоВыборки * 100)), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 из %2'; uk = 'Оброблено %1 з %2'"), 
			Ит, 
			КоличествоВыборки));
			
			
			Строка = ТаблицаДокументов.Добавить();
			Строка.Документ = Выборка.Документ;
			
			Если Выборка.Обработан Тогда
				Строка.Обработан = Истина;
				тПредставление = "(Выгружен) "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			Иначе
				Строка.Обработан = Ложь;
				Строка.Пометка = Выборка.Проведен;
				Строка.Проведен = Выборка.Проведен;
				тПредставление = "(Не выгружен "+?(Не Выборка.Проведен,"Не проведен","")+") "+Строка(Выборка.Документ) + " => склад " + Выборка.СкладКомпанииПредставление;
			КонецЕсли;
			Строка.ПредставлениеДокумента = тПредставление ;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Функция ЗагрузитьТаблицуДокументовЗакрытиеСмены(ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов)
	
	Перем НачалоПериода,КонецПериода,ОтборПоСкладам,ВидСравнения,ЗначениеОтбора;
	
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подключаемся к внешнему источнику'; uk = 'Підключаємося до зовнішнього джерела'"));
	
	ТаблицаДокументов.Очистить();
	ТаблицаСнятыхЗетОтчетов.Очистить();
	ПараметрыЗагрузки.Свойство("НачалоПериода"  ,НачалоПериода);	
	ПараметрыЗагрузки.Свойство("КонецПериода"   ,КонецПериода);			
	
	ОтборПоСкладам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "ОтборПоСкладам", Ложь);	
	ТаблицаСкладов = ПолучитьТаблицуСкладовДляОтбораИзПараметров(ПараметрыЗагрузки.МассивСкладов);	
	
	ДатаДокументаНач = ?(ЗначениеЗаполнено(НачалоПериода),НачалоДня(НачалоПериода),НачалоДня(ТекущаяДата()));
	ДатаДокументаКон = ?(ЗначениеЗаполнено(КонецПериода),КонецДня(КонецПериода),КонецДня(ТекущаяДата()));
	
	ПериодДень = ДатаДокументаНач = НачалоДня(ДатаДокументаКон);
	ЗапросПериод = Формат(ДатаДокументаНач,"ДФ='yyyy-MM-dd'")+?(ПериодДень,"","?to="+Формат(ДатаДокументаКон,"ДФ='yyyy-MM-dd'"));
	ЗапросОтборСклад = ?(ОтборПоСкладам,?(ПериодДень,"?","&")+"automatId=" + Формат(ТаблицаСкладов[0].id,"ЧГ=0"),"");
	Ответ = ПолучитьДанные_GET("dayreport/"+ЗапросПериод+ЗапросОтборСклад);
	
	Если Ответ.КодСостояния > 399 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка %1. message: %2  %3 [%4]'; uk = 'Помилка %1. message: %2  %3 [%4]'"),
		Ответ.КодСостояния,
		Ответ.Данные.message,
		"GET",
		Ответ.Команда);
		
		Возврат Новый Структура("СообщениеЗавершения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов", ТекстСообщения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
	КонецЕсли;
	
	Для Каждого строка Из Ответ.Данные Цикл 
		нСклад = ТаблицаСкладов.Найти(строка.automatId,"id");
		Если нСклад = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаZотчета = ПреобразоватьДатуИзСтроки(строка.endDateTime);
		
		нЗетка = ТаблицаСнятыхЗетОтчетов.Добавить();
		нЗетка.НомерСменыККМ	= строка.id;
		нЗетка.НомерZотчета		= строка.id;
		нЗетка.ДатаZотчета		= ДатаZотчета;
		нЗетка.ЗаводскойНомер	= строка.fiscalTerminal;
		нЗетка.АвтоматИД		= строка.automatId;
		нЗетка.СуммаВозврат		= строка.turnoverByReturns;
		нЗетка.СуммаПродаж		= строка.turnoverBySales;
		нЗетка.КоличествоЧеков	= строка.sellReceiptsCount;
		нЗетка.ОборотТерминал	= строка.cardSales;
		нЗетка.ОборотНаличные	= строка.cashSales;
		
		нЗетка.Дата				= ДатаZотчета;
		нЗетка.СкладКомпании	= нСклад.СкладКомпании;
		
	КонецЦикла;
	
	
	Если ТаблицаСнятыхЗетОтчетов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Таблица Z-отчетов пустая'; uk = 'Таблиця Z-звітів порожня'");
		ЗаписьЖурналаРегистрации("Загрузка.ЗКС",УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		
		Возврат Новый Структура("СообщениеЗавершения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов", ТекстСообщения, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
	КонецЕсли;
	
	тзСкладыЗетОтчетов = ТаблицаСнятыхЗетОтчетов.Скопировать(,"Дата,СкладКомпании");
	тзСкладыЗетОтчетов.Свернуть("Дата,СкладКомпании");
	тзСкладыЗетОтчетов.Сортировать("Дата Возр, СкладКомпании Убв");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеСмены.Ссылка КАК Документ,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Дата, ДЕНЬ) КАК ДатаДокумента,
	|	ЗакрытиеСмены.СкладКомпании КАК СкладКомпании,
	|	ЗакрытиеСмены.Проведен КАК Проведен
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеСмены.СкладКомпании В(&СкладКомпании)
	|	И ЗакрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ЗакрытиеСмены.РегламентированныйУчет"; // Временное решение - для того, чтобы не затирались созданые вручную Закрытия смены Vov41k 30.03.2022
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаДокументаНач);
	Запрос.УстановитьПараметр("КонецПериода", ДатаДокументаКон);
	Запрос.УстановитьПараметр("СкладКомпании", тзСкладыЗетОтчетов.ВыгрузитьКолонку("СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзЗагруженныеДокументы = РезультатЗапроса.Выгрузить();
	тзЗагруженныеДокументы.Индексы.Добавить("ДатаДокумента,СкладКомпании");
	
	Для Каждого СнятаяЗетка Из тзСкладыЗетОтчетов Цикл 
		
		нДокументЗагрузки = ТаблицаДокументов.Добавить();
		нДокументЗагрузки.Склад = СнятаяЗетка.СкладКомпании;
		нДокументЗагрузки.Дата  = СнятаяЗетка.Дата;
		мДокументЗакрытия =	тзЗагруженныеДокументы.НайтиСтроки(Новый Структура("ДатаДокумента,СкладКомпании",СнятаяЗетка.Дата, СнятаяЗетка.СкладКомпании));
		
		Если мДокументЗакрытия.Количество() = 0 Тогда
			ПредставлениеДокумента = "(Новый) " +Формат(СнятаяЗетка.Дата,"ДФ='<< yyyy-MM-dd >>'") +" "+ Строка(СнятаяЗетка.СкладКомпании);
			нДокументЗагрузки.Пометка = Истина;
			
		Иначе
			сДокумента = мДокументЗакрытия[0];
			нДокументЗагрузки.Документ  = сДокумента.Документ; 
			ПредставлениеДокумента = "(Загружен)";
			Если сДокумента.Проведен Тогда
				ПредставлениеДокумента = ПредставлениеДокумента + " проведен";
			Иначе
				ПредставлениеДокумента = ПредставлениеДокумента + " не проведен" ;
				нДокументЗагрузки.Пометка = Истина;
			КонецЕсли;
			
			ПредставлениеДокумента =  ПредставлениеДокумента + " "+Формат(СнятаяЗетка.Дата,"ДФ='<< yyyy-MM-dd >>'")+" "+ Строка(СнятаяЗетка.СкладКомпании) + " документ: "+Строка(нДокументЗагрузки.Документ);
			
			
		КонецЕсли;	
		нДокументЗагрузки.ПредставлениеДокумента = ПредставлениеДокумента;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	Результат.Вставить("ТаблицаСнятыхЗетОтчетов", ТаблицаСнятыхЗетОтчетов);
	Результат.Вставить("СообщениеЗавершения", 
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Получено %1 документ(ов)'; uk = 'Отримано %1 документ(ів)'"), 
	ТаблицаДокументов.Количество()));
	
	Возврат Результат;
	
КонецФункции


Процедура ВыгрузитьДокументыПоступлений(мДокументы)
	
	Начало = ТекущаяДата();
	
	МассивДанных = Новый Массив;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.Ссылка КАК Документ,
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата КАК ВидАвтомата,
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата КАК ИД_Автомата,
	|	ПоступлениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ПоступлениеТоваровТовары.КоличествоБазовое) КАК Количество,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ПоступлениеТоваровТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	|			И ПоступлениеТоваровТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли = ЦеныСрезПоследних.ТипЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, ) КАК ПланограммаАвтоматаСрезПоследних
	|		ПО ПоступлениеТоваровТовары.Номенклатура = ПланограммаАвтоматаСрезПоследних.Номенклатура
	|			И ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры = ПланограммаАвтоматаСрезПоследних.Характеристика
	|			И ПоступлениеТоваровТовары.Ссылка.СкладКомпании = ПланограммаАвтоматаСрезПоследних.Склад
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка В(&мДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровТовары.Номенклатура,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0),
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании,
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата,
	|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата,
	|	ПоступлениеТоваровТовары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	Номенклатура,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.Сортировка 
	|ИТОГИ ПО
	|	Документ,
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = ВыборкаДок.Количество();
	
	Пока ВыборкаДок.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		order = ТекущаяДата() - Дата(2023,01,01);
		
		Ответ = ПолучитьДанные_GET("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/");
		
		Если Ответ.КодСостояния > 399 Тогда
			Ошибка404(Ответ,"GET");
			Продолжить;
		КонецЕсли;
		
		ТаблицаОстатков.Очистить();                                                		
		
		Для каждого строка Из Ответ.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОстатков.Добавить(),строка);	
		КонецЦикла;
		
		Времяостатки = ТекущаяДата();
		
		тзРотацияВитрины = ПолучитьТаблицаЗначений();
		тзРотацияВитрины.Колонки.Добавить("Уже");
		
		ВыборкаТовар = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			Порядок = 0;
			Артикул = Число(ВыборкаТовар.Артикул);
			Выборка = ВыборкаТовар.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Порядок = 1 + Порядок;	
				
				Если Выборка.Ячейка = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не назначена ячейка для (%1) %2 %3'; uk = 'Не призначено комірку для (%1) %2 %3'"),
					Выборка.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				Если Выборка.Цена = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Нулевая цена у (%1) %2 %3'; uk = 'Нульова ціна у (%1) %2 %3'"),
					Выборка.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				
				
				Если НЕ Отказ Тогда
					
					//	Проверка на новое МРЦ
					мОстатки = ТаблицаОстатков.НайтиСтроки(Новый Структура("article,maxRetailPrice",Артикул,Выборка.Характеристика.ЗначениеМРЦ * 100));
					
					ЭтоНовоеМРЦ = мОстатки.Количество() = 0;
					
					Если ЭтоНовоеМРЦ Тогда
						тзОстаткиМРЦ = ТаблицаОстатков.Скопировать(Новый Структура("article",Артикул));
						тзОстаткиМРЦ.Сортировать("order Убыв");
						
						нСтрока = тзРотацияВитрины.Добавить();
						ЗаполнитьЗначенияСвойств(нСтрока,Выборка);
						Если тзОстаткиМРЦ.Количество() > 0 Тогда
							ЗаполнитьЗначенияСвойств(нСтрока,тзОстаткиМРЦ[0],,"Артикул,Номенклатура,Характеристика,Количество,Цена,Ячейка");
						КонецЕсли;
						нСтрока.СортировкаМРЦ = Выборка.Характеристика.Сортировка;
					КонецЕсли;
					
					//стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
					//Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
					//
					//Количество = Выборка.Количество + Остаток;
					//
					//СтруктураСтроки = новый Структура;
					//СтруктураСтроки.Вставить("number",Выборка.Ячейка);
					//СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
					//СтруктураСтроки.Вставить("article",Артикул);
					//СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
					//СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
					//СтруктураСтроки.Вставить("remainingStock",Количество);
					//СтруктураСтроки.Вставить("order",order + Порядок);
					//СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
					//МассивДанных.Добавить(СтруктураСтроки);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			ВыборкаТовар.Сбросить();
			Пока ВыборкаТовар.Следующий() Цикл
				Порядок = 0;
				Артикул = Число(ВыборкаТовар.Артикул);
				Выборка = ВыборкаТовар.Выбрать();
				Пока Выборка.Следующий() Цикл
					Порядок = 1 + Порядок;	
					Если тзРотацияВитрины.Количество() > 0 Тогда
						//мНоменклатураДляЗаменыВитрины = ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзРотацияВитрины.ВыгрузитьКолонку("Номенклатура"));
						//
						//Для Каждого стрНоменклатура Из мНоменклатураДляЗаменыВитрины Цикл
						//стрРотацияВитрины = тзРотацияВитрины.Найти(стрНоменклатура,"Номенклатура");
						тзРотация = тзРотацияВитрины.Скопировать(Новый Структура("Номенклатура",Выборка.Номенклатура));
						Если тзРотация.Количество() > 0 Тогда
							тзРотация.Сортировать("СортировкаМРЦ Убыв");
							стрРотация = тзРотация[0];
							Если стрРотация.Характеристика = Выборка.Характеристика Тогда
								СтруктураСтроки = Новый Структура;
								СтруктураСтроки.Вставить("number",стрРотация.Ячейка);
								СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
								СтруктураСтроки.Вставить("article",Артикул);
								СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.Характеристика.ЗначениеМРЦ * 100);
								СтруктураСтроки.Вставить("price",стрРотация.Цена * 100);
								СтруктураСтроки.Вставить("remainingStock",стрРотация.Количество - 1);
								СтруктураСтроки.Вставить("order",order + Порядок);
								СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
								МассивДанных.Добавить(СтруктураСтроки);
								
								ВитринаВендинг(Выборка, стрРотация.maxRetailPrice, Истина);
								//Для Каждого стрРотация Из тзРотация Цикл
								//	
								////Если тзРотация.Индекс(стрРотация) = 0 Тогда
								//СтруктураСтроки = Новый Структура;
								//СтруктураСтроки.Вставить("number",стрРотация.Ячейка);
								//СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
								//СтруктураСтроки.Вставить("article",Артикул);
								//СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.Характеристика.ЗначениеМРЦ * 100);
								//СтруктураСтроки.Вставить("price",стрРотация.Цена * 100);
								//СтруктураСтроки.Вставить("remainingStock",?(тзРотация.Индекс(стрРотация) = 0,стрРотация.Количество - 1,стрРотация.Количество));
								//СтруктураСтроки.Вставить("order",order + Порядок);
								//СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
								//МассивДанных.Добавить(СтруктураСтроки);
								
								Если стрРотация.number > 0 Тогда
									СтруктураСтроки = Новый Структура;
									СтруктураСтроки.Вставить("number",стрРотация.number);
									СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
									СтруктураСтроки.Вставить("article",Артикул);
									СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.maxRetailPrice);
									СтруктураСтроки.Вставить("price",стрРотация.price);
									//СтруктураСтроки.Вставить("remainingStock",стрРотация.remainingStock + Выборка.Количество + 1);
									СтруктураСтроки.Вставить("remainingStock",стрРотация.remainingStock + 1);
									СтруктураСтроки.Вставить("order",стрРотация.order);
									СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
									МассивДанных.Добавить(СтруктураСтроки);
									тзРотацияВитрины.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Выборка.Номенклатура,Выборка.Характеристика))[0].Уже = Истина;
									
									ВитринаВендинг(Выборка, стрРотация.maxRetailPrice, Ложь);
								КонецЕсли;
							Иначе
								тзРотация_ = тзРотацияВитрины.Скопировать(Новый Структура("Номенклатура,maxRetailPrice",Выборка.Номенклатура,Выборка.Характеристика.ЗначениеМРЦ * 100));
								Если тзРотация_.Количество() > 0 Тогда
									тзРотация_.Сортировать("СортировкаМРЦ Убыв");
									стрРотация_ = тзРотация_[0];
									Уже = стрРотация_.Уже = Истина;
								Иначе
									Уже = Ложь;
								КонецЕсли;
								Если Уже Тогда
								Иначе
									стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
									Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
									
									Количество = Выборка.Количество + Остаток;
									
									СтруктураСтроки = Новый Структура;
									СтруктураСтроки.Вставить("number",Выборка.Ячейка);
									СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
									СтруктураСтроки.Вставить("article",Артикул);
									СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
									СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
									СтруктураСтроки.Вставить("remainingStock",Количество);
									СтруктураСтроки.Вставить("order",order + Порядок);
									СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
									МассивДанных.Добавить(СтруктураСтроки);
								КонецЕсли;
							КонецЕсли;
							//КонецЦикла;
						Иначе
							стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
							Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
							
							Количество = Выборка.Количество + Остаток;
							
							СтруктураСтроки = Новый Структура;
							СтруктураСтроки.Вставить("number",Выборка.Ячейка);
							СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
							СтруктураСтроки.Вставить("article",Артикул);
							СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
							СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
							СтруктураСтроки.Вставить("remainingStock",Количество);
							СтруктураСтроки.Вставить("order",order + Порядок);
							СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
							МассивДанных.Добавить(СтруктураСтроки);
						КонецЕсли;
						
						//КонецЦикла;
					Иначе
						стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
						Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
						
						Количество = Выборка.Количество + Остаток;
						
						СтруктураСтроки = Новый Структура;
						СтруктураСтроки.Вставить("number",Выборка.Ячейка);
						СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
						СтруктураСтроки.Вставить("article",Артикул);
						СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
						СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
						СтруктураСтроки.Вставить("remainingStock",Количество);
						СтруктураСтроки.Вставить("order",order + Порядок);
						СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
						МассивДанных.Добавить(СтруктураСтроки);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Отказ Тогда     
			Ответ = ИзменитьЭлемент_PATCH("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/",МассивДанных);
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"PATCH");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки данных'; uk = 'Помилка вивантаження даних'"));
				Продолжить;
			КонецЕсли;
			
			ДокументыВендинг(ВыборкаДок.Документ);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документів: '") + Строка(ВыборкаДок.Документ), ВыборкаДок.Документ);			
		КонецЕсли;
	КонецЦикла;
	
	
	Конец = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("8 по 8 "+Начало+" - "+Конец+"     "+(Конец-Начало)+"         : "+Времяостатки);
	
КонецПроцедуры

Процедура ВыгрузитьДокументыПеремещенияПриход(мДокументы)
	
	Начало = ТекущаяДата();
	
	МассивДанных = Новый Массив;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|	КОНЕЦ КАК СкладКомпании,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата
	|	КОНЕЦ КАК ВидАвтомата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ИД_Автомата
	|	КОНЕЦ КАК ИД_Автомата,
	|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|				ТОГДА -ПеремещениеТоваровТовары.КоличествоБазовое
	|			КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое
	|		КОНЕЦ) КАК Количество,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТипЦенРозничнойТорговли
	|			КОНЕЦ = ЦеныСрезПоследних.ТипЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, ) КАК ПланограммаАвтоматаСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ПланограммаАвтоматаСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ПланограммаАвтоматаСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|			КОНЕЦ = ПланограммаАвтоматаСрезПоследних.Склад)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&мДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0),
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ИД_Автомата
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры.Сортировка
	|ИТОГИ ПО
	|	Документ,
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = ВыборкаДок.Количество();
	
	Пока ВыборкаДок.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		order = ТекущаяДата() - Дата(2023,01,01);
		
		Ответ = ПолучитьДанные_GET("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/");
		
		Если Ответ.КодСостояния > 399 Тогда
			Ошибка404(Ответ,"GET");
			Продолжить;
		КонецЕсли;
		
		ТаблицаОстатков.Очистить();                                                		
		
		Для каждого строка Из Ответ.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОстатков.Добавить(),строка);	
		КонецЦикла;
		
		Времяостатки = ТекущаяДата();
		
		тзРотацияВитрины = ПолучитьТаблицаЗначений();
		тзРотацияВитрины.Колонки.Добавить("Уже");
		
		ВыборкаТовар = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			Порядок = 0;
			Артикул = Число(ВыборкаТовар.Артикул);
			Выборка = ВыборкаТовар.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Порядок = 1 + Порядок;	
				
				
				
				
				Если Выборка.Ячейка = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не назначена ячейка для (%1) %2 %3'; uk = 'Не призначено комірку для (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				Если Выборка.Цена = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Нулевая цена у (%1) %2 %3'; uk = 'Нульова ціна у (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				
				
				Если НЕ Отказ Тогда     
					
					//	Проверка на новое МРЦ
					мОстатки = ТаблицаОстатков.НайтиСтроки(Новый Структура("article,maxRetailPrice",Артикул,Выборка.Характеристика.ЗначениеМРЦ * 100));
					
					ЭтоНовоеМРЦ = мОстатки.Количество() = 0;
					
					Если ЭтоНовоеМРЦ Тогда
						тзОстаткиМРЦ = ТаблицаОстатков.Скопировать(Новый Структура("article",Артикул));
						тзОстаткиМРЦ.Сортировать("order Убыв");
						
						нСтрока = тзРотацияВитрины.Добавить();
						ЗаполнитьЗначенияСвойств(нСтрока,Выборка);
						Если тзОстаткиМРЦ.Количество() > 0 Тогда
							ЗаполнитьЗначенияСвойств(нСтрока,тзОстаткиМРЦ[0],,"Артикул,Номенклатура,Характеристика,Количество,Цена,Ячейка");
						КонецЕсли;
						нСтрока.СортировкаМРЦ = Выборка.Характеристика.Сортировка;
					КонецЕсли;
					
					
					//стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
					//Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
					//
					//Количество = Выборка.Количество + Остаток;
					//
					//СтруктураСтроки = Новый Структура;
					//СтруктураСтроки.Вставить("number",Выборка.Ячейка);
					//СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
					//СтруктураСтроки.Вставить("article",Число(Выборка.Номенклатура.Артикул));
					//СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
					//СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
					//СтруктураСтроки.Вставить("remainingStock",Количество);
					//СтруктураСтроки.Вставить("order",order + Порядок);
					//СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
					//МассивДанных.Добавить(СтруктураСтроки);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			ВыборкаТовар.Сбросить();
			Пока ВыборкаТовар.Следующий() Цикл
				Порядок = 0;
				Артикул = Число(ВыборкаТовар.Артикул);
				Выборка = ВыборкаТовар.Выбрать();
				Пока Выборка.Следующий() Цикл
					Порядок = 1 + Порядок;	
					Если тзРотацияВитрины.Количество() > 0 Тогда
						//мНоменклатураДляЗаменыВитрины = ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзРотацияВитрины.ВыгрузитьКолонку("Номенклатура"));
						//
						//Для Каждого стрНоменклатура Из мНоменклатураДляЗаменыВитрины Цикл
						//стрРотацияВитрины = тзРотацияВитрины.Найти(стрНоменклатура,"Номенклатура");
						тзРотация = тзРотацияВитрины.Скопировать(Новый Структура("Номенклатура",Выборка.Номенклатура));
						Если тзРотация.Количество() > 0 Тогда
							тзРотация.Сортировать("СортировкаМРЦ Убыв");
							стрРотация = тзРотация[0];
							Если стрРотация.Характеристика = Выборка.Характеристика Тогда
								СтруктураСтроки = Новый Структура;
								СтруктураСтроки.Вставить("number",стрРотация.Ячейка);
								СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
								СтруктураСтроки.Вставить("article",Артикул);
								СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.Характеристика.ЗначениеМРЦ * 100);
								СтруктураСтроки.Вставить("price",стрРотация.Цена * 100);
								СтруктураСтроки.Вставить("remainingStock",стрРотация.Количество - 1);
								СтруктураСтроки.Вставить("order",order + Порядок);
								СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
								МассивДанных.Добавить(СтруктураСтроки);
								
								ВитринаВендинг(Выборка, стрРотация.maxRetailPrice, Истина);
								//Для Каждого стрРотация Из тзРотация Цикл
								//	
								////Если тзРотация.Индекс(стрРотация) = 0 Тогда
								//СтруктураСтроки = Новый Структура;
								//СтруктураСтроки.Вставить("number",стрРотация.Ячейка);
								//СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
								//СтруктураСтроки.Вставить("article",Артикул);
								//СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.Характеристика.ЗначениеМРЦ * 100);
								//СтруктураСтроки.Вставить("price",стрРотация.Цена * 100);
								//СтруктураСтроки.Вставить("remainingStock",?(тзРотация.Индекс(стрРотация) = 0,стрРотация.Количество - 1,стрРотация.Количество));
								//СтруктураСтроки.Вставить("order",order + Порядок);
								//СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
								//МассивДанных.Добавить(СтруктураСтроки);
								
								Если стрРотация.number > 0 Тогда
									СтруктураСтроки = Новый Структура;
									СтруктураСтроки.Вставить("number",стрРотация.number);
									СтруктураСтроки.Вставить("automatId",ВыборкаДок.ИД_Автомата);
									СтруктураСтроки.Вставить("article",Артикул);
									СтруктураСтроки.Вставить("maxRetailPrice",стрРотация.maxRetailPrice);
									СтруктураСтроки.Вставить("price",стрРотация.price);
									//СтруктураСтроки.Вставить("remainingStock",стрРотация.remainingStock + Выборка.Количество + 1);
									СтруктураСтроки.Вставить("remainingStock",стрРотация.remainingStock + 1);
									СтруктураСтроки.Вставить("order",стрРотация.order);
									СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
									МассивДанных.Добавить(СтруктураСтроки);
									тзРотацияВитрины.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Выборка.Номенклатура,Выборка.Характеристика))[0].Уже = Истина;
									
									ВитринаВендинг(Выборка, стрРотация.maxRetailPrice, Ложь);
								КонецЕсли;
							Иначе
								тзРотация_ = тзРотацияВитрины.Скопировать(Новый Структура("Номенклатура,maxRetailPrice",Выборка.Номенклатура,Выборка.Характеристика.ЗначениеМРЦ * 100));
								Если тзРотация_.Количество() > 0 Тогда
									тзРотация_.Сортировать("СортировкаМРЦ Убыв");
									стрРотация_ = тзРотация_[0];
									Уже = стрРотация_.Уже = Истина;
								Иначе
									Уже = Ложь;
								КонецЕсли;
								Если Уже Тогда
								Иначе
									стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
									Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
									
									Количество = Выборка.Количество + Остаток;
									
									СтруктураСтроки = Новый Структура;
									СтруктураСтроки.Вставить("number",Выборка.Ячейка);
									СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
									СтруктураСтроки.Вставить("article",Артикул);
									СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
									СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
									СтруктураСтроки.Вставить("remainingStock",Количество);
									СтруктураСтроки.Вставить("order",order + Порядок);
									СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
									МассивДанных.Добавить(СтруктураСтроки);
								КонецЕсли;
							КонецЕсли;
							//КонецЦикла;
						Иначе
							стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
							Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
							
							Количество = Выборка.Количество + Остаток;
							
							СтруктураСтроки = Новый Структура;
							СтруктураСтроки.Вставить("number",Выборка.Ячейка);
							СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
							СтруктураСтроки.Вставить("article",Артикул);
							СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
							СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
							СтруктураСтроки.Вставить("remainingStock",Количество);
							СтруктураСтроки.Вставить("order",order + Порядок);
							СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
							МассивДанных.Добавить(СтруктураСтроки);
						КонецЕсли;
						
						//КонецЦикла;
					Иначе
						стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
						Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
						
						Количество = Выборка.Количество + Остаток;
						
						СтруктураСтроки = Новый Структура;
						СтруктураСтроки.Вставить("number",Выборка.Ячейка);
						СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
						СтруктураСтроки.Вставить("article",Артикул);
						СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
						СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
						СтруктураСтроки.Вставить("remainingStock",Количество);
						СтруктураСтроки.Вставить("order",order + Порядок);
						СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
						МассивДанных.Добавить(СтруктураСтроки);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Отказ Тогда     
			Ответ = ИзменитьЭлемент_PATCH("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/",МассивДанных);
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"PATCH");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки данных'; uk = 'Помилка вивантаження даних'"));
				Продолжить;
			КонецЕсли;
			
			ДокументыВендинг(ВыборкаДок.Документ);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документів: '") + Строка(ВыборкаДок.Документ), ВыборкаДок.Документ);			
		КонецЕсли;
	КонецЦикла;
	
	
	Конец = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("8 по 8 "+Начало+" - "+Конец+"     "+(Конец-Начало)+"         : "+Времяостатки);
	
	
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыПеремещенияРасход(мДокументы)
	
	Начало = ТекущаяДата();
	
	МассивДанных = Новый Массив;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|	КОНЕЦ КАК СкладКомпании,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата
	|	КОНЕЦ КАК ВидАвтомата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ИД_Автомата
	|	КОНЕЦ КАК ИД_Автомата,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|				ТОГДА -ПеремещениеТоваровТовары.КоличествоБазовое
	|			КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|				ТОГДА ПеремещениеТоваровТовары.КоличествоБазовое
	|		КОНЕЦ) КАК Количество,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТипЦенРозничнойТорговли
	|			КОНЕЦ = ЦеныСрезПоследних.ТипЦен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, ) КАК ПланограммаАвтоматаСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ПланограммаАвтоматаСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ПланограммаАвтоматаСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|			КОНЕЦ = ПланограммаАвтоматаСрезПоследних.Склад)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&мДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0),
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ИД_Автомата
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ИД_Автомата
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры.Сортировка
	|ИТОГИ ПО
	|	Документ,
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = ВыборкаДок.Количество();
	
	Пока ВыборкаДок.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		order = ТекущаяДата() - Дата(2023,01,01);
		
		Ответ = ПолучитьДанные_GET("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/");
		
		Если Ответ.КодСостояния > 399 Тогда
			Ошибка404(Ответ,"GET");
			Продолжить;
		КонецЕсли;
		
		ТаблицаОстатков.Очистить();                                                		
		
		Для каждого строка Из Ответ.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОстатков.Добавить(),строка);	
		КонецЦикла;
		
		Времяостатки = ТекущаяДата();
		
		ВыборкаТовар = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			Порядок = 0;
			
			Выборка = ВыборкаТовар.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Порядок = 1 + Порядок;	
				
				
				
				
				Если Выборка.Ячейка = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не назначена ячейка для (%1) %2 %3'; uk = 'Не призначено комірку для (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				Если Выборка.Цена = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Нулевая цена у (%1) %2 %3'; uk = 'Нульова ціна у (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				
				
				Если НЕ Отказ Тогда     
					
					стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
					Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
					
					Количество = Выборка.Количество + Остаток;
					
					СтруктураСтроки = Новый Структура;
					СтруктураСтроки.Вставить("number",Выборка.Ячейка);
					СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
					СтруктураСтроки.Вставить("article",Число(Выборка.Номенклатура.Артикул));
					СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
					СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
					СтруктураСтроки.Вставить("remainingStock",Количество);
					СтруктураСтроки.Вставить("order",order + Порядок);
					СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
					МассивДанных.Добавить(СтруктураСтроки);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если НЕ Отказ Тогда     
			Ответ = ИзменитьЭлемент_PATCH("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/",МассивДанных);
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"PATCH");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки данных'; uk = 'Помилка вивантаження даних'"));
				Продолжить;
			КонецЕсли;
			
			ДокументыВендинг(ВыборкаДок.Документ);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документів: '") + Строка(ВыборкаДок.Документ), ВыборкаДок.Документ);			
		КонецЕсли;
	КонецЦикла;
	
	
	Конец = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("8 по 8 "+Начало+" - "+Конец+"     "+(Конец-Начало)+"         : "+Времяостатки);
	
	
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыИнвентаризации(мДокументы)
	
	Начало = ТекущаяДата();
	
	МассивДанных = Новый Массив;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТовары.Ссылка КАК Документ,
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании.ВидАвтомата КАК ВидАвтомата,
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании.ИД_Автомата КАК ИД_Автомата,
	|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ИнвентаризацияТовары.КоличествоФакт) КАК КоличествоФакт,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка
	|ИЗ
	|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ИнвентаризацияТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	|			И ИнвентаризацияТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли = ЦеныСрезПоследних.ТипЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, ) КАК ПланограммаАвтоматаСрезПоследних
	|		ПО ИнвентаризацияТовары.Номенклатура = ПланограммаАвтоматаСрезПоследних.Номенклатура
	|			И ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ПланограммаАвтоматаСрезПоследних.Характеристика
	|			И ИнвентаризацияТовары.Ссылка.СкладКомпании = ПланограммаАвтоматаСрезПоследних.Склад
	|ГДЕ
	|	ИнвентаризацияТовары.Ссылка В(&мДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияТовары.Номенклатура,
	|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0),
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании,
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании.ВидАвтомата,
	|	ИнвентаризацияТовары.Ссылка.СкладКомпании.ИД_Автомата,
	|	ИнвентаризацияТовары.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	Номенклатура,
	|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры.Сортировка
	|ИТОГИ ПО
	|	Документ,
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("мДокументы", мДокументы);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = ВыборкаДок.Количество();
	
	Пока ВыборкаДок.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		order = ТекущаяДата() - Дата(2023,01,01);
		
		Времяостатки = ТекущаяДата();
		
		ВыборкаТовар = ВыборкаДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			Порядок = 0;	
			
			Выборка = ВыборкаТовар.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Порядок = 1 + Порядок;	
				
				
				
				
				
				Если Выборка.Ячейка = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не назначена ячейка для (%1) %2 %3'; uk = 'Не призначено комірку для (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				Если Выборка.Цена = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Нулевая цена у (%1) %2 %3'; uk = 'Нульова ціна у (%1) %2 %3'"),
					Выборка.Номенклатура.Артикул,
					Выборка.Номенклатура,
					Выборка.Характеристика));
					Отказ = Истина;
				КонецЕсли;
				
				
				Если НЕ Отказ Тогда     
					
					СтруктураСтроки = Новый Структура;
					СтруктураСтроки.Вставить("number",Выборка.Ячейка);
					СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
					СтруктураСтроки.Вставить("article",Число(Выборка.Номенклатура.Артикул));
					СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
					СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
					СтруктураСтроки.Вставить("remainingStock",Выборка.КоличествоФакт);
					СтруктураСтроки.Вставить("order",order + Порядок);
					СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
					МассивДанных.Добавить(СтруктураСтроки);
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если НЕ Отказ Тогда     
			Ответ = ИзменитьЭлемент_PATCH("automat/"+Формат(ВыборкаДок.ИД_Автомата,"ЧГ=0")+"/cell/",МассивДанных);
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"PATCH");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки данных'; uk = 'Помилка вивантаження даних'"));
				Продолжить;
			КонецЕсли;
			
			ДокументыВендинг(ВыборкаДок.Документ);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки документа: '; uk = 'Помилка вивантаження документів: '") + Строка(ВыборкаДок.Документ), ВыборкаДок.Документ);			
		КонецЕсли;
	КонецЦикла;
	
	
	Конец = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("8 по 8 "+Начало+" - "+Конец+"     "+(Конец-Начало)+"         : "+Времяостатки);
	
	
	
	
	
КонецПроцедуры


Процедура ЗагрузитьДокументЗакрытиеСмены(ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, СообщениеЗавершения, ВсеОкЗагрузка = Истина, ПараметрыЗагрузки)
	
	Подразделение 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗагрузки, "Подразделение", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	ДокументыНаЗагрузку  	= ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка",Истина));
	КоличествоДокументов 	= ДокументыНаЗагрузку.Количество();
	СОшибками = 0;
	Параметры = Новый Структура;
	
	Если КоличествоДокументов = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет отмеченых документов для загрузки'; uk = 'Немає відмічених документів для завантаження'"));
		Параметры.Вставить("ОК", ВсеОкЗагрузка);
		Возврат;
	КонецЕсли;
	
	ТерминалПриватБанк = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("000000007");
	ТерминалДигма      = Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("000000008");
	
	ЗагруженныеОбъекты = Новый Структура();
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = Строка(КоличествоДокументов);
	Для Каждого тДокЗагрузки Из ДокументыНаЗагрузку Цикл
		ОбработаноДокументов = ОбработаноДокументов + 1;
		ВсеОк  = Истина;
		Ошибки = "";
		
		Если ЗначениеЗаполнено(тДокЗагрузки.Документ) Тогда
			
			ДокОбъект = тДокЗагрузки.Документ.ПолучитьОбъект();					
			Если ДокОбъект.ПометкаУдаления Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2) помечен на удаление. Документ не загружен.'; uk = '%1 (%2) помічений на видалення. Документ не завантажений.'"),
				Строка(ДокОбъект),
				Строка(тДокЗагрузки.Склад)),
				тДокЗагрузки.Документ);
				Продолжить;
			КонецЕсли;
			
			
			ДокОбъект.Товары.Очистить();
			ДокОбъект.ОплатаПлатежнымиКартами.Очистить();
			//ДокОбъект.СнятыеКассы.Очистить();
			
		Иначе
			ДокОбъект = Документы.ЗакрытиеСмены.СоздатьДокумент();
		КонецЕсли;
		тСклад = тДокЗагрузки.Склад;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 из %2 Обработка документа по складу: %3'; uk = '%1 з %2 Обрабка документа по складу: %3'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов, 
		Строка(тСклад)));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Подразделение КАК Подразделение,
		|	СкладыКомпании.ТипЦенРозничнойТорговли КАК ТипЦенСклада,
		|	СкладыКомпании.Розничный КАК ТипСкладаРозничный,
		|	СкладыКомпании.ТипЦенРозничнойТорговли.ВалютаЦены КАК ВалютаЦеныСклада,
		|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ЕСТЬNULL(ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&НаДату, ТорговаяПлощадка = ВЫРАЗИТЬ(&Склад КАК Справочник.СкладыКомпании).ТорговаяПлощадка) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
		|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
		|ГДЕ
		|	СкладыКомпании.Ссылка = &Склад";
		
		Запрос.УстановитьПараметр("Склад", тСклад);
		Запрос.УстановитьПараметр("НаДату", КонецДня(тДокЗагрузки.Дата));
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			тОрганизация      = ВыборкаДетальныеЗаписи.Организация;
			тПодразделение 	  = ВыборкаДетальныеЗаписи.Подразделение;
			ЭтоРозничныйСклад = ВыборкаДетальныеЗаписи.ТипСкладаРозничный;									
			тТипЦен       	  = ВыборкаДетальныеЗаписи.ТипЦенСклада;
			тВалюта       	  = ВыборкаДетальныеЗаписи.ВалютаЦеныСклада;
			тТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
		Иначе
			тОрганизация      = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
			тПодразделение 	  = ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка");
			ЭтоРозничныйСклад = Ложь;
			тТипЦен 		  = ПредопределенноеЗначение("Справочник.ТипыЦен.ПустаяСсылка");
			тВалюта 		  = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
			тТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(тВалюта) Тогда
			тВалюта = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		КонецЕсли;
		
		ДокОбъект.ХозОперация = Справочники.ХозОперации.ЗакрытиеСмены;
		ДокОбъект.СписыватьОстатки = Истина;
		ДокОбъект.РегламентированныйУчет = Ложь;
		ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Дата =  тДокЗагрузки.Дата;
		ДокОбъект.Организация = тОрганизация;
		ДокОбъект.ПодразделениеКомпании = тПодразделение;
		ДокОбъект.СкладКомпании = тСклад;
		ДокОбъект.ТорговаяПлощадка = тТорговаяПлощадка;
		ДокОбъект.ТипЦен = тТипЦен;
		ДокОбъект.ВалютаДокумента = тВалюта;
		ДокОбъект.КурсДокумента = 1;
		
		ДатаВДокумент =  тДокЗагрузки.Дата;
		
		мСнятыхЗетов =   ТаблицаСнятыхЗетОтчетов.НайтиСтроки(Новый Структура("Дата, СкладКомпании",тДокЗагрузки.Дата, тДокЗагрузки.Склад));
		
		ДокОбъект.СнятыеКассы.Очистить();
		
		Для Каждого СнаятаяЗетка Из мСнятыхЗетов Цикл 					
			
			Если СнаятаяЗетка.ДатаZотчета > ДатаВДокумент Тогда
				ДатаВДокумент =  СнаятаяЗетка.ДатаZотчета;
			КонецЕсли;
			
			Эмулятор = ВРег(СнаятаяЗетка.ЗаводскойНомер) = "ЭМУЛЯТОР";
			
			//Снятый зет
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КассыККМ.Ссылка КАК КассаККМ,
			|	ЭквайринговыеТерминалы.Ссылка КАК Терминал,
			|	КассыККМ.Код КАК КодКассы
			|ИЗ
			|	Справочник.КассыККМ КАК КассыККМ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_СчетаЭкваринга.СрезПоследних(&НаДату, ) КАК ТК_СчетаЭкварингаСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
			|			ПО ТК_СчетаЭкварингаСрезПоследних.Контрагент = ЭквайринговыеТерминалы.Эквайер
			|				И ТК_СчетаЭкварингаСрезПоследних.БанковскийСчет = ЭквайринговыеТерминалы.БанковскийСчет
			|		ПО КассыККМ.Объект = ТК_СчетаЭкварингаСрезПоследних.ТорговаяПлощадка
			|ГДЕ
			|	КассыККМ.ЗаводскойНомер = &ЗаводскойНомер
			|	И КассыККМ.Подразделение = &Подразделение
			|	И КассыККМ.Объект = &Объект
			|	И НЕ КассыККМ.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ЗаводскойНомер", СнаятаяЗетка.ЗаводскойНомер);			
			Запрос.УстановитьПараметр("Подразделение", тПодразделение);
			Запрос.УстановитьПараметр("Объект", тТорговаяПлощадка);
			Запрос.УстановитьПараметр("НаДату", тДокЗагрузки.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				КассаККМ = ПредопределенноеЗначение("Справочник.КассыККМ.ПустаяСсылка");
				Терминал = ТерминалПриватБанк;
				КодКассы = "000000";
			Иначе
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				КассаККМ = Выборка.КассаККМ;
				Терминал = ?(ЗначениеЗаполнено(Выборка.Терминал),Выборка.Терминал,ТерминалПриватБанк);
				КодКассы = СокрЛП(Выборка.КодКассы);
			КонецЕсли;
			
			тчСнятыеКассы = ДокОбъект.СнятыеКассы;			        
			
			НомерКассовойСменыСтарый = КодКассы + "-" + Формат(СнаятаяЗетка.НомерZотчета, "ЧЦ=15; ЧГ=");
			НомерКассовойСменыНовый = НомерКассовойСменыСтарый + "-" + Формат(СнаятаяЗетка.НомерСменыККМ, "ЧЦ=10; ЧГ=");
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ТК_КассоваяСмена.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ТК_КассоваяСмена КАК ТК_КассоваяСмена
			|ГДЕ
			|	(ТК_КассоваяСмена.Номер = &НомерСтарый
			|			ИЛИ ТК_КассоваяСмена.Номер = &НомерНовый)";
			
			Запрос.УстановитьПараметр("НомерСтарый", НомерКассовойСменыСтарый);
			Запрос.УстановитьПараметр("НомерНовый", НомерКассовойСменыНовый);
			
			РезКассоваяСмена = Запрос.Выполнить();			
			Если Не РезКассоваяСмена.Пустой() Тогда 				
				ВыборкаКассоваяСмена = РезКассоваяСмена.Выбрать();
				ВыборкаКассоваяСмена.Следующий();
				
				ДокКассоваяСмена = ВыборкаКассоваяСмена.Ссылка.ПолучитьОбъект();				
			Иначе				
				ДокКассоваяСмена = Документы.ТК_КассоваяСмена.СоздатьДокумент();								
			КонецЕсли;
			
			ДокКассоваяСмена.Номер = НомерКассовойСменыНовый;
			
			ЗаполнитьЗначенияСвойств(ДокКассоваяСмена, ДокОбъект, "Организация, ПодразделениеКомпании, ТорговаяПлощадка");	
			
			ДокКассоваяСмена.Дата = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.КассаККМ = КассаККМ;			
			ДокКассоваяСмена.ДатаZотчета = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.НачалоКассовойСмены = СнаятаяЗетка.Дата;			
			ДокКассоваяСмена.ОкончаниеКассовойСмены = СнаятаяЗетка.Дата;
			ДокКассоваяСмена.НомерZотчета = СнаятаяЗетка.НомерZотчета;			
			ДокКассоваяСмена.КоличествоЧеков = СнаятаяЗетка.КоличествоЧеков;
			ДокКассоваяСмена.НомерСменыККМ = СнаятаяЗетка.НомерСменыККМ;
			
			ДокКассоваяСмена.СуммаДокумента = СнаятаяЗетка.СуммаПродаж/100;
			ДокКассоваяСмена.СуммаВозврат = СнаятаяЗетка.СуммаВозврат/100;
			ДокКассоваяСмена.СуммаСкидки = 0;										
			
			//Товары зет отчета
			
			Ответ = ПолучитьДанные_GET("automat/"+Формат(СнаятаяЗетка.АвтоматИД,"ЧГ=0")+"/shift/"+Формат(СнаятаяЗетка.НомерСменыККМ,"ЧГ=0"));
			
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"GET");
			КонецЕсли;
			
			Если Ответ.Данные = Неопределено Тогда
				Ответ.Данные = Новый Массив;
			КонецЕсли;
			
			
			тзПродажи = ПолучитьТаблицаЗначений();
			
			Для каждого строка Из Ответ.Данные Цикл
				стрПродаж = тзПродажи.Добавить();
				ЗаполнитьЗначенияСвойств(стрПродаж,строка);
				//стрПродаж.itemsCount = строка.remainingStock;
				//стрПродаж.itemPrice = строка.price;
				//стрПродаж.salessum = строка.price * строка.remainingStock;
			КонецЦикла;
			
			//тзПродажи.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			тзПродажи.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			тзПродажи.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
			тзПродажи.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
			тзПродажи.Колонки.Добавить("КлассификаторПродажи",Новый ОписаниеТипов("СправочникСсылка.КлассификаторПродаж"));
			тзПродажи.Колонки.Добавить("Ставка",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(2,0)));
			тзПродажи.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			тзПродажи.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			тзПродажи.Колонки.Добавить("СуммаВсего",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			тзПродажи.Колонки.Добавить("СуммаСкидки",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			тзПродажи.Колонки.Добавить("СуммаАкцизногоНалога",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(32,12)));
			тзПродажи.Колонки.Добавить("ОплатаБезнал",Новый ОписаниеТипов("Булево"));
			//тзПродажи.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,3)));
			//тзПродажи.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
			
			ОбработатьТабличнуюЧасть("Товары",тзПродажи,ЗагруженныеОбъекты,Истина);
			
			ДокКассоваяСмена.СуммаСкидки = тзПродажи.Итог("СуммаСкидки");
			
			Если Эмулятор Тогда
				СуммаПродаж =  0;
				СуммаВозвратов = 0;
				
				мСтрокиПродажи = тзПродажи.НайтиСтроки(Новый Структура("Возврат",Ложь));
				Для Каждого мстПродажи Из мСтрокиПродажи Цикл 
					СуммаПродаж = СуммаПродаж + мстПродажи.СуммаВсего;
				КонецЦикла;
				
				мСтрокиПродажи = тзПродажи.НайтиСтроки(Новый Структура("Возврат",Истина));
				Для Каждого мстПродажи Из мСтрокиПродажи Цикл 
					СуммаВозвратов = СуммаВозвратов + мстПродажи.СуммаВсего;
				КонецЦикла;
				ДокКассоваяСмена.СуммаДокумента  = СуммаПродаж;
				ДокКассоваяСмена.СуммаВозврат	 = СуммаВозвратов;
			КонецЕсли;
			
			
			//Проведем измененный документ "ТК_КассоваяСмена"
			Попытка
				ДокКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВсеОкЗагрузка = Ложь;
				СОшибками = СОшибками + 1;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось проверсти Кассовую смену %1 от %2 по складу %3, кол-во чеков - %4
				|Ошибки: %5'; uk = 'Не вдалося провести Касову зміну %1 від %2 по складу %3, кіль-ть чеків - %4
				|Помилки: %5'"),
				СокрЛП(СнаятаяЗетка.НомерZотчета),
				Формат(СнаятаяЗетка.Дата, "ДФ=dd.MM.yyyy"),
				тСклад,
				СнаятаяЗетка.КоличествоЧеков,
				ОписаниеОшибки()));
				
				ДокКассоваяСмена.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
			Если ДокКассоваяСмена.Ссылка <> ПредопределенноеЗначение("Документ.ТК_КассоваяСмена.ПустаяСсылка") Тогда 
				НовСтрСК = ДокОбъект.СнятыеКассы.Добавить();				
				НовСтрСК.КассоваяСмена = ДокКассоваяСмена.Ссылка;
			КонецЕсли;
			
			ЗаполнитьТовары(ДокОбъект,тзПродажи);				
			
			тчПлатежныеКарты = ДокОбъект.ОплатаПлатежнымиКартами;
			
			Если СнаятаяЗетка.ОборотТерминал <> 0 Тогда
				НоваяСтрока = тчПлатежныеКарты.Добавить();
				НоваяСтрока.КассаККМ = КассаККМ;
				НоваяСтрока.Сумма    = СнаятаяЗетка.ОборотТерминал/100;
				НоваяСтрока.ЭквайринговыйТерминал = Терминал;
			КонецЕсли;
		КонецЦикла;
		
		//Нет товаров, пропустим загрузку, документ догрузится при проверке если дойдут товары.
		Если ДокОбъект.Товары.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ %1 по складу %2 не загружен. Таблица ""Товары"" пустая'; uk = 'Документ %1 по складу %2 не завантажений. Таблиця ""Товари"" порожня'"),
			Строка(ДокОбъект),
			тСклад));
			
			ВсеОк = Ложь;
			ВсеОкЗагрузка = Ложь;
			СОшибками = СОшибками + 1;
			Продолжить;
		КонецЕсли;
		
		тчТовары = ДокОбъект.Товары;
		
		тчТовары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,Цена,СтавкаНДС,Возврат,КлассификаторПродажи","Количество,Сумма,СуммаНДС,СуммаВсего,СуммаСкидки");
		
		СкидкаОкругления = Справочники.КлассификаторПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор("974757a9-f0d4-11e9-a2a9-005056a18470"));
		Для Каждого СтрокаТаблицы Из тчТовары Цикл 
			СтрокаТаблицы.ПроцентСкидки = ?(СтрокаТаблицы.СуммаВсего=0,0,(СтрокаТаблицы.СуммаСкидки*100)/СтрокаТаблицы.СуммаВсего);
			СтрокаТаблицы.Коэффициент = СтрокаТаблицы.ЕдиницаИзмерения.Коэффициент;
			текКоличество = СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент;
			СтрокаТаблицы.КоличествоБазовое = текКоличество;
			Если текКоличество = 0 Тогда
				СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма;
			Иначе
				СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма / текКоличество;
			КонецЕсли;
			
			Если СтрокаТаблицы.СуммаСкидки <> 0  И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КлассификаторПродажи) Тогда
				СтрокаТаблицы.КлассификаторПродажи = СкидкаОкругления;
			КонецЕсли;
			
		КонецЦикла;
		
		//Проведение
		ДокОбъект.Дата = ДатаВДокумент;
		
		Отказ = Ложь;
		
		Попытка
			Если ДокОбъект.ПроверитьЗаполнение() Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				СоздатьДокументЗКС(ДокОбъект.Ссылка,тзПродажи);
				ДокументыВендинг(ДокОбъект.Ссылка);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				СОшибками = СОшибками + 1;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 (%2) не проведен'; uk = 'Документ %1 (%2) не проведений'"),
				ДокОбъект.Ссылка,
				тСклад),
				ДокОбъект.Ссылка);
			КонецЕсли;
			
		Исключение
			
			ОписаниеОшибки = ОписаниеОшибки() + " по складу "+ тСклад; 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);			
			Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки);
			
			ВсеОк = Ложь;
			ВсеОкЗагрузка = Ложь;
			СОшибками = СОшибками + 1;
			
			Попытка
				Если НЕ ДокОбъект.Проведен тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки() + " по складу " + тСклад; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);								
				Ошибки = ДобавитьНовуюСтроку(Ошибки, ОписаниеОшибки);
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЦикла;	
	
	Параметры.Вставить("ОК",ВсеОкЗагрузка);
	
	СообщениеЗавершения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Обработано %1 документ(ов)'; uk = 'Оброблено %1 документ(ів)'"), 
	сКоличествоДокументов);
	
	Если СОшибками > 0 Тогда 
		СообщениеЗавершения = СообщениеЗавершения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' - из них с ошибками %1'; uk = ' - із них з помилками %1'"),
		СОшибками);
		
	КонецЕсли;							
	
КонецПроцедуры

Функция СоздатьДокументЗКС(ЗакрытиеСмены,тзПродажи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвязанныеДокументы.Ссылка КАК ДокументЗКС
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Документ) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ТК_ЗакрытиеСменыЗКС";
	
	Запрос.УстановитьПараметр("Документ", ЗакрытиеСмены);
	
	ВыборкаЗКС = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗКС.Следующий() Тогда 
		ДокументЗКС = ВыборкаЗКС.ДокументЗКС.ПолучитьОбъект();
		Если ДокументЗКС.ПометкаУдаления Тогда 
			ДокументЗКС.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	Иначе
		ДокументЗКС = Документы.ТК_ЗакрытиеСменыЗКС.СоздатьДокумент();	
	КонецЕсли;
	
	ДокументЗКС.Заполнить(ЗакрытиеСмены);
	ДокументЗКС.СписыватьОстатки = Истина;
	ДокументЗКС.Товары.Очистить();
	
	ЗаполнитьТовары(ДокументЗКС,тзПродажи);				
	
	тчТовары = ДокументЗКС.Товары;
	тчТовары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,Цена,СтавкаНДС,Возврат,ОплатаБезнал,КлассификаторПродажи","Количество,Сумма,СуммаНДС,СуммаВсего,СуммаСкидки,СуммаАкцизногоНалога");
	
	СкидкаОкругления = Справочники.КлассификаторПродаж.ПолучитьСсылку(Новый УникальныйИдентификатор("974757a9-f0d4-11e9-a2a9-005056a18470"));
	Для Каждого СтрокаТаблицы Из тчТовары Цикл 
		СтрокаТаблицы.ПроцентСкидки = ?(СтрокаТаблицы.СуммаВсего=0,0,(СтрокаТаблицы.СуммаСкидки*100)/СтрокаТаблицы.СуммаВсего);
		СтрокаТаблицы.Коэффициент = СтрокаТаблицы.ЕдиницаИзмерения.Коэффициент;
		текКоличество = СтрокаТаблицы.Количество * СтрокаТаблицы.Коэффициент;
		СтрокаТаблицы.КоличествоБазовое = текКоличество;
		Если текКоличество = 0 Тогда
			СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма;
		Иначе
			СтрокаТаблицы.Цена          = СтрокаТаблицы.Сумма / текКоличество;
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаСкидки <> 0  И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КлассификаторПродажи) Тогда
			СтрокаТаблицы.КлассификаторПродажи = СкидкаОкругления;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Попытка
		ДокументЗКС.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось провести документ ЗКС %1'; uk = 'Не вдалося провести документ ЗКС %1'"),
		ДокументЗКС));
	КонецПопытки;
	
	Возврат ДокументЗКС;
КонецФункции



Функция СформироватьОтчет_Планограмма(Параметры) 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОтборСклад = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборСклад", Ложь);
	
	НаДату = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланограммаАвтоматаСрезПоследних.Период КАК Период,
	|	ПланограммаАвтоматаСрезПоследних.Склад КАК Склад,
	|	ПланограммаАвтоматаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ПланограммаАвтоматаСрезПоследних.Характеристика КАК Характеристика,
	|	ПланограммаАвтоматаСрезПоследних.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, Склад = &Склад) КАК ПланограммаАвтоматаСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Склад", ОтборСклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Планограмма = РезультатЗапроса.Выгрузить();
	
	Рядов = ОтборСклад.ВидАвтомата.Рядов;
	Ячеек = ОтборСклад.ВидАвтомата.Ячеек;
	ВсегоЯчеек = Рядов * Ячеек;
	
	Макет = ПолучитьМакет("Планограмма");
	
	облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	облШапкаРяд = Макет.ПолучитьОбласть("Шапка|Ряд");
	облШапкаЯчейка = Макет.ПолучитьОбласть("Шапка|Ячейка");
	облДанныеРяд = Макет.ПолучитьОбласть("Данные|Ряд");
	облДанныеЯчейка= Макет.ПолучитьОбласть("Данные|Ячейка");
	
	облЗаголовок.Параметры.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Планограмма (%1) %2 на %3'; uk = 'Планограма (%1) %2 на %3'"),
	СокрЛП(ОтборСклад.Код),
	ОтборСклад.Наименование,
	Формат(НаДату,"ДФ=dd.MM.yyyy"));
	
	ТабДок.Вывести(облЗаголовок);
	ТабДок.Вывести(облШапкаРяд);
	
	Для Ячейка = 1 По Ячеек Цикл
		облШапкаЯчейка.Параметры.Ячейка = Ячейка;
		ТабДок.Присоединить(облШапкаЯчейка);
	КонецЦикла;
	
	Для Ряд = 0 По Рядов - 1 Цикл
		облДанныеРяд.Параметры.Ряд = Символ(65+Ряд);
		ТабДок.Вывести(облДанныеРяд);
		Для сЯчейка = 1 По Ячеек Цикл
			//Ячейка = сЯчейка + (Рядов - 1 - Ряд) * Ячеек;
			Ячейка = сЯчейка + Ряд * Ячеек;
			строка = Планограмма.Найти(Ячейка,"Ячейка");
			Если строка = Неопределено Тогда
				Артикул = 0;	
				МРЦ = 0;	
			Иначе
				Артикул = строка.Номенклатура.Артикул;	
				МРЦ = строка.Характеристика;	
			КонецЕсли;
			облДанныеЯчейка.Параметры.Ячейка = Ячейка;
			облДанныеЯчейка.Параметры.Артикул = Артикул;
			облДанныеЯчейка.Параметры.МРЦ = МРЦ;
			ТабДок.Присоединить(облДанныеЯчейка);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.Вывести(облШапкаРяд);
	
	Для Ячейка = 1 По Ячеек Цикл
		облШапкаЯчейка.Параметры.Ячейка = Ячейка;
		ТабДок.Присоединить(облШапкаЯчейка);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ФиксацияСлева = 1;
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчет_Продажи(Параметры) 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОтборСклад = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборСклад", Ложь);
	
	ИД_Автомата = ОтборСклад.ИД_Автомата;
	
	КонецПериода = НачалоДня(ТекущаяДата());
	НачалоПериода = ДобавитьМесяц(КонецПериода,-1);
	
	Макет = ПолучитьМакет("Продажи");
	
	облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	облШапка = Макет.ПолучитьОбласть("Шапка");
	облДанные = Макет.ПолучитьОбласть("Данные");
	
	ЗапросПериод = Формат(НачалоПериода,"ДФ='yyyy-MM-dd'")+"?to="+Формат(КонецПериода,"ДФ='yyyy-MM-dd'");
	ЗапросОтборСклад = "&automatId=" + Формат(ИД_Автомата,"ЧГ=0");
	
	Ответ = ПолучитьДанные_GET("dayreport/"+ЗапросПериод+ЗапросОтборСклад);
	
	Если Ответ.КодСостояния > 399 Тогда
		Ошибка404(Ответ,"GET");
		Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	КонецЕсли;
	
	Данные = Ответ.Данные;
	ТекущаяСмена = Данные[Данные.Количество()-1].id+1;
	
	облЗаголовок.Параметры.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Продажи текущей %1 смены (%2) %3'; uk = 'Продаж поточної %1 зміни (%2) %3'"),
	ТекущаяСмена,
	СокрЛП(ОтборСклад.Код),
	ОтборСклад.Наименование);
	
	ТабДок.Вывести(облЗаголовок);
	
	ТабДок.Вывести(облШапка);
	
	Ответ = ПолучитьДанные_GET("automat/"+Формат(ИД_Автомата,"ЧГ=0")+"/shift/"+Формат(ТекущаяСмена,"ЧГ=0"));
	
	Если Ответ.КодСостояния > 399 Тогда
		Ошибка404(Ответ,"GET");
		Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	КонецЕсли;
	
	Если Ответ.Данные = Неопределено Тогда
		Данные = Новый Массив;
	Иначе
		Данные = Ответ.Данные;
	КонецЕсли;
	
	Нпп = 0;
	Для Каждого Строка Из Данные Цикл
		Нпп = 1 + Нпп;
		Ячейка = ИмяЯчейки(ОтборСклад.ВидАвтомата.Рядов,ОтборСклад.ВидАвтомата.Ячеек,Строка.cellNumber);
		
		облДанные.Параметры.Нпп				= Нпп;
		облДанные.Параметры.dateTime		= МестноеВремя(ПреобразоватьДатуИзСтроки(Строка.dateTime),ПолучитьЧасовойПоясИнформационнойБазы());
		облДанные.Параметры.Ячейка			= Ячейка;
		облДанные.Параметры.cellNumber		= "(" + Строка.cellNumber + ")";
		облДанные.Параметры.paymentType		= Строка.paymentType;
		облДанные.Параметры.article			= Строка.article;
		облДанные.Параметры.Номенклатура	= Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Формат(Строка.article, "ЧЦ=6; ЧДЦ=; ЧГ="));
		облДанные.Параметры.maxRetailPrice	= Строка.maxRetailPrice / 100;
		облДанные.Параметры.itemsCount		= Строка.itemsCount;
		облДанные.Параметры.itemPrice		= Строка.itemPrice / 100;
		облДанные.Параметры.priceSum		= Строка.priceSum / 100;
		
		ТабДок.Вывести(облДанные);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ФиксацияСверху = 4;
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция СформироватьОтчет_Остатки(Параметры) 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОтборСклад = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтборСклад", Ложь);
	
	ИД_Автомата = ОтборСклад.ИД_Автомата;
	
	Макет = ПолучитьМакет("Остатки");
	
	облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	облШапка = Макет.ПолучитьОбласть("Шапка");
	облДанные = Макет.ПолучитьОбласть("Данные");
	облИтого = Макет.ПолучитьОбласть("Итого");
	
	облЗаголовок.Параметры.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Остатки на (%1) %2'; uk = 'Залишки на (%1) %2'"),
	СокрЛП(ОтборСклад.Код),
	ОтборСклад.Наименование);
	
	ТабДок.Вывести(облЗаголовок);
	
	ТабДок.Вывести(облШапка);
	
	Ответ = ПолучитьДанные_GET("automat/"+Формат(ИД_Автомата,"ЧГ=0")+"/cell/");
	
	Если Ответ.КодСостояния > 399 Тогда
		Ошибка404(Ответ,"GET");
		Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	КонецЕсли;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Для каждого стрДанные Из Ответ.Данные Цикл
		строка = ТаблицаОстатков.Добавить();
		строка.Артикул			= Формат(стрДанные.article,"ЧГ=0");
		строка.maxRetailPrice	= стрДанные.maxRetailPrice / 100;
		строка.remainingStock	= стрДанные.remainingStock;
		строка.order			= стрДанные.order;
	КонецЦикла;
	
	КонецПериода = НачалоДня(ТекущаяДата());
	НачалоПериода = ДобавитьМесяц(КонецПериода,-1);
	
	ЗапросПериод = Формат(НачалоПериода,"ДФ='yyyy-MM-dd'")+"?to="+Формат(КонецПериода,"ДФ='yyyy-MM-dd'");
	ЗапросОтборСклад = "&automatId=" + Формат(ИД_Автомата,"ЧГ=0");
	
	Ответ = ПолучитьДанные_GET("dayreport/"+ЗапросПериод+ЗапросОтборСклад);
	
	Если Ответ.КодСостояния > 399 Тогда
		Ошибка404(Ответ,"GET");
		Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	КонецЕсли;
	
	Данные = Ответ.Данные;
	ТекущаяСмена = Данные[Данные.Количество()-1].id+1;
	
	Ответ = ПолучитьДанные_GET("automat/"+Формат(ИД_Автомата,"ЧГ=0")+"/shift/"+Формат(ТекущаяСмена,"ЧГ=0"));
	
	Если Ответ.КодСостояния > 399 Тогда
		Ошибка404(Ответ,"GET");
		Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	КонецЕсли;
	
	Если Ответ.Данные = Неопределено Тогда
		Данные = Новый Массив;
	Иначе
		Данные = Ответ.Данные;
	КонецЕсли;
	
	ТаблицаПродаж = ПолучитьТаблицаЗначений();
	
	Для каждого стрДанные Из Данные Цикл
		строка = ТаблицаПродаж.Добавить();
		строка.Артикул = Формат(стрДанные.article,"ЧГ=0");
		строка.maxRetailPrice = стрДанные.maxRetailPrice / 100;
		строка.itemsCount = стрДанные.itemsCount;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ОЛД"+/////////////
	"ВЫБРАТЬ
	|	Остатки.Артикул КАК Артикул,
	|	Остатки.maxRetailPrice КАК maxRetailPrice,
	|	Остатки.remainingStock КАК remainingStock,
	|	Остатки.order КАК order
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	&тзОстатки КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.Артикул КАК Артикул,
	|	МАКСИМУМ(втОстатки.order) КАК order
	|ПОМЕСТИТЬ ПоследнееМРЦ
	|ИЗ
	|	втОстатки КАК втОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	втОстатки.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Артикул КАК Артикул,
	|	Продажи.maxRetailPrice КАК maxRetailPrice,
	|	Продажи.itemsCount КАК itemsCount
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	&тзПродажи КАК Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Артикул КАК Артикул,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстаткиИОбороты.ХарактеристикаНоменклатуры.ЗначениеМРЦ, 0) КАК МРЦ,
	|	СУММА(ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Остаток1С,
	|	0 КАК Остаток,
	|	0 КАК Продажа,
	|	NULL КАК НаВитрине
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Артикул,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстаткиИОбороты.ХарактеристикаНоменклатуры.ЗначениеМРЦ, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Артикул,
	|	Номенклатура.Ссылка,
	|	ВложенныйЗапрос.maxRetailPrice,
	|	0,
	|	ВложенныйЗапрос.remainingStock,
	|	ВложенныйЗапрос.itemsCount,
	|	МАКСИМУМ(ВложенныйЗапрос.НаВитрине)
	|ИЗ
	|	(ВЫБРАТЬ
	|		втОстатки.Артикул КАК Артикул,
	|		втОстатки.maxRetailPrice КАК maxRetailPrice,
	|		СУММА(втОстатки.remainingStock) КАК remainingStock,
	|		0 КАК itemsCount,
	|		НЕ ПоследнееМРЦ.order ЕСТЬ NULL КАК НаВитрине
	|	ИЗ
	|		втОстатки КАК втОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоследнееМРЦ КАК ПоследнееМРЦ
	|			ПО втОстатки.Артикул = ПоследнееМРЦ.Артикул
	|				И втОстатки.order = ПоследнееМРЦ.order
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втОстатки.Артикул,
	|		втОстатки.maxRetailPrice,
	|		НЕ ПоследнееМРЦ.order ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втПродажи.Артикул,
	|		втПродажи.maxRetailPrice,
	|		0,
	|		СУММА(втПродажи.itemsCount),
	|		NULL
	|	ИЗ
	|		втПродажи КАК втПродажи
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втПродажи.Артикул,
	|		втПродажи.maxRetailPrice) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВложенныйЗапрос.Артикул = Номенклатура.Артикул
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Артикул,
	|	Номенклатура.Ссылка,
	|	ВложенныйЗапрос.maxRetailPrice,
	|	ВложенныйЗапрос.remainingStock,
	|	ВложенныйЗапрос.itemsCount
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Артикул КАК Артикул,
	|	Итоговая.Номенклатура.ИД_Товара КАК ИД_Товара,
	|	Итоговая.Номенклатура КАК Номенклатура,
	|	Итоговая.МРЦ КАК МРЦ,
	|	СУММА(Итоговая.Остаток1С) КАК Остаток1С,
	|	СУММА(Итоговая.Остаток) КАК Остаток,
	|	СУММА(Итоговая.Продажа) КАК Продажа,
	|	СУММА(-Итоговая.Остаток1С + Итоговая.Продажа + Итоговая.Остаток + ВЫБОР
	|			КОГДА Итоговая.НаВитрине = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разница,
	|	МАКСИМУМ(Итоговая.НаВитрине) КАК НаВитрине,
	|	СУММА(ВЫБОР
	|			КОГДА Итоговая.НаВитрине = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Витрина
	|ИЗ
	|	Итоговая КАК Итоговая
	|
	|СГРУППИРОВАТЬ ПО
	|	Итоговая.Артикул,
	|	Итоговая.Номенклатура,
	|	Итоговая.МРЦ,
	|	Итоговая.Номенклатура.ИД_Товара
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Остаток1С),
	|	СУММА(Остаток),
	|	СУММА(Продажа),
	|	СУММА(Разница),
	|	СУММА(Витрина)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.Артикул КАК Артикул,
	|	Остатки.maxRetailPrice КАК maxRetailPrice,
	|	Остатки.remainingStock КАК remainingStock
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	&тзОстатки КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Артикул КАК Артикул,
	|	Продажи.maxRetailPrice КАК maxRetailPrice,
	|	Продажи.itemsCount КАК itemsCount
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	&тзПродажи КАК Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Артикул КАК Артикул,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстаткиИОбороты.ХарактеристикаНоменклатуры.ЗначениеМРЦ, 0) КАК МРЦ,
	|	СУММА(ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Остаток1С,
	|	0 КАК Остаток,
	|	0 КАК Продажа,
	|	0 КАК Витрина
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.Артикул,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстаткиИОбороты.ХарактеристикаНоменклатуры.ЗначениеМРЦ, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Артикул,
	|	Номенклатура.Ссылка,
	|	ВложенныйЗапрос.maxRetailPrice,
	|	0,
	|	ВложенныйЗапрос.remainingStock,
	|	ВложенныйЗапрос.itemsCount,
	|	0
	|ИЗ
	|	(ВЫБРАТЬ
	|		втОстатки.Артикул КАК Артикул,
	|		втОстатки.maxRetailPrice КАК maxRetailPrice,
	|		СУММА(втОстатки.remainingStock) КАК remainingStock,
	|		0 КАК itemsCount
	|	ИЗ
	|		втОстатки КАК втОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втОстатки.Артикул,
	|		втОстатки.maxRetailPrice
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втПродажи.Артикул,
	|		втПродажи.maxRetailPrice,
	|		0,
	|		СУММА(втПродажи.itemsCount)
	|	ИЗ
	|		втПродажи КАК втПродажи
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втПродажи.Артикул,
	|		втПродажи.maxRetailPrice) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВложенныйЗапрос.Артикул = Номенклатура.Артикул
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Артикул,
	|	Номенклатура.Ссылка,
	|	ВложенныйЗапрос.maxRetailPrice,
	|	ВложенныйЗапрос.remainingStock,
	|	ВложенныйЗапрос.itemsCount
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВитринаВендингАвтоматовСрезПоследних.Номенклатура.Артикул,
	|	ВитринаВендингАвтоматовСрезПоследних.Номенклатура,
	|	ВитринаВендингАвтоматовСрезПоследних.Характеристика.ЗначениеМРЦ,
	|	0,
	|	0,
	|	0,
	|	ВитринаВендингАвтоматовСрезПоследних.Витрина
	|ИЗ
	|	РегистрСведений.ВитринаВендингАвтоматов.СрезПоследних(&КонецПериода, Склад = &СкладКомпании) КАК ВитринаВендингАвтоматовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.Артикул КАК Артикул,
	|	Итоговая.Номенклатура.ИД_Товара КАК ИД_Товара,
	|	Итоговая.Номенклатура КАК Номенклатура,
	|	Итоговая.МРЦ КАК МРЦ,
	|	СУММА(Итоговая.Остаток1С) КАК Остаток1С,
	|	СУММА(Итоговая.Остаток) КАК Остаток,
	|	СУММА(Итоговая.Продажа) КАК Продажа,
	|	СУММА(-Итоговая.Остаток1С + Итоговая.Продажа + Итоговая.Остаток + Итоговая.Витрина) КАК Разница,
	|	СУММА(Итоговая.Витрина) КАК Витрина
	|ИЗ
	|	Итоговая КАК Итоговая
	|
	|СГРУППИРОВАТЬ ПО
	|	Итоговая.Артикул,
	|	Итоговая.Номенклатура,
	|	Итоговая.МРЦ,
	|	Итоговая.Номенклатура.ИД_Товара
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Остаток1С),
	|	СУММА(Остаток),
	|	СУММА(Продажа),
	|	СУММА(Разница),
	|	СУММА(Витрина)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Запрос.УстановитьПараметр("СкладКомпании", ОтборСклад);
	Запрос.УстановитьПараметр("тзОстатки", ТаблицаОстатков);
	Запрос.УстановитьПараметр("тзПродажи", ТаблицаПродаж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ааа = РезультатЗапроса.Выгрузить();
	
	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтоги.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаИтоги.Выбрать();
		
		облИтого.Параметры.Нпп			= ВыборкаДетальныеЗаписи.Количество();
		облИтого.Параметры.Остаток1С	= ВыборкаИтоги.Остаток1С;
		облИтого.Параметры.Остаток		= ВыборкаИтоги.Остаток;
		облИтого.Параметры.Продажа		= ВыборкаИтоги.Продажа;
		облИтого.Параметры.Разница		= ВыборкаИтоги.Разница;
		облИтого.Параметры.Витрина		= ВыборкаИтоги.Витрина;
		
		ТабДок.Вывести(облИтого);
		
		Нпп = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Нпп = 1 + Нпп;
			облДанные.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			облДанные.Параметры.Нпп		= Нпп;
			облДанные.Параметры.ид		= Формат(ВыборкаДетальныеЗаписи.ИД_Товара,"ЧН=-; ЧГ=");
			
			ТабДок.Вывести(облДанные);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ФиксацияСверху = 6;
	
	Возврат Новый Структура("ТабличныйДокумент", ТабДок);
	
КонецФункции

Функция ВыполнитьПереоценкуОстатков(Параметры)
	
	мСклады = Параметры.МассивСкладов;
	
	Начало = ТекущаяДата();
	
	МассивДанных = Новый Массив;
	
	ТаблицаОстатков = ПолучитьТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланограммаАвтоматаСрезПоследних.Склад КАК СкладКомпании,
	|	ПланограммаАвтоматаСрезПоследних.Склад.ВидАвтомата КАК ВидАвтомата,
	|	ПланограммаАвтоматаСрезПоследних.Склад.ИД_Автомата КАК ИД_Автомата,
	|	ПланограммаАвтоматаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ПланограммаАвтоматаСрезПоследних.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка,
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	РегистрСведений.ПланограммаАвтомата.СрезПоследних(&НаДату, Склад В (&Склады)) КАК ПланограммаАвтоматаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ПланограммаАвтоматаСрезПоследних.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ПланограммаАвтоматаСрезПоследних.Характеристика = ЦеныСрезПоследних.Характеристика
	|			И ПланограммаАвтоматаСрезПоследних.Склад.ТипЦенРозничнойТорговли = ЦеныСрезПоследних.ТипЦен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0),
	|	ПланограммаАвтоматаСрезПоследних.Склад,
	|	ПланограммаАвтоматаСрезПоследних.Склад.ВидАвтомата,
	|	ПланограммаАвтоматаСрезПоследних.Склад.ИД_Автомата,
	|	ПланограммаАвтоматаСрезПоследних.Номенклатура,
	|	ПланограммаАвтоматаСрезПоследних.Характеристика
	|ИТОГИ ПО
	|	СкладКомпании";
	
	Запрос.УстановитьПараметр("Склады", мСклады);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбработаноДокументов = 0;
	сКоличествоДокументов = ВыборкаСклад.Количество();
	
	Пока ВыборкаСклад.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДлительныеОперации.СообщитьПрогресс(Цел(ОбработаноДокументов / сКоличествоДокументов * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выгружено %1 из %2'; uk = 'Вивантажено %1 з %2'"), 
		ОбработаноДокументов, 
		сКоличествоДокументов));
		
		ОбработаноДокументов = ОбработаноДокументов + 1;
		
		Ответ = ПолучитьДанные_GET("automat/"+Формат(ВыборкаСклад.ИД_Автомата,"ЧГ=0")+"/cell/");
		
		Если Ответ.КодСостояния > 399 Тогда
			Ошибка404(Ответ,"GET");
			Продолжить;
		КонецЕсли;
		
		ТаблицаОстатков.Очистить();                                                		
		
		Для каждого строка Из Ответ.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОстатков.Добавить(),строка);	
		КонецЦикла;
		
		Времяостатки = ТекущаяДата();
		
		Выборка = ВыборкаСклад.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			
			
			
			
			
			Если Выборка.Ячейка = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не назначена ячейка для (%1) %2 %3'; uk = 'Не призначено комірку для (%1) %2 %3'"),
				Выборка.Номенклатура.Артикул,
				Выборка.Номенклатура,
				Выборка.Характеристика));
				Отказ = Истина;
			КонецЕсли;
			Если Выборка.Цена = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Нулевая цена у (%1) %2 %3'; uk = 'Нульова ціна у (%1) %2 %3'"),
				Выборка.Номенклатура.Артикул,
				Выборка.Номенклатура,
				Выборка.Характеристика));
				Отказ = Истина;
			КонецЕсли;
			
			
			Если НЕ Отказ Тогда     
				
				стрОстаток = ТаблицаОстатков.Найти(Выборка.Ячейка,"number");
				Остаток = ?(стрОстаток = Неопределено,0,стрОстаток.remainingStock);
				
				СтруктураСтроки = новый Структура;
				СтруктураСтроки.Вставить("number",Выборка.Ячейка);
				СтруктураСтроки.Вставить("automatId",Выборка.ИД_Автомата);
				СтруктураСтроки.Вставить("article",Число(Выборка.Номенклатура.Артикул));
				СтруктураСтроки.Вставить("maxRetailPrice",Выборка.Характеристика.ЗначениеМРЦ * 100);
				СтруктураСтроки.Вставить("price",Выборка.Цена * 100);
				СтруктураСтроки.Вставить("remainingStock",Остаток);
				СтруктураСтроки.Вставить("order",стрОстаток.order);
				СтруктураСтроки.Вставить("lotGuid","00000000-0000-0000-0000-000000000000");
				МассивДанных.Добавить(СтруктураСтроки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Отказ Тогда     
			Ответ = ИзменитьЭлемент_PATCH("automat/"+Формат(ВыборкаСклад.ИД_Автомата,"ЧГ=0")+"/cell/",МассивДанных);
			Если Ответ.КодСостояния > 399 Тогда
				Ошибка404(Ответ,"PATCH");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка выгрузки данных'; uk = 'Помилка вивантаження даних'"));
				Продолжить;
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка переоценки склада: '; uk = 'Помилка переоцінки складу: '") + Строка(ВыборкаСклад.Склад), ВыборкаСклад.Склад);			
		КонецЕсли;
	КонецЦикла;
	
	
	Конец = ТекущаяДата();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("8 по 8 "+Начало+" - "+Конец+"     "+(Конец-Начало)+"         : "+Времяостатки);
	
	
	
	Возврат Истина;
КонецФункции


Функция ПолучитьТаблицуСкладовДляОтбораИзПараметров(МассивСкладов)
	
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаСкладов.Колонки.Добавить("id", Новый ОписаниеТипов("Число"));
	
	Для Каждого Склад Из МассивСкладов Цикл 
		
		НоваяСтрока = ТаблицаСкладов.Добавить();
		НоваяСтрока.СкладКомпании = Склад;
		НоваяСтрока.id = Склад.ИД_Автомата;
		
	КонецЦикла;
	
	ТаблицаСкладов.Индексы.Добавить("id");
	
	Возврат ТаблицаСкладов;
	
КонецФункции

Функция МассивСкладов()	Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкладыКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.ИД_Автомата > 0
	|	И НЕ СкладыКомпании.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивСкладов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивСкладов;
КонецФункции

Процедура Ошибка404(Ответ,Метод)	Экспорт
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Ошибка %1. message: %2  %3 [%4]'; uk = 'Помилка %1. message: %2  %3 [%4]'"),
	Ответ.КодСостояния,
	Ответ.Данные.message,
	Метод,
	Ответ.Команда));
КонецПроцедуры

Функция СократитьНаименование(Знач Наименование)	Экспорт
	Наименование = СтрЗаменить(Наименование,"Сигарети ","");
	Наименование = СтрЗаменить(Наименование,"сигарети ","");
	Наименование = СтрЗаменить(Наименование,"сигарили ","");
	Наименование = СтрЗаменить(Наименование,"с-ли ","");
	Наименование = СтрЗаменить(Наименование,"Сиг. ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновм. виріб для нагрів. 20ст. ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновм. виріб для нагріван. 20 стіків ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновм. виріб для нагрів20 ст. ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновмісн.виріб для нагрів20стік. ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновмісний виріб для нагрівання, ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновмісн. виріб для нагрів 20 стіків ","");
	Наименование = СтрЗаменить(Наименование,"Тютюновмісн. виріб для нагрів20стік. ","");
	Наименование = СтрЗаменить(Наименование,"""","");
	Наименование = СтрЗаменить(Наименование,"(пач=20шт)","");
	Возврат Наименование;
КонецФункции

Функция ПолучитьТаблицаЗначений()	Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика");
	Таблица.Колонки.Добавить("СортировкаМРЦ");
	Таблица.Колонки.Добавить("Ячейка");
	Таблица.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(15,3)));
	
	Таблица.Колонки.Добавить("number", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("remainingStock", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("article", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("maxRetailPrice", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("price", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("order", Новый ОписаниеТипов("Число"));
	
	Таблица.Колонки.Добавить("itemsCount", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("itemPrice", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("priceSum", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("paymentType", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("taxExcise", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("taxVat", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
	
	Таблица.Колонки.Удалить("taxVat");
КонецФункции

Функция ПреобразоватьДатуИзСтроки(СтрокаДаты)
	ЗначениеДаты = Дата(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрокаДаты,"-",""),":","")," ",""));
	Возврат ЗначениеДаты;
КонецФункции

Процедура ДокументыВендинг(Документ)
	МенеджерЗаписи = РегистрыСведений.ДокументыВендинг.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Документ;
	МенеджерЗаписи.Обработан = Истина;
	МенеджерЗаписи.ИД = Документ.УникальныйИдентификатор();
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ВитринаВендинг(Выборка, ЗначМРЦ, Витрина)
	Если Витрина Тогда
		Характеристика = Выборка.Характеристика;
	Иначе
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура,ЗначМРЦ/100, ,Истина);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ВитринаВендингАвтоматов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Склад = Выборка.СкладКомпании;
	МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
	МенеджерЗаписи.Характеристика = Характеристика;
	МенеджерЗаписи.Витрина = Витрина;
	МенеджерЗаписи.Записать();
КонецПроцедуры


Функция ДобавитьНовуюСтроку(Знач ИсходнаяСтрока = "", Знач НоваяСтрока = "")
	
	Если Не ПустаяСтрока(ИсходнаяСтрока) И Не ПустаяСтрока(НоваяСтрока) Тогда 
		
		Возврат ИсходнаяСтрока + Символы.ПС + НоваяСтрока;
		
	ИначеЕсли ПустаяСтрока(ИсходнаяСтрока) Тогда 
		
		Возврат НоваяСтрока;
		
	Иначе
		
		Возврат ИсходнаяСтрока;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьТовары(ДокОбъект,ТаблицаПродаж)
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ТК_ЗакрытиеСменыЗКС") Тогда
		ТаблицаПродаж.Колонки.Удалить("СуммаНДС");
		ТаблицаПродаж.Колонки.taxVat.Имя = "СуммаНДС";
	КонецЕсли;
	
	тчТовары = ДокОбъект.Товары;
	Если тчТовары.Количество() = 0 Тогда
		тчТовары.Загрузить(ТаблицаПродаж);
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаПродаж Цикл 
			НоваяСтрока = тчТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьТабличнуюЧасть(ТаблицаДокумента,тзРезультатЗапроса,ЗагруженныеОбъекты,ЗетПродажи = Ложь)
	
	Если ТаблицаДокумента = "Товары" Тогда
		
		Для Каждого СтрокаТаблицы Из тзРезультатЗапроса Цикл 
			Артикул = Формат(СтрокаТаблицы.article, "ЧЦ=6; ЧДЦ=; ЧГ=");
			ЕдИзм   = "ЕдИзм";
			ЗначМРЦ  = СтрокаТаблицы.maxRetailPrice/100;
			
			КлючТовара = "А"+Артикул+""+ЕдИзм+""+Формат(СтрокаТаблицы.maxRetailPrice,"ЧГ=0");
			ДанныеПоТовару =  Неопределено;
			
			ЗагруженныеОбъекты.Свойство(КлючТовара,ДанныеПоТовару);
			
			Если ДанныеПоТовару = Неопределено Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	спрНоменклатура.Ссылка КАК Номенклатура,
				|	спрНоменклатура.СтавкаНДС КАК СтавкаНДС,
				|	спрНоменклатура.СтавкаНДС.Ставка КАК Ставка,
				|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения
				|ИЗ
				|	Справочник.Номенклатура КАК спрНоменклатура
				|ГДЕ
				|	спрНоменклатура.Артикул = &Артикул
				|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Артикул", Артикул);
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					нНоменклатура     = ВыборкаДетальныеЗаписи.Номенклатура;
					нСтавкаНДС        = ВыборкаДетальныеЗаписи.СтавкаНДС;
					нСтавка           = ВыборкаДетальныеЗаписи.Ставка;
					нЕдИзм           = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
				Иначе
					нНоменклатура     = Справочники.Номенклатура.ПустаяСсылка();
					нСтавкаНДС        = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					нСтавка           = 20;
					нЕдИзм           = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
				КонецЕсли;
				
				Если Не ОбщегоНазначения.СсылкаСуществует(нЕдИзм) Тогда 
					нЕдИзм = Справочники.ЕдиницыИзмерения.НайтиЕдиницуИзмеренийПоБазовой(нНоменклатура);
				КонецЕсли;
				
				нХарактеристика   = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(нНоменклатура,ЗначМРЦ, ,Истина);
				
				СтрокаТаблицы.Номенклатура               = нНоменклатура;
				СтрокаТаблицы.ХарактеристикаНоменклатуры = нХарактеристика;
				СтрокаТаблицы.ЕдиницаИзмерения           = нЕдИзм;
				СтрокаТаблицы.СтавкаНДС                  = нСтавкаНДС;
				СтрокаТаблицы.Ставка                     = нСтавка;
				ЗагруженныеОбъекты.Вставить(КлючТовара,Новый Структура("Номенклатура,ЕдиницаИзмерения,Характеристика,СтавкаНДС,Ставка",нНоменклатура,нЕдИзм,нХарактеристика,нСтавкаНДС,нСтавка));
			Иначе
				СтрокаТаблицы.Номенклатура               = ДанныеПоТовару["Номенклатура"];
				СтрокаТаблицы.ХарактеристикаНоменклатуры = ДанныеПоТовару["Характеристика"];
				СтрокаТаблицы.ЕдиницаИзмерения           = ДанныеПоТовару["ЕдиницаИзмерения"];
				СтрокаТаблицы.СтавкаНДС                  = ДанныеПоТовару["СтавкаНДС"];
				СтрокаТаблицы.Ставка                     = ДанныеПоТовару["Ставка"];
				
			КонецЕсли;
			
			СтрокаТаблицы.Количество	= СтрокаТаблицы.itemsCount;
			СтрокаТаблицы.Цена			= СтрокаТаблицы.itemPrice/100;
			СтрокаТаблицы.Сумма			= СтрокаТаблицы.priceSum/100;
			СтрокаТаблицы.СуммаВсего	= СтрокаТаблицы.priceSum/100;
			СтрокаТаблицы.СуммаНДС		= СтрокаТаблицы.priceSum/100 * СтрокаТаблицы.Ставка / (100 + СтрокаТаблицы.Ставка);
			СтрокаТаблицы.ОплатаБезнал	= СтрокаТаблицы.paymentType = "CARD";
			СтрокаТаблицы.СуммаАкцизногоНалога	= СтрокаТаблицы.taxExcise/100;
			СтрокаТаблицы.taxVat		= СтрокаТаблицы.taxVat/100;
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

