
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОрганизацияОбъекта = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Объект.Объект,ТекущаяДатаСеанса());
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	ОрганизацияОбъекта = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Объект.Объект,ТекущаяДатаСеанса());
КонецПроцедуры



&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОбъектПриИзмененииНаСервере();
КонецПроцедуры
