
Функция tk_apiGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	ИмяМетода = Запрос.ПараметрыURL.Получить("Метод");
	Если ИмяМетода = "License"	Тогда
		Результат = ТК_APIHTTP.ИспользуемыеЛицензии();
	Иначе
		Ответ.КодСостояния = 405;
		Результат = "Отсутствует метод";
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(Результат);
	
	Возврат Ответ;
	
КонецФункции


//////	Scubis	//////
Функция Scubis_sales_GET(Запрос)
	
	Дата1 = Запрос.ПараметрыURL["date1"];
	Дата2 = Запрос.ПараметрыURL["date2"];
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = ТК_ОбменСкубисСобытия.ОтправитьОперПродажи(Дата1,Дата2);
	
	Если Результат.Ошибка = "" Тогда
		Если Результат.СтрокДанных = 0 Тогда
			КодСостояния = 204;
		Иначе
			КодСостояния = 200;
		КонецЕсли;
	Иначе
		КодСостояния = 400;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(?(КодСостояния = 400,Результат.Ошибка,Результат.СтрокаJSON));
	
	Возврат Ответ;
	
КонецФункции

Функция Scubis_Charts_OUT_GET(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ТК_ОбменСкубисСобытия.ОтправитьГрафики();
	
	Если Результат.Ошибка = "" Тогда
		Если Результат.СтрокДанных = 0 Тогда
			КодСостояния = 204;
		Иначе
			КодСостояния = 200;
		КонецЕсли;
	Иначе
		КодСостояния = 400;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(?(КодСостояния = 400,Результат.Ошибка,Результат.СтрокаJSON));
	
	Возврат Ответ;
	
КонецФункции

Функция Scubis_Charts_IN_POST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	
	Результат = ТК_ОбменСкубисСобытия.ПринятьГрафики(МассивДанных);
	
	Если Результат.Ошибка = "" Тогда
		Если Результат.СтрокДанных = 0 Тогда
			КодСостояния = 204;
		Иначе
			КодСостояния = 200;
		КонецЕсли;
	Иначе
		КодСостояния = 400;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(?(КодСостояния = 400,Результат.Ошибка,Результат.СтрокаJSON));
	
	Возврат Ответ;
	
КонецФункции


Функция Scubis_routes_POST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	
	Результат = ТК_ОбменСкубисСобытия.ПринятьМаршруты(МассивДанных);
	
	Если Результат.Ошибка = "" Тогда
		Если Результат.СтрокДанных = 0 Тогда
			КодСостояния = 204;
		Иначе
			КодСостояния = 200;
		КонецЕсли;
	Иначе
		КодСостояния = 400;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(?(КодСостояния = 400,Результат.Ошибка,Результат.СтрокаJSON));
	
	Возврат Ответ;
	
КонецФункции



#Область PowerBi

Функция PowerBi_DailyReportFCGET(Запрос)
	
	Дата = КонецДня(ТекущаяДата() - 60*60*24);
	ДанныеОтвета = ТК_PowerBi_РаботаHTTP_Сервис.ПолучитьЕжедневныйОтчетФабрикаСыра(Дата);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("content-type", "application/json");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции

Функция PowerBi_ReportsGET(Запрос)
	
	ИмяОтчета = Запрос.ПараметрыURL.Получить("NameReport");
	ПараметрыОтчета = Запрос.ПараметрыURL.Получить("Param");
	
	ВсеОк = Истина;
	Описание = "";
	
	ДанныеОтвета = ТК_PowerBi_РаботаHTTP_Сервис.ПолучитьДанныеОтчетаPowerBi(ИмяОтчета, ПараметрыОтчета, ВсеОк, Описание);	
	
	Ответ = Новый HTTPСервисОтвет(ДанныеОтвета.КодСостояния);
	Ответ.Заголовки.Вставить("content-type", "application/json");
	Ответ.УстановитьТелоИзСтроки(ДанныеОтвета.ТелоОтчета);
	
	Возврат Ответ;
	
КонецФункции




#КонецОбласти



Функция ReturnCheckListGET(Запрос)
	КодТТ = Запрос.ПараметрыURL.Получить("code");
	СтруктураОтвет = ТК_МобильныйРабтаHTTP_Сервис.АнкетаКТочке(КодТТ);
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвет); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Кодировка = "windows-1251";
	Ответ = Новый HTTPСервисОтвет(200);
	Если Кодировка = Неопределено Тогда
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
	Иначе
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,Кодировка);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции
