#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	УстановитьУсловноеОформление();

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
 
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ПриходныйКассовыйОрдер"));
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнениеОсновныхРеквизитов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗаполнитьПоказателиОстатков(Истина, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом	
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьСостояниеДокумента();
	
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	    ОбновитьЭлементыДополнительныхРеквизитов();
	    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеОсновныхРеквизитов()
	
	Объект.ГлавныйБухгалтер = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Объект.Организация);
	Объект.Директор         = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Объект.Организация);
	Объект.СтаршийКассир    = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Кассир, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
        И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
        СвойстваВыполнитьОтложеннуюИнициализацию();
        УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
    КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьПоказателиОстатков(Истина, Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#Область ОбработчикиСобытийРеквизитовШапки

//Изменение реквизита "Дата"
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПоказателиОстатков(Истина, Истина);
КонецПроцедуры

//Изменение реквизита "КассаКомпании"
&НаСервере
Процедура КассаКомпанииПриИзмененииНаСервере()	
	
	СтруктураРеквизитов = ПолучитьРеквизитыКассыКоммпании(Объект.КассаКомпании);
	Объект.ВалютаДокумента = СтруктураРеквизитов.ВалютаДенежныхСредств;
	ПриИзмененииВалютыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаКомпанииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.КассаКомпании) Тогда 
		КассаКомпанииПриИзмененииНаСервере();	
	КонецЕсли;
	
	ЗаполнитьПоказателиОстатков(Истина);
КонецПроцедуры

//Изменение реквизита "Контрагент"
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		//КонтрагентПриИзмененииНаСервере();
	КонецЕсли;
	
	ЗаполнитьПоказателиОстатков(, Истина);
КонецПроцедуры

//Изменение реквизита "ДоговорВзаиморасчетов"
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда 
		//ДоговорВзаиморасчетовПриИзмененииНаСервере();
	КонецЕсли;
	
	ЗаполнитьПоказателиОстатков(, Истина);
КонецПроцедуры

//Изменение реквизита "Организация"
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.ГлавныйБухгалтер = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Объект.Организация);
	Объект.Директор         = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Объект.Организация);
	Объект.СтаршийКассир    = ОтветственныеЛица.ПодобратьОтветственноеЛицоОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.Кассир, Объект.Организация);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

//Изменение реквизита "ТорговаяПлощадка"
&НаСервере
Процедура ТорговаяПлощадкаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяПлощадкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ТорговаяПлощадка) Тогда 
		//ТорговаяПлощадкаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

//Изменение реквизита "РегламентированныйУчет"
&НаКлиенте
Процедура РегламентированныйУчетПриИзменении(Элемент)
	ЗаполнитьПоказателиОстатков(Истина, Истина);
КонецПроцедуры

//Изменение реквизита "СуммаДокумента"
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Объект.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДокумента, 
	     			  		ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Объект.СтавкаНДС));	
							
КонецПроцедуры

//Изменение реквизита "СтавкаНДС"
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Объект.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДокумента, 
	     			  		ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Объект.СтавкаНДС));	
							
КонецПроцедуры

//Изменение реквизита "СуммаНДС"
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	СтавкаНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Объект.СтавкаНДС);
	
	Если СтавкаНДС <> 0 Тогда 
		Объект.СуммаДокумента = (Объект.СуммаНДС * (СтавкаНДС + 1)) / СтавкаНДС;
	КонецЕсли;
	
КонецПроцедуры

//Изменение реквизита "ВалютаДокумента"
&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	ПриИзмененииВалюты();
	ЗаполнитьПоказателиОстатков(Истина);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	//УстановитьВидимостьПоказателейОстаткаИДолга();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоказателейОстаткаИДолга(ЗаполнитьОстатокВКассе = Истина, ЗаполнитьДолгПоДоговору = Истина) 
	Если ЗаполнитьОстатокВКассе Тогда 
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОстатокВКассеСтрокой", "Видимость", ЗначениеЗаполнено(Объект.КассаКомпании) И ЗначениеЗаполнено(Объект.ВалютаДокумента));
	КонецЕсли;
	
	Если ЗаполнитьДолгПоДоговору Тогда 
		ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДолгПоДоговоруСтрокой", "Видимость", ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиОстатков(ЗаполнитьОстатокВКассе = Ложь, ЗаполнитьДолгПоДоговору = Ложь) Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата", Объект.Дата);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	
	УстановитьВидимостьПоказателейОстаткаИДолга(ЗаполнитьОстатокВКассе, ЗаполнитьДолгПоДоговору);
	
	ВалютаДокумента = Объект.ВалютаДокумента;
	Если ЗаполнитьОстатокВКассе И Элементы.ОстатокВКассеСтрокой.Видимость Тогда 			
		СтруктураПараметров.Вставить("КассаКомпании", Объект.КассаКомпании);
		СтруктураПараметров.Вставить("ВалютаДокумента", ВалютаДокумента);						
		
		ОстатокВКассе = ПолучитьОстатокВКассе(СтруктураПараметров);
		стрОстатокВКассе = НСтр("ru = 'Остаток в кассе: '; uk = 'Залишок в касі: '");
		
		ОстатокВКассеСтрокой = стрОстатокВКассе + Формат(ОстатокВКассе, "ЧДЦ=2; ЧН=") + " " + ВалютаДокумента;
		Элементы.ОстатокВКассеСтрокой.Заголовок = ОстатокВКассеСтрокой;
	КонецЕсли;
	
	Если ЗаполнитьДолгПоДоговору И Элементы.ДолгПоДоговоруСтрокой.Видимость Тогда 		
		СтруктураПараметров.Вставить("РегламентированныйУчет", Объект.РегламентированныйУчет);
		СтруктураПараметров.Вставить("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		
		ДолгПоДоговору = ПолучитьДолгПоДоговору(СтруктураПараметров);
		стрДолгПоДоговору = НСтр("ru = 'По договору долг контрагента составляет: '; uk = 'По договору долг контрагента составляет: '");	
		
		ДолгПоДоговоруСтрокой = стрДолгПоДоговору + Формат(ДолгПоДоговору, "ЧДЦ=2; ЧН=") + " " + ВалютаДокумента;
		Элементы.ДолгПоДоговоруСтрокой.Заголовок = ДолгПоДоговоруСтрокой;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокВКассе(СтруктураПараметров)
	
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.ДенежныеСредстваКомпании)Тогда	
		
		ТекДата = ?(Не ЗначениеЗаполнено(СтруктураПараметров.Дата), ТекущаяДата(), СтруктураПараметров.Дата);
		МоментВремени = Новый МоментВремени(СтруктураПараметров.Дата, СтруктураПараметров.Ссылка);
		Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ДенежныеСредстваКомпанииОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании.Остатки(
		|			&Дата,
		|			СтруктурнаяЕдиница ССЫЛКА Справочник.КассыКомпании
		|				И СтруктурнаяЕдиница = &КассаКомпании
		|				И Валюта = &ВалютаДокумента) КАК ДенежныеСредстваКомпанииОстатки");
		
		
		Запрос.УстановитьПараметр("Дата", Граница);
		Запрос.УстановитьПараметр("КассаКомпании", СтруктураПараметров.КассаКомпании);
		Запрос.УстановитьПараметр("ВалютаДокумента", СтруктураПараметров.ВалютаДокумента);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Сумма;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДолгПоДоговору(СтруктураПараметров)
	
	ТекДата = ?(Не ЗначениеЗаполнено(СтруктураПараметров.Дата), ТекущаяДата(), СтруктураПараметров.Дата);
	МоментВремени = Новый МоментВремени(СтруктураПараметров.Дата, СтруктураПараметров.Ссылка);
	Граница = Новый Граница(МоментВремени, ВидГраницы.Включая);
	
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСПоставщиками)Тогда	
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК Долг
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
		|			&Дата,
		|			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		|				И РегламентированныйУчет = &РегламентированныйУчет) КАК РасчетыСПоставщикамиОстатки,
		|	РегистрНакопления.РасчетыСПокупателями.Остатки(
		|			&Дата,
		|			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		|				И РегламентированныйУчет = &РегламентированныйУчет) КАК РасчетыСПокупателямиОстатки");
		
		Запрос.УстановитьПараметр("Дата", Граница);
		Запрос.УстановитьПараметр("РегламентированныйУчет", СтруктураПараметров.РегламентированныйУчет);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", СтруктураПараметров.ДоговорВзаиморасчетов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Долг;
		Иначе 
			Возврат 0;
		КонецЕсли;
		
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ПриИзмененииВалюты()
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда 
		ПриИзмененииВалютыНаСервере();
	Иначе
		Объект.КурсДокумента = 0;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВалютыНаСервере() 
	
	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	СтруктураКурсовВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ДатаДокумента);
	
	Если СтруктураКурсовВалюты.Свойство("Курс") Тогда 
		Объект.КурсДокумента = СтруктураКурсовВалюты.Курс;
	Иначе 
		Объект.КурсДокумента = 0;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыКассыКоммпании(КассаКомпании)
	
	Возврат Справочники.КассыКомпании.ПолучитьРеквизитыКассыКомпании(КассаКомпании);
	
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры


#КонецОбласти