


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор 				  = Пользователи.ТекущийПользователь();
	ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	КурсДокумента         = 1;
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	СкладКомпании 		  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнойСклад",,СкладКомпании);	
	Статус                = Перечисления.СтатусЗаказаКазначейство.ПринятВОбработку;
	
	ХозОперация           = Справочники.ХозОперации.ЗаказПокупателяКазначейство;
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый"		, ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи"	, РежимЗаписи);
	СуммаДокумента = Товары.Итог("СуммаВсего");	
	
	Если СуммаДокумента<>СуммаСЗаказника Тогда 
		Сообщить("Сумма заказа не соответствует сумме в полученом документе!!!");
	КонецЕсли;
	

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
КонецПроцедуры

Функция ПоискОрганизации(Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытыеОрганизации.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ЗакрытыеОрганизации КАК ЗакрытыеОрганизации
		|ГДЕ
		|	ЗакрытыеОрганизации.Организация = &Организация
		|	И ЗакрытыеОрганизации.ДатаЗакрытия <= &ДатаЗакрытия
		|	И ЗакрытыеОрганизации.Закрыта";
	
	Запрос.УстановитьПараметр("ДатаЗакрытия", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецЕсли

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Закрыта = ПоискОрганизации(Организация, Дата);
	Если Закрыта Тогда 
		ОбщегоНазначения.СообщитьПользователю("Нельзя проводить заказы по закрытой организации!!!");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры
