////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ НАСТРОЙКИ ПОРЯДКА ЭЛЕМЕНТОВ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	
	//НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
		
	СтрокаПоиска = "";
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтрокаПоиска = ТекДанные.Наименование;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СтрокаПоиска, ОткрытИзФормыСписка", СтрокаПоиска, Истина);
	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбораИзКлассификатора",
		СтруктураПараметров, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоКП(Команда)
	ОткрытьФорму("Справочник.Должности.Форма.ФормаПомощникЗаполненияРеквизитовКП",
		, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗакрытиеФормыПомощника" Тогда
		ЭтаФорма.Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

