
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
 
	Если Параметры.Отбор.Свойство("Номенклатура") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайла(Команда)
	

	ОткрытьФорму("Справочник.НоменклатураПоставщиков.Форма.ФормаЗагрузки",,ЭтаФорма);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

	

#КонецОбласти

&НаКлиенте
Процедура ВставитьИзБуфераОбменаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//ЗагрузитьТоварыИзФайлаНаСервере(АдресЗагруженныхДанных);
	//
	//РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

