
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	#Область СлужебныеПроцедурыИФункции
	
	
	Функция УжеЕстьТерритория(Сотрудник, Ссылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерриторииИсполнителей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТерриторииИсполнителей КАК ТерриторииИсполнителей
		|ГДЕ
		|	ТерриторииИсполнителей.Владелец = &Владелец
		|	И ТерриторииИсполнителей.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();		
		
	КонецФункции
	
	
	#КонецОбласти

	
	#КонецЕсли
