

Функция ВыполнитьЧистку(НаДату,Дней,Ошибки="")	Экспорт 
	ВсЁОк = Истина;
	День = НачалоДня(НаДату)-86400*Дней;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ЧисткаРасcчитанныхПотребностейТовара";
	СтруктураЗаписиЖурнала.КлючОбработки = "ЧисткаРасcчитанныхПотребностейТовара";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТК_РасcчитанныеПотребностиТовара.День КАК День
	|ИЗ
	|	РегистрСведений.ТК_РасcчитанныеПотребностиТовара КАК ТК_РасcчитанныеПотребностиТовара
	|ГДЕ
	|	ТК_РасcчитанныеПотребностиТовара.День < &День
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	
	Запрос.УстановитьПараметр("День", День);
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	Выборка = Результат.Выбрать();
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки. 	Количество найденных Дней	- "+Формат(Выборка.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ОбработаноДней = 0;
	
	НаборЗаписей = РегистрыСведений.ТК_РасcчитанныеПотребностиТовара.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Организация.Установить(УдаляемаяОрганизация);
	//НаборЗаписей.Записать(); 	
	Пока Выборка.Следующий() Цикл 
		
		НаборЗаписей.Отбор.День.Установить(Выборка.День);
		Попытка
			НаборЗаписей.Записать();
			ОбработаноДней = ОбработаноДней + 1;
			РезультатыВыполнения.ДобавитьКомментарий("" + Формат(Выборка.День,"ДФ=dd.MM.yyyy") + " ОК", СтруктураЗаписиЖурнала);
		Исключение
			ВсЁОк = Ложь;
			ОписаниеОшибки = ОписаниеОшибки();
			РезультатыВыполнения.СообщитьОбОшибке("" + Формат(Выборка.День,"ДФ=dd.MM.yyyy") + " Не удалось очистить день по причине:" + ОписаниеОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Сообщить("Не удалось очистить день " + Формат(Выборка.День,"ДФ=dd.MM.yyyy") + " по причине:" + ОписаниеОшибки, СтатусСообщения.Важное);
		КонецПопытки;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество обработанных Дней	- "+Формат(ОбработаноДней,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
	Исключение
		//
	КонецПопытки;
	
	Возврат  ВсЁОк;	
КонецФункции
