
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ДопПараметры = Новый Структура;	
	
	АдресСохраненияРезультата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АдресСохраненияРезультата", Неопределено);
	
	Если ЗначениеЗаполнено(АдресСохраненияРезультата) Тогда 
		ДопПараметры.Вставить("АдресСохраненияРезультата", АдресСохраненияРезультата);
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Документы.ИзменениеЦен.ПолучитьМакет("СхемаКомпоновкиДанных");
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);			
	
	ВыбиратьСМРЦ = Истина;
	ЗаменятьТовары = Ложь;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыбиратьСМРЦПриИзменении(Элемент)
	//ПолучитьНоменклатуруПоОтборуНаСервере();
	//ОбновитьОтображениеИмениГруппы();
КонецПроцедуры


#КонецОбласти	

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
		
	Результат = Новый Структура;
	
	Если Товары.Количество() = 0 Тогда 	
		ПолучитьНоменклатуруПоОтборуНаСервере();
	КонецЕсли;
	
	Если Товары.Количество() > 0 Тогда 
		АдресРезультата = ПолучитьАдресРезультата();
			
		Если ЗначениеЗаполнено(АдресРезультата) Тогда 
			Результат.Вставить("АдресРезультата", АдресРезультата);
		КонецЕсли;
		Если ЗаменятьТовары Тогда 
			Результат.Вставить("ЗаменятьТовары", ЗаменятьТовары);
		КонецЕсли;	
	КонецЕсли;	
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНоменклатуруПоОтбору(Команда)
	ПолучитьНоменклатуруПоОтборуНаСервере();
	ОбновитьОтображениеИмениГруппы();
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАдресРезультата()
	
	Если Товары.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	АдресФормы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "АдресСохраненияРезультата", Новый УникальныйИдентификатор);
	
	ТаблицаТовары = Товары.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаТовары, АдресФормы);
		
КонецФункции

&НаСервере
Процедура ПолучитьНоменклатуруПоОтборуНаСервере()
	
	Товары.Очистить();
	
	СКД = Документы.ИзменениеЦен.ПолучитьМакет("СхемаКомпоновкиДанных");
				
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	ПараметрыНастройки = КомпоновщикНастроек.Настройки.ПараметрыДанных;
		
	//Получим макет компоновки    
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
		
	//Через процессор компоновки получим результат
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
	
	ТаблицаРезультат = Новый ТаблицаЗначений; 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	//Если Не ВыбиратьСМРЦ Тогда 
	//	ТаблицаРезультат.Свернуть("Номенклатура");
	//Иначе
	//	МассивСтрок = ТаблицаРезультат.НайтиСтроки(Новый Структура("ХарактеристикиИспользуются", Истина));
	//	
	//	МассивУдаления = Новый Массив;
	//	Для Каждого Стр Из МассивСтрок Цикл 
	//		Если Не ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда 
	//			ТаблицаРезультат.Удалить(Стр);
	//		КонецЕсли;
	//	КонецЦикла;				
	//КонецЕсли;
	
	Товары.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИмениГруппы()
	
	Заголовок = НСтр("ru = 'Товары'; uk = 'Товари'");
	КоличествоТоваров = Товары.Количество();
	
	Если КоличествоТоваров > 0 Тогда 
		Заголовок = Заголовок + " (" + КоличествоТоваров + ")";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаТовары", "Заголовок", Заголовок);
	
КонецПроцедуры

#КонецОбласти
