&НаСервере
Процедура ЗаполнитьТЧНаСервере(ВыбЗнач)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрМассива Из МассивСтрок Цикл 
		
		СправочникОбъект = СтрМассива.ПолучитьОбъект();
		
		Справочники.ПортативныеУстройстваВвода.ЗаполнитьКонтрагентовПоУстройству(ВыбЗнач,СправочникОбъект.Контрагенты);
		Справочники.ПортативныеУстройстваВвода.ЗаполнитьТоварыПоУстройству(ВыбЗнач,СправочникОбъект.Товары);
		
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
	
	
КонецПроцедуры




&НаКлиенте
Процедура ЗаполнитьТЧ_ПоУстройству(Команда)
	
	Перем ВыбЗнач;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,Параметры);
	ПоказатьВводЗначения(Оповещение,ВыбЗнач,"Введите устройство",Тип("СправочникСсылка.ПортативныеУстройстваВвода"));

КонецПроцедуры


&НаКлиенте
Процедура ПослеВвода(ВыбЗнач,Параметр)Экспорт
	
	Если ВыбЗнач<>Неопределено Тогда
			ЗаполнитьТЧНаСервере(ВыбЗнач);
	КонецЕсли;
	
КонецПроцедуры

