
// Доступные действия
// - Номенклатура
// - ТорговыеПлощадки
// - Продажи
// - Чеки

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьДанные() Экспорт 
	
	УзелОбмена = ОбменPowerBi_ПовтИсп.УзелОбмена();
	Если Не ЗначениеЗаполнено(УзелОбмена) Тогда 
		ВызватьИсключение НСтр("ru = 'Не найден узел обмена для Power Bi'; uk = 'Не знайдений вузол обміну для Power Bi'");
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("УзелОбмена", УзелОбмена);	
	
	ОбработкаВыгрузка = Обработки.ТК_ВыгрузкаДанныхPowerBi.Создать();
	
	ОбработкаВыгрузка.ВыполнитьВыгрузкуНоменклатуры(ПараметрыВыгрузки);	
	ОбработкаВыгрузка.ВыполнитьВыгрузкуОбъекты(ПараметрыВыгрузки);
	
	ПараметрыВыгрузки.Вставить("НеУдалятьРегистрацию", Истина);	
	Отказ = Ложь;
	
	ОбработкаВыгрузка.ВыполнитьВыгрузкуПродажи(ПараметрыВыгрузки, Отказ);
	ОбработкаВыгрузка.ВыполнитьВыгрузкуЧеков(ПараметрыВыгрузки, Отказ);
	
	Если Не Отказ Тогда 
		ОбработкаВыгрузка.УдалитьРегистрациюПродажи(УзелОбмена);
	КонецЕсли;
	
КонецПроцедуры





#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти


#Область ПрочиеПроцедурыИФункции


#КонецОбласти



#КонецЕсли