

Функция ЭтоВнутреннийКонтрагент(Контрагент)Экспорт
	
	Возврат Справочники.Организации.ПроверкаНаВнутреннегоКонтрагента(Контрагент);
	
КонецФункции


Функция ОсновнаяСтрана() Экспорт
	Возврат Справочники.СтраныМира.НайтиПоКоду("804");
КонецФункции

Функция ТерминалПриват()Экспорт
	Возврат Справочники.ЭквайринговыеТерминалы.ТерминалПриват();
КонецФункции


// Возвращает значения дополнительных свойств объектов.
//
// Параметры:
//  Свойства                * ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - значения
//                            которых следует получить.
//                          * Строка - уникальное имя дополнительного свойства.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - свойство.
//    * Значение - Произвольный - значения любого типа из описания типов свойства объекта метаданных:
//                  "Метаданные.ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Тип".
//    * ВладелецСвойств - ЛюбаяСсылка - ссылка на объект.
//
Функция ЗначенияСвойства(Свойство)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство КАК Свойство,
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	(ДополнительныеСведения.Свойство = &Свойство
	|			ИЛИ ДополнительныеСведения.Свойство.Имя = &Свойство)";
	
	Запрос.Параметры.Вставить("Свойство", Свойство);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВМассивТовар(ГуидГруппs,ОтборРеквизит,ОтборЗначение,МассивТовара)Экспорт
	
	Группа = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидГруппs));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.[ОтборРеквизит] = &ОтборЗначение";
	
	Запрос.Параметры.Вставить("Ссылка", Группа);
	Запрос.Параметры.Вставить("ОтборЗначение", ОтборЗначение);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"[ОтборРеквизит]",ОтборРеквизит);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивТовара.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры


