Перем ТекстУстановкиПараметров Экспорт;

Функция дкДобавитьОшибку(Ошибки="",ЕщеСтрока="") Экспорт 
	Ошибки=?(Ошибки="",ЕщеСтрока,Ошибки+Символы.ПС+ЕщеСтрока);
	Возврат(Ошибки);
КонецФункции

Функция СформироватьОтчет(СтрокаУсловий, Сумма, Ошибки, Результат = Неопределено) Экспорт
	ВсеОк = Истина;
	
	Если ТипЗнч(Результат) <> Тип("ТаблицаЗначений") Тогда
		Результат = Новый ТаблицаЗначений;
	КонецЕсли;
	
	УстановитьОтбор(СтрокаУсловий, ВсеОк, Ошибки);	
	
	Если ВсеОк Тогда 
		УстановитьПараметры(СтрокаУсловий, ВсеОк, Ошибки);
	КонецЕсли;
	
	Если ВсеОк Тогда 
		Попытка
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(Результат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
			
			Если Результат.Колонки.Найти("СуммаБазовая") <> Неопределено Тогда
				Сумма = Результат.Итог("СуммаБазовая");
			ИначеЕсли Результат.Колонки.Найти("Сумма") <> Неопределено Тогда
				Сумма = Результат.Итог("Сумма");
			КонецЕсли;
		Исключение
			дкДобавитьОшибку(Ошибки, ОписаниеОшибки());
			Сумма = 0;
			ВсеОк = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВсеОк;
КонецФункции

Процедура УстановитНастройкиИнтерактивно(Объект, Условие, ВсеОк, Ошибки) Экспорт
	Если ЗначениеЗаполнено(Условие.ХранилищеОтборов) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Условие.ХранилищеОтборов);	
	КонецЕсли;
				
	Попытка
		СтрокаXML = ЭтотОбъект.ПолучитьФорму("ФормаНастроек").ОткрытьМодально();
		
		Если СтрокаXML <> Неопределено Тогда
			Условие.ХранилищеОтборов = СтрокаXML;			
		КонецЕсли;
	Исключение
		ВсеОк = Ложь;
		дкДобавитьОшибку(Ошибки, ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура УстановитьПараметры(СтрокаУсловий, ВсеОк,Ошибки) 
	Если ЗначениеЗаполнено(ТекстУстановкиПараметров) Тогда
		Попытка
			Выполнить(ТекстУстановкиПараметров);	
		Исключение
			дкДобавитьОшибку(Ошибки, ОписаниеОшибки());
			ВсеОк = Ложь;
		КонецПопытки;
	Иначе 
		Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
		
		Попытка
			Параметры.Элементы[0].Использование = Истина;
			Параметры.Элементы[0].Значение = НачалоДня(СтрокаУсловий.НачалоРасчета);
			
			Параметры.Элементы[1].Использование = Истина;
			Параметры.Элементы[1].Значение = КонецДня(СтрокаУсловий.КонецРасчета);
			
			Параметры.Элементы[2].Использование = Истина;
			Параметры.Элементы[2].Значение = СтрокаУсловий.Контрагент;
			
			СписокТП = Новый СписокЗначений;
			Тз = СтрокаУсловий.УстановкаМаркетинга.Площадки.Выгрузить();
			СписокТП.ЗагрузитьЗначения(Тз.ВыгрузитьКолонку("ТорговаяПлощадка"));
			Параметры.Элементы[3].Использование = Истина;
			Параметры.Элементы[3].Значение = СписокТП;
			
			Параметры.Элементы[4].Использование = НЕ СтрокаУсловий.Организация.Пустая();
			Параметры.Элементы[4].Значение = СтрокаУсловий.Организация;
			
			Если СтрокаУсловий.УстановкаМаркетинга.СхемаРасчета = Перечисления.СхемыНачисления.ПроцентОтОплат Тогда
				Параметры.Элементы[5].Использование = Истина;
				Параметры.Элементы[5].Значение = Справочники.ХозОперации.БанковскаяВыпискаРасход;
			КонецЕсли;
		Исключение
			дкДобавитьОшибку(Ошибки, ОписаниеОшибки());
			ВсеОк = Ложь;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьОтбор(СтрокаУсловий, ВсеОк, Ошибки)	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	Если Не ВсеОк Тогда 
		Возврат;
	КонецЕсли;  
	
	Попытка
		КомпоновщикНастроек.ЗагрузитьНастройки(СтрокаУсловий.УстановкаМаркетинга.ХранилищеОтборов.Получить());
	Исключение
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецПопытки;
	
КонецПроцедуры

