
Процедура СформироватьОтчеты(ВариантыОтчетов)	Экспорт
	Для Каждого Вариант ИЗ ВариантыОтчетов Цикл
		спВариантыОтчетов = Новый СписокЗначений;
		ЗаполнитьЗначенияСвойств(спВариантыОтчетов.Добавить(),Вариант);
		//спВариантыОтчетов.Добавить(Вариант.Значение,Вариант.Представление,Вариант.Пометка);
		Сформировать(Вариант.Группа, Ложь, спВариантыОтчетов);
	КонецЦикла;
КонецПроцедуры

Процедура Сформировать(Группа,НеКлиент = Истина,спВариантыОтчетов = Неопределено)	Экспорт
	Если Группа = "Приходы по фабрикам" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Приходы по фабрикам");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "ІТЮ - Обсяги продажу" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ІТЮ - Обсяги продажу",Истина);
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи по фабрикам" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи по фабрикам");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Реализация Табака" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Реализация Табака");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = ".ФМУ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			//спВариантыОтчетов.Добавить(Группа,"ФМУ Fich");
			//спВариантыОтчетов.Добавить(Группа,"ФМУ Инструменты");
			//спВариантыОтчетов.Добавить(Группа,"ФМУ Стики БАТ");
			//спВариантыОтчетов.Добавить(Группа,"ФМУ Стики ФМУ");
			//спВариантыОтчетов.Добавить(Группа,"ФМУ Тотал");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Точки Аттики");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи Табак ОПТ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи ОПТа и Дистрибуции","Продажи Табак ОПТ");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "СТИКИ и VELO" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"СТИКИ и VELO");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчет оперативный ежедневный" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Аттика",,БиблиотекаКартинок.Вперед);
			спВариантыОтчетов.Добавить(Группа,"Аттика",,БиблиотекаКартинок.Назад);
			спВариантыОтчетов.Добавить(Группа,"Баффет",,БиблиотекаКартинок.Вперед);
			спВариантыОтчетов.Добавить(Группа,"Баффет",,БиблиотекаКартинок.Назад);
			спВариантыОтчетов.Добавить(Группа,"Табак_Дигма",,БиблиотекаКартинок.Вперед);
			спВариантыОтчетов.Добавить(Группа,"Табак_Дигма",,БиблиотекаКартинок.Назад);
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Новый Шаблон заказа сигарет на РЦ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Харьков");
			спВариантыОтчетов.Добавить(Группа,"Полтава");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Шаблон заказа сигарет на РЦ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Заказ сигарет на РЦ");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Шаблон заказа электронных сигарет на РЦ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Шаблон заказа сигарет на РЦ");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчет по оборачиваемости товара" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ПЛ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаРЦ+ИЕ/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаРЦ+ИЕ/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/Х");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/С");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/П");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/В");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/Х",Истина);
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/С");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/П");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/В");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ПЛ-Роз/");	//	должен быть в конце
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ПЛ-Роз/");	//	должен быть в конце
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчет для совета директоров" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Аттика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Баффет");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-ТабакД");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Фабрика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-ОПТ");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Баффет");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-ТабакД");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-Розница");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-ОПТ");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-РЦ");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Дебиторы Аттики" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Дальность дебиторки Аттика Детальный");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Доступность товара" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Баффет",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Аттика",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Табак-Дигма",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Кур-кума",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Фабрика Сыра",,БиблиотекаКартинок.Записать);
			//спВариантыОтчетов.Добавить(Группа,"Доступность товара Склады РЦ",,БиблиотекаКартинок.Записать);
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли ТипЗнч(Группа) = Тип ("СписокЗначений") И Группа[0].Представление = "Продажи дистрибуции по форме" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции по форме");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи дистрибуции по форме" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
			
			спВариантыОтчетов.Добавить(Период,"Продажи Дистрибуции по форме");
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоМесяца;
			спВариантыОтчетов.Добавить(Период,"Продажи Дистрибуции по форме");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи ОПТа и Дистрибуции" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции Детальный",Истина);
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции Сравнительный",Истина);
			спВариантыОтчетов.Добавить(Группа,"Продажи ОПТа Детальный",Истина);
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Товарооборот и маржа" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Да");
			спВариантыОтчетов.Добавить(Группа,"Нет");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Выкупленный товар" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Выкупленный товар ТС Buffet");
			спВариантыОтчетов.Добавить(Группа,"Выкупленный товар ТС Аттика");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "ФМУ продажи от Миши" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "ИТЮ продажи от Миши" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_ИТЮ_ПродажиОтМиши(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи по ТТ эл.сигарет" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя");
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи по ТТ эл.сигарет_Месяц" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи по ТТ эл.сигарет","ПрошлыйМесяц");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи по ТТ эл.сигарет_Неделя" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи по ТТ эл.сигарет","ПрошлаяНеделя");
		КонецЕсли;
		
		Запустить(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты БАТ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлаяНеделя");
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты БАТ_Неделя" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлаяНеделя");
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты БАТ_Месяц" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты JTI" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты JTI_Неделя" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты JTI_Месяц" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов);
	ИначеЕсли Группа = "Приходы табака по поставщикам" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам","ПрошлаяНеделя");
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_ПриходыТабакаПоПоставщикам(спВариантыОтчетов, Ложь);
	ИначеЕсли Группа = "Приходы табака по поставщикам тыс.шт" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам тыс.шт","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам тыс.шт","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_ПриходыТабакаПоПоставщикам(спВариантыОтчетов, Истина);
	ИначеЕсли Группа = "Аналитика дистрибуции" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Аналитика дистрибуции","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_АналитикаДистрибуции(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи ТОП 100" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи ТОП 100","ПрошлаяНеделя",Истина);
			спВариантыОтчетов.Добавить("Продажи ТОП 100","ПрошлыйМесяц",Истина);
		КонецЕсли;
		
		ЗапуститьОтчеты_ПродажиТОП100(спВариантыОтчетов);
	ИначеЕсли Группа = "ФИЧ продажи от Миши" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ФИЧ продажи от Миши","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
		КонецЕсли;
		
		ЗапуститьОтчеты_ФИЧ_ПродажиОтМиши(спВариантыОтчетов);
	ИначеЕсли Группа = "для ИТЮ продажи" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьОтчеты_ДляИТЮ_Продажи(спВариантыОтчетов);
	ИначеЕсли Группа = "Остатки на РЦ для ФМУ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Остатки для ФМУ","СНачалаЭтогоМесяца");
		КонецЕсли;
		
		ЗапуститьОтчеты_ДляФМУ_ОстаткиНаРЦ(спВариантыОтчетов);
	ИначеЕсли Группа = "ФИЧ сводный" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"НачалоЭтогоДня");
		КонецЕсли;
		
		ЗапуститьОтчеты_СводныйФИЧ(спВариантыОтчетов);
	ИначеЕсли Группа = "Сводная реализация по ТМ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Сводная реализация по ТМ","ПрошлыйМесяц",Истина);
			спВариантыОтчетов.Добавить("Сводная реализация по ТМ","СНачалаЭтогоГода",Истина);
		КонецЕсли;
		
		ЗапуститьОтчеты_СводнаяРеализацияПоТМ(спВариантыОтчетов);
	ИначеЕсли Группа = "Продажи розницы для ИТЮ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи розницы для ИТЮ","ПрошлыйМесяц");
		КонецЕсли;
		
		ЗапуститьПродажиРозницыДляИТЮ(спВариантыОтчетов);
	ИначеЕсли Группа = "ТБД" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Buffet","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Аттика","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Табак-Дигма","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Фабрика Сыра","НачалоПрошлогоДня");
		КонецЕсли;
		
		ЗапуститьТоварыБезПродажНовыйПлоский(спВариантыОтчетов);
	ИначеЕсли Группа = "Отчеты ФМУ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Проверка продукции ФМУ");
			спВариантыОтчетов.Добавить("ОтчетыЕжедневные");
			//спВариантыОтчетов.Добавить("ОтчетНедельный","0 БЕЗ ЗАДЕРЖЕК");
			//спВариантыОтчетов.Добавить("ОтчетыМесячные","0 БЕЗ ЗАДЕРЖЕК");
			//спВариантыОтчетов.Добавить("ОтчетыМесячные","1 МЕС ЗАДЕРЖКИ");
			//спВариантыОтчетов.Добавить("ОтчетыМесячные","3 МЕС ЗАДЕРЖКИ");
			//спВариантыОтчетов.Добавить("ОтчетыМесячные","6 МЕС ЗАДЕРЖКИ");
		КонецЕсли;
		
		ЗапуститьОтчеты_ФМУ(спВариантыОтчетов);
		
	ИначеЕсли Группа = "Остатки ИТЮ" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Остатки ИТЮ","ПрошлаяНеделя");
		КонецЕсли;
		
		ЗапуститьОтчеты_ОстаткиИТЮ(спВариантыОтчетов);
		
	ИначеЕсли Группа = "Новые клиенты Дистрибуции" Тогда
		Если НеКлиент Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя",Истина );
		КонецЕсли;
		
		ЗапуститьОтчеты_НовыеКлиентыДистрибуции(спВариантыОтчетов);
		
	КонецЕсли;
	
КонецПроцедуры

/////////-----000-----/////////

Функция ПолучитьПриходыПоФабрикам(НачалоПериода,КонецПериода,Поставщики,Номенклатура,ТоварнаяМарка)
	
	ТМ_ЛьвовШТ = Справочники.ТоварныеМарки.НайтиПоКоду("Т701");
	Тедис = Новый СписокЗначений;
	Тедис.Добавить(Справочники.Контрагенты.НайтиПоКоду("30622532"));
	Тедис.Добавить(Справочники.Контрагенты.НайтиПоКоду("44895101"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент В (&Тедис)
	|			ТОГДА ""Тедис""
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.КодПоЕДРПОУ = ""36497264""
	|			ТОГДА ""Галичина-Табак""
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.КодПоЕДРПОУ = ""44624498""
	|			ТОГДА ""Глобал Тобакко""
	|		ИНАЧЕ ""Фабрика""
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Код = ""В869""
	|			ТОГДА ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка
	|		ИНАЧЕ ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|	КОНЕЦ КАК ТоварнаяМаркаРодитель,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка = &ЛьвовШТ
	|				ТОГДА ПартииТоваровКомпанииОбороты.КоличествоПриход / 20
	|			ИНАЧЕ ПартииТоваровКомпанииОбороты.КоличествоПриход
	|		КОНЕЦ) КАК КоличествоПриход,
	|	СУММА(ПартииТоваровКомпанииОбороты.СуммаПриход) КАК СуммаПриход,
	|	ПартииТоваровКомпанииОбороты.Номенклатура.Родитель КАК НоменклатураРодитель
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)) КАК ПартииТоваровКомпанииОбороты
	|ГДЕ
	|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент В(&Контрагент)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОбороты.Номенклатура.Родитель,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Код = ""В869""
	|			ТОГДА ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка
	|		ИНАЧЕ ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент В (&Тедис)
	|			ТОГДА ""Тедис""
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.КодПоЕДРПОУ = ""36497264""
	|			ТОГДА ""Галичина-Табак""
	|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.КодПоЕДРПОУ = ""44624498""
	|			ТОГДА ""Глобал Тобакко""
	|		ИНАЧЕ ""Фабрика""
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поставщик,
	|	ТоварнаяМаркаРодитель,
	|	НоменклатураРодитель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТоварнаяМарка", ТоварнаяМарка);
	Запрос.УстановитьПараметр("Контрагент", Поставщики);
	Запрос.УстановитьПараметр("ЛьвовШТ", ТМ_ЛьвовШТ);
	Запрос.УстановитьПараметр("Тедис", Тедис);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьОбсягиПродажу(НачалоПериода,КонецПериода,Номенклатура,ТоварнаяМарка)
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	//ТоварнаяМарка_ЛьвовШТ = Справочники.ТоварныеМарки.НайтиПоКоду("Т701");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Регистратор.Организация КАК Организация,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель КАК ТМ_Родитель,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Колво
	|ПОМЕСТИТЬ ПродажиОбщие
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозОперация В (&ХозОперация)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ИскТоварнаяМарка)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель,
	|	ПродажиОбороты.Регистратор.Организация,
	|	ПродажиОбороты.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация,
	|	КонсолидированныеПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель,
	|	КонсолидированныеПродажиОбороты.Номенклатура,
	|	СУММА(КонсолидированныеПродажиОбороты.КоличествоОборот)
	|ИЗ
	|	РегистрНакопления.КонсолидированныеПродажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ИскТоварнаяМарка)) КАК КонсолидированныеПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(&КонецПериода, ) КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	|		ПО КонсолидированныеПродажиОбороты.СкладКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонсолидированныеПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель,
	|	КонсолидированныеПродажиОбороты.Номенклатура,
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбщие.Организация КАК Организация,
	|	ПродажиОбщие.ТМ_Родитель КАК ТМ_Родитель,
	|	ПродажиОбщие.Номенклатура КАК Номенклатура,
	|	СУММА(ПродажиОбщие.Колво) КАК Колво,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК ЧИСЛО), 0) КАК Значение,
	|	СУММА(ПродажиОбщие.Колво * (ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК ЧИСЛО)) / 1000) КАК Т_ШТ_Сиг
	|ИЗ
	|	ПродажиОбщие КАК ПродажиОбщие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ПродажиОбщие.Номенклатура = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбщие.Номенклатура,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК ЧИСЛО), 0),
	|	ПродажиОбщие.Организация,
	|	ПродажиОбщие.ТМ_Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ТМ_Родитель,
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ИскТоварнаяМарка", ТоварнаяМарка);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
	//Запрос.УстановитьПараметр("ЛьвовШТ", ТоварнаяМарка_ЛьвовШТ);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьПродажиПоФабрикам(НачалоПериода,КонецПериода,Номенклатура,ТоварнаяМарка)
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	ХозОперацияОпт = Новый СписокЗначений;
	ХозОперацияОпт.Добавить(Справочники.ХозОперации.РеализацияТоваров);
	ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
	
	ТМ_ЛьвовШТ = Справочники.ТоварныеМарки.НайтиПоКоду("Т701");
	
	Менеджеры = Новый СписокЗначений;
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
	
	ПокупателиДистр = Новый СписокЗначений;
	ПокупателиДистр.Добавить(Справочники.Контрагенты.НайтиПоКоду("41146737"));	//	Градус-17 ООО
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Розн_ПродажиОбороты.Номенклатура.Родитель КАК Номенклатура,
	|	Розн_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель КАК ТоварнаяМаркаРодитель,
	|	Розн_ПродажиОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	|	СУММА(ВЫБОР
	|			КОГДА Розн_ПродажиОбороты.Номенклатура.ТоварнаяМарка = &ЛьвовШТ
	|				ТОГДА Розн_ПродажиОбороты.КоличествоОборот / 20
	|			ИНАЧЕ Розн_ПродажиОбороты.КоличествоОборот
	|		КОНЕЦ) КАК РозницаКолво,
	|	0 КАК ОптКолво,
	|	0 КАК ДистрибКолво
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперацияРозн)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)) КАК Розн_ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Розн_ПродажиОбороты.Номенклатура.Родитель,
	|	Розн_ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	Розн_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Опт_ПродажиОбороты.Номенклатура.Родитель,
	|	Опт_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель,
	|	Опт_ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА Опт_ПродажиОбороты.Номенклатура.ТоварнаяМарка = &ЛьвовШТ
	|				ТОГДА Опт_ПродажиОбороты.КоличествоОборот / 20
	|			ИНАЧЕ Опт_ПродажиОбороты.КоличествоОборот
	|		КОНЕЦ),
	|	0
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперацияОпт)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)
	|				И НЕ ДоговорВзаиморасчетов.Менеджер В ИЕРАРХИИ (&Менеджер)
	|				И НЕ Покупатель В ИЕРАРХИИ (&Покупатель)
	|				И Покупатель.ВидКонтрагента <> ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)) КАК Опт_ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Опт_ПродажиОбороты.Номенклатура.Родитель,
	|	Опт_ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	Опт_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Дистр_ПродажиОбороты.Номенклатура.Родитель,
	|	Дистр_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель,
	|	Дистр_ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	0,
	|	0,
	|	СУММА(ВЫБОР
	|			КОГДА Дистр_ПродажиОбороты.Номенклатура.ТоварнаяМарка = &ЛьвовШТ
	|				ТОГДА Дистр_ПродажиОбороты.КоличествоОборот / 20
	|			ИНАЧЕ Дистр_ПродажиОбороты.КоличествоОборот
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперацияОпт)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)
	|				И (ДоговорВзаиморасчетов.Менеджер В ИЕРАРХИИ (&Менеджер)
	|					ИЛИ Покупатель В ИЕРАРХИИ (&Покупатель))
	|				И Покупатель.ВидКонтрагента <> ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)) КАК Дистр_ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Дистр_ПродажиОбороты.Номенклатура.Родитель,
	|	Дистр_ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	Дистр_ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ТоварнаяМаркаРодитель,
	|	ТоварнаяМарка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТоварнаяМарка", ТоварнаяМарка);
	Запрос.УстановитьПараметр("ХозОперацияРозн", ХозОперацияРозница);
	Запрос.УстановитьПараметр("ХозОперацияОпт", ХозОперацияОпт);
	Запрос.УстановитьПараметр("Менеджер", Менеджеры);
	Запрос.УстановитьПараметр("Покупатель", ПокупателиДистр);
	Запрос.УстановитьПараметр("ЛьвовШТ", ТМ_ЛьвовШТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьРеализацию(НачалоПериода,КонецПериода,Номенклатура,ТоварнаяМарка)
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	ТоварнаяМарка_ЛьвовШТ = Справочники.ТоварныеМарки.НайтиПоКоду("Т701");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура.Родитель КАК Номенклатура,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель КАК ТоварнаяМаркаРодитель,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.Номенклатура.ТоварнаяМарка = &ЛьвовШТ
	|				ТОГДА ПродажиОбороты.КоличествоОборот / 20
	|			ИНАЧЕ ПродажиОбороты.КоличествоОборот
	|		КОНЕЦ) КАК Колво,
	|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперация)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура.Родитель,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка.Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ТоварнаяМаркаРодитель,
	|	ТоварнаяМарка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТоварнаяМарка", ТоварнаяМарка);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
	Запрос.УстановитьПараметр("ЛьвовШТ", ТоварнаяМарка_ЛьвовШТ);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьВыкупленныйТовар(НаДату,Подразделение)
	
	Табак = Новый СписокЗначений;
	Табак.Добавить(Справочники.Контрагенты.НайтиПоКоду("36929041"));	//	Марвел ТД
	Табак.Добавить(Справочники.Контрагенты.НайтиПоКоду("30622532"));	//	Тедис Украина ООО
	
	НеНоменклатура = Справочники.Номенклатура.НайтиПоКоду("D0000100");	//	Тара
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоДокументамОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов КАК Договор,
	|	СУММА(РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток) КАК Кредиторка,
	|	СУММА(0) КАК Остаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&НаДату, ДоговорВзаиморасчетов.Подразделение В (&Подразделение)) КАК РасчетыСПоставщикамиПоДокументамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиПоДокументамОстатки.Контрагент,
	|	РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.Партия.Контрагент,
	|	ПартииТоваровКомпанииОстатки.Партия.ДоговорВзаиморасчетов,
	|	СУММА(0),
	|	СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток)
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&НаДату,
	|			СкладКомпании.Подразделение В (&Подразделение)
	|				И Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				И НЕ Номенклатура В ИЕРАРХИИ (&НеНоменклатура)) КАК ПартииТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОстатки.Партия.Контрагент,
	|	ПартииТоваровКомпанииОстатки.Партия.ДоговорВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Контрагент КАК Контрагент,
	|	СУММА(ВТ.Кредиторка) КАК Кредиторка,
	|	СУММА(ВТ.Остаток) КАК Остаток,
	|	СУММА(ВТ.Кредиторка + ВТ.Остаток) КАК Дельта,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ.Кредиторка) + СУММА(ВТ.Остаток) > 0
	|			ТОГДА СУММА(ВТ.Кредиторка) + СУММА(ВТ.Остаток)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Выкуп,
	|	ВЫБОР
	|		КОГДА ВТ.Контрагент В (&Табак)
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ВТ.Кредиторка) + СУММА(ВТ.Остаток) > 0
	|						ТОГДА СУММА(ВТ.Кредиторка) + СУММА(ВТ.Остаток)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Табак,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Договор.Менеджер КАК Менеджер
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Контрагент,
	|	ВТ.Договор,
	|	ВТ.Договор.Менеджер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Табак", Табак);
	Запрос.УстановитьПараметр("НеНоменклатура", НеНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьПродажиПоТТ1(НачалоПериода,КонецПериода,Номенклатура)
	
	ТМ = Новый СписокЗначений;
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В889"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В423"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В905"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В906"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В907"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф17"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф21"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В922"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В908"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В868"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В955"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В921"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("А301"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("А309"),1200);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В902"),800);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В909"),800);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В879"),800);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В822"),800);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф13"),800);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В903"),300);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В904"),300);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В871"),300);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В875"),300);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В869"),300);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В876"),0);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В847"),0);
	ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В246"),0);
	
	Затяжки = Новый ТаблицаЗначений;
	Затяжки.Колонки.Добавить("Марка",Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
	Затяжки.Колонки.Добавить("Затяжек",Новый ОписаниеТипов("Число"));
	
	Для Каждого эл Из ТМ Цикл
		строка = Затяжки.Добавить();
		строка.Затяжек = Число(эл.Представление);
		строка.Марка = эл.Значение;
	КонецЦикла;
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	Менеджеры = Новый СписокЗначений;
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
	
	ПодразделениеАттика = Новый СписокЗначений;
	ПодразделениеАттика.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"));	//	ТС Аттика
	ПодразделениеАттика.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"));	//	ТС Табак-Дигма
	
	ПодразделениеКиев = Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008");			//	ТС Buffet
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Затяжки.Марка КАК Марка,
	|	Затяжки.Затяжек КАК Затяжек
	|ПОМЕСТИТЬ Затяжки
	|ИЗ
	|	&Затяжки КАК Затяжки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПродажиОбороты.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	|	ПродажиОбороты.ДоговорВзаиморасчетов.Менеджер КАК Менеджер,
	|	ПродажиОбороты.ХозОперация КАК ХозОперация,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиАттика.ТоварнаяМарка КАК ТоварнаяМарка,
	|	СУММА(ПродажиАттика.КоличествоОборот) КАК ПродажиАттика,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиАттика.ТорговаяПлощадка) КАК КоличествоТТ,
	|	СУММА(0) КАК ПродажиКиев,
	|	СУММА(0) КАК ПродажиДистриб
	|ПОМЕСТИТЬ втПромежуточная
	|ИЗ
	|	втПродажи КАК ПродажиАттика
	|ГДЕ
	|	ПродажиАттика.ПодразделениеКомпании В(&ПодразделениеАттика)
	|	И ПродажиАттика.ХозОперация В(&ХозОперацияРозница)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиАттика.ТоварнаяМарка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиКиев.ТоварнаяМарка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ПродажиКиев.КоличествоОборот),
	|	СУММА(0)
	|ИЗ
	|	втПродажи КАК ПродажиКиев
	|ГДЕ
	|	ПродажиКиев.ПодразделениеКомпании В(&ПодразделениеКиев)
	|	И ПродажиКиев.ХозОперация В(&ХозОперацияРозница)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиКиев.ТоварнаяМарка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиДистриб.ТоварнаяМарка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ПродажиДистриб.КоличествоОборот)
	|ИЗ
	|	втПродажи КАК ПродажиДистриб
	|ГДЕ
	|	ПродажиДистриб.Менеджер В(&Менеджер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиДистриб.ТоварнаяМарка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПромежуточная.ТоварнаяМарка.Код КАК ТоварнаяМаркаКод,
	|	ЕСТЬNULL(Затяжки.Марка, втПромежуточная.ТоварнаяМарка) КАК ТоварнаяМарка,
	|	СУММА(втПромежуточная.ПродажиАттика) КАК ПродажиАттика,
	|	СУММА(втПромежуточная.КоличествоТТ) КАК КоличествоТТ,
	|	СУММА(втПромежуточная.ПродажиКиев) КАК ПродажиКиев,
	|	СУММА(втПромежуточная.ПродажиДистриб) КАК ПродажиДистриб,
	|	ЕСТЬNULL(Затяжки.Затяжек, 0) КАК Затяжек
	|ИЗ
	|	Затяжки КАК Затяжки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втПромежуточная КАК втПромежуточная
	|		ПО Затяжки.Марка = втПромежуточная.ТоварнаяМарка
	|
	|СГРУППИРОВАТЬ ПО
	|	втПромежуточная.ТоварнаяМарка.Код,
	|	ЕСТЬNULL(Затяжки.Затяжек, 0),
	|	ЕСТЬNULL(Затяжки.Марка, втПромежуточная.ТоварнаяМарка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Затяжек УБЫВ,
	|	ТоварнаяМарка
	|ИТОГИ ПО
	|	Затяжек
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Затяжки", Затяжки);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХозОперацияРозница", ХозОперацияРозница);
	Запрос.УстановитьПараметр("Менеджер", Менеджеры);
	Запрос.УстановитьПараметр("ПодразделениеАттика", ПодразделениеАттика);
	Запрос.УстановитьПараметр("ПодразделениеКиев", ПодразделениеКиев);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// РезультатЗапроса.Выгрузить();
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьПродажиПоТТ(НачалоПериода,КонецПериода,Номенклатура)
	
	МаркаChillLab = Справочники.ТоварныеМарки.НайтиПоКоду("Ф496");
	МаркаМаноли1 = Справочники.ТоварныеМарки.НайтиПоКоду("ФС00034");
	МаркаМаноли2 = Справочники.ТоварныеМарки.НайтиПоКоду("Ф931");
	ТМ = Новый СписокЗначений;
	ТМ.Добавить(МаркаChillLab);
	ТМ.Добавить(МаркаМаноли1);
	ТМ.Добавить(МаркаМаноли2);
	
	//ТМ = Новый СписокЗначений;
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В889"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В423"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В905"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В906"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В907"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф17"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф21"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В922"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В908"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В868"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В955"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В921"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("А301"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("А309"),1200);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В902"),800);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В909"),800);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В879"),800);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В822"),800);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф13"),800);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В903"),300);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В904"),300);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В871"),300);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В875"),300);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В869"),300);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В876"),0);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В847"),0);
	//ТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В246"),0);
	//
	//Затяжки = Новый ТаблицаЗначений;
	//Затяжки.Колонки.Добавить("Марка",Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
	//Затяжки.Колонки.Добавить("Затяжек",Новый ОписаниеТипов("Число"));
	//
	//Для Каждого эл Из ТМ Цикл
	//	строка = Затяжки.Добавить();
	//	строка.Затяжек = Число(эл.Представление);
	//	строка.Марка = эл.Значение;
	//КонецЦикла;
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	Менеджеры = Новый СписокЗначений;
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
	Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
	
	ПодразделениеАттика = Новый СписокЗначений;
	ПодразделениеАттика.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"));	//	ТС Аттика
	ПодразделениеАттика.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"));	//	ТС Табак-Дигма
	
	ПодразделениеКиев = Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008");			//	ТС Buffet
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоличествоЗатяжек.Марка КАК Марка,
	|	ВЫБОР
	|		КОГДА КоличествоЗатяжек.Затяжек = 0
	|			ТОГДА 0
	|		КОГДА КоличествоЗатяжек.Затяжек > 800
	|			ТОГДА 1200
	|		КОГДА КоличествоЗатяжек.Затяжек < 800
	|			ТОГДА 300
	|		ИНАЧЕ 800
	|	КОНЕЦ КАК Затяжек
	|ПОМЕСТИТЬ Затяжки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДополнительныеСведения.Объект КАК Марка,
	|		ДополнительныеСведения.Значение КАК Затяжек
	|	ИЗ
	|		РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|	ГДЕ
	|		ДополнительныеСведения.Свойство.Имя = ""КоличествоЗатяжек"") КАК КоличествоЗатяжек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПродажиОбороты.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	|	ПродажиОбороты.ДоговорВзаиморасчетов.Менеджер КАК Менеджер,
	|	ПродажиОбороты.ХозОперация КАК ХозОперация,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ПродажиОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиОбороты.ПодразделениеКомпании,
	|	ПродажиОбороты.ТорговаяПлощадка,
	|	ПродажиОбороты.Номенклатура.ТоварнаяМарка,
	|	ПродажиОбороты.ДоговорВзаиморасчетов.Менеджер,
	|	ПродажиОбороты.ХозОперация,
	|	ПродажиОбороты.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиАттика.ТоварнаяМарка КАК ТоварнаяМарка,
	|	СУММА(ПродажиАттика.КоличествоОборот) КАК ПродажиАттика,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиАттика.ТорговаяПлощадка) КАК КоличествоТТ,
	|	СУММА(0) КАК ПродажиКиев,
	|	СУММА(0) КАК ПродажиДистриб
	|ПОМЕСТИТЬ втПромежуточная
	|ИЗ
	|	втПродажи КАК ПродажиАттика
	|ГДЕ
	|	ПродажиАттика.ПодразделениеКомпании В(&ПодразделениеАттика)
	|	И ПродажиАттика.ХозОперация В(&ХозОперацияРозница)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиАттика.ТоварнаяМарка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиКиев.ТоварнаяМарка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ПродажиКиев.КоличествоОборот),
	|	СУММА(0)
	|ИЗ
	|	втПродажи КАК ПродажиКиев
	|ГДЕ
	|	ПродажиКиев.ПодразделениеКомпании В(&ПодразделениеКиев)
	|	И ПродажиКиев.ХозОперация В(&ХозОперацияРозница)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиКиев.ТоварнаяМарка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиДистриб.ТоварнаяМарка,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ПродажиДистриб.КоличествоОборот)
	|ИЗ
	|	втПродажи КАК ПродажиДистриб
	|ГДЕ
	|	ПродажиДистриб.Менеджер В(&Менеджер)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиДистриб.ТоварнаяМарка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Затяжки.Марка, втПромежуточная.ТоварнаяМарка) КАК ТоварнаяМарка,
	|	СУММА(втПромежуточная.ПродажиАттика) КАК ПродажиАттика,
	|	СУММА(втПромежуточная.КоличествоТТ) КАК КоличествоТТ,
	|	СУММА(втПромежуточная.ПродажиКиев) КАК ПродажиКиев,
	|	СУММА(втПромежуточная.ПродажиДистриб) КАК ПродажиДистриб,
	|	Затяжки.Затяжек КАК Затяжек
	|ПОМЕСТИТЬ Итого
	|ИЗ
	|	Затяжки КАК Затяжки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втПромежуточная КАК втПромежуточная
	|		ПО Затяжки.Марка = втПромежуточная.ТоварнаяМарка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(Затяжки.Марка, втПромежуточная.ТоварнаяМарка),
	|	Затяжки.Затяжек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итого.ТоварнаяМарка.Код КАК ТоварнаяМаркаКод,
	|	Итого.ТоварнаяМарка КАК ТоварнаяМарка,
	|	СУММА(Итого.ПродажиАттика) КАК ПродажиАттика,
	|	СУММА(Итого.КоличествоТТ) КАК КоличествоТТ,
	|	СУММА(Итого.ПродажиКиев) КАК ПродажиКиев,
	|	СУММА(Итого.ПродажиДистриб) КАК ПродажиДистриб,
	|	Итого.Затяжек КАК Затяжек
	|ИЗ
	|	Итого КАК Итого
	|
	|СГРУППИРОВАТЬ ПО
	|	Итого.ТоварнаяМарка.Код,
	|	Итого.ТоварнаяМарка,
	|	Итого.Затяжек
	|
	|УПОРЯДОЧИТЬ ПО
	|	Затяжек УБЫВ,
	|	ТоварнаяМарка
	|ИТОГИ ПО
	|	Затяжек
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//Запрос.УстановитьПараметр("Затяжки", Затяжки);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХозОперацияРозница", ХозОперацияРозница);
	Запрос.УстановитьПараметр("Менеджер", Менеджеры);
	Запрос.УстановитьПараметр("ПодразделениеАттика", ПодразделениеАттика);
	Запрос.УстановитьПараметр("ПодразделениеКиев", ПодразделениеКиев);
	Запрос.УстановитьПараметр("ТоварнаяМарка", ТМ );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// РезультатЗапроса.Выгрузить()
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьПриходыТабакаПоПоставщикам(НачалоПериода,КонецПериода,Поставщики,ТысШт)
	
	Тедис = Новый СписокЗначений;
	Тедис.Добавить(Справочники.Контрагенты.НайтиПоКоду("30622532"));
	Тедис.Добавить(Справочники.Контрагенты.НайтиПоКоду("44895101"));
	
	
	Киев	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000118");
	КиевРЦ	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000322");
	Полтава	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000300");
	Сумы	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000153");
	
	Запрос = Новый Запрос;
	Если ТысШт Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент В (&Тедис)
		|			ТОГДА ""Тедис""
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код = ""36497264""
		|			ТОГДА ""Галичина-Табак""
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код = ""44624498""
		|			ТОГДА ""Глобал Тобакко""
		|		ИНАЧЕ ""Фабрики""
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Киев)
		|			ТОГДА ""Киев""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&КиевРЦ)
		|			ТОГДА ""Киев""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Полтава)
		|			ТОГДА ""Полтава""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Сумы)
		|			ТОГДА ""Сумы""
		|		ИНАЧЕ ""Харьков""
		|	КОНЕЦ КАК Город,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.Родитель КАК НоменклатураРодитель,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Родитель КАК МаркаРодитель,
		|	ПартииТоваровКомпанииОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ЕСТЬNULL(ДопСвКоэффициентПачки.Значение, 0) КАК КоэффициентПачки,
		|	ПартииТоваровКомпанииОбороты.КоличествоПриход * (ВЫРАЗИТЬ(ЕСТЬNULL(ДопСвКоэффициентПачки.Значение, 0) КАК ЧИСЛО(5, 0))) / 1000 КАК КоличествоПриходТысШт
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПартииТоваровКомпанииОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСвКоэффициентПачки
		|		ПО (ДопСвКоэффициентПачки.Объект ССЫЛКА Справочник.Номенклатура)
		|			И ПартииТоваровКомпанииОбороты.Номенклатура = ДопСвКоэффициентПачки.Объект
		|			И (ДопСвКоэффициентПачки.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
		|ГДЕ
		|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент В(&Контрагент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Поставщик КАК Поставщик,
		|	ВТ.Город КАК Город,
		|	ВТ.НоменклатураРодитель КАК НоменклатураРодитель,
		|	ВТ.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ВТ.МаркаРодитель КАК МаркаРодитель,
		|	СУММА(ВТ.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ.КоличествоПриходТысШт) КАК КоличествоПриходЯщики,
		|	ВТ.КоэффициентПачки КАК КоэффициентПачки
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Поставщик,
		|	ВТ.Город,
		|	ВТ.НоменклатураРодитель,
		|	ВТ.ТоварнаяМарка,
		|	ВТ.МаркаРодитель,
		|	ВТ.КоэффициентПачки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поставщик,
		|	Город";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент В (&Тедис)
		|			ТОГДА ""Тедис""
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код = ""36497264""
		|			ТОГДА ""Галичина-Табак""
		|		КОГДА ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код = ""44624498""
		|			ТОГДА ""Глобал Тобакко""
		|		ИНАЧЕ ""Фабрики""
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Киев)
		|			ТОГДА ""Киев""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&КиевРЦ)
		|			ТОГДА ""Киев""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Полтава)
		|			ТОГДА ""Полтава""
		|		КОГДА ПартииТоваровКомпанииОбороты.СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&Сумы)
		|			ТОГДА ""Сумы""
		|		ИНАЧЕ ""Харьков""
		|	КОНЕЦ КАК Город,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.Родитель КАК НоменклатураРодитель,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.ТоварнаяМарка.Родитель КАК МаркаРодитель,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент КАК КоэффициентЯщика,
		|	ПартииТоваровКомпанииОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ПартииТоваровКомпанииОбороты.КоличествоПриход / ЕСТЬNULL(ПартииТоваровКомпанииОбороты.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 1) КАК КоличествоПриходЯщики
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПартииТоваровКомпанииОбороты
		|ГДЕ
		|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент В(&Контрагент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Поставщик КАК Поставщик,
		|	ВТ.Город КАК Город,
		|	ВТ.НоменклатураРодитель КАК НоменклатураРодитель,
		|	ВТ.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ВТ.МаркаРодитель КАК МаркаРодитель,
		|	ВТ.КоэффициентЯщика КАК КоэффициентЯщика,
		|	СУММА(ВТ.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(ВТ.КоличествоПриходЯщики) КАК КоличествоПриходЯщики
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.КоэффициентЯщика,
		|	ВТ.Поставщик,
		|	ВТ.Город,
		|	ВТ.НоменклатураРодитель,
		|	ВТ.ТоварнаяМарка,
		|	ВТ.МаркаРодитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поставщик,
		|	Город";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Контрагент", Поставщики);
	Запрос.УстановитьПараметр("Тедис", Тедис);
	Запрос.УстановитьПараметр("Киев", Киев);
	Запрос.УстановитьПараметр("КиевРЦ", КиевРЦ);
	Запрос.УстановитьПараметр("Полтава", Полтава);
	Запрос.УстановитьПараметр("Сумы", Сумы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьАналитикаДистрибуции(НачалоПериода,КонецПериода)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду("10070");	//	Табачные изделия и аксессуары
	СигаретыСигары = Справочники.Номенклатура.НайтиПоКоду("10050");	//	Сигареты, сигары
	
	МенеджерыФедоренко = Новый СписокЗначений;
	МенеджерыФедоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
	МенеджерыФедоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
	МенеджерыФедоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
	МенеджерыФедоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
	МенеджерыФедоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
	
	МенеджерыКайданов = Новый СписокЗначений;
	МенеджерыКайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
	МенеджерыКайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
	МенеджерыКайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.Ссылка.РегламентированныйУчет КАК РегламентированныйУчет,
	|	РеализацияТоваровТовары.Ссылка.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	РеализацияТоваровТовары.Ссылка.ДоговорВзаиморасчетов.Менеджер КАК Менеджер,
	|	РеализацияТоваровТовары.Ссылка.ТочкаДоставки КАК ТочкаДоставки,
	|	РеализацияТоваровТовары.Номенклатура.Родитель КАК Номенклатура,
	|	РеализацияТоваровТовары.СуммаВсего КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровТовары.Ссылка.Проведен
	|	И РеализацияТоваровТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратОтПокупателяТовары.Ссылка.РегламентированныйУчет,
	|	ВозвратОтПокупателяТовары.Ссылка.ТорговаяПлощадка,
	|	ВозвратОтПокупателяТовары.Ссылка.ДоговорВзаиморасчетов.Менеджер,
	|	ВозвратОтПокупателяТовары.Ссылка.ТочкаДоставки,
	|	ВозвратОтПокупателяТовары.Номенклатура.Родитель,
	|	-ВозвратОтПокупателяТовары.СуммаВсего
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	|ГДЕ
	|	ВозвратОтПокупателяТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратОтПокупателяТовары.Ссылка.Проведен
	|	И ВозвратОтПокупателяТовары.Номенклатура В ИЕРАРХИИ(&Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК Учет,
	|	ВТ.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|			ТОГДА ""Федоренко""
	|		КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|			ТОГДА ""Кайданов""
	|		ИНАЧЕ ""Прочий""
	|	КОНЕЦ КАК Менеджер,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.ТочкаДоставки) КАК ТочкаДоставки,
	|	0 КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|				ТОГДА ""Федоренко""
	|			КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|				ТОГДА ""Кайданов""
	|			ИНАЧЕ ""Прочий""
	|		КОНЕЦ <> ""Прочий""
	|	И ВТ.Номенклатура В ИЕРАРХИИ(&СигаретыСигары)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|			ТОГДА ""Федоренко""
	|		КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|			ТОГДА ""Кайданов""
	|		ИНАЧЕ ""Прочий""
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.РегламентированныйУчет,
	|	ВТ.ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|			ТОГДА ""Федоренко""
	|		КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|			ТОГДА ""Кайданов""
	|		ИНАЧЕ ""Прочий""
	|	КОНЕЦ,
	|	0,
	|	СУММА(ВТ.Сумма)
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|				ТОГДА ""Федоренко""
	|			КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|				ТОГДА ""Кайданов""
	|			ИНАЧЕ ""Прочий""
	|		КОНЕЦ <> ""Прочий""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТорговаяПлощадка,
	|	ВТ.РегламентированныйУчет,
	|	ВЫБОР
	|		КОГДА ВТ.Менеджер В (&МенеджерыФедоренко)
	|			ТОГДА ""Федоренко""
	|		КОГДА ВТ.Менеджер В (&МенеджерыКайданов)
	|			ТОГДА ""Кайданов""
	|		ИНАЧЕ ""Прочий""
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Менеджер,
	|	ТорговаяПлощадка,
	|	Учет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СигаретыСигары", СигаретыСигары);
	Запрос.УстановитьПараметр("МенеджерыФедоренко", МенеджерыФедоренко);
	Запрос.УстановитьПараметр("МенеджерыКайданов", МенеджерыКайданов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьТОП100Продаж(НачалоПериода,КонецПериода)
	
	Табак = Справочники.Номенклатура.НайтиПоКоду("10070");
	
	Баффет = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008");			//	ТС Buffet
	
	ХозОперацияРозница = Новый СписокЗначений;
	//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	СУММА(Продажи.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(Продажи.СебестоимостьУпрОборот) КАК СебестоимостьУпрОборот,
	|	СУММА(Продажи.СуммаУпрОборот) КАК СуммаУпрОборот
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&Табак) КАК Табак,
	|		ПродажиОбороты.СкладКомпании КАК СкладКомпании,
	|		ПродажиОбороты.Номенклатура КАК Номенклатура,
	|		СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
	|		СУММА(ПродажиОбороты.СебестоимостьУпрОборот) КАК СебестоимостьУпрОборот,
	|		СУММА(ПродажиОбороты.СуммаУпрОборот) КАК СуммаУпрОборот
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				ПодразделениеКомпании = &Баффет
	|					И ХозОперация В (&ХозОперация)
	|					И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПродажиОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПродажиОбороты.СкладКомпании,
	|		ПродажиОбороты.Номенклатура) КАК Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииОстатки.СкладКомпании КАК СкладКомпании,
	|	ПартииОстатки.Номенклатура КАК Номенклатура,
	|	ПартииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПартииОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПартииОстатки.КоличествоОстаток > ЕСТЬNULL(ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВитринаОстаток, 0) КАК ОстатокБольшеВитрины
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПартииТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|		ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|		СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток,
	|		СУММА(ПартииТоваровКомпанииОстатки.СуммаБазОстаток) КАК СуммаБазОстаток
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|				&КонецПериода,
	|				СкладКомпании.Подразделение = &Баффет
	|					И СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ОсновнойСклад)) КАК ПартииТоваровКомпанииОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПартииТоваровКомпанииОстатки.СкладКомпании,
	|		ПартииТоваровКомпанииОстатки.Номенклатура) КАК ПартииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(&КонецПериода, ) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних
	|		ПО ПартииОстатки.Номенклатура = ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура
	|			И ПартииОстатки.СкладКомпании.ТорговаяПлощадка = ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Остатки.СкладКомпании) КАК КолвоСкладов
	|ПОМЕСТИТЬ СкладыБольшеВитрины
	|ИЗ
	|	Остатки КАК Остатки
	|ГДЕ
	|	Остатки.ОстатокБольшеВитрины
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Номенклатура В ИЕРАРХИИ (&Табак) КАК Табак,
	|	Продажи.Номенклатура.Артикул КАК Артикул,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	СкладыБольшеВитрины.КолвоСкладов КАК КолвоСкладов,
	|	СУММА(Продажи.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(Продажи.СебестоимостьУпрОборот) КАК СебестоимостьУпрОборот,
	|	СУММА(Продажи.СуммаУпрОборот - Продажи.СебестоимостьУпрОборот) КАК Маржа,
	|	СУММА(Продажи.СуммаУпрОборот) КАК СуммаУпрОборот,
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	Остатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	Продажи КАК Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыБольшеВитрины КАК СкладыБольшеВитрины
	|		ПО Продажи.Номенклатура = СкладыБольшеВитрины.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Остатки.Номенклатура КАК Номенклатура,
	|			СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток,
	|			СУММА(Остатки.СуммаОстаток) КАК СуммаОстаток
	|		ИЗ
	|			Остатки КАК Остатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Остатки.Номенклатура) КАК Остатки
	|		ПО Продажи.Номенклатура = Остатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура,
	|	СкладыБольшеВитрины.КолвоСкладов,
	|	Продажи.Номенклатура.Артикул,
	|	Остатки.КоличествоОстаток,
	|	Остатки.СуммаОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	Табак УБЫВ,
	|	СебестоимостьУпрОборот УБЫВ
	|ИТОГИ ПО
	|	Табак";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Табак", Табак);
	Запрос.УстановитьПараметр("Баффет", Баффет);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// РезультатЗапроса.Выгрузить();
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьОстаткиРЦ_ДляФМУ(Склады,Номенклатура,День)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка КАК Площадка,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&НаДень,
	|			СкладКомпании В (&Склады)
	|				И Номенклатура В (&Номенклатура)) КАК ОстаткиТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОстатки.Площадка КАК Площадка,
	|	""71700001"" КАК КодКлиента,
	|	КодыСклада.Значение КАК КодСклада,
	|	Товары.Артикул КАК Артикул,
	|	Товары.Ссылка КАК Товар,
	|	КодыФМУ.Значение КАК КодФМУ,
	|	0 КАК План,
	|	втОстатки.Остаток КАК Остаток
	|ИЗ
	|	Справочник.Номенклатура КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК КодыСклада
	|			ПО втОстатки.Площадка = КодыСклада.Объект
	|				И (КодыСклада.Свойство.Имя = ""КодФМУ_PURCHASEPLACE"")
	|		ПО Товары.Ссылка = втОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК КодыФМУ
	|		ПО Товары.Ссылка = КодыФМУ.Объект
	|			И (КодыФМУ.Свойство.Имя = ""КодФМУ_PMUBRAND"")
	|ГДЕ
	|	Товары.Ссылка В(&Номенклатура)
	|ИТОГИ ПО
	|	Площадка";
	
	Запрос.УстановитьПараметр("НаДень", День);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("Баффет", Баффет);
	//Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// РезультатЗапроса.Выгрузить();
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПолучитьПродажиРозницыДляИТЮ(НачалоПериода,КонецПериода)
	
	ХозОперацияРозница = Новый СписокЗначений;
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
	ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
	
	Подразделения = Новый СписокЗначений;
	Подразделения.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"));	//	ТС Аттика
	Подразделения.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"));		//	ТС Табак-Дигма
	Подразделения.Добавить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008"));	//	ТС Buffet
	
	Номенклатура = Новый СписокЗначений;
	Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0001002"));		//	Сигареты
	Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0002000"));		//	Сигары
	Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0000880"));		//	Стики для нагревания
	Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0002000"));		//	Электронные сигареты
	
	НеТоварнаяМарка = Новый СписокЗначений;
	НеТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т90"));			//	Сигарный Дом Фортуна (Папка)
	НеТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("671"));			//	Табачные изделия
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.СкладКомпании КАК СкладКомпании,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперация)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)
	|				И ПодразделениеКомпании В (&ПодразделениеКомпании)) КАК ПродажиОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонсолидированныеПродажиОбороты.СкладКомпании,
	|	КонсолидированныеПродажиОбороты.Номенклатура,
	|	КонсолидированныеПродажиОбороты.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.КонсолидированныеПродажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперация)
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И НЕ Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)
	|				И ПодразделениеКомпании В (&ПодразделениеКомпании)) КАК КонсолидированныеПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.СкладКомпании.ТочкаДоставки.Область КАК Область,
	|	ВТ.СкладКомпании.ТочкаДоставки.Город КАК Город,
	|	ВЫБОР
	|		КОГДА ВТ.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
	|			ТОГДА ""Павильон""
	|		КОГДА ВТ.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
	|			ТОГДА ""Киоск""
	|		ИНАЧЕ ВТ.СкладКомпании.ВидСклада
	|	КОНЕЦ КАК ВидСклада,
	|	ВТ.СкладКомпании.Код КАК КодСклада,
	|	ВТ.СкладКомпании КАК Склад,
	|	ВТ.Номенклатура.ТоварнаяМарка.Родитель КАК Производитель,
	|	ВТ.Номенклатура.Родитель КАК Родитель,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Артикул КАК Артикул,
	|	ВТ.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	|	ДополнительныеСведения.Значение КАК КолвоВПачке,
	|	СУММА(ВТ.Количество) КАК Количество
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ВТ.Номенклатура = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура,
	|	ВТ.СкладКомпании,
	|	ВТ.СкладКомпании.ТочкаДоставки.Область,
	|	ВТ.СкладКомпании.ТочкаДоставки.Город,
	|	ВТ.СкладКомпании.Код,
	|	ВТ.Номенклатура.ТоварнаяМарка.Родитель,
	|	ВТ.Номенклатура.Родитель,
	|	ВТ.Номенклатура.Артикул,
	|	ВТ.Номенклатура.ТоварнаяМарка,
	|	ВЫБОР
	|		КОГДА ВТ.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
	|			ТОГДА ""Павильон""
	|		КОГДА ВТ.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
	|			ТОГДА ""Киоск""
	|		ИНАЧЕ ВТ.СкладКомпании.ВидСклада
	|	КОНЕЦ,
	|	ДополнительныеСведения.Значение";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТоварнаяМарка", НеТоварнаяМарка);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделения);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	// РезультатЗапроса.Выгрузить()
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ПолучитьОстаткиИТЮ(наДату)
	
	РЦ = Новый СписокЗначений;
	РЦ.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000295"));	//	04 РЦ ТАБАК
	РЦ.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("DaL005"));	//	Распределительный центр - Харьков Аттика
	
	тмИТЮ = Справочники.ТоварныеМарки.НайтиПоКоду("Т40");						//	Империал Тобакко
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000300""
	|			ТОГДА 12904096
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000153""
	|			ТОГДА 12903766
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""GL000160""
	|			ТОГДА 12904198
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""DaL005""
	|			ТОГДА 12904198
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000322""
	|			ТОГДА 101
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РЦ,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнойШтрихКод КАК ШтрихКод,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ КАК МРЦ,
	|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|ПОМЕСТИТЬ втОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&НаДату,
	|			СкладКомпании.ТорговаяПлощадка В ИЕРАРХИИ (&РЦ)
	|				И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&тмИТЮ)) КАК ОстаткиТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнойШтрихКод,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000300""
	|			ТОГДА 12904096
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000153""
	|			ТОГДА 12903766
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""GL000160""
	|			ТОГДА 12904198
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""DaL005""
	|			ТОГДА 12904198
	|		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка.Код = ""ХGL000322""
	|			ТОГДА 101
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НаДату КАК НаДату,
	|	12904196 КАК Организация,
	|	втОстаток.РЦ КАК РЦ,
	|	втОстаток.ШтрихКод КАК ШтрихКод,
	|	втОстаток.Номенклатура КАК Номенклатура,
	|	втОстаток.МРЦ КАК МРЦ,
	|	ВЫБОР
	|		КОГДА ДопСвКоэффициентПачки.Значение ЕСТЬ NULL
	|			ТОГДА ""Коэф не установлен""
	|		ИНАЧЕ втОстаток.Остаток * (ВЫРАЗИТЬ(ДопСвКоэффициентПачки.Значение КАК ЧИСЛО(5, 0))) / 1000
	|	КОНЕЦ КАК ОстатокТысШт,
	|	втОстаток.Остаток КАК Остаток,
	|	ЕСТЬNULL(ДопСвКоэффициентПачки.Значение, 0) КАК КоэфПачки
	|ИЗ
	|	втОстаток КАК втОстаток
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСвКоэффициентПачки
	|		ПО (ДопСвКоэффициентПачки.Объект ССЫЛКА Справочник.Номенклатура)
	|			И (ДопСвКоэффициентПачки.Свойство.Имя = ""КоличествоСигарет_ОснЕдиницы"")
	|			И втОстаток.Номенклатура = ДопСвКоэффициентПачки.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	РЦ,
	|	втОстаток.Номенклатура.Наименование,
	|	МРЦ";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("РЦ", РЦ);
	Запрос.УстановитьПараметр("тмИТЮ", тмИТЮ);
	
	РезультатЗапроса = Запрос.Выполнить();
	// РезультатЗапроса.Выгрузить()
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ПолучитьНовыеКлиентыДистрибуции(НачалоПериода,КонецПериода,Менеджеры)
	
	НачалоПериода90	= НачалоПериода - 90*86400;
	КонецПериода90	= НачалоПериода - 1;
	
	ХозОперацияОпт = Новый СписокЗначений;
	ХозОперацияОпт.Добавить(Справочники.ХозОперации.РеализацияТоваров);
	ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Дистр_ПродажиОбороты.Покупатель КАК Покупатель
	|ПОМЕСТИТЬ СтарыеКлиенты
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода90,
	|			&КонецПериода90,
	|			,
	|			ХозОперация В (&ХозОперацияОпт)
	|				И ДоговорВзаиморасчетов.Менеджер В (&Менеджер)) КАК Дистр_ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Дистр_ПродажиОбороты.ТорговаяПлощадка КАК РЦ,
	|	Дистр_ПродажиОбороты.Покупатель КАК Покупатель,
	|	СУММА(Дистр_ПродажиОбороты.СуммаОборот) КАК Сумма,
	|	СУММА(Дистр_ПродажиОбороты.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(Дистр_ПродажиОбороты.СуммаОборот - Дистр_ПродажиОбороты.СебестоимостьОборот) КАК Наценка
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&ХозОперацияОпт)
	|				И ДоговорВзаиморасчетов.Менеджер В (&Менеджер)
	|				И НЕ Покупатель В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Дистр_ПродажиОбороты.Покупатель КАК Покупатель
	|						ИЗ
	|							РегистрНакопления.Продажи.Обороты(&НачалоПериода90, &КонецПериода90, , ХозОперация В (&ХозОперацияОпт)
	|								И ДоговорВзаиморасчетов.Менеджер В (&Менеджер)) КАК Дистр_ПродажиОбороты)) КАК Дистр_ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Дистр_ПродажиОбороты.Покупатель,
	|	Дистр_ПродажиОбороты.ТорговаяПлощадка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Покупатель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода90", НачалоПериода90);
	Запрос.УстановитьПараметр("КонецПериода90", КонецПериода90);
	Запрос.УстановитьПараметр("ХозОперацияОпт", ХозОперацияОпт);
	Запрос.УстановитьПараметр("Менеджер", Менеджеры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	//	РезультатЗапроса.Выгрузить()
	
КонецФункции



Функция ЗаписатьТабДок(Док,Вариант,СтруктураЗаписиЖурнала,Каталог,Получатель = Неопределено)
	
	ВсЁОк = Истина;
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	
	ИмяФайла = "Отчет " + Вариант.Значение+"_"+Вариант.Представление + " " + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd") + ".XlsX";
	ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
	СоздатьКаталог(ПутьХранения+Каталог);
	
	ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
	
	Попытка
		Если Вариант.Пометка Тогда
			Док.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		ИначеЕсли Вариант.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо Тогда
			ОтправитьПисьмо(ИмяФайла,Док,Получатель,Вариант,СтруктураЗаписиЖурнала);	
		Иначе
			Док.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		КонецЕсли;
		РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
	Исключение
		ВсЁОк = Ложь;
		ТекстОшибки = " Не удалось записать файл! " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат ВсЁОк;
	
КонецФункции

Процедура ОтправитьПисьмо(ИмяФайла,ТабДок,Получатель,Вариант,СтруктураЗаписиЖурнала)
	ВыполненоОтчетов = 1;
	Вложения = Новый Массив;
	
	ПотокФайла = Новый ПотокВПамяти();
	ТабДок.Записать(ПотокФайла,ТипФайлаТабличногоДокумента.XLSX);
	ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
	ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
	ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", ИмяФайла, ВременноеХранилищеФайла);
	Вложения.Добавить(ОписаниеВложения);
	
	СтрокаАдрес = "";
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	
	тзЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель,ВидКИ,,Ложь);
	Для Каждого ЭлАдрес Из тзЭлАдрес Цикл
		Если ПустаяСтрока(ЭлАдрес.Представление) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАдрес = СтрокаАдрес + ЭлАдрес.Представление+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ТекстОшибки = НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("Копии","sergei.dotsenko@digma.ua");
	ПараметрыПисьма.Вставить("СкрытыеКопии","sergey.lohvitskiy@digma.ua");
	ПараметрыПисьма.Вставить("Тема","Аттика " + Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd   '") + ИмяФайла);
	ПараметрыПисьма.Вставить("Тело",ИмяФайла);
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
КонецПроцедуры


/////////-----000-----/////////

// Процедура - Запустить
//
// Параметры:
//  спВариантыОтчетов	 - 	 - 
//
Процедура Запустить(спВариантыОтчетов)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Если Вариант.Представление = "Приходы по фабрикам" Тогда
			
			НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
			КонецПериода = КонецМесяца(НачалоПериода);
			
			спГруппНоменклатура = Новый СписокЗначений;
			спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("10070"));
			
			ТМ_ФМУ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т80");
			ТМ_JTI		= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
			ТМ_БАТ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
			ТМ_ИТЮ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
			ТМ_Львов	= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
			ТМ_Маршал	= Справочники.ТоварныеМарки.НайтиПоКоду("Т500");
			ТМ_Фич		= Справочники.ТоварныеМарки.НайтиПоКоду("Т860");
			ТМ_НикоМ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т880");
			ТМ_Пирятин	= Справочники.ТоварныеМарки.НайтиПоКоду("П81");
			ТМ_Масккинг	= Справочники.ТоварныеМарки.НайтиПоКоду("В869");
			ТМ_Астекс	= Справочники.ТоварныеМарки.НайтиПоКоду("В920");
			ТМ_Олимп	= Справочники.ТоварныеМарки.НайтиПоКоду("В878");
			ТМ_Фортуна	= Справочники.ТоварныеМарки.НайтиПоКоду("Т90");
			ТМ_Аполон	= Справочники.ТоварныеМарки.НайтиПоКоду("А520");
			ТМ_ТобакоТ	= Справочники.ТоварныеМарки.НайтиПоКоду("Ф400");
			ТМ_ПроТабак	= Справочники.ТоварныеМарки.НайтиПоКоду("ФС00033");
			
			спТМ = Новый СписокЗначений;
			спТМ.Добавить(ТМ_ФМУ);
			спТМ.Добавить(ТМ_JTI);
			спТМ.Добавить(ТМ_БАТ);
			спТМ.Добавить(ТМ_ИТЮ);
			спТМ.Добавить(ТМ_Львов);
			спТМ.Добавить(ТМ_Маршал);
			спТМ.Добавить(ТМ_Фич);
			спТМ.Добавить(ТМ_НикоМ);
			спТМ.Добавить(ТМ_Пирятин);
			спТМ.Добавить(ТМ_Масккинг);
			спТМ.Добавить(ТМ_Астекс);
			спТМ.Добавить(ТМ_Олимп);
			спТМ.Добавить(ТМ_Фортуна);
			спТМ.Добавить(ТМ_Аполон);
			спТМ.Добавить(ТМ_ТобакоТ);
			спТМ.Добавить(ТМ_ПроТабак);
			
			спПоставщиков = Новый СписокЗначений;
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("40102602"));	//	Бритиш Американ Тобакко Сейлз енд Маркетинг Украина ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("30600346"));	//	Вега-плюс ООО 
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("D19345204"));	//	Джей Ти Интернешнл  ЧАО  
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("20044494"));	//	Империал Тобако Юкрейн ПИИ
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("36929041"));	//	Марвел ТД (бывш. Львовская табачная фабрика ТД) ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("43678364"));	//	Маршал Табако ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("42873903"));	//	Никомюкрейн ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("30622532"));	//	Тедис Украина ООО (до 24.05.2016 Мегаполис-Украина ТК ООО)
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("39540982"));	//	Филип Моррис Сейлз Дистибушн ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("43161084"));	//	Фич Лебз ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("40930723"));	//	Юнайтед Табако ТД ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("43656686"));	//	ТД Фич Трейд Хаус ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("36313601"));	//	Пирятинский деликатес ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("43181619"));	//	Масккинг ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("41469705"));	//	АСТЕКС ПРОМ ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("43804102"));	//	Олимп Импортс ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("D33139581"));	//	Стар Трейд-1 ПП
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("44317988"));	//	АПОЛОН ГРЕЙД ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("44895101"));	//	ДЛ СОЛЮШН ООО(бывший ТЕДІС ЛОГІСТИК)
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("44564832"));	//	Тобако Трейдинг ТД ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("36497264"));	//	Галичина-Табак ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("44346956"));	//	Про табак ТД ООО
			спПоставщиков.Добавить(Справочники.Контрагенты.НайтиПоКоду("44624498"));	//	Глобал Тобакко ООО
			
			тзРезультат = ПолучитьПриходыПоФабрикам(НачалоПериода,КонецПериода,спПоставщиков,спГруппНоменклатура,спТМ);
			
			спТМ.Вставить(0,"Сигареты Общее");
			
			спПоказателей = Новый СписокЗначений;
			спПоказателей.Добавить("ИТОГО");
			спПоказателей.Добавить("Тедис");
			спПоказателей.Добавить("Галичина-Табак");
			спПоказателей.Добавить("Глобал Тобакко");
			спПоказателей.Добавить("Фабрика");
			
			ТабДок = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("ПриходыПоФабрикам");
			облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			облПустая = Макет.ПолучитьОбласть("Пусто");
			облШапка = Макет.ПолучитьОбласть("Шапка|Показатели");
			облШапкаТМ = Макет.ПолучитьОбласть("Шапка|ТМ");
			облДанные = Макет.ПолучитьОбласть("Данные|Показатели");
			облДанныеТМ = Макет.ПолучитьОбласть("Данные|ТМ");
			
			облЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода);
			ТабДок.Вывести(облЗаголовок);
			
			ТабДок.Вывести(ОблШапка);
			
			Для Каждого элсп Из спТМ Цикл                                         
				облШапкаТМ.Параметры.ТМ = элсп.Значение;
				ТабДок.Присоединить(облШапкаТМ);
			КонецЦикла;
			
			Для Каждого Показатель ИЗ спПоказателей Цикл
				облДанные.Параметры.Показатель = Показатель.Значение;
				ТабДок.Вывести(облДанные);
				
				Если Показатель.Значение = "ИТОГО" Тогда
					ВТ = тзРезультат.Скопировать();
				Иначе
					ВТ = тзРезультат.Скопировать(Новый Структура("Поставщик",Показатель.Значение));
				КонецЕсли;
				
				Для Каждого ТМ ИЗ спТМ Цикл
					Если ТМ.Значение = "Сигареты Общее" Тогда
						втТМ = ВТ.Скопировать();
						втИтогФортуна = ВТ.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТМ_Фортуна));
						втЭлектроФортуна = ВТ.Скопировать(Новый Структура("ТоварнаяМаркаРодитель,НоменклатураРодитель",ТМ_Фортуна,Справочники.Номенклатура.НайтиПоКоду("777812")));
						облДанныеТМ.Параметры.Колво = втТМ.Итог("КоличествоПриход") - втИтогФортуна.Итог("КоличествоПриход") + втЭлектроФортуна.Итог("КоличествоПриход");
						облДанныеТМ.Параметры.Сумма = втТМ.Итог("СуммаПриход") - втИтогФортуна.Итог("СуммаПриход") + втЭлектроФортуна.Итог("СуммаПриход");
					Иначе
						Если СокрЛП(ТМ.Значение.Код) = "Т90" Тогда		//	Сигарный Дом Фортуна
							втТМ = ВТ.Скопировать(Новый Структура("ТоварнаяМаркаРодитель,НоменклатураРодитель",ТМ.Значение,Справочники.Номенклатура.НайтиПоКоду("777812")));
						Иначе
							втТМ = ВТ.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТМ.Значение));
						КонецЕсли;
						облДанныеТМ.Параметры.Колво = втТМ.Итог("КоличествоПриход");
						облДанныеТМ.Параметры.Сумма = втТМ.Итог("СуммаПриход");
					КонецЕсли;
					ТабДок.Присоединить(облДанныеТМ);
				КонецЦикла;
			КонецЦикла;
			
			ТабДок.Вывести(облПустая);
			
			спТМ = Новый СписокЗначений;
			спТМ.Добавить(ТМ_ФМУ);
			спТМ.Добавить(ТМ_БАТ);
			
			Товар_Принадлежности= Справочники.Номенклатура.НайтиПоКоду("777811");
			Товар_ЭлектрСигареты= Справочники.Номенклатура.НайтиПоКоду("777812");
			Товар_Сигареты		= Справочники.Номенклатура.НайтиПоКоду("D0001002");
			Товар_Стики			= Справочники.Номенклатура.НайтиПоКоду("D0000880");
			
			спТовара = Новый СписокЗначений;
			спТовара.Добавить(Товар_Сигареты,,Истина);
			спТовара.Добавить(Товар_Стики,,Истина);
			спТовара.Добавить(Товар_Принадлежности);
			спТовара.Добавить(Товар_ЭлектрСигареты);
			
			ТабДок.Вывести(ОблШапка);
			
			Для Каждого элспМ Из спТМ Цикл                                         
				Для Каждого элспТ Из спТовара Цикл                                         
					облШапкаТМ.Параметры.ТМ = СокрЛП(элспМ.Значение)+Символы.ПС+СокрЛП(элспТ.Значение);
					ТабДок.Присоединить(облШапкаТМ);
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого Показатель ИЗ спПоказателей Цикл
				облДанные.Параметры.Показатель = Показатель.Значение;
				ТабДок.Вывести(облДанные);
				
				Для Каждого ТМ ИЗ спТМ Цикл
					Для Каждого Товар Из спТовара Цикл                                         
						Если Показатель.Значение = "ИТОГО" Тогда
							ВТ = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель,НоменклатураРодитель",ТМ.Значение,Товар.Значение));
						Иначе
							ВТ = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель,НоменклатураРодитель,Поставщик",ТМ.Значение,Товар.Значение,Показатель.Значение));
						КонецЕсли;
						
						облДанныеТМ.Параметры.Колво = ВТ.Итог("КоличествоПриход");;
						облДанныеТМ.Параметры.Сумма = ВТ.Итог("СуммаПриход");;
						ТабДок.Присоединить(облДанныеТМ);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			
			
		ИначеЕсли Вариант.Представление = "ІТЮ - Обсяги продажу" Тогда
			
			НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
			КонецПериода = КонецМесяца(НачалоПериода);
			
			Номенклатура = Справочники.Номенклатура.НайтиПоКоду("10050");
			ТМ_Исключение = Новый СписокЗначений;
			ТМ_Исключение.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т90"));
			ТМ_Исключение.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("671"));
			
			ТМ_ИТЮ = Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
			ТМ_JTI = Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
			ТМ_БАТ = Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
			ТМ_ФМУ = Справочники.ТоварныеМарки.НайтиПоКоду("Т80");
			
			спТМ = Новый СписокЗначений;
			спТМ.Добавить(ТМ_ИТЮ,"РАЗОМ ІТЮ");
			спТМ.Добавить(ТМ_БАТ,"BAT");
			спТМ.Добавить(ТМ_JTI,"JTI/GLH");
			спТМ.Добавить(ТМ_ФМУ,"PMI");
			спТМ.Добавить("OTHER","OTHER",Истина);
			
			ЦветОблИтогов = Новый Соответствие;
			ЦветОблИтогов.Вставить(ТМ_ИТЮ,WebЦвета.Желтый);
			ЦветОблИтогов.Вставить(ТМ_БАТ,WebЦвета.НасыщенноНебесноГолубой);
			ЦветОблИтогов.Вставить(ТМ_JTI,WebЦвета.ЖелтоЗеленый);
			ЦветОблИтогов.Вставить(ТМ_ФМУ,WebЦвета.Томатный);
			ЦветОблИтогов.Вставить("OTHER",WebЦвета.Серебряный);
			
			тзРезультат = ПолучитьОбсягиПродажу(НачалоПериода,КонецПериода,Номенклатура,ТМ_Исключение);
			
			Если НЕ ЗначениеЗаполнено(тзРезультат) Тогда
				Продолжить;
			КонецЕсли;
			
			Книга = Новый ПакетОтображаемыхДокументов;
			
			тзОрганизации = тзРезультат.Скопировать(,"Организация");
			тзОрганизации.Свернуть("Организация");
			
			Для Каждого стрОрганизация ИЗ тзОрганизации Цикл
				
				ТабДок = Новый ТабличныйДокумент;
				Макет = ПолучитьМакет("ОбсягиПродажуІТЮ");
				облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
				облШапка = Макет.ПолучитьОбласть("Шапка");
				облСтрока = Макет.ПолучитьОбласть("Строка");
				облИтог = Макет.ПолучитьОбласть("Итог");
				облПодвал = Макет.ПолучитьОбласть("Подвал");
				
				облЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода,"Л=uk_UA");
				облЗаголовок.Параметры.Организация = стрОрганизация.Организация;
				облЗаголовок.Параметры.День = Формат(КонецПериода,"ДФ='dd.MM.yyyy р'");
				
				ТабДок.Вывести(облЗаголовок);
				ТабДок.Вывести(облШапка);
				
				втОрганизации = тзРезультат.Скопировать(Новый Структура("Организация",стрОрганизация.Организация));
				втИТю = втОрганизации.Скопировать(Новый Структура("ТМ_Родитель",ТМ_ИТЮ));
				нп = 0;
				Для Каждого строка ИЗ втИТю Цикл
					нп = нп + 1;	
					облСтрока.Параметры.нп = нп;
					облСтрока.Параметры.Заполнить(строка);
					ТабДок.Вывести(облСтрока);
				КонецЦикла;
				
				OTHER = втОрганизации.Итог("Т_ШТ_Сиг");
				
				Для Каждого ТМ ИЗ спТМ Цикл
					втТМ = втОрганизации.Скопировать(Новый Структура("ТМ_Родитель",ТМ.Значение));
					ТМ_Итог = втТМ.Итог("Т_ШТ_Сиг");
					OTHER = OTHER-ТМ_Итог;
					облИтог.Параметры.ТМ = ТМ.Представление;
					облИтог.Параметры.Т_ШТ_Сиг = ?(ТМ.Пометка,OTHER,ТМ_Итог);
					облИтог.Область(1,2,1,5).ЦветФона = ЦветОблИтогов.Получить(ТМ.Значение);
					ТабДок.Вывести(облИтог);
				КонецЦикла;
				ТабДок.Вывести(облПодвал);
				
				Лист = Книга.Состав.Добавить();
				Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
				Лист.Наименование = СокрЛП(стрОрганизация.Организация);
			КонецЦикла;
			
			Пустые = тзРезультат.Скопировать(Новый Структура("Значение",0));
			Если ЗначениеЗаполнено(Пустые) Тогда
				ТабДок = Новый ТабличныйДокумент;
				Построитель = Новый ПостроительОтчета;
				Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Пустые);       
				Построитель.ТекстЗаголовка = "Эти позиции  с незаполнеными кол-вом сигарет в пачке на "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				Построитель.Вывести(ТабДок);
			КонецЕсли;
			
		ИначеЕсли Вариант.Представление = "Продажи по фабрикам" Тогда
			
			НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
			КонецПериода = КонецМесяца(НачалоПериода);
			
			спГруппНоменклатура = Новый СписокЗначений;
			спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("777811"));
			спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("10050"));
			спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("777812"));
			
			спПоказателей = Новый СписокЗначений;
			спПоказателей.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0001002"),"Сигареты");
			спПоказателей.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0002000"),"Сигары");
			спПоказателей.Добавить(Справочники.Номенклатура.НайтиПоКоду("777811"),"Velo");
			спПоказателей.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0000880"),"Стики");
			
			спТМ = Новый СписокЗначений;
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т80"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т10"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т20"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т40"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т60"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т500"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т860"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т880"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("П81" ),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В869"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В920"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("В878"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т90" ),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("А520"),,Истина);
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Ф400"));
			спТМ.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("ФС00033"));
			
			ТабДок = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("ПродажиПоФабрикам");
			облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			облШапка = Макет.ПолучитьОбласть("Шапка|Показатели");
			облШапкаТМ = Макет.ПолучитьОбласть("Шапка|ТМ");
			облДанные = Макет.ПолучитьОбласть("Данные|Показатели");
			облДанныеТМ = Макет.ПолучитьОбласть("Данные|ТМ");
			
			облЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода);
			
			ТабДок.Вывести(облЗаголовок);
			
			ТабДок.Вывести(ОблШапка);
			
			Для Каждого элсп Из спТМ Цикл                                         
				облШапкаТМ.Параметры.ТМ = элсп.Значение;
				ТабДок.Присоединить(облШапкаТМ);
			КонецЦикла;
			
			ТабДок.Вывести(облДанные);
			
			Для Каждого ТоварнаяМарка Из спТМ Цикл 
				
				тзРезультат = ПолучитьПродажиПоФабрикам(НачалоПериода,КонецПериода,спГруппНоменклатура,ТоварнаяМарка.Значение);
				
				Для Каждого группа Из спПоказателей Цикл
					Если группа.Представление = "Velo" И НЕ ТоварнаяМарка.Пометка Тогда
						РозницаКолво= 0;
						ОптКолво	= 0;
						ДистрибКолво= 0;
					ИначеЕсли СокрЛП(ТоварнаяМарка.Значение.Код) = "Т90" И группа.Представление <> "Velo" Тогда
						РозницаКолво= 0;
						ОптКолво	= 0;
						ДистрибКолво= 0;
					Иначе
						Если группа.Представление = "Velo" И СокрЛП(ТоварнаяМарка.Значение.Код) = "Т860" Тогда
							вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка.Значение));
						ИначеЕсли группа.Представление = "Velo" И (СокрЛП(ТоварнаяМарка.Значение.Код) = "П81" Или СокрЛП(ТоварнаяМарка.Значение.Код) = "В878" ИЛИ СокрЛП(ТоварнаяМарка.Значение.Код) = "В920") Тогда
							вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка.Значение));
						ИначеЕсли группа.Представление = "Velo" И (СокрЛП(ТоварнаяМарка.Значение.Код) = "В869") Тогда
							вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМарка",ТоварнаяМарка.Значение));
						ИначеЕсли группа.Представление = "Velo" И СокрЛП(ТоварнаяМарка.Значение.Код) = "Т90" Тогда
							вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Справочники.Номенклатура.НайтиПоКоду("777812"),ТоварнаяМарка.Значение));
						Иначе
							вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",группа.Значение,ТоварнаяМарка.Значение));
						КонецЕсли;
						РозницаКолво= вт.Итог("РозницаКолво");
						ОптКолво	= вт.Итог("ОптКолво");
						ДистрибКолво= вт.Итог("ДистрибКолво");
					КонецЕсли;
					облДанныеТМ.Параметры["Р_"+группа.Представление] = РозницаКолво;
					облДанныеТМ.Параметры["О_"+группа.Представление] = ОптКолво;
					облДанныеТМ.Параметры["Д_"+группа.Представление] = ДистрибКолво;
					облДанныеТМ.Параметры["И_"+группа.Представление] = РозницаКолво + ОптКолво + ДистрибКолво;
				КонецЦикла;
				ТабДок.Присоединить(облДанныеТМ);
			КонецЦикла;
			
			ТабДок.ФиксацияСлева = 1;
			
		ИначеЕсли Вариант.Представление = "Реализация Табака" Тогда
			
			ТаблицаИтоговая = Новый ТаблицаЗначений;
			
			ТаблицаИтоговая.Колонки.Добавить("ОбщееКолво");				ОбщееКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ОбщееСумма");				ОбщееСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУСигаретыКолво");		ФМУСигаретыКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУСигаретыСумма");		ФМУСигаретыСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУСтикиКолво");			ФМУСтикиКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУСтикиСумма");			ФМУСтикиСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУТоталКолво");			ФМУТоталКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФМУТоталСумма");			ФМУТоталСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("JTIКолво");				JTIКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("JTIСумма");				JTIСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТСигаретыКолво");		БАТСигаретыКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТСигаретыСумма");		БАТСигаретыСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТСтикиGloКолво");		БАТСтикиGloКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТСтикиGloСумма");		БАТСтикиGloСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТВЕЛОКолво");			БАТВЕЛОКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТВЕЛОСумма");			БАТВЕЛОСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТТоталКолво");			БАТТоталКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("БАТТоталСумма");			БАТТоталСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ИТЮКолво");				ИТЮКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ИТЮСумма");				ИТЮСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ЛьвовКолво");				ЛьвовКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ЛьвовСумма");				ЛьвовСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ДонскойКолво");			ДонскойКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ДонскойСумма");			ДонскойСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаСигарыКолво");		ФортунаСигарыКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаСигарыСумма");		ФортунаСигарыСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаСигаретыКолво");	ФортунаСигаретыКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаСигаретыСумма");	ФортунаСигаретыСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаЭлектроКолво");	ФортунаЭлектроКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ФортунаЭлектроСумма");	ФортунаЭлектроСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("FICHКолво");				FICHКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("FICHСумма");				FICHСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("МаршалКолво");			МаршалКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("МаршалСумма");			МаршалСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("НикомюкрейнКолво");		НикомюкрейнКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("НикомюкрейнСумма");		НикомюкрейнСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ПирятинКолво");			ПирятинКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ПирятинСумма");			ПирятинСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("МасккингКолво");			МасккингКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("МасккингСумма");			МасккингСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("АстексКолво");			АстексКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("АстексСумма");			АстексСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ОлимпКолво");				ОлимпКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ОлимпСумма");				ОлимпСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("АполонКолво");			АполонКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("АполонСумма");			АполонСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ТобакоТрейдингКолво");	ТобакоТрейдингКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ТобакоТрейдингСумма");	ТобакоТрейдингСумма = 0;
			ТаблицаИтоговая.Колонки.Добавить("ПроТабакКолво");			ПроТабакКолво = 0;
			ТаблицаИтоговая.Колонки.Добавить("ПроТабакСумма");			ПроТабакСумма = 0;
			
			Номенклатура_Принадлежности	= Справочники.Номенклатура.НайтиПоКоду("777811");
			Номенклатура_Сигареты		= Справочники.Номенклатура.НайтиПоКоду("D0001002");
			Номенклатура_Сигары			= Справочники.Номенклатура.НайтиПоКоду("D0002000");
			Номенклатура_Стики			= Справочники.Номенклатура.НайтиПоКоду("D0000880");
			Номенклатура_ЭлектрСигареты	= Справочники.Номенклатура.НайтиПоКоду("777812");
			
			ТоварнаяМарка_ФМУ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т80");
			ТоварнаяМарка_JTI		= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
			ТоварнаяМарка_БАТ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
			ТоварнаяМарка_Glo		= Справочники.ТоварныеМарки.НайтиПоКоду("Т3");
			ТоварнаяМарка_VELO		= Справочники.ТоварныеМарки.НайтиПоКоду("Т1953");
			ТоварнаяМарка_ИТЮ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
			ТоварнаяМарка_Львов		= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
			ТоварнаяМарка_Донской	= Справочники.ТоварныеМарки.НайтиПоКоду("Е30");
			ТоварнаяМарка_Фортуна	= Справочники.ТоварныеМарки.НайтиПоКоду("Т90");
			ТоварнаяМарка_FICH		= Справочники.ТоварныеМарки.НайтиПоКоду("Т860");
			ТоварнаяМарка_Маршал	= Справочники.ТоварныеМарки.НайтиПоКоду("Т500");
			ТоварнаяМарка_НикоМюк	= Справочники.ТоварныеМарки.НайтиПоКоду("Т880");
			ТоварнаяМарка_Пирятин	= Справочники.ТоварныеМарки.НайтиПоКоду("П81");
			ТоварнаяМарка_МаскКинг	= Справочники.ТоварныеМарки.НайтиПоКоду("В869");
			ТоварнаяМарка_Астекс	= Справочники.ТоварныеМарки.НайтиПоКоду("В920");
			ТоварнаяМарка_Олимп		= Справочники.ТоварныеМарки.НайтиПоКоду("В878");
			ТоварнаяМарка_Аполон	= Справочники.ТоварныеМарки.НайтиПоКоду("А520");
			ТоварнаяМарка_ТобакоТр	= Справочники.ТоварныеМарки.НайтиПоКоду("Ф400");
			ТоварнаяМарка_ПроТабак	= Справочники.ТоварныеМарки.НайтиПоКоду("ФС00033");
			
			Номенклатура = Новый СписокЗначений;
			Номенклатура.Добавить(Номенклатура_Стики);
			Номенклатура.Добавить(Номенклатура_Сигары);
			Номенклатура.Добавить(Номенклатура_Сигареты);
			Номенклатура.Добавить(Номенклатура_Принадлежности);
			Номенклатура.Добавить(Номенклатура_ЭлектрСигареты);
			
			ТоварнаяМарка = Новый СписокЗначений;
			ТоварнаяМарка.Добавить(ТоварнаяМарка_БАТ);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_JTI);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Донской);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_ИТЮ);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Львов);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Маршал);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_НикоМюк);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Фортуна);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_FICH);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_ФМУ);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Пирятин);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_МаскКинг);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Астекс);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Олимп);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_Аполон);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_ТобакоТр);
			ТоварнаяМарка.Добавить(ТоварнаяМарка_ПроТабак);
			
			НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
			КонецПериода = КонецМесяца(НачалоПериода);
			
			строка = ТаблицаИтоговая.Добавить();
			
			тзРезультат = ПолучитьРеализацию(НачалоПериода,КонецПериода,Номенклатура,ТоварнаяМарка);
			
			Если ЗначениеЗаполнено(тзРезультат) Тогда
				//	ФМУ	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_ФМУ));
				ФМУСигаретыКолво = вт.Итог("Колво");
				ФМУСигаретыСумма = вт.Итог("Сумма");
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Стики,ТоварнаяМарка_ФМУ));
				ФМУСтикиКолво = вт.Итог("Колво");
				ФМУСтикиСумма = вт.Итог("Сумма");
				ФМУТоталКолво = ФМУСигаретыКолво + ФМУСтикиКолво;
				ФМУТоталСумма = ФМУСигаретыСумма + ФМУСтикиСумма;
				//	JTI	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_JTI));
				JTIКолво = вт.Итог("Колво");
				JTIСумма = вт.Итог("Сумма");
				//	БАТ	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_БАТ));
				БАТСигаретыКолво = вт.Итог("Колво");
				БАТСигаретыСумма = вт.Итог("Сумма");
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Стики,ТоварнаяМарка_БАТ));
				БАТСтикиGloКолво = вт.Итог("Колво");
				БАТСтикиGloСумма = вт.Итог("Сумма");
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМарка",Номенклатура_Принадлежности,ТоварнаяМарка_VELO));
				БАТВЕЛОКолво = вт.Итог("Колво");
				БАТВЕЛОСумма = вт.Итог("Сумма");
				БАТТоталКолво = БАТСигаретыКолво + БАТСтикиGloКолво + БАТВЕЛОКолво;
				БАТТоталСумма = БАТСигаретыСумма + БАТСтикиGloСумма + БАТВЕЛОСумма;
				//	ИТЮ	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_ИТЮ));
				ИТЮКолво = вт.Итог("Колво");
				ИТЮСумма = вт.Итог("Сумма");
				//	Львов	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_Львов));
				ЛьвовКолво = вт.Итог("Колво");
				ЛьвовСумма = вт.Итог("Сумма");
				//	Донской	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_Донской));
				ДонскойКолво = вт.Итог("Колво");
				ДонскойСумма = вт.Итог("Сумма");
				//	Фортуна	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигары,ТоварнаяМарка_Фортуна));
				ФортунаСигарыКолво = вт.Итог("Колво");
				ФортунаСигарыСумма = вт.Итог("Сумма");
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_Фортуна));
				ФортунаСигаретыКолво = вт.Итог("Колво");
				ФортунаСигаретыСумма = вт.Итог("Сумма");
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_ЭлектрСигареты,ТоварнаяМарка_Фортуна));
				ФортунаЭлектроКолво = вт.Итог("Колво");
				ФортунаЭлектроСумма = вт.Итог("Сумма");
				//	FICH	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_FICH));
				FICHКолво = вт.Итог("Колво");
				FICHСумма = вт.Итог("Сумма");
				//	Маршал	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Сигареты,ТоварнаяМарка_Маршал));
				МаршалКолво = вт.Итог("Колво");
				МаршалСумма = вт.Итог("Сумма");
				//	Никомюкрейн	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_Принадлежности,ТоварнаяМарка_НикоМюк));
				НикомюкрейнКолво = вт.Итог("Колво");
				НикомюкрейнСумма = вт.Итог("Сумма");
				//	Пирятин	///
				вт = тзРезультат.Скопировать(Новый Структура("Номенклатура,ТоварнаяМаркаРодитель",Номенклатура_ЭлектрСигареты,ТоварнаяМарка_Пирятин));
				ПирятинКолво = вт.Итог("Колво");
				ПирятинСумма = вт.Итог("Сумма");
				//	МаскКинг	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМарка",ТоварнаяМарка_МаскКинг));
				МаскКингКолво = вт.Итог("Колво");
				МаскКингСумма = вт.Итог("Сумма");
				//	Астекс-Пром	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_Астекс));
				АстексКолво = вт.Итог("Колво");
				АстексСумма = вт.Итог("Сумма");
				//	Олимп Импортс	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_Олимп));
				ОлимпКолво = вт.Итог("Колво");
				ОлимпСумма = вт.Итог("Сумма");
				//	Аполон Грейд	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_Аполон));
				АполонКолво = вт.Итог("Колво");
				АполонСумма = вт.Итог("Сумма");
				//	Тобако Трейдинг	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_ТобакоТр));
				ТобакоТрейдингКолво = вт.Итог("Колво");
				ТобакоТрейдингСумма = вт.Итог("Сумма");
				//	Про табак ТД	///
				вт = тзРезультат.Скопировать(Новый Структура("ТоварнаяМаркаРодитель",ТоварнаяМарка_ПроТабак));
				ПроТабакКолво = вт.Итог("Колво");
				ПроТабакСумма = вт.Итог("Сумма");
				//	Общее	///
				ОбщееКолво = ФМУТоталКолво + JTIКолво + БАТТоталКолво + ИТЮКолво + ЛьвовКолво + ДонскойКолво + ФортунаСигаретыКолво + FICHКолво + МаршалКолво + НикомюкрейнКолво + ПирятинКолво + МаскКингКолво + АстексКолво + ОлимпКолво + ФортунаЭлектроКолво + АполонКолво + ТобакоТрейдингКолво + ПроТабакКолво;
				ОбщееСумма = ФМУТоталСумма + JTIСумма + БАТТоталСумма + ИТЮСумма + ЛьвовСумма + ДонскойСумма + ФортунаСигаретыСумма + FICHСумма + МаршалСумма + НикомюкрейнСумма + ПирятинСумма + МаскКингСумма + АстексСумма + ОлимпСумма + ФортунаЭлектроСумма + АполонСумма + ТобакоТрейдингСумма + ПроТабакСумма;
				
				строка.ОбщееКолво			= ОбщееКолво;
				строка.ОбщееСумма			= ОбщееСумма;
				строка.ФМУСигаретыКолво		= ФМУСигаретыКолво;
				строка.ФМУСигаретыСумма		= ФМУСигаретыСумма;
				строка.ФМУСтикиКолво		= ФМУСтикиКолво;
				строка.ФМУСтикиСумма		= ФМУСтикиСумма;
				строка.ФМУТоталКолво		= ФМУТоталКолво;
				строка.ФМУТоталСумма		= ФМУТоталСумма;
				строка.JTIКолво				= JTIКолво;
				строка.JTIСумма				= JTIСумма;
				строка.БАТСигаретыКолво		= БАТСигаретыКолво;
				строка.БАТСигаретыСумма		= БАТСигаретыСумма;
				строка.БАТСтикиGloКолво		= БАТСтикиGloКолво;
				строка.БАТСтикиGloСумма		= БАТСтикиGloСумма;
				строка.БАТВЕЛОКолво			= БАТВЕЛОКолво;
				строка.БАТВЕЛОСумма			= БАТВЕЛОСумма;
				строка.БАТТоталКолво		= БАТТоталКолво;
				строка.БАТТоталСумма		= БАТТоталСумма;
				строка.ИТЮКолво				= ИТЮКолво;
				строка.ИТЮСумма				= ИТЮСумма;
				строка.ЛьвовКолво			= ЛьвовКолво;
				строка.ЛьвовСумма			= ЛьвовСумма;
				строка.ДонскойКолво			= ДонскойКолво;
				строка.ДонскойСумма			= ДонскойСумма;
				строка.ФортунаСигарыКолво	= ФортунаСигарыКолво;
				строка.ФортунаСигарыСумма	= ФортунаСигарыСумма;
				строка.ФортунаСигаретыКолво	= ФортунаСигаретыКолво;
				строка.ФортунаСигаретыСумма	= ФортунаСигаретыСумма;
				строка.FICHКолво			= FICHКолво;
				строка.FICHСумма			= FICHСумма;
				строка.МаршалКолво			= МаршалКолво;
				строка.МаршалСумма			= МаршалСумма;
				строка.НикомюкрейнКолво		= НикомюкрейнКолво;
				строка.НикомюкрейнСумма		= НикомюкрейнСумма;
				строка.ПирятинКолво			= ПирятинКолво;
				строка.ПирятинСумма			= ПирятинСумма;
				строка.МаскКингКолво		= МаскКингКолво;
				строка.МаскКингСумма		= МаскКингСумма;
				строка.АстексКолво			= АстексКолво;
				строка.АстексСумма			= АстексСумма;
				строка.ОлимпКолво			= ОлимпКолво;
				строка.ОлимпСумма			= ОлимпСумма;
				строка.ФортунаЭлектроКолво	= ФортунаЭлектроКолво;
				строка.ФортунаЭлектроСумма	= ФортунаЭлектроСумма;
				строка.АполонКолво			= АполонКолво;
				строка.АполонСумма			= АполонСумма;
				строка.ТобакоТрейдингКолво	= ТобакоТрейдингКолво;
				строка.ТобакоТрейдингСумма	= ТобакоТрейдингСумма;
				строка.ПроТабакКолво		= ПроТабакКолво;
				строка.ПроТабакСумма		= ПроТабакСумма;
				
			КонецЕсли;
			
			ТабДок = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("ТабакРеализация");
			облОтчет = Макет.ПолучитьОбласть("Отчет");
			облОтчет.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода);
			облОтчет.Параметры.Заполнить(строка);
			ТабДок.Вывести(облОтчет);
			
		ИначеЕсли Вариант.Представление = "Продажи Табак ОПТ" Тогда
			
			//	Отбор
			ХозОперацияОпт = Новый СписокЗначений;
			//ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
			ХозОперацияОпт.Добавить(Справочники.ХозОперации.РеализацияТоваров);
			ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
			
			Номенклатура_СигаретыСигары = Справочники.Номенклатура.НайтиПоКоду("10050");
			
			Менеджеры = Новый СписокЗначений;
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
			Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
			//
			
			спВариантов = Новый СписокЗначений;
			спВариантов.Добавить("Кайданов");
			спВариантов.Добавить("Федоренко");
			спВариантов.Добавить("Прочие");
			
			
			ВТ = Новый ТаблицаЗначений; 
			ВТ.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
			ВТ.Колонки.Добавить("Параметр");
			ВТ.Колонки.Добавить("Сумма");
			
			СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");			
			
			Настройки = СхемаКомпоновкиДанных.ВариантыНастроек.ПродажиТабакОПТ.Настройки;
			Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
			ДатаНачала = Период.Значение.ДатаНачала; 
			ДатаОкончания = Период.Значение.ДатаОкончания; 
			
			
			Для Каждого отчет ИЗ спВариантов Цикл
				
				Настройки.Структура[0].Использование = НЕ отчет.Значение = "Прочие";
				Настройки.Структура[1].Использование = отчет.Значение = "Прочие";
				
				Настройки.Отбор.Элементы.Очистить();
				
				НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				НовыйОтбор.ПравоеЗначение = Номенклатура_СигаретыСигары;
				НовыйОтбор.Использование = Истина;
				
				НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
				НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
				НовыйОтбор.Использование = Истина;
				
				НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
				НовыйОтбор.Использование = Истина;
				
				МенеджерыОтбор = Новый СписокЗначений;
				
				Для Каждого эл Из Менеджеры Цикл
					эл.Пометка = ?(отчет.Значение = "Прочие",Истина,СтрНайти(эл.Значение.ФИО,отчет.Значение) > 0);
					Если эл.Пометка Тогда
						МенеджерыОтбор.Добавить(эл.Значение);
					КонецЕсли;
				КонецЦикла;
				
				НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоговорВзаиморасчетов.Менеджер");
				НовыйОтбор.ВидСравнения = ?(отчет.Значение = "Прочие",ВидСравненияКомпоновкиДанных.НеВСписке,ВидСравненияКомпоновкиДанных.ВСписке);
				НовыйОтбор.ПравоеЗначение = МенеджерыОтбор;
				НовыйОтбор.Использование = Истина;
				
				// Компоновка макета
				КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
				
				МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				// Инициализация процессора компоновки
				ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
				
				ТаблицаРезультат = Новый ТаблицаЗначений; 
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
				
				ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
				ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
				
				Для Каждого строка ИЗ ТаблицаРезультат Цикл
					строкаИтоговая = ВТ.Добавить();
					строкаИтоговая.Тип = отчет.Значение;
					строкаИтоговая.Параметр = ?(отчет.Значение = "Прочие",строка.Покупатель,строка.ТорговаяПлощадка);
					строкаИтоговая.Сумма = строка.Сумма;
				КонецЦикла;
			КонецЦикла;
			
			ТаблицаИтоговая = ВТ.СкопироватьКолонки();
			
			Для Каждого отчет ИЗ спВариантов Цикл
				тзВарианта = ВТ.Скопировать(Новый  Структура("Тип",отчет.Значение));
				Для Каждого строка ИЗ тзВарианта Цикл
					строкаИтоговая = ТаблицаИтоговая.Добавить();
					строкаИтоговая.Тип = отчет.Значение;
					
					Если ЗначениеЗаполнено(тзВарианта) Тогда
						ЗаполнитьЗначенияСвойств(строкаИтоговая,строка);
					Иначе
						строкаИтоговая.Параметр = отчет.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			
			ТабДок = Новый ТабличныйДокумент;
			Построитель = Новый ПостроительОтчета;
			Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаИтоговая);       
			Построитель.ТекстЗаголовка = Вариант.Представление+" "+Формат(ДатаНачала,"ДФ=dd.MM.yyyy")+"-"+Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			Построитель.Вывести(ТабДок);
			
		ИначеЕсли Вариант.Представление = "СТИКИ и VELO" Тогда
			
			//	Отбор
			ХозОперацияРозница = Новый СписокЗначений;
			//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
			
			ХозОперацияОпт = Новый СписокЗначений;
			//ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
			ХозОперацияОпт.Добавить(Справочники.ХозОперации.РеализацияТоваров);
			ХозОперацияОпт.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
			
			Номенклатура_СтикиДляНагревания = Справочники.Номенклатура.НайтиПоКоду("D0000880");
			Номенклатура_ПринадлежностиДляКурения = Справочники.Номенклатура.НайтиПоКоду("777811");
			Номенклатура_ЭлектронныеСигареты = Справочники.Номенклатура.НайтиПоКоду("777812");
			
			ТоварнаяМарка_ФМУ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т80");
			ТоварнаяМарка_БАТ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
			ТоварнаяМарка_FICH		= Справочники.ТоварныеМарки.НайтиПоКоду("Т860");
			ТоварнаяМарка_НикоМю	= Справочники.ТоварныеМарки.НайтиПоКоду("Т880");
			ТоварнаяМарка_Пирятин	= Справочники.ТоварныеМарки.НайтиПоКоду("П81");
			ТоварнаяМарка_MaskKing	= Справочники.ТоварныеМарки.НайтиПоКоду("П86");
			ТоварнаяМарка_Астекс	= Справочники.ТоварныеМарки.НайтиПоКоду("В920");
			ТоварнаяМарка_Олимп		= Справочники.ТоварныеМарки.НайтиПоКоду("В878");
			ТоварнаяМарка_Фортуна	= Справочники.ТоварныеМарки.НайтиПоКоду("Т90");
			ТоварнаяМарка_Айфил		= Справочники.ТоварныеМарки.НайтиПоКоду("П85");
			
			спHEETS = Новый СписокЗначений;
			спHEETS.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т107"));
			спHEETS.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т109"));
			спHEETS.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т108"));
			
			спВариантов = Новый СписокЗначений;
			спВариантов.Добавить(,"HEETS розница");
			спВариантов.Добавить(,"HEETS опт");
			спВариантов.Добавить(ТоварнаяМарка_БАТ,"БАТ стики розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_БАТ,"БАТ стики опт",Истина);
			спВариантов.Добавить(,"VELO розница");
			спВариантов.Добавить(,"VELO опт");
			спВариантов.Добавить(,"FICH принадлежности розница");
			спВариантов.Добавить(ТоварнаяМарка_FICH,"FICH сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_FICH,"FICH сигареты опт",Истина);
			спВариантов.Добавить(,"ЭС розница");
			спВариантов.Добавить(,"ЭС опт");
			спВариантов.Добавить(ТоварнаяМарка_НикоМю,"Никомюкрейн розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_НикоМю,"Никомюкрейн опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Пирятин,"Пирятин сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Пирятин,"Пирятин сигареты опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_MaskKing,"MaskKing сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_MaskKing,"MaskKing сигареты опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Астекс,"Астекс-Пром сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Астекс,"Астекс-Пром сигареты опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Олимп,"Олимп Импортс сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Олимп,"Олимп Импортс сигареты опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Фортуна,"Фортуна Электронные сигареты розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Фортуна,"Фортуна Электронные сигареты опт",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Айфил,"Айфил картриджи",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Айфил,"Айфил одноразки розница",Истина);
			спВариантов.Добавить(ТоварнаяМарка_Айфил,"Айфил одноразки опт",Истина);
			
			
			ВТ = Новый ТаблицаЗначений; 
			ВТ.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
			ВТ.Колонки.Добавить("НоменклатураТоварнаяМарка");
			ВТ.Колонки.Добавить("Количество");
			
			СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");			
			
			Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
			Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
			ДатаНачала = Период.Значение.ДатаНачала; 
			ДатаОкончания = Период.Значение.ДатаОкончания; 
			
			
			Для Каждого отчет ИЗ спВариантов Цикл
				
				Настройки.Отбор.Элементы.Очистить();
				
				//НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель");
				//НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
				//НовыйОтбор.ПравоеЗначение = Справочники.Контрагенты.НайтиПоКоду("41146737");	//	Градус-17 ООО
				//НовыйОтбор.Использование = Истина;
				
				Если отчет.Представление = "HEETS розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_СтикиДляНагревания;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_ФМУ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "HEETS опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_СтикиДляНагревания;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_ФМУ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "БАТ стики розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_СтикиДляНагревания;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "БАТ стики опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_СтикиДляНагревания;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "VELO розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "VELO опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "FICH принадлежности розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_FICH;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "FICH сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_FICH;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "FICH сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_FICH;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "ЭС розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "ЭС опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_БАТ;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Никомюкрейн розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_НикоМю;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Никомюкрейн опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_НикоМю;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Пирятин сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Пирятин;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Пирятин сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Пирятин;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "MaskKing сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_MaskKing;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "MaskKing сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_MaskKing;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Астекс-Пром сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Астекс;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Астекс-Пром сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Астекс;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Олимп Импортс сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Олимп;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Олимп Импортс сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Олимп;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Фортуна Электронные сигареты розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Фортуна;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Фортуна Электронные сигареты опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Фортуна;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Айфил картриджи" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ПринадлежностиДляКурения;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Айфил;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Айфил одноразки розница" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияРозница;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Айфил;
					НовыйОтбор.Использование = Истина;
					
				ИначеЕсли отчет.Представление = "Айфил одноразки опт" Тогда
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозОперация");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					НовыйОтбор.ПравоеЗначение = ХозОперацияОпт;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Покупатель.ВидКонтрагента");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					НовыйОтбор.ПравоеЗначение = Перечисления.ВидыКонтрагентов.Внутренний;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = Номенклатура_ЭлектронныеСигареты;
					НовыйОтбор.Использование = Истина;
					
					НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.ТоварнаяМарка");
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
					НовыйОтбор.ПравоеЗначение = ТоварнаяМарка_Айфил;
					НовыйОтбор.Использование = Истина;
					
				КонецЕсли;
				
				//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
				//ВидОформления.Значение = "Античный"; //строка 
				//ВидОформления.Использование = Истина;
				//
				//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
				//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
				//ВыводОтбора.Использование = Истина;
				
				//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
				//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
				//РасположениеРеквизита.Использование = Истина;
				
				// Компоновка макета
				КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
				
				МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				// Инициализация процессора компоновки
				ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
				
				ТаблицаРезультат = Новый ТаблицаЗначений; 
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
				
				ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
				ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
				
				Для Каждого строка ИЗ ТаблицаРезультат Цикл
					строкаИтоговая = ВТ.Добавить();
					строкаИтоговая.Тип = отчет.Представление;
					ЗаполнитьЗначенияСвойств(строкаИтоговая,строка);
				КонецЦикла;
			КонецЦикла;
			
			ТаблицаИтоговая = ВТ.СкопироватьКолонки();
			
			Для Каждого отчет ИЗ спВариантов Цикл
				тзВарианта = ВТ.Скопировать(Новый Структура("Тип",отчет.Представление));
				строкаИтоговая = ТаблицаИтоговая.Добавить();
				строкаИтоговая.Тип = отчет.Представление;
				Если СтрНайти(отчет.Представление,"HEETS") > 0 Тогда
					строкаИтоговая.НоменклатураТоварнаяМарка = отчет.Представление;
					строкаИтоговая.Количество = тзВарианта.Итог("Количество");
					Для Каждого стик ИЗ спHEETS Цикл
						тзHEETS = тзВарианта.Скопировать(Новый Структура("НоменклатураТоварнаяМарка",стик.Значение));
						строкаИтоговая = ТаблицаИтоговая.Добавить();
						строкаИтоговая.Тип = отчет.Представление;
						Если ЗначениеЗаполнено(тзHEETS) Тогда
							ЗаполнитьЗначенияСвойств(строкаИтоговая,тзHEETS[0]);
						Иначе
							строкаИтоговая.НоменклатураТоварнаяМарка = стик.Значение;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли отчет.Пометка Тогда
					строкаИтоговая.НоменклатураТоварнаяМарка = отчет.Значение;
					строкаИтоговая.Количество = тзВарианта.Итог("Количество");	
				Иначе
					Если ЗначениеЗаполнено(тзВарианта) Тогда
						ЗаполнитьЗначенияСвойств(строкаИтоговая,тзВарианта[0]);
					Иначе
						строкаИтоговая.НоменклатураТоварнаяМарка = отчет.Представление;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			
			ТабДок = Новый ТабличныйДокумент;
			Построитель = Новый ПостроительОтчета;
			Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаИтоговая);       
			Построитель.ТекстЗаголовка = Вариант.Представление+" "+Формат(ДатаНачала,"ДФ=dd.MM.yyyy")+"-"+Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
			Построитель.Вывести(ТабДок);
			
		ИначеЕсли Вариант.Значение = ".ФМУ" Тогда
			
			ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Представление);
			
			Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
				ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
				Сообщить(ТекстОшибки);
				РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			Настройки = ВариантОтчета.Настройки.Получить();
			Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
				Если Строка(ТекОтбор.ЛевоеЗначение) = "ОтчетПоставщику" Тогда
					ТекОтбор.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			ТабДок = Новый ТабличныйДокумент;
			
			//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
			СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().ПолучитьМакет("СКД_КонсолидированныеПродажи");
			
			// Загрузка настроек
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
			
			ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
			ВидОформления.Значение = "Античный"; //строка 
			ВидОформления.Использование = Истина;
			
			ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
			ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
			ВыводОтбора.Использование = Истина;
			
			РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
			РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
			РасположениеРеквизита.Использование = Истина;
			
			// Компоновка макета
			КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
			
			МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
			
			// Инициализация процессора компоновки
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
			
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
			
		ИначеЕсли Вариант.Значение = "Отчет оперативный ежедневный" Тогда
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Значение).Ссылка);
			
			Точки = "";
			Если Вариант.Картинка = БиблиотекаКартинок.Вперед Тогда
				Точки = " Новые";
				НовыеТочки = Истина;
			ИначеЕсли Вариант.Картинка = БиблиотекаКартинок.Назад Тогда
				Точки = " Действующие";
				НовыеТочки = Ложь;
			КонецЕсли;
			
			Если Вариант.Представление = "Аттика" Тогда
				Табдок = ОбъектОтчет.ЗаполнитьТаблицу_Аттика(Период,Истина,Истина,НовыеТочки);
			ИначеЕсли Вариант.Представление = "Баффет" Тогда
				Табдок = ОбъектОтчет.ЗаполнитьТаблицу_Баффет(Период,Истина,Истина,НовыеТочки);
			ИначеЕсли Вариант.Представление = "Табак_Дигма" Тогда
				Табдок = ОбъектОтчет.ЗаполнитьТаблицу_Табак_Дигма(Период,Истина,Истина,НовыеТочки);
			КонецЕсли;
			
			ИмяОтчета = "Оперативный " + Вариант.Представление + Точки;
			Вариант.Представление = ИмяОтчета;
			Вариант.Значение = "Ежедневная отчетность Аттика, Баффет";
			
		ИначеЕсли Вариант.Значение = "Новый Шаблон заказа сигарет на РЦ" Тогда
			
			соотРЦ = Новый Соответствие;
			соотРЦ.Вставить("Харьков",Справочники.СкладыКомпании.НайтиПоКоду("AC000019"));	//	Суздальские ряды,12 - РЦ ТКС Аттика
			соотРЦ.Вставить("Полтава",Справочники.СкладыКомпании.НайтиПоКоду("AC000026"));	//	Овощная, 5 - РЦ ТКС Полтава
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Шаблон простой заказа сигарет на РЦ").Ссылка);
			
			ПараметрыВсе = ОбъектОтчет.Инициализация();
			
			Табдок = ОбъектОтчет.Сформировать(ПараметрыВсе.Дата,соотРЦ.Получить(Вариант.Представление),ПараметрыВсе.ТоварнаяМарка);
			
			Вариант.Представление = Вариант.Значение+" "+Вариант.Представление;
			Вариант.Значение = "Заказ сигарет на РЦ";
			
		ИначеЕсли Вариант.Значение = "Шаблон заказа сигарет на РЦ" Тогда
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Значение).Ссылка);
			
			ПараметрыВсе = ОбъектОтчет.Инициализация();
			
			Табдок = ОбъектОтчет.Сформировать(ПараметрыВсе.Дата,ПараметрыВсе.ТоварнаяМарка,ПараметрыВсе.ПлощадкиРЦ,ПараметрыВсе.СкладРЦ,ПараметрыВсе.Дистрибуция1);
			
			Вариант.Представление = Вариант.Значение;
			Вариант.Значение = "Заказ сигарет на РЦ";
			
		ИначеЕсли Вариант.Значение = "Шаблон заказа электронных сигарет на РЦ" Тогда
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Представление).Ссылка);
			
			ОбъектОтчет.ЭС = Истина;
			ПараметрыВсе = ОбъектОтчет.Инициализация();
			
			Табдок = ОбъектОтчет.Сформировать(ПараметрыВсе.Дата,ПараметрыВсе.ТоварнаяМарка,ПараметрыВсе.ПлощадкиРЦ,ПараметрыВсе.СкладРЦ,ПараметрыВсе.Дистрибуция1);
			
			Вариант.Представление = Вариант.Значение;
			Вариант.Значение = "Заказ сигарет на РЦ";
			
		ИначеЕсли Вариант.Значение = "Отчет по оборачиваемости товара" Тогда
			
			РЦ = Ложь;
			текстОптРозница		= "";
			текстПодразделение	= "";
			текстОпт			= "";
			текстИерархия		= "";
			текстСигареты		= "";
			
			Склады = Новый СписокЗначений;
			Склады.Добавить("ДистрибуцияРозница","Розница",Истина,БиблиотекаКартинок.ГрупповоеОбсуждение);
			Склады.Добавить("ДистрибуцияФедоренко","Федоренко",Истина,БиблиотекаКартинок.Пользователь);
			Склады.Добавить("ДистрибуцияКайданов","Кайданов",Истина,БиблиотекаКартинок.СостояниеПользователя08);
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.Вчера;
			Период.ДатаНачала = Период.ДатаНачала - 27*86400;
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Значение).Ссылка);
			
			Отбор = ОбъектОтчет.Инициализация();
			
			Если СтрНайти(Вариант.Представление,"Buffet") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008");			//	ТС Buffet
			ИначеЕсли СтрНайти(Вариант.Представление,"АттикаАттика") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002");			//	ТС Аттика
			ИначеЕсли СтрНайти(Вариант.Представление,"АттикаДигма") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009");			//	ТС Табак-Дигма
			ИначеЕсли СтрНайти(Вариант.Представление,"АттикаРЦ") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002");			//	ТС Аттика
				РЦ = Истина;
				Розница = Истина;
				текстОптРозница = " РЦ";
			КонецЕсли;
			
			текстПодразделение = " "+строка(Подразделение);
			
			Если СтрНайти(Вариант.Представление,"-Роз") > 0 Тогда
				Розница = Истина;
				текстОптРозница = " Розница";
			ИначеЕсли СтрНайти(Вариант.Представление,"-Опт") > 0 Тогда
				Розница = Ложь;
				текстПодразделение = "";
			КонецЕсли;
			
			Если Прав(Вариант.Представление,2) = "/Х" Тогда
				Опт = "ПлощадкиОптХарьков";
				текстОпт = " Опт Харьков";
			ИначеЕсли Прав(Вариант.Представление,2) = "/С" Тогда
				Опт = "ПлощадкиОптСуммы";
				текстОпт = " Опт Сумы";
			ИначеЕсли Прав(Вариант.Представление,2) = "/П" Тогда
				Опт = "ПлощадкиОптПолтава";
				текстОпт = " Опт Полтава";
			ИначеЕсли Прав(Вариант.Представление,2) = "/В" Тогда
				Опт = "ПлощадкиОптВесь";
				текстОпт = " ВЕСЬ ОПТ";
			КонецЕсли;
			
			Если СтрНайти(Вариант.Представление,"+ИЕ") > 0 Тогда
				Отбор.НайтиСтроки(Новый Структура("Поле","Номенклатура"))[0].Использование = Ложь;
				Если СтрНайти(Вариант.Представление,"/Г") > 0 Тогда
					Табдок = ОбъектОтчет.СформироватьВСКД(Розница,РЦ,Период,Подразделение,Отбор);
					текстИерархия = " Иерархия";
				Иначе
					Табдок = ОбъектОтчет.СформироватьВСКД(Розница,РЦ,Период,Подразделение,Отбор,Истина);
					текстИерархия = " Плоско";
				КонецЕсли;
			ИначеЕсли СтрНайти(Вариант.Представление,"+ПЛ") > 0 Тогда
				Если Розница И Подразделение <> "000000008" Тогда
					//Если Розница И ТипЗнч(Подразделение) = Тип("СписокЗначений") И Подразделение[0].Значение.Код <> "000000008" Тогда
					//Отбор.НайтиСтроки(Новый Структура("Поле","Номенклатура"))[0].Значение.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0002000"));	//	Сигары
					//Отбор.НайтиСтроки(Новый Структура("Поле","Номенклатура"))[0].Значение.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0000880"));	//	Стики для нагревания	
				ИначеЕсли НЕ Розница Тогда
					Если СтрНайти(Вариант.Представление,"+Сиг") > 0 Тогда
						текстСигареты = " Сигареты";
						ОтборНоменклатура = Отбор.НайтиСтроки(Новый Структура("Поле","Номенклатура"))[0].Значение;
						ОтборНоменклатура.Удалить(2);
						ОтборНоменклатура.Удалить(1);
					КонецЕсли;
				Иначе
					ОтборНоменклатура = Отбор.НайтиСтроки(Новый Структура("Поле","Номенклатура"))[0].Значение;
					ОтборНоменклатура.Удалить(2);
					ОтборНоменклатура.Удалить(1);
				КонецЕсли;
				
				Табдок = ОбъектОтчет.СформироватьПлоско(Розница,Период,?(Розница,Подразделение,Опт),Отбор);
				
				Если Опт = "ПлощадкиОптХарьков" И текстСигареты = " Сигареты" Тогда
					Книга = Новый ПакетОтображаемыхДокументов;
					Лист = Книга.Состав.Добавить();
					Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
					Лист.Наименование = текстОпт;
					Для Каждого склад из Склады Цикл
						Табдок = ОбъектОтчет.СформироватьПлоскоДистрибуция(Розница,Период,склад.Значение,Отбор,Истина);
						Лист = Книга.Состав.Добавить();
						Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
						Лист.Наименование = склад.Представление;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			Вариант.Значение = Лев(Вариант.Представление,30);
			Вариант.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"по оборачиваемости%1%2%3%4%5",
			текстОптРозница,
			текстПодразделение,
			текстОпт,
			текстСигареты,
			текстИерархия);
			
		ИначеЕсли Вариант.Значение = "Отчет для совета директоров" Тогда
			
			текстТип = "";
			текстПодразделение = "";
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.ПрошлаяНеделя;
			
			ПозаПрошлая = НачалоНедели(НачалоНедели(ТекущаяДата())-1)-1;
			Прошлая = НачалоНедели(ТекущаяДата())-1;
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Значение).Ссылка);
			
			Отбор = ОбъектОтчет.Инициализация();
			
			Если СтрНайти(Вариант.Представление,"-Аттика") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002");		//	ТС Аттика
			ИначеЕсли СтрНайти(Вариант.Представление,"-Баффет") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008");		//	ТС Buffet
			ИначеЕсли СтрНайти(Вариант.Представление,"-ТабакД") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009");		//	ТС Табак-Дигма
			ИначеЕсли СтрНайти(Вариант.Представление,"-Фабрика") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000006");		//	Фабрика Сыра
			КонецЕсли;
			
			текстПодразделение = " "+строка(Подразделение);
			
			Если СтрНайти(Вариант.Представление,"+Обороты") > 0 Тогда
				Если СтрНайти(Вариант.Представление,"-ОПТ") > 0 Тогда
					Табдок = ОбъектОтчет.ЗаполнитьТаблицуТ_ОПТ(Период,Отбор);
					текстТип = " Обороты ОПТ";
					текстПодразделение = "";
				Иначе
					Табдок = ОбъектОтчет.ВывестиОтчетТовароОборот(Период,Подразделение,Отбор);
					текстТип = " Обороты";
				КонецЕсли;
			ИначеЕсли СтрНайти(Вариант.Представление,"+Остатки") > 0 Тогда
				Если СтрНайти(Вариант.Представление,"-Розница") > 0 Тогда
					Табдок = ОбъектОтчет.ВывестиОтчетОстатки(ПозаПрошлая,Прошлая,Подразделение,"Розница");
					текстТип = " Остатки Розница";
				ИначеЕсли СтрНайти(Вариант.Представление,"-ОПТ") > 0 Тогда
					Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000010");		//	Аттика Дистрибуция+Опт
					Табдок = ОбъектОтчет.ВывестиОтчетОстатки(ПозаПрошлая,Прошлая,Подразделение,"ОПТ",Отбор,"СкладыДистибуции");
					текстТип = " Остатки ОПТ";
				ИначеЕсли СтрНайти(Вариант.Представление,"-РЦ") > 0 Тогда
					Табдок = ОбъектОтчет.ВывестиОтчетОстатки(ПозаПрошлая,Прошлая,Подразделение,"РЦ",Отбор,"СкладыРЦ");
					текстТип = " Остатки РЦ";
				Иначе Табдок = ОбъектОтчет.ВывестиОтчетОстатки(ПозаПрошлая,Прошлая,Подразделение);
					текстТип = " Остатки";
				КонецЕсли;
			КонецЕсли;
			
			Вариант.Значение = Лев(Вариант.Представление,30);
			Вариант.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"для совета директоров.%1%2",
			текстТип,
			текстПодразделение);
			
		ИначеЕсли Вариант.Значение = "Дебиторы Аттики" Тогда
			
			ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Представление);
			
			Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
				ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
				Сообщить(ТекстОшибки);
				РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ВидыПериодов = Новый ТаблицаЗначений;
			//ВидыПериодов.Колонки.Добавить("ПредставлениеПериода",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
			ВидыПериодов.Колонки.Добавить("ПредставлениеПериода",Новый ОписаниеТипов("Число"));
			ВидыПериодов.Колонки.Добавить("НачалоПериода",Новый ОписаниеТипов("Число"));
			ВидыПериодов.Колонки.Добавить("КонецПериода",Новый ОписаниеТипов("Число"));
			
			Строка = ВидыПериодов.Добавить();
			Строка.ПредставлениеПериода = 1;
			Строка.НачалоПериода = 0;
			Строка.КонецПериода = 7;
			
			Строка = ВидыПериодов.Добавить();
			Строка.ПредставлениеПериода = 2;
			Строка.НачалоПериода = 7;
			Строка.КонецПериода = 14;
			
			Строка = ВидыПериодов.Добавить();
			Строка.ПредставлениеПериода = 3;
			Строка.НачалоПериода = 14;
			Строка.КонецПериода = 30;
			
			Строка = ВидыПериодов.Добавить();
			Строка.ПредставлениеПериода = 4;
			Строка.НачалоПериода = 30;
			Строка.КонецПериода = 0;
			
			Периоды = Новый СписокЗначений;
			Периоды.Добавить(1,"до 7 дней");
			Периоды.Добавить(2,"от 7 до 14 дней");
			Периоды.Добавить(3,"от 14 до 30 дней");
			Периоды.Добавить(4,"свыше 30 дней");
			
			НаДату = Формат(ТекущаяДата(),"ДЛФ=DD");
			
			ТабДок = Новый ТабличныйДокумент;
			
			Настройки = ВариантОтчета.Настройки.Получить();
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
			
			
			//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
			СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
			
			// Загрузка настроек
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
			
			ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
			ВидОформления.Значение = "Античный"; //строка 
			ВидОформления.Использование = Истина;
			
			ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
			ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
			ВыводОтбора.Использование = Истина;
			
			РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
			РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
			РасположениеРеквизита.Использование = Истина;
			
			// Компоновка макета
			КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
			
			МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			Запрос.УстановитьПараметр("ТаблицаПериодов", ВидыПериодов);	
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаПериодов.ПредставлениеПериода КАК ПредставлениеПериода,
			|	ТаблицаПериодов.НачалоПериода КАК НачалоПериода,
			|	ТаблицаПериодов.КонецПериода КАК КонецПериода
			|ПОМЕСТИТЬ ТаблицаПериоды
			|ИЗ
			|	&ТаблицаПериодов КАК ТаблицаПериодов";
			
			Запрос.Выполнить();
			
			// Инициализация процессора компоновки
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
			//ДеревоЗначений
			
			ТаблицаРезультат = Новый ТаблицаЗначений; 
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			
			ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			ТЗп = ТаблицаРезультат.Скопировать();
			ТЗп.Свернуть("ПредставлениеПериода","СуммаРаспределенная");
			
			ТЗк = ТаблицаРезультат.Скопировать(Новый Структура("ПредставлениеПериода",4));
			ТЗк.Свернуть("Контрагент","СуммаРаспределенная");
			ТЗк.Сортировать("СуммаРаспределенная Убыв");
			
			
			Макет = ПолучитьМакет("Дебиторка");
			облШапка		= Макет.ПолучитьОбласть("Шапка");
			облРаздел		= Макет.ПолучитьОбласть("Раздел");
			облПериод		= Макет.ПолучитьОбласть("Период");
			облПокупатель	= Макет.ПолучитьОбласть("Покупатель");
			облПустая		= Макет.ПолучитьОбласть("Пустая");
			
			облШапка.Параметры.Заголовок = "Задолженность покупатели по срокам ТС Аттика";
			облШапка.Параметры.НаДату = НаДату;
			ТабДок.Вывести(облШапка);
			
			облРаздел.Параметры.Раздел = "Всего задолженность покупатели, тыс.грн.";
			облРаздел.Параметры.Сумма = ТЗп.Итог("СуммаРаспределенная") / 1000;
			ТабДок.Вывести(облРаздел);
			
			СуммаПросроченная = 0;
			Для Каждого п Из Периоды Цикл
				строка = ТЗп.Найти(п.Значение);
				Сумма = ?(строка = Неопределено,0,Строка.СуммаРаспределенная);
				облПериод.Параметры.Период = п.Представление;
				облПериод.Параметры.Сумма = Сумма / 1000;
				ТабДок.Вывести(облПериод);
				Если п.Значение > 2 Тогда
					СуммаПросроченная = СуммаПросроченная + Сумма;
				КонецЕсли;
			КонецЦикла;
			
			облРаздел.Параметры.Раздел = "Итого просроченная задолженность, тыс.грн.";
			облРаздел.Параметры.Сумма = СуммаПросроченная / 1000;
			ТабДок.Вывести(облРаздел);
			
			ТабДок.Вывести(облПустая);
			
			облШапка.Параметры.Заголовок = "Проблемные покупатели ТС Аттика";
			облШапка.Параметры.НаДату = НаДату;
			ТабДок.Вывести(облШапка);
			
			СуммаПроБлемных = 0;
			Для н = 0 По 9 Цикл
				строка = ТЗк.Получить(н);
				облПокупатель.Параметры.Контрагент = строка.Контрагент;
				облПокупатель.Параметры.Сумма = строка.СуммаРаспределенная / 1000;
				ТабДок.Вывести(облПокупатель);
				СуммаПроБлемных = СуммаПроБлемных + строка.СуммаРаспределенная;
			КонецЦикла;
			
			облРаздел.Параметры.Раздел = "Итого крупнейшие, тыс.грн.";
			облРаздел.Параметры.Сумма = СуммаПроБлемных / 1000;
			ТабДок.Вывести(облРаздел);
			
			Вариант.Представление = Вариант.Значение;
			Вариант.Значение = "Еженедельная отчетность Аттика";
			
		ИначеЕсли Вариант.Значение = "Доступность товара" Тогда
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Вариант.Значение).Ссылка);
			
			Если СтрНайти(Вариант.Представление,"Баффет") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008");			//	ТС Buffet
				Макет = "ОтчетКиев";
				//ИначеЕсли СтрНайти(Вариант.Представление,"Аттика") > 0 Тогда
				//	Подразделение = Новый СписокЗначений;
				//	Подразделение.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002"));	//	ТС Аттика
				//	Подразделение.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009"));	//	ТС Табак-Дигма
				//	Макет = "Отчет";
			ИначеЕсли СтрНайти(Вариант.Представление,"Аттика") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002");			//	ТС Аттика
				Макет = "Отчет";
			ИначеЕсли СтрНайти(Вариант.Представление,"Табак-Дигма") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009");			//	ТС Табак-Дигма
				Макет = "Отчет";
			ИначеЕсли СтрНайти(Вариант.Представление,"Кур-кума") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000011");			//	ТС Кур-кума Полтава
				Макет = "Отчет";
			ИначеЕсли СтрНайти(Вариант.Представление,"Фабрика Сыра") > 0 Тогда
				Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000014");			//	ТС Фабрика сыра
				Макет = "Отчет";
			ИначеЕсли СтрНайти(Вариант.Представление,"Склады РЦ") > 0 Тогда
				Подразделение = Неопределено;
				Макет = "ОтчетРЦ";
			КонецЕсли;
			
			Отбор = ОбъектОтчет.Инициализация();
			
			Табдок = ОбъектОтчет.Сформировать(ТекущаяДата(),Подразделение,Отбор,Макет);
			
			Вариант.Значение = "Ежедневная отчетность Аттика, Баффет";
			
		ИначеЕсли Вариант.Представление = "Продажи Дистрибуции по форме" Тогда
			
			НачалоПериода = Вариант.Значение[0].Значение.ДатаНачала;	
			КонецПериода = Вариант.Значение[0].Значение.ДатаОкончания;	
			
			ТабДок = Новый ТабличныйДокумент;
			
			Макет = ПолучитьМакет("ПродажиПоФорме");
			облШапка = Макет.ПолучитьОбласть("Шапка");
			облИтог = Макет.ПолучитьОбласть("Итог");
			облСтрока = Макет.ПолучитьОбласть("Строка");
			
			облШапка.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода);
			ТабДок.Вывести(ОблШапка);
			
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Опт + Дистрибуция");
			спВариантыОтчетов.Добавить(Группа,"Федоренко");
			спВариантыОтчетов.Добавить(Группа,"Кайданов");
			
			Для Каждого ВариантыОтчета Из спВариантыОтчетов Цикл
				Если ВариантыОтчета.Представление = "Федоренко" Тогда
					Менеджеры = Новый СписокЗначений;
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"));	//	Федоренко Иван Владимирович
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
				ИначеЕсли ВариантыОтчета.Представление = "Кайданов" Тогда
					Менеджеры = Новый СписокЗначений;
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"));	//	Кайданов Руслан Михайлович
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
					Менеджеры.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
				КонецЕсли;
				
				ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Представление);
				
				Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
					ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
					Сообщить(ТекстОшибки);
					РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				Настройки = ВариантОтчета.Настройки.Получить();
				Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
					Если Строка(ТекОтбор.ЛевоеЗначение) = "ДоговорВзаиморасчетов.Менеджер" Тогда
						Если ВариантыОтчета.Представление = "Опт + Дистрибуция" Тогда
							ТекОтбор.Использование = Ложь;
						ИначеЕсли ВариантыОтчета.Представление = "Федоренко" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ПравоеЗначение = Менеджеры;
						ИначеЕсли ВариантыОтчета.Представление = "Кайданов" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ПравоеЗначение = Менеджеры;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
					Если Строка(ТекПараметр.Параметр) = "Период" Тогда
						ТекПараметр.Значение = Вариант.Значение;
					КонецЕсли;
				КонецЦикла;
				
				СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
				
				// Загрузка настроек
				КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
				КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
				КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
				
				// Компоновка макета
				КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
				
				МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
				// Инициализация процессора компоновки
				ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
				
				ТаблицаРезультат = Новый ТаблицаЗначений; 
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
				ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
				ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
				
				ИндексПС = ТаблицаРезультат.Количество()-1;
				
				облИтог.Параметры.Параметр = ВариантыОтчета.Представление;
				облИтог.Параметры.Сумма = ТаблицаРезультат[ИндексПС].Сумма;
				облИтог.Параметры.Наценка = ТаблицаРезультат[ИндексПС].ДоходОборот;
				ТабДок.Вывести(облИтог);
				
				Для Каждого строка Из ТаблицаРезультат Цикл
					Если строка.РегламентированныйУчет <> Неопределено Тогда
						облСтрока.Параметры.Параметр = строка.РегламентированныйУчет;		
						облСтрока.Параметры.Сумма = строка.Сумма;
						облСтрока.Параметры.Наценка =строка.ДоходОборот;
						ТабДок.Вывести(облСтрока);
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			Вариант.Представление = Вариант.Представление + ?(Вариант.Значение[0].Значение.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц," Месяц","");	
			Вариант.Значение = "Продажи Дистрибуции по форме";
			
		ИначеЕсли Вариант.Значение = "Продажи ОПТа и Дистрибуции" Тогда
			
			Федоренко = Новый СписокЗначений;
			Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"),"Федоренко");	//	Федоренко Иван Владимирович
			Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
			Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
			Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
			Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
			
			Кайданов = Новый СписокЗначений;
			Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"),"Кайданов");	//	Кайданов Руслан Михайлович
			Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
			Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
			
			Табак = Справочники.Номенклатура.НайтиПоКоду("D0009000");
			
			Полтава	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000300");
			Сумы	= Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000153");
			Харьков = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("GL000160");
			
			Если Вариант.Представление = "Продажи Дистрибуции Детальный" Тогда
				
				ВарыОтчетов = Новый Массив;
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Федоренко,Истина,Ложь,Полтава));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Федоренко,Истина,Ложь,Сумы));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Федоренко,Истина,Ложь,Харьков));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Федоренко,Истина,Истина,"Итого"));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Федоренко,Ложь,Истина,"Итого"));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер,Табак,Итого,РЦ"	,Кайданов,Истина,Истина,"Итого"));
				
				ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию("Продажи Дистрибуции Детальный Год");
				
				Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
					ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
					Сообщить(ТекстОшибки);
					РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				Настройки = ВариантОтчета.Настройки.Получить();
				
				Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
				Если Месяц(ТекущаяДата()) = 1 Тогда 
					Период.Значение.Вариант = ВариантСтандартногоПериода.ПрошлыйГод
				Иначе
					Период.Значение.ДатаОкончания = НачалоМесяца(ТекущаяДата())-1;
				КонецЕсли;
				
				Книга = Новый ПакетОтображаемыхДокументов;
				
				Для Каждого Отчет Из ВарыОтчетов Цикл
					
					ТабДок = Новый ТабличныйДокумент;
					
					Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
						Если Строка(ТекОтбор.ЛевоеЗначение) = "Номенклатура" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ВидСравнения = ?(Отчет.Табак,ВидСравненияКомпоновкиДанных.ВИерархии,ВидСравненияКомпоновкиДанных.НеВИерархии);
							ТекОтбор.ПравоеЗначение = Табак;
						ИначеЕсли Строка(ТекОтбор.ЛевоеЗначение) = "ТорговаяПлощадка" Тогда
							ТекОтбор.Использование = ?(Отчет.Итого,Ложь,Истина);
							ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
							ТекОтбор.ПравоеЗначение = Отчет.РЦ;
						ИначеЕсли Строка(ТекОтбор.ЛевоеЗначение) = "ДоговорВзаиморасчетов.Менеджер" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
							ТекОтбор.ПравоеЗначение = Отчет.Менеджер;
						КонецЕсли;
					КонецЦикла;
					
					СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
					
					// Загрузка настроек
					КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
					КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
					КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
					
					ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
					ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
					ВыводОтбора.Использование = Истина;
					
					// Компоновка макета
					КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
					
					МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
					
					// Инициализация процессора компоновки
					ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
					ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
					
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
					
					Лист = Книга.Состав.Добавить();
					Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
					Лист.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1%2 %3",
					Отчет.Менеджер[0].Представление,
					?(Отчет.Итого,Формат(Отчет.Табак,"БЛ=' Продукты'; БИ=' Табак'"),""),
					Отчет.РЦ,
					текстИерархия);
					
				КонецЦикла;
				
			ИначеЕсли Вариант.Представление = "Продажи Дистрибуции Сравнительный" Тогда
				
				Если Месяц(ТекущаяДата()) = 1 Тогда 
					ДатаНачала		= НачалоГода(НачалоГода(ТекущаяДата())-1);
					ДатаОкончания	= НачалоМесяца(ТекущаяДата())-1;
				Иначе
					ДатаНачала		= НачалоГода(ТекущаяДата());
					ДатаОкончания	= НачалоМесяца(ТекущаяДата())-1;
				КонецЕсли;
				
				спПериодов = Новый Массив;
				спПериодов.Добавить(Новый Структура("ТЗ,ДатаНачала,ДатаОкончания"	,,ДобавитьМесяц(ДатаНачала,-12),ДобавитьМесяц(ДатаОкончания,-12)));
				спПериодов.Добавить(Новый Структура("ТЗ,ДатаНачала,ДатаОкончания"	,,ДатаНачала,ДатаОкончания));
				
				ВарыОтчетов = Новый Массив;
				ВарыОтчетов.Добавить(Новый Структура("Менеджер"	,Федоренко));
				ВарыОтчетов.Добавить(Новый Структура("Менеджер"	,Кайданов));
				
				ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию("Продажи Дистрибуции Детальный Год");
				
				Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
					ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
					Сообщить(ТекстОшибки);
					РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				Настройки = ВариантОтчета.Настройки.Получить();
				
				Настройки.Структура[0].Использование = Истина;				
				Настройки.Структура[1].Использование = Ложь;
				
				Книга = Новый ПакетОтображаемыхДокументов;
				
				Для Каждого Отчет Из ВарыОтчетов Цикл
					
					Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
						Если Строка(ТекОтбор.ЛевоеЗначение) = "ДоговорВзаиморасчетов.Менеджер" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
							ТекОтбор.ПравоеЗначение = Отчет.Менеджер;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
					
					Для Каждого вПериод Из спПериодов Цикл
						
						ТаблицаРезультат = Новый ТаблицаЗначений; 
						
						Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
						Период.Значение.ДатаНачала = вПериод.ДатаНачала;
						Период.Значение.ДатаОкончания = вПериод.ДатаОкончания;
						
						// Загрузка настроек
						КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
						КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
						КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
						
						ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
						ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
						ВыводОтбора.Использование = Истина;
						
						ВертикальноеРасположениеОбщихИтогов = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВертикальноеРасположениеОбщихИтогов"));
						ВертикальноеРасположениеОбщихИтогов.Значение = РасположениеИтоговКомпоновкиДанных.Нет; 
						ВертикальноеРасположениеОбщихИтогов.Использование = Истина;
						
						// Компоновка макета
						КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
						
						МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));						
						
						// Инициализация процессора компоновки
						ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
						ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
						
						ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
						ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
						ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
						
						вПериод.ТЗ = ТаблицаРезультат;
						
					КонецЦикла;
					
					ТабДок = Новый ТабличныйДокумент;
					
					Макет = Обработки.ФоновоеФормированиеОтчетов.ПолучитьМакет("СравнениеПродажДистрибуции");
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВЫРАЗИТЬ(ТЗ_0.Покупатель КАК Справочник.Контрагенты) КАК Покупатель,
					|	ТЗ_0.Сумма КАК Сумма_0
					|ПОМЕСТИТЬ ВТ_0
					|ИЗ
					|	&ТЗ_0 КАК ТЗ_0
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВЫРАЗИТЬ(ТЗ_1.Покупатель КАК Справочник.Контрагенты) КАК Покупатель,
					|	ТЗ_1.Сумма КАК Сумма_1
					|ПОМЕСТИТЬ ВТ_1
					|ИЗ
					|	&ТЗ_1 КАК ТЗ_1
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Покупатель КАК Покупатель,
					|	СУММА(ВложенныйЗапрос.Сумма_0) КАК Сумма_0,
					|	СУММА(ВложенныйЗапрос.Сумма_1) КАК Сумма_1
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВТ_0.Покупатель КАК Покупатель,
					|		ВТ_0.Сумма_0 КАК Сумма_0,
					|		0 КАК Сумма_1
					|	ИЗ
					|		ВТ_0 КАК ВТ_0
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		ВТ_1.Покупатель,
					|		0,
					|		ВТ_1.Сумма_1
					|	ИЗ
					|		ВТ_1 КАК ВТ_1) КАК ВложенныйЗапрос
					|
					|СГРУППИРОВАТЬ ПО
					|	ВложенныйЗапрос.Покупатель
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ.Покупатель КАК Покупатель,
					|	ВТ.Сумма_0 КАК Сумма_0,
					|	ВТ.Сумма_1 КАК Сумма_1,
					|	ВТ.Сумма_1 - ВТ.Сумма_0 КАК Дельта,
					|	ВЫБОР
					|		КОГДА ВТ.Сумма_0 = 0
					|			ТОГДА 0
					|		ИНАЧЕ 100 * (ВТ.Сумма_1 / ВТ.Сумма_0 - 1)
					|	КОНЕЦ КАК ДельтаПроцент
					|ИЗ
					|	ВТ КАК ВТ
					|
					|УПОРЯДОЧИТЬ ПО
					|	Дельта
					|ИТОГИ
					|	СУММА(Сумма_0),
					|	СУММА(Сумма_1),
					|	СУММА(Сумма_1) - СУММА(Сумма_0) КАК Дельта,
					|	ВЫБОР
					|		КОГДА СУММА(ВТ.Сумма_0) = 0
					|			ТОГДА 0
					|		ИНАЧЕ 100 * (СУММА(ВТ.Сумма_1) / СУММА(ВТ.Сумма_0) - 1)
					|	КОНЕЦ КАК ДельтаПроцент
					|ПО
					|	ОБЩИЕ";
					
					Запрос.УстановитьПараметр("ТЗ_0", спПериодов[0].ТЗ);
					Запрос.УстановитьПараметр("ТЗ_1", спПериодов[1].ТЗ);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
					ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
					ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
					ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
					ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
					ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
					
					ТабДок.Очистить();
					ТабДок.Вывести(ОбластьЗаголовок);
					
					ОбластьШапкаТаблицы.Параметры.Период_0 = ПредставлениеПериода(спПериодов[0].ДатаНачала,спПериодов[0].ДатаОкончания);
					ОбластьШапкаТаблицы.Параметры.Период_1 = ПредставлениеПериода(спПериодов[1].ДатаНачала,спПериодов[1].ДатаОкончания);
					ТабДок.Вывести(ОбластьШапкаТаблицы);
					
					ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ВыборкаОбщийИтог.Следующий();		// Общий итог
					ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
					ТабДок.Вывести(ОбластьОбщийИтог);
					
					ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						ТабДок.Вывести(ОбластьДетальныхЗаписей);
					КонецЦикла;
					
					ТабДок.Вывести(ОбластьПодвалТаблицы);
					ТабДок.Вывести(ОбластьПодвал);
					
					
					
					Лист = Книга.Состав.Добавить();
					Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
					Лист.Наименование = Отчет.Менеджер[0].Представление;
					
				КонецЦикла;
				
			ИначеЕсли Вариант.Представление = "Продажи ОПТа Детальный" Тогда
				
				ВарыОтчетов = Новый Массив;
				ВарыОтчетов.Добавить(Новый Структура("Табак",Истина,Ложь));
				ВарыОтчетов.Добавить(Новый Структура("Табак",Ложь));
				
				ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию("Продажи ОПТа Детальный Год");
				
				Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
					ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Представление;
					Сообщить(ТекстОшибки);
					РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				Настройки = ВариантОтчета.Настройки.Получить();
				
				Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
				Если Месяц(ТекущаяДата()) = 1 Тогда 
					Период.Значение.Вариант = ВариантСтандартногоПериода.ПрошлыйГод
				Иначе
					Период.Значение.ДатаОкончания = НачалоМесяца(ТекущаяДата())-1;
				КонецЕсли;
				
				Книга = Новый ПакетОтображаемыхДокументов;
				
				Для Каждого Отчет Из ВарыОтчетов Цикл
					
					ТабДок = Новый ТабличныйДокумент;
					
					Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
						Если Строка(ТекОтбор.ЛевоеЗначение) = "Номенклатура" Тогда
							ТекОтбор.Использование = Истина;
							ТекОтбор.ВидСравнения = ?(Отчет.Табак,ВидСравненияКомпоновкиДанных.ВИерархии,ВидСравненияКомпоновкиДанных.НеВИерархии);
							ТекОтбор.ПравоеЗначение = Табак;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
					
					// Загрузка настроек
					КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
					КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
					КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
					
					ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
					ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
					ВыводОтбора.Использование = Истина;
					
					ВыводПараметров = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПараметрыДанных"));
					ВыводПараметров.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
					ВыводПараметров.Использование = Истина;
					
					// Компоновка макета
					КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
					
					МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
					
					// Инициализация процессора компоновки
					ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
					ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
					
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
					ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
					
					Лист = Книга.Состав.Добавить();
					Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
					Лист.Наименование = Формат(Отчет.Табак,"БЛ=Продукты; БИ=Табак");
					
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли Вариант.Значение = "Товарооборот и маржа" Тогда
			
			ТабДок = Новый ТабличныйДокумент;
			
			Макет = ПолучитьМакет("ТоварооборотМаржа");
			
			облЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
			облШапка		= Макет.ПолучитьОбласть("Шапка|Показатели");
			облШапкаСредне	= Макет.ПолучитьОбласть("Шапка|Средне");
			облШапкаМесяц	= Макет.ПолучитьОбласть("Шапка|Месяц");
			облУровень1		= Макет.ПолучитьОбласть("Уровень1|Показатели");
			облУровень1Средне = Макет.ПолучитьОбласть("Уровень1|Средне");
			облУровень1Месяц= Макет.ПолучитьОбласть("Уровень1|Месяц");
			облУровень2		= Макет.ПолучитьОбласть("Уровень2|Показатели");
			облУровень2Средне = Макет.ПолучитьОбласть("Уровень2|Средне");
			облУровень2Месяц= Макет.ПолучитьОбласть("Уровень2|Месяц");
			облУровень3		= Макет.ПолучитьОбласть("Уровень3|Показатели");
			облУровень3Средне = Макет.ПолучитьОбласть("Уровень3|Средне");
			облУровень3Месяц= Макет.ПолучитьОбласть("Уровень3|Месяц");
			облИтого		= Макет.ПолучитьОбласть("Итог|Показатели");
			облИтогоСредне	= Макет.ПолучитьОбласть("Итог|Средне");
			облИтогоМесяц	= Макет.ПолучитьОбласть("Итог|Месяц");
			облПусто		= Макет.ПолучитьОбласть("Пустая");
			
			Если Месяц(ТекущаяДата()) = 1 Тогда 
				НачалоПериода= НачалоГода(НачалоГода(ТекущаяДата())-1);
				КонецПериода = НачалоМесяца(ТекущаяДата())-1;
			Иначе
				НачалоПериода= НачалоГода(ТекущаяДата());
				КонецПериода = НачалоМесяца(ТекущаяДата())-1;
			КонецЕсли;
			
			Если Вариант.Представление Тогда
				НачалоПериода = ДобавитьМесяц(НачалоПериода,-12);
				КонецПериода = ДобавитьМесяц(КонецПериода,-12);
			КонецЕсли;
			
			спМесяцев = Новый СписокЗначений;
			Для М = 0 По Месяц(КонецПериода)-1 Цикл
				Начало = ДобавитьМесяц(НачалоПериода,М);	
				спМесяцев.Добавить(Начало,ПредставлениеПериода(Начало,КонецМесяца(Начало)));
			КонецЦикла;
			
			КоличествоМесяцев = спМесяцев.Количество();
			
			ХозОперацияРозница = Новый СписокЗначений;
			//ХозОперацияРозница.Добавить(Справочники.ХозОперации.ВиртуальныеПродажи);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
			ХозОперацияРозница.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
			
			Товар_Табак		= Справочники.Номенклатура.НайтиПоКоду("D0009000");
			Товар_Сигареты	= Справочники.Номенклатура.НайтиПоКоду("D0001002");
			Товар_Стики		= Справочники.Номенклатура.НайтиПоКоду("D0000880");
			Товар_Сигары	= Справочники.Номенклатура.НайтиПоКоду("D0002000");
			
			Товар_Продукты	= Справочники.Номенклатура.НайтиПоКоду("D0010000");
			Товар_Алкоголь	= Справочники.Номенклатура.НайтиПоКоду("D0100000");
			Товар_Вермут	= Справочники.Номенклатура.НайтиПоКоду("D0612060");
			Товар_Вино		= Справочники.Номенклатура.НайтиПоКоду("778091");
			Товар_Шампань	= Справочники.Номенклатура.НайтиПоКоду("D0400000");
			Товар_Водка		= Справочники.Номенклатура.НайтиПоКоду("D0200000");
			Товар_Коньяк	= Справочники.Номенклатура.НайтиПоКоду("D0500000");
			Товар_Прочий	= Справочники.Номенклатура.НайтиПоКоду("D0600000");
			Товар_Пиво		= Справочники.Номенклатура.НайтиПоКоду("D0900000");
			Товар_Слабуха	= Справочники.Номенклатура.НайтиПоКоду("D0800000");
			Товар_Безалкоголь= Справочники.Номенклатура.НайтиПоКоду("D0095000");
			Товар_Напитки	= Справочники.Номенклатура.НайтиПоКоду("D0091340");
			Товар_Соки		= Справочники.Номенклатура.НайтиПоКоду("D0091000");
			Товар_Вода		= Справочники.Номенклатура.НайтиПоКоду("D0091330");
			Товар_Кондитерка= Справочники.Номенклатура.НайтиПоКоду("20500");
			Товар_Батончики	= Справочники.Номенклатура.НайтиПоКоду("777937");
			Товар_Жвачка	= Справочники.Номенклатура.НайтиПоКоду("777930");
			Товар_Шоколад	= Справочники.Номенклатура.НайтиПоКоду("D0021000");
			Товар_Снеки		= Справочники.Номенклатура.НайтиПоКоду("D0074400");
			Товар_Чипсы		= Справочники.Номенклатура.НайтиПоКоду("D0050600");
			Товар_Семечки	= Справочники.Номенклатура.НайтиПоКоду("D0024790");
			
			Товар_Непроды	= Справочники.Номенклатура.НайтиПоКоду("D0051000");
			Товар_Припейды	= Справочники.Номенклатура.НайтиПоКоду("779960");
			
			м_Табак		= Новый СписокЗначений;
			м_Табак.Добавить(Товар_Табак);
			м_Сигареты	= Новый СписокЗначений;
			м_Сигареты.Добавить(Товар_Сигареты);
			м_Стики		= Новый СписокЗначений;
			м_Стики.Добавить(Товар_Стики);
			м_Сигары	= Новый СписокЗначений;
			м_Сигары.Добавить(Товар_Сигары);
			
			м_Продукты		= Новый СписокЗначений;
			м_Продукты.Добавить(Товар_Продукты);
			м_Алкоголь		= Новый СписокЗначений;
			м_Алкоголь.Добавить(Товар_Алкоголь);
			м_Вино		= Новый СписокЗначений;
			м_Вино.Добавить(Товар_Вермут);
			м_Вино.Добавить(Товар_Вино);
			м_Вино.Добавить(Товар_Шампань);
			м_Крепкий	= Новый СписокЗначений;
			м_Крепкий.Добавить(Товар_Водка);
			м_Крепкий.Добавить(Товар_Коньяк);
			м_Крепкий.Добавить(Товар_Прочий);
			м_Пиво		= Новый СписокЗначений;
			м_Пиво.Добавить(Товар_Пиво);
			м_Слабуха		= Новый СписокЗначений;
			м_Слабуха.Добавить(Товар_Слабуха);
			м_Безалкоголь		= Новый СписокЗначений;
			м_Безалкоголь.Добавить(Товар_Безалкоголь);
			м_Напитки		= Новый СписокЗначений;
			м_Напитки.Добавить(Товар_Напитки);
			м_Напитки.Добавить(Товар_Соки);
			м_Вода		= Новый СписокЗначений;
			м_Вода.Добавить(Товар_Вода);
			м_Кондитерка		= Новый СписокЗначений;
			м_Кондитерка.Добавить(Товар_Кондитерка);
			м_Батончики		= Новый СписокЗначений;
			м_Батончики.Добавить(Товар_Батончики);
			м_Жвачка		= Новый СписокЗначений;
			м_Жвачка.Добавить(Товар_Жвачка);
			м_Шоколад		= Новый СписокЗначений;
			м_Шоколад.Добавить(Товар_Шоколад);
			м_Снеки		= Новый СписокЗначений;
			м_Снеки.Добавить(Товар_Снеки);
			м_Чипсы		= Новый СписокЗначений;
			м_Чипсы.Добавить(Товар_Чипсы);
			м_Семечки		= Новый СписокЗначений;
			м_Семечки.Добавить(Товар_Семечки);
			
			м_Непроды		= Новый СписокЗначений;
			м_Непроды.Добавить(Товар_Непроды);
			м_Припейды		= Новый СписокЗначений;
			м_Припейды.Добавить(Товар_Припейды);
			
			спПоказатели = Новый СписокЗначений;
			спПоказатели.Добавить("Табак","Табачные изделия",Истина);
			спПоказатели.Добавить("Сигареты","Сигареты");
			спПоказатели.Добавить("Стики","Стики для нагревания");
			спПоказатели.Добавить("Сигары","Сигары");
			спПоказатели.Добавить("Пусто","");
			спПоказатели.Добавить("Продукты","Продукты питания",Истина);
			спПоказатели.Добавить("Алкоголь","Алкогольные напитки",,БиблиотекаКартинок.УровеньВверх);
			спПоказатели.Добавить("Вино","Вино, вермут");
			спПоказатели.Добавить("Крепкий","Крепкий алкоголь");
			спПоказатели.Добавить("Пиво","Пиво");
			спПоказатели.Добавить("Слабуха","Слабоалкогольные Напитки");
			спПоказатели.Добавить("Безалкоголь","Безалкогольные напитки",,БиблиотекаКартинок.УровеньВверх);
			спПоказатели.Добавить("Напитки","Сладкие напитки");
			спПоказатели.Добавить("Вода","Вода");
			спПоказатели.Добавить("Кондитерка","Кондитерские изделия",,БиблиотекаКартинок.УровеньВверх);
			спПоказатели.Добавить("Батончики","Батончики шоколадные");
			спПоказатели.Добавить("Жвачка","Жевательная резинка");
			спПоказатели.Добавить("Шоколад","Шоколад");
			спПоказатели.Добавить("Снеки","Снеки",,БиблиотекаКартинок.УровеньВверх);
			спПоказатели.Добавить("Чипсы","Чипсы");
			спПоказатели.Добавить("Семечки","Семечки жареные");
			спПоказатели.Добавить("Пусто","");
			спПоказатели.Добавить("Непроды","Непродовольственные товары",Истина);
			спПоказатели.Добавить("Припейды","При-пейд, стартовые пакеты");
			//спПоказатели.Добавить("Итог","");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПродажиОбороты.Период КАК Период,
			|	ВЫБОР
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Табак)
			|			ТОГДА ""Табак""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Продукты)
			|			ТОГДА ""Продукты""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Непроды)
			|			ТОГДА ""Непроды""
			|		ИНАЧЕ ""_Другое""
			|	КОНЕЦ КАК Уровень1,
			|	ВЫБОР
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Алкоголь)
			|			ТОГДА ""Алкоголь""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Безалкоголь)
			|			ТОГДА ""Безалкоголь""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Кондитерка)
			|			ТОГДА ""Кондитерка""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Снеки)
			|			ТОГДА ""Снеки""
			|		ИНАЧЕ ""_Другое""
			|	КОНЕЦ КАК Уровень2,
			|	ВЫБОР
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Сигареты)
			|			ТОГДА ""Сигареты""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Стики)
			|			ТОГДА ""Стики""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Сигары)
			|			ТОГДА ""Сигары""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Вино)
			|			ТОГДА ""Вино""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Крепкий)
			|			ТОГДА ""Крепкий""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Пиво)
			|			ТОГДА ""Пиво""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Слабуха)
			|			ТОГДА ""Слабуха""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Напитки)
			|			ТОГДА ""Напитки""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Вода)
			|			ТОГДА ""Вода""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Батончики)
			|			ТОГДА ""Батончики""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Жвачка)
			|			ТОГДА ""Жвачка""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Шоколад)
			|			ТОГДА ""Шоколад""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Чипсы)
			|			ТОГДА ""Чипсы""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Семечки)
			|			ТОГДА ""Семечки""
			|		КОГДА ПродажиОбороты.Номенклатура В ИЕРАРХИИ (&м_Припейды)
			|			ТОГДА ""Припейды""
			|		ИНАЧЕ ""_Другое""
			|	КОНЕЦ КАК Уровень3,
			|	ПродажиОбороты.СуммаУпрОборот КАК СуммаУпрОборот,
			|	ПродажиОбороты.СебестоимостьУпрОборот КАК СебестоимостьУпрОборот
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Месяц,
			|			ХозОперация В ИЕРАРХИИ (&ХозОперация)
			|				И ПодразделениеКомпании = &ПодразделениеКомпании
			|				И (СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон)
			|					ИЛИ СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал))) КАК ПродажиОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт.Период КАК Период,
			|	вт.Уровень1 КАК Уровень1,
			|	вт.Уровень2 КАК Уровень2,
			|	вт.Уровень3 КАК Уровень3,
			|	СУММА(вт.СуммаУпрОборот) КАК Сумма,
			|	СУММА(вт.СуммаУпрОборот - вт.СебестоимостьУпрОборот) КАК Наценка,
			|	СУММА(вт.СебестоимостьУпрОборот) КАК Себестоимость
			|ИЗ
			|	вт КАК вт
			|
			|СГРУППИРОВАТЬ ПО
			|	вт.Уровень1,
			|	вт.Уровень2,
			|	вт.Уровень3,
			|	вт.Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период,
			|	Уровень1,
			|	Уровень2,
			|	Уровень3";
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
			Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002"));
			Запрос.УстановитьПараметр("ХозОперация", ХозОперацияРозница);
			Запрос.УстановитьПараметр("м_Табак",м_Табак);
			Запрос.УстановитьПараметр("м_Сигареты",м_Сигареты);
			Запрос.УстановитьПараметр("м_Стики",м_Стики);
			Запрос.УстановитьПараметр("м_Сигары",м_Сигары);
			Запрос.УстановитьПараметр("м_Продукты",м_Продукты);
			Запрос.УстановитьПараметр("м_Алкоголь",м_Алкоголь);
			Запрос.УстановитьПараметр("м_Вино",м_Вино);
			Запрос.УстановитьПараметр("м_Крепкий",м_Крепкий);
			Запрос.УстановитьПараметр("м_Пиво",м_Пиво);
			Запрос.УстановитьПараметр("м_Слабуха",м_Слабуха);
			Запрос.УстановитьПараметр("м_Безалкоголь",м_Безалкоголь);
			Запрос.УстановитьПараметр("м_Напитки",м_Напитки);
			Запрос.УстановитьПараметр("м_Вода",м_Вода);
			Запрос.УстановитьПараметр("м_Кондитерка",м_Кондитерка);
			Запрос.УстановитьПараметр("м_Батончики",м_Батончики);
			Запрос.УстановитьПараметр("м_Жвачка",м_Жвачка);
			Запрос.УстановитьПараметр("м_Шоколад",м_Шоколад);
			Запрос.УстановитьПараметр("м_Снеки",м_Снеки);
			Запрос.УстановитьПараметр("м_Чипсы",м_Чипсы);
			Запрос.УстановитьПараметр("м_Семечки",м_Семечки);
			Запрос.УстановитьПараметр("м_Непроды",м_Непроды);
			Запрос.УстановитьПараметр("м_Припейды",м_Припейды);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			ТабДок.Вывести(облЗаголовок);
			
			ТабДок.Вывести(облШапка);
			
			облШапкаСредне.Параметры.Мес = КоличествоМесяцев;			
			облШапкаСредне.Параметры.Год = Формат(Год(НачалоПериода),"ЧГ=0");			
			ТабДок.Присоединить(облШапкаСредне);
			
			Для Каждого Месяц Из спМесяцев Цикл
				облШапкаМесяц.Параметры.Месяц = Месяц.Представление;			
				ТабДок.Присоединить(облШапкаМесяц);
			КонецЦикла;
			
			облШапкаМесяц.Параметры.Месяц = "Итог";			
			ТабДок.Присоединить(облШапкаМесяц);
			
			НачОбъед = 6;
			Для Каждого Показатель Из спПоказатели Цикл
				Если Показатель.Значение = "Пусто" Тогда
					ТабДок.Вывести(облПусто);
					ТабДок.Область(НачОбъед,1,5+спПоказатели.Индекс(Показатель),1).Объединить();
					НачОбъед = 6;
					Продолжить;
				КонецЕсли;	
				
				Если Показатель.Пометка Тогда
					НачОбъед = НачОбъед + спПоказатели.Индекс(Показатель);
					Область			= облУровень1;
					ОбластьСредне	= облУровень1Средне;
					ОбластьМесяц	= облУровень1Месяц;
					Область.Параметры.Группа = Показатель.Значение;
					ВТЗ = РезультатЗапроса.Скопировать(Новый Структура("Уровень1",Показатель.Значение));
				ИначеЕсли ЗначениеЗаполнено(Показатель.Картинка) Тогда
					Область			= облУровень2;
					ОбластьСредне	= облУровень2Средне;
					ОбластьМесяц	= облУровень2Месяц;
					ВТЗ = РезультатЗапроса.Скопировать(Новый Структура("Уровень2",Показатель.Значение));
				Иначе
					Область			= облУровень3;
					ОбластьСредне	= облУровень3Средне;
					ОбластьМесяц	= облУровень3Месяц;
					ВТЗ = РезультатЗапроса.Скопировать(Новый Структура("Уровень3",Показатель.Значение));
				КонецЕсли;	
				
				Область.Параметры.Уровень = Показатель.Представление;
				ТабДок.Вывести(Область);
				
				СуммаТовар			= ВТЗ.Итог("Сумма");
				НаценкаТовар		= ВТЗ.Итог("Наценка");
				СебестоимостьТовар	= ВТЗ.Итог("Себестоимость");
				ОбластьСредне.Параметры.Сумма			= СуммаТовар / КоличествоМесяцев;
				ОбластьСредне.Параметры.Наценка			= НаценкаТовар / КоличествоМесяцев;
				ОбластьСредне.Параметры.ПроцентНаценки	= ?(СебестоимостьТовар = 0,0,НаценкаТовар / СебестоимостьТовар * 100);
				ОбластьСредне.Параметры.ПроцентМаржи	= ?(СуммаТовар = 0,0,НаценкаТовар / СуммаТовар * 100);
				
				ТабДок.Присоединить(ОбластьСредне);
				
				Для Каждого Месяц Из спМесяцев Цикл
					мВТЗ = ВТЗ.Скопировать(Новый Структура("Период",Месяц.Значение));
					СуммаМесяца	= мВТЗ.Итог("Сумма");
					НаценкаМесяц= мВТЗ.Итог("Наценка");
					СебестоимостьМесяц= мВТЗ.Итог("Себестоимость");
					ОбластьМесяц.Параметры.Сумма = СуммаМесяца;
					ОбластьМесяц.Параметры.Наценка = НаценкаМесяц;
					ОбластьМесяц.Параметры.ПроцентНаценки = ?(СебестоимостьМесяц = 0,0,НаценкаМесяц / СебестоимостьМесяц * 100);
					ТабДок.Присоединить(ОбластьМесяц);
				КонецЦикла;
				
				ОбластьМесяц.Параметры.Сумма			= СуммаТовар;
				ОбластьМесяц.Параметры.Наценка			= НаценкаТовар;
				ОбластьМесяц.Параметры.ПроцентНаценки	= ?(СебестоимостьТовар = 0,0,НаценкаТовар / СебестоимостьТовар * 100);
				ТабДок.Присоединить(ОбластьМесяц);
				
			КонецЦикла;
			
			ТабДок.Вывести(облИтого);
			ИтогСумма = РезультатЗапроса.Итог("Сумма");
			ИтогНаценка = РезультатЗапроса.Итог("Наценка");
			ИтогСебестоимость = РезультатЗапроса.Итог("Себестоимость");
			
			дВТЗ = РезультатЗапроса.Скопировать(Новый Структура("Уровень1","_Другое"));
			
			ИтогоСуммаСредне		= ИтогСумма - дВТЗ.Итог("Сумма");
			ИтогоНаценкаСредне		= ИтогНаценка - дВТЗ.Итог("Наценка");
			ИтогоСебестоимостьСредне= ИтогСебестоимость - дВТЗ.Итог("Себестоимость");
			
			облИтогоСредне.Параметры.Сумма			= ИтогоСуммаСредне / КоличествоМесяцев;
			облИтогоСредне.Параметры.Наценка		= ИтогоНаценкаСредне / КоличествоМесяцев;
			облИтогоСредне.Параметры.ПроцентНаценки = ?(ИтогоСебестоимостьСредне = 0,0,ИтогоНаценкаСредне / ИтогоСебестоимостьСредне * 100);
			облИтогоСредне.Параметры.ПроцентМаржи	= ?(ИтогоСуммаСредне = 0,0,ИтогоНаценкаСредне / ИтогоСуммаСредне * 100);
			ТабДок.Присоединить(облИтогоСредне);
			
			Для Каждого Месяц Из спМесяцев Цикл
				мВТЗ = РезультатЗапроса.Скопировать(Новый Структура("Период",Месяц.Значение));
				ИтогНаценкаМесяц = мВТЗ.Итог("Наценка");
				ИтогСебестоимостьМесяц = мВТЗ.Итог("Себестоимость");
				облИтогоМесяц.Параметры.Сумма = мВТЗ.Итог("Сумма");
				облИтогоМесяц.Параметры.Наценка = ИтогНаценкаМесяц;
				облИтогоМесяц.Параметры.ПроцентНаценки = ?(ИтогСебестоимостьМесяц = 0,0,ИтогНаценкаМесяц / ИтогСебестоимостьМесяц * 100);
				ТабДок.Присоединить(облИтогоМесяц);
			КонецЦикла;
			
			облИтогоМесяц.Параметры.Сумма = ИтогСумма;
			облИтогоМесяц.Параметры.Наценка = ИтогНаценка;
			облИтогоМесяц.Параметры.ПроцентНаценки = ?(ИтогСебестоимость = 0,0,ИтогНаценка / ИтогСебестоимость * 100);
			ТабДок.Присоединить(облИтогоМесяц);
			
			ТабДок.Область(28,1,29,1).Объединить();
			
			ТабДок.ФиксацияСлева = 7;
			ТабДок.ФиксацияСверху = 5;
			ТабДок.ОтображатьСетку = Ложь;
			Вариант.Представление = Формат(Год(НачалоПериода),"ЧГ=0; ЧФ='Ч '") + Вариант.Значение;
			
			
		ИначеЕсли Вариант.Значение = "Выкупленный товар" Тогда
			
			НаДату = НачалоНедели(ТекущаяДата());
			
			Если СтрНайти(Вариант.Представление,"ТС Аттика") Тогда
				Подразделение = ОбменФронтПовтИсп.МассивПодразделенийАттика();
			ИначеЕсли СтрНайти(Вариант.Представление,"ТС Buffet") Тогда
				Подразделение = ОбменФронтПовтИсп.МассивПодразделенийБафет();
			КонецЕсли;
			
			тзРезультат = ПолучитьВыкупленныйТовар(НаДату,Подразделение);
			
			ТабДок = Новый ТабличныйДокумент;
			
			Макет = ПолучитьМакет("ВыкупленныйТовар");
			облЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
			облШапка		= Макет.ПолучитьОбласть("Шапка");
			облДетали		= Макет.ПолучитьОбласть("Детали");
			облДеталиВыкуп	= Макет.ПолучитьОбласть("ДеталиВыкуп");
			облИтоги		= Макет.ПолучитьОбласть("Итоги");
			облИтогиНеТабак	= Макет.ПолучитьОбласть("ИтогиНеТабак");
			
			облЗаголовок.Параметры.Заголовок = Вариант.Представление;
			облЗаголовок.Параметры.НаДату = НаДату;
			ТабДок.Вывести(облЗаголовок);
			
			ТабДок.Вывести(облШапка);
			
			Для Каждого строка Из тзРезультат Цикл
				Если строка.Выкуп = 0 Тогда
					областьДетали = облДетали;
				Иначе
					областьДетали = облДеталиВыкуп;
				КонецЕсли;
				областьДетали.Параметры.Заполнить(строка);
				ТабДок.Вывести(областьДетали);
			КонецЦикла;
			
			облИтоги.Параметры.ИтогоКредиторка = тзРезультат.Итог("Кредиторка");
			облИтоги.Параметры.ИтогоОстаток = тзРезультат.Итог("Остаток");
			облИтоги.Параметры.Выкуп = тзРезультат.Итог("Выкуп");
			ТабДок.Вывести(облИтоги);
			
			облИтогиНеТабак.Параметры.БезТабака = тзРезультат.Итог("Выкуп")-тзРезультат.Итог("Табак");
			ТабДок.Вывести(облИтогиНеТабак);
			
		ИначеЕсли Вариант.Значение = "ФМУ продажи от Миши" Тогда
			
			ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
			
			Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
				ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
				Сообщить(ТекстОшибки);
				РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			
			тзВнешниеДанные = Новый ТаблицаЗначений;
			тзВнешниеДанные.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
			тзВнешниеДанные.Колонки.Добавить("Global_ID", ОбщегоНазначения.ОписаниеТипаСтрока(30));
			тзВнешниеДанные.Колонки.Добавить("ОбщАртикул", ОбщегоНазначения.ОписаниеТипаСтрока(25));
			тзВнешниеДанные.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
			тзВнешниеДанные.Колонки.Добавить("Покупатель", ОбщегоНазначения.ОписаниеТипаСтрока(60));
			тзВнешниеДанные.Колонки.Добавить("КодПоЕДРПОУ", ОбщегоНазначения.ОписаниеТипаСтрока(20));
			тзВнешниеДанные.Колонки.Добавить("ТочкаДоставки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
			тзВнешниеДанные.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			тзВнешниеДанные.Колонки.Добавить("Производитель", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
			тзВнешниеДанные.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			Запрос.УстановитьПараметр("тзВнешниеДанные", тзВнешниеДанные);	
			Запрос.Текст = "ВЫБРАТЬ
			|	тзВнешниеДанные.Период КАК Период,
			|	тзВнешниеДанные.Global_ID КАК Global_ID,
			|	тзВнешниеДанные.ОбщАртикул КАК ОбщАртикул,
			|	тзВнешниеДанные.Количество КАК Количество,
			|	тзВнешниеДанные.Покупатель КАК Покупатель,
			|	тзВнешниеДанные.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
			|	тзВнешниеДанные.ТочкаДоставки КАК ТочкаДоставки,
			|	тзВнешниеДанные.Номенклатура КАК Номенклатура,
			|	тзВнешниеДанные.Производитель КАК Производитель,
			|	тзВнешниеДанные.Группа КАК Группа
			|ПОМЕСТИТЬ ВнешниеДанные
			|ИЗ
			|	&тзВнешниеДанные КАК тзВнешниеДанные";
			
			Запрос.Выполнить();
			
			Сигареты= Справочники.Номенклатура.НайтиПоКоду("D0001002");
			Сигары	= Справочники.Номенклатура.НайтиПоКоду("D0002000");	
			Стики	= Справочники.Номенклатура.НайтиПоКоду("D0000880");
			
			ТМ_JTI	= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
			ТМ_БАТ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
			ТМ_ИТЮ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
			ТМ_Львов= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
			
			ТаблицаГруппировок = Новый ТаблицаЗначений;
			ТаблицаГруппировок.Колонки.Добавить("ТоварнаяМарка", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
			ТаблицаГруппировок.Колонки.Добавить("ГруппаТовара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаГруппировок.Колонки.Добавить("ПредставлениеГруппировки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
			
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Сигареты;
			//Строка.ТоварнаяМарка = ТМ_JTI;
			//Строка.ПредставлениеГруппировки = "Total JTI";
			//
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Сигареты;
			//Строка.ТоварнаяМарка = ТМ_ИТЮ;
			//Строка.ПредставлениеГруппировки = "Total ИТЮ";
			//
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Сигареты;
			//Строка.ТоварнаяМарка = ТМ_БАТ;
			//Строка.ПредставлениеГруппировки = "Total BAT";
			//
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Стики;
			//Строка.ТоварнаяМарка = ТМ_БАТ;
			//Строка.ПредставлениеГруппировки = "BAT Nanostick";
			//
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Сигареты;
			//Строка.ТоварнаяМарка = ТМ_Львов;
			//Строка.ПредставлениеГруппировки = "Total other";
			//
			//Строка = ТаблицаГруппировок.Добавить();
			//Строка.ГруппаТовара = Сигары;
			//Строка.ТоварнаяМарка = ТМ_Львов;
			//Строка.ПредставлениеГруппировки = "Total other";
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			Запрос.УстановитьПараметр("ТаблицаГруппировки", ТаблицаГруппировок);	
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаГруппировки.ТоварнаяМарка КАК ТоварнаяМарка,
			|	ТаблицаГруппировки.ГруппаТовара КАК ГруппаТовара,
			|	ТаблицаГруппировки.ПредставлениеГруппировки КАК ПредставлениеГруппировки
			|ПОМЕСТИТЬ ТаблицаГруппировки
			|ИЗ
			|	&ТаблицаГруппировки КАК ТаблицаГруппировки";
			
			Запрос.Выполнить();
			
			ТабДок = Новый ТабличныйДокумент;
			
			Настройки = ВариантОтчета.Настройки.Получить();
			
			Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
			Период.Значение.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
			
			ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
			
			//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
			СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
			
			// Загрузка настроек
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
			
			//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
			//ВидОформления.Значение = "Античный"; //строка 
			//ВидОформления.Использование = Истина;
			//
			//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
			//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
			//ВыводОтбора.Использование = Истина;
			//
			//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
			//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
			//РасположениеРеквизита.Использование = Истина;
			
			// Компоновка макета
			КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
			
			МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
			
			// Инициализация процессора компоновки
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
			
			ТабДок = Новый ТабличныйДокумент;
			
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
			ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
			
			Вариант.Представление = Вариант.Значение+"_"+Вариант.Представление;  
			Вариант.Значение = ".ФМУ";
			Получатель = Справочники.Пользователи.НайтиПоНаименованию("РассылкаОтчетов ФМУ");
			
		ИначеЕсли Вариант.Значение = "Продажи по ТТ эл.сигарет" Тогда
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
			
			НачалоПериода = Период.ДатаНачала;
			КонецПериода = Период.ДатаОкончания;
			
			Номенклатура_ЭлектрСигареты	= Справочники.Номенклатура.НайтиПоКоду("777812");
			
			ТабДок = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("ПродажиПоТТ");
			облШапка	= Макет.ПолучитьОбласть("Шапка");
			облМарка	= Макет.ПолучитьОбласть("Марка");
			облДетали	= Макет.ПолучитьОбласть("Детали");
			облУровень	= Макет.ПолучитьОбласть("Уровень");
			
			облШапка.Параметры.Период = ПредставлениеПериода(НачалоПериода,КонецПериода);
			ТабДок.Вывести(облШапка);
			
			ТабДок.НачатьАвтогруппировкуСтрок();
			
			ВыборкаУровень = ПолучитьПродажиПоТТ(НачалоПериода,КонецПериода,Номенклатура_ЭлектрСигареты);
			Пока ВыборкаУровень.Следующий() Цикл
				облУровень.Параметры.Уровень = ВыборкаУровень.Затяжек;	
				ТабДок.Вывести(облУровень,1);
				
				Выборка = ВыборкаУровень.Выбрать();
				Пока Выборка.Следующий() Цикл
					облМарка.Параметры.Показатель = Выборка.ТоварнаяМарка;	
					облМарка.Параметры.Значение = Выборка.ПродажиАттика;	
					ТабДок.Вывести(облМарка,2);
					облДетали.Параметры.Показатель = "Количество ТТ";	
					облДетали.Параметры.Значение = Выборка.КоличествоТТ;	
					ТабДок.Вывести(облДетали,3);
					облДетали.Параметры.Показатель = "Киев";	
					облДетали.Параметры.Значение = Выборка.ПродажиКиев;	
					ТабДок.Вывести(облДетали,3);
					облДетали.Параметры.Показатель = "Дистрибуция";	
					облДетали.Параметры.Значение = Выборка.ПродажиДистриб;	
					ТабДок.Вывести(облДетали,3);
				КонецЦикла;
			КонецЦикла;
			
			ТабДок.ЗакончитьАвтогруппировкуСтрок();
			ТабДок.ОтображатьГруппировки = Истина;
			
			Вариант.Представление = Вариант.Значение + " " + Вариант.Представление;
			Вариант.Значение = "СТИКИ и VELO";
			
			
		КонецЕсли;
		
		ИмяФайла = "Отчет " + Вариант.Представление + " " + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd") + ".XlsX";
		ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
		//Каталог = Лев(ВариантОтчета,СтрНайти(ВариантОтчета," ")-1) + "\";
		Каталог = Вариант.Значение + "\";
		СоздатьКаталог(ПутьХранения+Каталог);
		
		ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
		
		Попытка
			Если Вариант.Пометка Тогда
				Если ЗначениеЗаполнено(Пустые) Тогда
					ИмяФайла = "Незаполненное кол-во сигарет в осн. ед. изм. "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + ".XlsX";
					ТабДок.Записать(ПутьХранения + Каталог + ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
				КонецЕсли;
				Книга.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			ИначеЕсли Вариант.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо Тогда
				ОтправитьПисьмо(ИмяФайла,ТабДок,Получатель,Вариант,СтруктураЗаписиЖурнала);	
			Иначе
				ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			КонецЕсли;
			РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
			Если Вариант.Картинка = БиблиотекаКартинок.Записать Тогда
				Каталог2 = "\\space.digma\office\departments\PowerBi\Доступность товаров\";
				ПолноеИмяФайла2 = Каталог2 + ИмяФайла;
				КопироватьФайл(ПолноеИмяФайла,ПолноеИмяФайла2);
				//ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			КонецЕсли;
		Исключение
			ВсЁОк = Ложь;
			ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		КонецПопытки;
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры


/////////-----000-----/////////


Процедура ЗапуститьОтчеты_БАТ_JTI(спВариантыОтчетов)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		БАТ = Найти(Вариант.Значение,"БАТ");
		JTI = Найти(Вариант.Значение,"JTI");
		
		Если БАТ Тогда
			Каталог = ".БАТ\";
			Обробка = "Обработка.ТК_ФормированиеОтчетовБАТ.Форма.Форма";	
		ИначеЕсли JTI Тогда
			Каталог = ".JTI\";
			Обробка = "Обработка.ТК_ФормированиеОтчетовJTI.Форма.Форма";	
		КонецЕсли;
		
		Тело = "";
		Вложения = Новый Массив;
		списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		
		Для Каждого Настройка Из списокНастроек цикл
			
			ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
			
			ИсточникДанных = ВосстановленныеПараметры.Получить("ИсточникДанных");	
			
			СписокОтчетов = Новый Структура;
			//////		БАТ		//////
			Если ВосстановленныеПараметры.Получить("глОтчетОптовыеПродажи") = Истина Тогда 
				СписокОтчетов.Вставить("ОтчетОптовыеПродажи");
			КонецЕсли;	
			
			Если ВосстановленныеПараметры.Получить("глОтчетДетальныеПродажи") = Истина Тогда 
				СписокОтчетов.Вставить("ОтчетДетальныеПродажи");
			КонецЕсли;
			
			Если ВосстановленныеПараметры.Получить("глОтчетПриходПродукции") = Истина Тогда 
				СписокОтчетов.Вставить("ОтчетПриходПродукции");
			КонецЕсли;
			
			Если ВосстановленныеПараметры.Получить("глСправочникТорговыеТочки") = Истина Тогда 
				СписокОтчетов.Вставить("СправочникТорговыеТочки");
			КонецЕсли;
			
			//////		JTI		//////
			Если Вариант.Представление = "ПрошлаяНеделя" Тогда
				Если ВосстановленныеПараметры.Получить("глОтчетОтчет1") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетПродажи");
				КонецЕсли;	
				
				Если ВосстановленныеПараметры.Получить("глОтчетОтчет1b") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетОстатки");
				КонецЕсли;
				
				Если ВосстановленныеПараметры.Получить("глОтчетПродажиПоРегионам") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетПродажиПоРегионам");
				КонецЕсли;
				
				Если ВосстановленныеПараметры.Получить("ГлОтчет3") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетПродажиПоСкладам");
				КонецЕсли;
				
				Если ВосстановленныеПараметры.Получить("глОтчет4") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетДляДистрибьюторов");
				КонецЕсли;	
				
			ИначеЕсли Вариант.Представление = "ПрошлыйМесяц" Тогда
				Если ВосстановленныеПараметры.Получить("глОтчет10") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетПродажиПоТочкам");
				КонецЕсли;
				
				Если ВосстановленныеПараметры.Получить("глОтчет11") = Истина Тогда 
					СписокОтчетов.Вставить("ОтчетТочкиДоставки");
				КонецЕсли;
			КонецЕсли;
			
			Если СписокОтчетов.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			ПараметрыОтчетов = Новый Структура;
			ПараметрыОтчетов.Вставить("НачалоПериода", ПериодОтчета.ДатаНачала);
			ПараметрыОтчетов.Вставить("КонецПериода", ПериодОтчета.ДатаОкончания);
			ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внешний"));
			ПараметрыОтчетов.Вставить("ИзВнутреннегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внутренний"));
			
			НастройкиОтбора = ВосстановленныеПараметры.Получить("НастройкиОтбора").Получить();
			СтруктураОтборов = Новый Структура;
			Для Каждого Отбор Из НастройкиОтбора.Отбор.Элементы Цикл 
				
				ПолноеИмяОтбора = Строка(Отбор.ЛевоеЗначение);
				
				Если Не Отбор.Использование ИЛИ ПустаяСтрока(ПолноеИмяОтбора) Тогда 
					Продолжить;
				КонецЕсли;
				
				тСтруктураОтбора = Новый Структура;
				тСтруктураОтбора.Вставить("ИмяПоля", ПолноеИмяОтбора);
				тСтруктураОтбора.Вставить("ПравоеЗначение", Отбор.ПравоеЗначение);
				тСтруктураОтбора.Вставить("ВидСравнения", Отбор.ВидСравнения);
				
				ИмяОснРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяОтбора, ".", Истина, Истина).Получить(0);
				Если Не СтруктураОтборов.Свойство(ИмяОснРеквизита) Тогда 	
					СтруктураОтборов.Вставить(ИмяОснРеквизита, Новый Массив);
				КонецЕсли;
				
				СтруктураОтборов[ИмяОснРеквизита].Добавить(тСтруктураОтбора);
			КонецЦикла;
			
			ПараметрыОтчетов.Вставить("Отборы", СтруктураОтборов);
			
			Результат = Обработки[Вариант.Значение].СформироватьОтчеты(СписокОтчетов,ПараметрыОтчетов);
			
			Если ТипЗнч(Результат) = Тип("Структура") Тогда
				
				Для Каждого отчет Из Результат Цикл 
					ТабДок = отчет.Значение.Документ;
					ИмяФайла = отчет.Значение.ИмяФайла;					
					ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
					СоздатьКаталог(ПутьХранения+Каталог);
					
					ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
					
					Попытка
						Если Вариант.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо Тогда
							ПотокФайла = Новый ПотокВПамяти();
							ТабДок.Записать(ПотокФайла);//,ТипФайлаТабличногоДокумента.TXT);
							ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
							ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
							ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", ИмяФайла, ВременноеХранилищеФайла);
							Вложения.Добавить(ОписаниеВложения);
							Тело = Тело+Символы.ПС+ИмяФайла;
						Иначе
							ТабДок.Записать(ПолноеИмяФайла, "Windows-1251");
							РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
						КонецЕсли;
						ВыполненоОтчетов = ВыполненоОтчетов + 1;
					Исключение
						ВсЁОк = Ложь;
						ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
						Сообщить(ТекстОшибки);
						РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					КонецПопытки;
				КонецЦикла;					
			КонецЕсли;
		КонецЦикла;
		Если Вариант.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо Тогда
			Получатель = Справочники.Пользователи.НайтиПоНаименованию("РассылкаОтчетов JTI");
			СтрокаАдрес = "";
			
			ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
			
			тзЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель,ВидКИ,,Ложь);
			Для Каждого ЭлАдрес Из тзЭлАдрес Цикл
				Если ПустаяСтрока(ЭлАдрес.Представление) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаАдрес = СтрокаАдрес + ЭлАдрес.Представление+";";	
			КонецЦикла;
			
			Если ПустаяСтрока(СтрокаАдрес) Тогда
				ТекстОшибки = НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Возврат;
			КонецЕсли;
			
			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
			ПараметрыПисьма.Вставить("Копии","sergei.dotsenko@digma.ua");
			ПараметрыПисьма.Вставить("СкрытыеКопии","sergey.lohvitskiy@digma.ua");
			ПараметрыПисьма.Вставить("Тема","Аттика " + Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd'") + "   Отчеты " + Сред(Каталог,2,3));
			ПараметрыПисьма.Вставить("Тело",Тело);
			ПараметрыПисьма.Вставить("Вложения", Вложения);
			
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
			РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
		КонецЕсли;
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_БАТ_Ежедневные(спВариантыОтчетов)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Вложения = Новый Массив;
		
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		БАТ = Найти(Вариант.Значение,"БАТ");
		JTI = Найти(Вариант.Значение,"JTI");
		
		Если БАТ Тогда
			Каталог = ".БАТ\";
			Обробка = "Обработка.ТК_ФормированиеОтчетовБАТ.Форма.Форма";	
		ИначеЕсли JTI Тогда
			Каталог = ".JTI\";
			Обробка = "Обработка.ТК_ФормированиеОтчетовJTI.Форма.Форма";	
		КонецЕсли;
		
		списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		
		Для Каждого Настройка Из списокНастроек цикл
			
			ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
			
			ИсточникДанных = ВосстановленныеПараметры.Получить("ИсточникДанных");	
			
			СписокОтчетов = Новый Структура;
			//////		БАТ		//////
			Если ВосстановленныеПараметры.Получить("глОтчетОптовыеПродажи") = Истина Тогда 
				СписокОтчетов.Вставить("ОтчетОптовыеПродажи");
			КонецЕсли;	
			
			//Если ВосстановленныеПараметры.Получить("глОтчетДетальныеПродажи") = Истина Тогда 
			//	СписокОтчетов.Вставить("ОтчетДетальныеПродажи");
			//КонецЕсли;
			//
			//Если ВосстановленныеПараметры.Получить("глОтчетПриходПродукции") = Истина Тогда 
			//	СписокОтчетов.Вставить("ОтчетПриходПродукции");
			//КонецЕсли;
			//
			//Если ВосстановленныеПараметры.Получить("глСправочникТорговыеТочки") = Истина Тогда 
			//	СписокОтчетов.Вставить("СправочникТорговыеТочки");
			//КонецЕсли;
			//
			////////		JTI		//////
			//Если Вариант.Представление = "ПрошлаяНеделя" Тогда
			//	Если ВосстановленныеПараметры.Получить("глОтчетОтчет1") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетПродажи");
			//	КонецЕсли;	
			//	
			//	Если ВосстановленныеПараметры.Получить("глОтчетОтчет1b") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетОстатки");
			//	КонецЕсли;
			//	
			//	Если ВосстановленныеПараметры.Получить("глОтчетПродажиПоРегионам") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетПродажиПоРегионам");
			//	КонецЕсли;
			//	
			//	Если ВосстановленныеПараметры.Получить("ГлОтчет3") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетПродажиПоСкладам");
			//	КонецЕсли;
			//	
			//	Если ВосстановленныеПараметры.Получить("глОтчет4") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетДляДистрибьюторов");
			//	КонецЕсли;	
			//	
			//ИначеЕсли Вариант.Представление = "ПрошлыйМесяц" Тогда
			//	Если ВосстановленныеПараметры.Получить("глОтчет10") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетПродажиПоТочкам");
			//	КонецЕсли;
			//	
			//	Если ВосстановленныеПараметры.Получить("глОтчет11") = Истина Тогда 
			//		СписокОтчетов.Вставить("ОтчетТочкиДоставки");
			//	КонецЕсли;
			//КонецЕсли;
			
			Если СписокОтчетов.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			ПараметрыОтчетов = Новый Структура;
			ПараметрыОтчетов.Вставить("НачалоПериода", ПериодОтчета.ДатаНачала);
			ПараметрыОтчетов.Вставить("КонецПериода", ПериодОтчета.ДатаОкончания);
			ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внешний"));
			ПараметрыОтчетов.Вставить("ИзВнутреннегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внутренний"));
			
			НастройкиОтбора = ВосстановленныеПараметры.Получить("НастройкиОтбора").Получить();
			СтруктураОтборов = Новый Структура;
			Для Каждого Отбор Из НастройкиОтбора.Отбор.Элементы Цикл 
				
				ПолноеИмяОтбора = Строка(Отбор.ЛевоеЗначение);
				
				Если Не Отбор.Использование ИЛИ ПустаяСтрока(ПолноеИмяОтбора) Тогда 
					Продолжить;
				КонецЕсли;
				
				тСтруктураОтбора = Новый Структура;
				тСтруктураОтбора.Вставить("ИмяПоля", ПолноеИмяОтбора);
				тСтруктураОтбора.Вставить("ПравоеЗначение", Отбор.ПравоеЗначение);
				тСтруктураОтбора.Вставить("ВидСравнения", Отбор.ВидСравнения);
				
				ИмяОснРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяОтбора, ".", Истина, Истина).Получить(0);
				Если Не СтруктураОтборов.Свойство(ИмяОснРеквизита) Тогда 	
					СтруктураОтборов.Вставить(ИмяОснРеквизита, Новый Массив);
				КонецЕсли;
				
				СтруктураОтборов[ИмяОснРеквизита].Добавить(тСтруктураОтбора);
			КонецЦикла;
			
			ПараметрыОтчетов.Вставить("Отборы", СтруктураОтборов);
			
			Результат = Обработки[Вариант.Значение].СформироватьОтчеты(СписокОтчетов,ПараметрыОтчетов);
			
			Если ТипЗнч(Результат) = Тип("Структура") Тогда 
				
				Для Каждого отчет Из Результат Цикл 
					ТабДок = отчет.Значение.Документ;
					ИмяФайла = отчет.Значение.ИмяФайла;					
					
					ПотокФайла = Новый ПотокВПамяти();
					ТабДок.Записать(ПотокФайла,"windows-1251");
					ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
					ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
					ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", ИмяФайла, ВременноеХранилищеФайла);
					Вложения.Добавить(ОписаниеВложения);
					
					//ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
					//	СоздатьКаталог(ПутьХранения+Каталог);
					//	
					//	ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
					//	
					//	Попытка
					//		ТабДок.Записать(ПолноеИмяФайла, "Windows-1251");
					//		РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
					ВыполненоОтчетов = ВыполненоОтчетов + 1;
					//	Исключение
					//		ВсЁОк = Ложь;
					//		ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
					//		Сообщить(ТекстОшибки);
					//		РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
					//	КонецПопытки;
				КонецЦикла;					
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Получатели = Новый СписокЗначений;
	Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Белов Дмитрий Анатольевич"));
	Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Доценко Сергей Сергеевич"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Лохвицкий Сергей Викторович"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("ЛохвицкийСВ"));
	
	Тело = "";
	
	СтрокаАдрес = "";
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	
	Для Каждого Получатель Из Получатели Цикл
		ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель.Значение,ВидКИ);
		
		Если ПустаяСтрока(ЭлАдрес) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ТекстОшибки = НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ОтчетЗаДату = Формат(ПериодОтчета.ДатаНачала,"ДФ='yyyy-MM-dd'");
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("Копии","bat_reports@bat.com");
	ПараметрыПисьма.Вставить("СкрытыеКопии","sergey.lohvitskiy@digma.ua");
	ПараметрыПисьма.Вставить("Тема","Ежедневные отчеты БАТ за " + ОтчетЗаДату);
	ПараметрыПисьма.Вставить("Тело",Тело);
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ФМУ(спВариантыОтчетов)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = "ОтчетыФМУ";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Вложения = Новый Массив;
	Каталог = ".ФМУ\sFTP_PMU\CSVFiles\";
	Обробка = "Обработка.ТК_ФормированиеОтчетовФМУ.Форма.Форма";	
	
	ТекущаяДата = ТекущаяДата();
	НаДату = КонецДня(НачалоДня(ТекущаяДата)-10);
	ПериодОтчета = Новый СтандартныйПериод;
	списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
	
	Если ДеньНедели(ТекущаяДата) = 1 Тогда
		спВариантыОтчетов.Добавить("ОтчетПродажиРегион","ПрошлаяНеделя");
		спВариантыОтчетов.Добавить("ОтчетПродажиЕжедневный","ПрошлаяНеделя");
	КонецЕсли;
	Если НачалоДня(ТекущаяДата) = НачалоМесяца(ТекущаяДата) Тогда
		спВариантыОтчетов.Добавить("ОтчетПродажиЕжедневный","ПрошлыйМесяц");
		спВариантыОтчетов.Добавить("ОтчетПродажиРегион","ПрошлыйМесяц");
		спВариантыОтчетов.Добавить("ОтчетПродажиРЦ",1);
		спВариантыОтчетов.Добавить("ОтчетПродажиСегмент",1);
		спВариантыОтчетов.Добавить("ОтчетПродажиПроизводитель",1);
		спВариантыОтчетов.Добавить("ОтчетПродажиПроизводительРЦ",3);
		спВариантыОтчетов.Добавить("ОтчетПродажиРЦТТ",3);
		спВариантыОтчетов.Добавить("ОтчетПродажиПроизводительСКЮ",6);
	КонецЕсли;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		СписокОтчетов = Новый Структура;
		
		Если Вариант.Значение = "Проверка продукции ФМУ" Тогда
			СписокОтчетов.Вставить("ОтчетСправочникПродукция");
			ПериодОтчета.Вариант = ВариантСтандартногоПериода.Последние7Дней;
			ИмяНастройки = "Проверка продукции ФМУ";
		ИначеЕсли Вариант.Значение = "ОтчетыЕжедневные" Тогда
			СписокОтчетов.Вставить("ОтчетОстаткиЕжедневный");
			СписокОтчетов.Вставить("ОтчетПродажиЕжедневный");
			ПериодОтчета.Вариант = ВариантСтандартногоПериода.Вчера;
			ИмяНастройки = "ОтчетыЕжедневные";
		ИначеЕсли Вариант.Значение = "ОтчетПродажиЕжедневный" Тогда
			СписокОтчетов.Вставить(Вариант.Значение);
			ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
			ИмяНастройки = "ОтчетыЕжедневные";
		ИначеЕсли Вариант.Значение = "ОтчетПродажиРегион" Тогда
			СписокОтчетов.Вставить(Вариант.Значение);
			ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
			ИмяНастройки = "Сигареты 1,2,3,4,6";
		ИначеЕсли Вариант.Значение = "ОтчетПродажиРЦ" Или Вариант.Значение = "ОтчетПродажиСегмент" Или Вариант.Значение = "ОтчетПродажиПроизводитель" Или Вариант.Значение = "ОтчетПродажиРЦТТ" Тогда
			СписокОтчетов.Вставить(Вариант.Значение);
			ИмяНастройки = "Сигареты 1,2,3,4,6";
			ПериодОтчета.ДатаНачала = ДобавитьМесяц(НачалоМесяца(НаДату),-1-Вариант.Представление);
			ПериодОтчета.ДатаОкончания = КонецМесяца(ПериодОтчета.ДатаНачала);
		ИначеЕсли Вариант.Значение = "ОтчетПродажиПроизводительРЦ" Или Вариант.Значение = "ОтчетПродажиПроизводительСКЮ" Тогда
			СписокОтчетов.Вставить(Вариант.Значение);
			ИмяНастройки = "Сигареты + Стики 5,7";
			ПериодОтчета.ДатаНачала = ДобавитьМесяц(НачалоМесяца(НаДату),-1-Вариант.Представление);
			ПериодОтчета.ДатаОкончания = КонецМесяца(ПериодОтчета.ДатаНачала);
		КонецЕсли;
		
		Если СписокОтчетов.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого Настройка Из списокНастроек цикл
			Если Настройка.Представление = ИмяНастройки Тогда
				ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		ИсточникДанных = ВосстановленныеПараметры.Получить("ИсточникДанных");	
		
		ПараметрыОтчетов = Новый Структура;
		ПараметрыОтчетов.Вставить("НаДату", НаДату);
		ПараметрыОтчетов.Вставить("НачалоПериода", ПериодОтчета.ДатаНачала);
		ПараметрыОтчетов.Вставить("КонецПериода", ПериодОтчета.ДатаОкончания);
		ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внешний"));
		ПараметрыОтчетов.Вставить("ИзВнутреннегоИсточника", (ИсточникДанных = "Все" ИЛИ ИсточникДанных = "Внутренний"));
		
		НастройкиОтбора = ВосстановленныеПараметры.Получить("НастройкиОтбора").Получить();
		СтруктураОтборов = Новый Структура;
		Для Каждого Отбор Из НастройкиОтбора.Отбор.Элементы Цикл 
			
			ПолноеИмяОтбора = Строка(Отбор.ЛевоеЗначение);
			
			Если Не Отбор.Использование ИЛИ ПустаяСтрока(ПолноеИмяОтбора) Тогда 
				Продолжить;
			КонецЕсли;
			
			тСтруктураОтбора = Новый Структура;
			тСтруктураОтбора.Вставить("ИмяПоля", ПолноеИмяОтбора);
			тСтруктураОтбора.Вставить("ПравоеЗначение", Отбор.ПравоеЗначение);
			тСтруктураОтбора.Вставить("ВидСравнения", Отбор.ВидСравнения);
			
			ИмяОснРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяОтбора, ".", Истина, Истина).Получить(0);
			Если Не СтруктураОтборов.Свойство(ИмяОснРеквизита) Тогда 	
				СтруктураОтборов.Вставить(ИмяОснРеквизита, Новый Массив);
			КонецЕсли;
			
			СтруктураОтборов[ИмяОснРеквизита].Добавить(тСтруктураОтбора);
		КонецЦикла;
		
		ПараметрыОтчетов.Вставить("Отборы", СтруктураОтборов);
		
		Результат = Обработки.ТК_ФормированиеОтчетовФМУ.СформироватьОтчеты(СписокОтчетов,ПараметрыОтчетов);
		
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			
			Для Каждого отчет Из Результат Цикл 
				ТабДок = отчет.Значение.Документ;
				ИмяФайла = отчет.Значение.ИмяФайла;					
				
				ПотокФайла = Новый ПотокВПамяти();
				ТабДок.Записать(ПотокФайла,"windows-1251");
				ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
				ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
				ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", ИмяФайла, ВременноеХранилищеФайла);
				Если отчет.Ключ = "СправочникПродукция" Тогда
					Вложения.Добавить(ОписаниеВложения);
					Каталог = ".ФМУ\";
				Иначе
					Каталог = ".ФМУ\sFTP_PMU\CSVFiles\";
				КонецЕсли;
				
				ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
				СоздатьКаталог(ПутьХранения+Каталог);
				
				ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
				
				Попытка
					ТабДок.Записать(ПолноеИмяФайла, "Windows-1251");
					РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
					ВыполненоОтчетов = ВыполненоОтчетов + 1;
				Исключение
					ВсЁОк = Ложь;
					ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
					Сообщить(ТекстОшибки);
					РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Получатели = Новый СписокЗначений;
	Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Доценко Сергей Сергеевич"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Лохвицкий Сергей Викторович"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("ЛохвицкийСВ"));
	
	Тело = "Выгружено " + ВыполненоОтчетов + " Файла(ов)."+Символы.ПС+"Файлы находятся тут"+Символы.ПС+""""+ПутьХранения + Каталог+"""";
	
	СтрокаАдрес = "";
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	
	Для Каждого Получатель Из Получатели Цикл
		ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель.Значение,ВидКИ);
		
		Если ПустаяСтрока(ЭлАдрес) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ТекстОшибки = НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = Формат(ТекущаяДата(),"ДФ='yyyy-MM-dd'");
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("СкрытыеКопии","sergey.lohvitskiy@digma.ua");
	ПараметрыПисьма.Вставить("Тема","Ежедневные отчеты ФМУ " + ТекущаяДата);
	ПараметрыПисьма.Вставить("Тело",Тело);
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ПриходыТабакаПоПоставщикам(спВариантыОтчетов, ТысШт)	Экспорт
	
	ВсЁОк = Истина;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	ПОставкиОт = Новый СписокЗначений;
	ПОставкиОт.Добавить("Фабрики");
	ПОставкиОт.Добавить("Тедис");
	ПОставкиОт.Добавить("Галичина-Табак");
	ПОставкиОт.Добавить("Глобал Тобакко");
	
	Марки = Новый СписокЗначений;
	Марки.Добавить("JTI");
	Марки.Добавить("BAT only CC");
	Марки.Добавить("BAT Kent Nanostick (GLO)");
	Марки.Добавить("ФМУ only CC");
	Марки.Добавить("Heets");
	Марки.Добавить("lil Heatsticks");
	Марки.Добавить("Змінний картридж Veev");
	Марки.Добавить("ИТЮ");
	Марки.Добавить("Velo");
	
	Города = Новый СписокЗначений;
	Города.Добавить("Днепр");
	Города.Добавить("Киев");
	Города.Добавить("Полтава");
	Города.Добавить("Сумы");
	Города.Добавить("Харьков");
	
	ТМ_ИТЮ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
	ТМ_ФМУ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т80");
	ТМ_JTI		= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
	ТМ_БАТ		= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
	ТМ_Гло		= Справочники.ТоварныеМарки.НайтиПоКоду("Т3");
	ТМ_HEETS	= Справочники.ТоварныеМарки.НайтиПоКоду("Т107");
	ТМ_HEETS_Di	= Справочники.ТоварныеМарки.НайтиПоКоду("Т109");
	ТМ_Fiit		= Справочники.ТоварныеМарки.НайтиПоКоду("Т108");
	ТМ_VELO		= Справочники.ТоварныеМарки.НайтиПоКоду("Т1953");
	ТМ_Veev		= Справочники.ТоварныеМарки.НайтиПоКоду("Ф11");
	
	Товар_Принадлежности= Справочники.Номенклатура.НайтиПоКоду("777811");
	Товар_ЭлектрСигареты= Справочники.Номенклатура.НайтиПоКоду("777812");
	Товар_Сигареты		= Справочники.Номенклатура.НайтиПоКоду("D0001002");
	Товар_Стики			= Справочники.Номенклатура.НайтиПоКоду("D0000880");
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию("Приходы табака за неделю");
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - Приходы табака за неделю";
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке("Приходы табака за неделю - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
			Если Строка(ТекОтбор.ЛевоеЗначение) = "Регистратор.Контрагент" Тогда
				Поставщики = ТекОтбор.ПравоеЗначение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Поставщики) ТОгда
			тзРезультат = ПолучитьПриходыТабакаПоПоставщикам(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания,Поставщики,ТысШт);	
		Иначе
			ТекстОшибки = "Не найдены поставщиики - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - поставщиики не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("ПриходыПоПоставщикам");
		облПериод	= Макет.ПолучитьОбласть("Период");
		облШапка	= Макет.ПолучитьОбласть("Шапка|Город");
		облШапкаТМ	= Макет.ПолучитьОбласть("Шапка|Марка");
		облДанные	= Макет.ПолучитьОбласть("Данные|Город");
		облДанныеТМ	= Макет.ПолучитьОбласть("Данные|Марка");
		
		облПериод.Параметры.Период = ПредставлениеПериода(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания);
		ТабДок.Вывести(облПериод);
		
		Для Каждого Поставка ИЗ ПОставкиОт Цикл
			
			ОблШапка.Параметры.Поставщик = Поставка.Значение;
			ТабДок.Вывести(ОблШапка);
			
			втПоставка = тзРезультат.Скопировать(Новый Структура("Поставщик",Поставка.Значение));
			
			Для Каждого Марка Из Марки Цикл                                         
				облШапкаТМ.Параметры.Марка = Марка.Значение;
				ТабДок.Присоединить(облШапкаТМ);
			КонецЦикла;
			
			Для Каждого Город ИЗ Города Цикл
				облДанные.Параметры.Город = Город.Значение;
				ТабДок.Вывести(облДанные);
				
				втГород = втПоставка.Скопировать(Новый Структура("Город",Город.Значение));
				
				Для Каждого Марка Из Марки Цикл
					Колво = -800800008;
					Если Марка.Значение = "JTI" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель",ТМ_JTI));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "BAT only CC" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель,НоменклатураРодитель",ТМ_БАТ,Товар_Сигареты));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "BAT Kent Nanostick (GLO)" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель,НоменклатураРодитель",ТМ_БАТ,Товар_Стики));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "ФМУ only CC" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель,НоменклатураРодитель",ТМ_ФМУ,Товар_Сигареты));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "Heets" Тогда
						втМарка = втГород.Скопировать(Новый Структура("ТоварнаяМарка",ТМ_HEETS));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
						втМарка = втГород.Скопировать(Новый Структура("ТоварнаяМарка",ТМ_HEETS_Di));	
						Колво = Колво + втМарка.Итог("КоличествоПриходЯщики")
					ИначеЕсли Марка.Значение = "lil Heatsticks" Тогда
						втМарка = втГород.Скопировать(Новый Структура("ТоварнаяМарка",ТМ_Fiit));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "Змінний картридж Veev" Тогда
						втМарка = втГород.Скопировать(Новый Структура("ТоварнаяМарка",ТМ_Veev));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "ИТЮ" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель",ТМ_ИТЮ));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					ИначеЕсли Марка.Значение = "Velo" Тогда
						втМарка = втГород.Скопировать(Новый Структура("МаркаРодитель,НоменклатураРодитель",ТМ_БАТ,Товар_Принадлежности));	
						Колво = втМарка.Итог("КоличествоПриходЯщики");
					КонецЕсли;
					облДанныеТМ.Параметры.Колво = Колво;
					ТабДок.Присоединить(облДанныеТМ);
				КонецЦикла;
				
			КонецЦикла;
			
			
		КонецЦикла;
		
		ИмяФайла = "Отчет " + Вариант.Значение+"_"+Вариант.Представление + " " + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd") + ".XlsX";
		ПутьХранения = "\\space.digma\office\departments\Служба_Аналитики\Отчеты Аналитика\";
		//Каталог = Лев(ВариантОтчета,СтрНайти(ВариантОтчета," ")-1) + "\";
		Каталог = ".ФМУ\";;
		СоздатьКаталог(ПутьХранения+Каталог);
		
		ПолноеИмяФайла = ПутьХранения + Каталог + ИмяФайла;
		
		Получатель = Справочники.Пользователи.НайтиПоНаименованию("РассылкаОтчетов ФМУ");
		
		Попытка
			Если Вариант.Пометка Тогда
				ТабДок.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			ИначеЕсли Вариант.Картинка = БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо Тогда
				ОтправитьПисьмо(ИмяФайла,ТабДок,Получатель,Вариант,СтруктураЗаписиЖурнала);	
			Иначе
				ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			КонецЕсли;
			РезультатыВыполнения.ДобавитьКомментарий(Вариант.Представление + " - ОК", СтруктураЗаписиЖурнала);
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		Исключение
			ВсЁОк = Ложь;
			ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		КонецПопытки;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_АналитикаДистрибуции(спВариантыОтчетов)	Экспорт
	
	Каталог = "Продажи ОПТа и Дистрибуции\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		тзРезультат = ПолучитьАналитикаДистрибуции(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания);	
		
		Менеджеры = Новый СписокЗначений;
		Менеджеры.Добавить("Кайданов");
		Менеджеры.Добавить("Федоренко");
		
		Города = Новый СписокЗначений;
		Города.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("GL000160"),"Харьков");
		Города.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000153"),"Сумы");
		Города.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000300"),"Полтава");
		Города.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000322"),"Киев");
		
		Форма = Новый СписокЗначений;
		Форма.Добавить(Ложь,"нал");
		Форма.Добавить(Истина,"безнал");
		
		ТабДок = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("АналитикаДистрибуции");
		облПериод = Макет.ПолучитьОбласть("Период");
		облДетали = Макет.ПолучитьОбласть("Детали");
		облПустая = Макет.ПолучитьОбласть("Пустая");
		
		облПериод.Параметры.Период = ПредставлениеПериода(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания);
		ТабДок.Вывести(облПериод);
		ТабДок.Вывести(облПустая);
		
		Для Каждого Город ИЗ Города Цикл
			Для Каждого Менеджер ИЗ Менеджеры Цикл
				Если Город.Представление <> "Харьков" И Менеджер.Значение = "Кайданов" Тогда
					Продолжить;
				КонецЕсли;
				втТТ = тзРезультат.Скопировать(Новый Структура("ТорговаяПлощадка,Менеджер",Город.Значение,Менеджер.Значение));	
				Показатель = "АКБ "+Город.Представление+" "+Менеджер.Значение+" кол-во ТТ";
				Значение = втТТ.Итог("ТочкаДоставки");	
				облДетали.Параметры.Показатель = Показатель;
				облДетали.Параметры.Значение = Значение;
				ТабДок.Вывести(облДетали);
			КонецЦикла;
		КонецЦикла;
		
		ТабДок.Вывести(облПустая);
		
		облДетали.Параметры.Показатель = "Товарооборот, грн.";
		облДетали.Параметры.Значение = тзРезультат.Итог("Сумма");
		ТабДок.Вывести(облДетали);
		
		ТабДок.Вывести(облПустая);
		
		Для Каждого Учет ИЗ Форма Цикл
			втТТ = тзРезультат.Скопировать(Новый Структура("Учет",Учет.Значение));	
			облДетали.Параметры.Показатель = "Общий "+Учет.Представление;
			облДетали.Параметры.Значение = втТТ.Итог("Сумма");
			ТабДок.Вывести(облДетали);
		КонецЦикла;
		
		ТабДок.Вывести(облПустая);
		
		Для Каждого Менеджер ИЗ Менеджеры Цикл
			Для Каждого Город ИЗ Города Цикл
				Если Город.Представление <> "Харьков" И Менеджер.Значение = "Кайданов" Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого Учет ИЗ Форма Цикл
					втТТ = тзРезультат.Скопировать(Новый Структура("Менеджер,ТорговаяПлощадка,Учет",Менеджер.Значение,Город.Значение,Учет.Значение));
					Показатель = Менеджер.Значение+" "+Город.Представление+" "+Учет.Представление;
					Значение = втТТ.Итог("Сумма");	
					облДетали.Параметры.Показатель = Показатель;
					облДетали.Параметры.Значение = Значение;
					ТабДок.Вывести(облДетали);
				КонецЦикла;
				ТабДок.Вывести(облПустая);
			КонецЦикла;
		КонецЦикла;
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ИТЮ_ПродажиОтМиши(спВариантыОтчетов)	Экспорт
	
	Каталог = ".ИТЮ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Обробка = "ВнешнийОтчет.ОтчетПродажиПроизводителей.Форма.ФормаОтчета";	
		списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		
		Для Каждого Настройка Из списокНастроек цикл
			Если Настройка.Представление = "Для ИТЮ" Тогда 
				ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
				тзГруппировки = ВосстановленныеПараметры.Получить("ХранилищеГруппировок").Получить();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Если тзГруппировки = Неопределено ТОгда
			ТекстОшибки = "Не найдена настройка группировки -Для ИТЮ- : "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - группировка не найдена", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		тзВнешниеДанные = Новый ТаблицаЗначений;
		тзВнешниеДанные.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		тзВнешниеДанные.Колонки.Добавить("Global_ID", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		тзВнешниеДанные.Колонки.Добавить("ОбщАртикул", ОбщегоНазначения.ОписаниеТипаСтрока(25));
		тзВнешниеДанные.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		тзВнешниеДанные.Колонки.Добавить("Покупатель", ОбщегоНазначения.ОписаниеТипаСтрока(60));
		тзВнешниеДанные.Колонки.Добавить("КодПоЕДРПОУ", ОбщегоНазначения.ОписаниеТипаСтрока(20));
		тзВнешниеДанные.Колонки.Добавить("ТочкаДоставки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		тзВнешниеДанные.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзВнешниеДанные.Колонки.Добавить("Производитель", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		тзВнешниеДанные.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("тзВнешниеДанные", тзВнешниеДанные);	
		Запрос.Текст = "ВЫБРАТЬ
		|	тзВнешниеДанные.Период КАК Период,
		|	тзВнешниеДанные.Global_ID КАК Global_ID,
		|	тзВнешниеДанные.ОбщАртикул КАК ОбщАртикул,
		|	тзВнешниеДанные.Количество КАК Количество,
		|	тзВнешниеДанные.Покупатель КАК Покупатель,
		|	тзВнешниеДанные.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
		|	тзВнешниеДанные.ТочкаДоставки КАК ТочкаДоставки,
		|	тзВнешниеДанные.Номенклатура КАК Номенклатура,
		|	тзВнешниеДанные.Производитель КАК Производитель,
		|	тзВнешниеДанные.Группа КАК Группа
		|ПОМЕСТИТЬ ВнешниеДанные
		|ИЗ
		|	&тзВнешниеДанные КАК тзВнешниеДанные";
		
		Запрос.Выполнить();
		
		//Сигареты= Справочники.Номенклатура.НайтиПоКоду("D0001002");
		//Сигары	= Справочники.Номенклатура.НайтиПоКоду("D0002000");	
		//Стики	= Справочники.Номенклатура.НайтиПоКоду("D0000880");
		//
		//ТМ_JTI	= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
		//ТМ_БАТ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
		//ТМ_ИТЮ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
		//ТМ_Львов= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
		//
		//ТаблицаГруппировок = Новый ТаблицаЗначений;
		//ТаблицаГруппировок.Колонки.Добавить("ТоварнаяМарка", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		//ТаблицаГруппировок.Колонки.Добавить("ГруппаТовара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//ТаблицаГруппировок.Колонки.Добавить("ПредставлениеГруппировки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_JTI;
		//Строка.ПредставлениеГруппировки = "Total JTI";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_ИТЮ;
		//Строка.ПредставлениеГруппировки = "Total ИТЮ";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "Total BAT";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Стики;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "BAT Nanostick";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигары;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("ТаблицаГруппировки", тзГруппировки);	
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаГруппировки.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ТаблицаГруппировки.ГруппаТовара КАК ГруппаТовара,
		|	ТаблицаГруппировки.ПредставлениеГруппировки КАК ПредставлениеГруппировки
		|ПОМЕСТИТЬ ТаблицаГруппировки
		|ИЗ
		|	&ТаблицаГруппировки КАК ТаблицаГруппировки";
		
		Запрос.Выполнить();
		
		ТабДок = Новый ТабличныйДокумент;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Период.Значение.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ПродажиТОП100(спВариантыОтчетов)	Экспорт
	
	Каталог = "ТОП 100\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Книга = Новый ПакетОтображаемыхДокументов;
		
		ПериодОтчета = Новый СтандартныйПериод;
		ПериодОтчета.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ВыборкаТабак = ПолучитьТОП100Продаж(ПериодОтчета.ДатаНачала,ПериодОтчета.ДатаОкончания);	
		
		Пока ВыборкаТабак.Следующий() Цикл
			
			ТабДок = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("ПродажиТОП100");
			облШапка = Макет.ПолучитьОбласть("Шапка");
			облДанные = Макет.ПолучитьОбласть("Данные");
			
			ТабДок.Вывести(облШапка);
			
			ТОП100 = 0;
			Выборка = ВыборкаТабак.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТОП100 = 1 + ТОП100;
				облДанные.Параметры.Заполнить(Выборка);				
				ТабДок.Вывести(облДанные);
				Если ТОП100 = 100 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Лист = Книга.Состав.Добавить();
			Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
			Лист.Наименование = Формат(ВыборкаТабак.Табак,"БЛ='Не табак'; БИ=Табак");
			
		КонецЦикла;
		
		ВсЁОк = ЗаписатьТабДок(Книга,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ФИЧ_ПродажиОтМиши(спВариантыОтчетов)	Экспорт
	
	Каталог = "ФИЧ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		//Обробка = "ВнешнийОтчет.ОтчетПродажиПроизводителей.Форма.ФормаОтчета";	
		//списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		//
		//Для Каждого Настройка Из списокНастроек цикл
		//	Если Настройка.Представление = "Для ИТЮ" Тогда 
		//		ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
		//		тзГруппировки = ВосстановленныеПараметры.Получить("ХранилищеГруппировок").Получить();
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Если тзГруппировки = Неопределено ТОгда
		//	ТекстОшибки = "Не найдена настройка группировки -Для ИТЮ- : "+Вариант.Значение;
		//	Сообщить(ТекстОшибки);
		//	РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - группировка не найдена", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		//	Продолжить;
		//КонецЕсли;
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		тзВнешниеДанные = Новый ТаблицаЗначений;
		тзВнешниеДанные.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		тзВнешниеДанные.Колонки.Добавить("Global_ID", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		тзВнешниеДанные.Колонки.Добавить("ОбщАртикул", ОбщегоНазначения.ОписаниеТипаСтрока(25));
		тзВнешниеДанные.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		тзВнешниеДанные.Колонки.Добавить("Покупатель", ОбщегоНазначения.ОписаниеТипаСтрока(60));
		тзВнешниеДанные.Колонки.Добавить("КодПоЕДРПОУ", ОбщегоНазначения.ОписаниеТипаСтрока(20));
		тзВнешниеДанные.Колонки.Добавить("ТочкаДоставки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		тзВнешниеДанные.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзВнешниеДанные.Колонки.Добавить("Производитель", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		тзВнешниеДанные.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("тзВнешниеДанные", тзВнешниеДанные);	
		Запрос.Текст = "ВЫБРАТЬ
		|	тзВнешниеДанные.Период КАК Период,
		|	тзВнешниеДанные.Global_ID КАК Global_ID,
		|	тзВнешниеДанные.ОбщАртикул КАК ОбщАртикул,
		|	тзВнешниеДанные.Количество КАК Количество,
		|	тзВнешниеДанные.Покупатель КАК Покупатель,
		|	тзВнешниеДанные.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
		|	тзВнешниеДанные.ТочкаДоставки КАК ТочкаДоставки,
		|	тзВнешниеДанные.Номенклатура КАК Номенклатура,
		|	тзВнешниеДанные.Производитель КАК Производитель,
		|	тзВнешниеДанные.Группа КАК Группа
		|ПОМЕСТИТЬ ВнешниеДанные
		|ИЗ
		|	&тзВнешниеДанные КАК тзВнешниеДанные";
		
		Запрос.Выполнить();
		
		//Сигареты= Справочники.Номенклатура.НайтиПоКоду("D0001002");
		//Сигары	= Справочники.Номенклатура.НайтиПоКоду("D0002000");	
		//Стики	= Справочники.Номенклатура.НайтиПоКоду("D0000880");
		//
		//ТМ_JTI	= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
		//ТМ_БАТ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
		//ТМ_ИТЮ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
		//ТМ_Львов= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
		
		ТаблицаГруппировок = Новый ТаблицаЗначений;
		ТаблицаГруппировок.Колонки.Добавить("ТоварнаяМарка", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		ТаблицаГруппировок.Колонки.Добавить("ГруппаТовара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаГруппировок.Колонки.Добавить("ПредставлениеГруппировки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_JTI;
		//Строка.ПредставлениеГруппировки = "Total JTI";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_ИТЮ;
		//Строка.ПредставлениеГруппировки = "Total ИТЮ";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "Total BAT";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Стики;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "BAT Nanostick";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигары;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("ТаблицаГруппировки", ТаблицаГруппировок);	
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаГруппировки.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ТаблицаГруппировки.ГруппаТовара КАК ГруппаТовара,
		|	ТаблицаГруппировки.ПредставлениеГруппировки КАК ПредставлениеГруппировки
		|ПОМЕСТИТЬ ТаблицаГруппировки
		|ИЗ
		|	&ТаблицаГруппировки КАК ТаблицаГруппировки";
		
		Запрос.Выполнить();
		
		ТабДок = Новый ТабличныйДокумент;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Период.Значение.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		Получатель = Справочники.Пользователи.НайтиПоНаименованию("РассылкаОтчетов ФИЧ");
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог,Получатель);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ДляИТЮ_Продажи(спВариантыОтчетов)	Экспорт
	
	Каталог = ".ИТЮ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Обробка = "ВнешнийОтчет.ОтчетПродажиПроизводителей.Форма.ФормаОтчета";	
		списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		
		Для Каждого Настройка Из списокНастроек цикл
			Если Настройка.Представление = "Для ИТЮ" Тогда 
				ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
				тзГруппировки = ВосстановленныеПараметры.Получить("ХранилищеГруппировок").Получить();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Если тзГруппировки = Неопределено ТОгда
			ТекстОшибки = "Не найдена настройка группировки -Для ИТЮ- : "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - группировка не найдена", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		тзГруппировки.Очистить();
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		тзВнешниеДанные = Новый ТаблицаЗначений;
		тзВнешниеДанные.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		тзВнешниеДанные.Колонки.Добавить("Global_ID", ОбщегоНазначения.ОписаниеТипаСтрока(30));
		тзВнешниеДанные.Колонки.Добавить("ОбщАртикул", ОбщегоНазначения.ОписаниеТипаСтрока(25));
		тзВнешниеДанные.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		тзВнешниеДанные.Колонки.Добавить("Покупатель", ОбщегоНазначения.ОписаниеТипаСтрока(60));
		тзВнешниеДанные.Колонки.Добавить("КодПоЕДРПОУ", ОбщегоНазначения.ОписаниеТипаСтрока(20));
		тзВнешниеДанные.Колонки.Добавить("ТочкаДоставки", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		тзВнешниеДанные.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзВнешниеДанные.Колонки.Добавить("Производитель", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		тзВнешниеДанные.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("тзВнешниеДанные", тзВнешниеДанные);	
		Запрос.Текст = "ВЫБРАТЬ
		|	тзВнешниеДанные.Период КАК Период,
		|	тзВнешниеДанные.Global_ID КАК Global_ID,
		|	тзВнешниеДанные.ОбщАртикул КАК ОбщАртикул,
		|	тзВнешниеДанные.Количество КАК Количество,
		|	тзВнешниеДанные.Покупатель КАК Покупатель,
		|	тзВнешниеДанные.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
		|	тзВнешниеДанные.ТочкаДоставки КАК ТочкаДоставки,
		|	тзВнешниеДанные.Номенклатура КАК Номенклатура,
		|	тзВнешниеДанные.Производитель КАК Производитель,
		|	тзВнешниеДанные.Группа КАК Группа
		|ПОМЕСТИТЬ ВнешниеДанные
		|ИЗ
		|	&тзВнешниеДанные КАК тзВнешниеДанные";
		
		Запрос.Выполнить();
		
		//Сигареты= Справочники.Номенклатура.НайтиПоКоду("D0001002");
		//Сигары	= Справочники.Номенклатура.НайтиПоКоду("D0002000");	
		//Стики	= Справочники.Номенклатура.НайтиПоКоду("D0000880");
		//
		//ТМ_JTI	= Справочники.ТоварныеМарки.НайтиПоКоду("Т20");
		//ТМ_БАТ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т10");
		//ТМ_ИТЮ	= Справочники.ТоварныеМарки.НайтиПоКоду("Т40");
		//ТМ_Львов= Справочники.ТоварныеМарки.НайтиПоКоду("Т60");
		//
		//ТаблицаГруппировок = Новый ТаблицаЗначений;
		//ТаблицаГруппировок.Колонки.Добавить("ТоварнаяМарка", Новый ОписаниеТипов("СправочникСсылка.ТоварныеМарки"));
		//ТаблицаГруппировок.Колонки.Добавить("ГруппаТовара", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		//ТаблицаГруппировок.Колонки.Добавить("ПредставлениеГруппировки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_JTI;
		//Строка.ПредставлениеГруппировки = "Total JTI";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_ИТЮ;
		//Строка.ПредставлениеГруппировки = "Total ИТЮ";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "Total BAT";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Стики;
		//Строка.ТоварнаяМарка = ТМ_БАТ;
		//Строка.ПредставлениеГруппировки = "BAT Nanostick";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигареты;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		//
		//Строка = ТаблицаГруппировок.Добавить();
		//Строка.ГруппаТовара = Сигары;
		//Строка.ТоварнаяМарка = ТМ_Львов;
		//Строка.ПредставлениеГруппировки = "Total other";
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("ТаблицаГруппировки", тзГруппировки);	
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаГруппировки.ТоварнаяМарка КАК ТоварнаяМарка,
		|	ТаблицаГруппировки.ГруппаТовара КАК ГруппаТовара,
		|	ТаблицаГруппировки.ПредставлениеГруппировки КАК ПредставлениеГруппировки
		|ПОМЕСТИТЬ ТаблицаГруппировки
		|ИЗ
		|	&ТаблицаГруппировки КАК ТаблицаГруппировки";
		
		Запрос.Выполнить();
		
		ТабДок = Новый ТабличныйДокумент;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Период.Значение.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		Получатель = Справочники.Пользователи.НайтиПоНаименованию("РассылкаОтчетов ИТЮ");
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог,Получатель);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ДляФМУ_ОстаткиНаРЦ1(спВариантыОтчетов)	Экспорт
	
	Каталог = ".ФМУ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		
		Склады = Новый СписокЗначений;
		Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AC000026"));	//	Овощная, 5 - РЦ ТКС Полтава
		Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AC000024"));	//	Юрия Вєтрова, 20/1 - РЦ ТКС Сумы
		Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AC000019"));	//	Суздальские ряды,12 - РЦ ТКС Аттика
		Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AC000021"));	//	Суздальские ряды,12 - РЦ ТКС Дистрибьюция
		Склады.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AC000027"));	//	Суздальские ряды,12 - РЦ ТКС Дистрибьюция 1
		
		Номенклатура = Новый СписокЗначений;
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","3540"));				//	BOND STREET BLUE SELECTION 20
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","3170"));				//	BOND STREET BLUE SELECTION 25
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2320"));				//	L&M LOFT BLUE 
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2332"));				//	L&M LOFT SEA BLUE KS DSP 20 SLI
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2440"));				//	L&M LOFT MIX KS DSP 20 SLI
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2797"));				//	MARLBORO GOLD
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2831"));				//	MARLBORO RED
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","3771"));				//	PARLIAMENT AQUA
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2566"));				//	PHILIP MORRIS (RED) KS RCB 25
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","2416"));				//	PHILIP MORRIS NOVEL MIX KS DSP 20 SLI
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1378"),,Истина);		//	HEETS AMBER . TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1384"));				//	HEETS BRONZE, TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1386"));				//	HEETS GREEN ZING, TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","18846"),,Истина);	//	HEETS PURPLE , TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","29179"));			//	HEETS RUBY FUSE , TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1374"));				//	HEETS SILVER , TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1262"));				//	HEETS TROPICAL SWIFT, TBEH
		Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1380"));				//	HEETS YELLOW, TBEH
		
		НоменклатураСлагаемое = Новый СписокЗначений;
		НоменклатураСлагаемое.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","1378"),,Истина);		//	HEETS AMBER . TBEH
		
		НоменклатураСумма = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул","18846");	//	HEETS PURPLE , TBEH
		
		//Период = Новый СтандартныйПериод;;
		//Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		//ДатаНачала = Период.ДатаНачала;
		//ДатаОкончания = Период.ДатаОкончания;
		//
		//мДни = Новый Массив;
		//Пока ДатаНачала < ДатаОкончания Цикл
		//	мДни.Добавить(ДатаНачала);
		//	
		//	ДатаНачала = ДатаНачала + 86400;
		//КонецЦикла;
		//
		//
		//ТабДок = Новый ТабличныйДокумент;
		//Макет = ПолучитьМакет("ОстаткиРЦ_ДляФМУ");
		//облШапка		= Макет.ПолучитьОбласть("Шапка|Показатели");
		//облШапкаДень	= Макет.ПолучитьОбласть("Шапка|День");
		//облДанные		= Макет.ПолучитьОбласть("Данные|Показатели");
		//облДанныеДень	= Макет.ПолучитьОбласть("Данные|День");
		//облПусто		= Макет.ПолучитьОбласть("Пусто|Показатели");
		//облПустоДень	= Макет.ПолучитьОбласть("Пусто|День");
		//
		//ТабДок.Вывести(ОблШапка);
		//
		//Для Каждого День Из мДни Цикл                                         
		//	облШапкаДень.Параметры.День = День;
		//	ТабДок.Присоединить(облШапкаДень);
		//КонецЦикла;
		//
		//Для Каждого День Из мДни Цикл                                         
		//	ВыборкаСклад = ПолучитьОстаткиРЦ_ДляФМУ(Склады,Номенклатура,День);
		//	
		//	Пока ВыборкаСклад.Следующий() Цикл
		//		Выборка = ВыборкаСклад.Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			облДанные.Параметры.Заполнить(Выборка);				
		//			ТабДок.Вывести(облДанные);
		//		КонецЦикла;
		//		
		//		
		//	КонецЦикла;
		//	
		//КонецЦикла;
		
		////////////////////////////////////
		
		ТабДок = Новый ТабличныйДокумент;
		
		СхемаКомпоновкиДанных = ПолучитьМакет("ОстаткиРЦ_ДляФМУ");			
		
		Настройки = СхемаКомпоновкиДанных.ВариантыНастроек.ОстаткиРЦ_ДляФМУ.Настройки;
		
		Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл
			Если Строка(ТекПараметр.Параметр) = "Номенклатура" Тогда
				ТекПараметр.Значение = Номенклатура;
			КонецЕсли;
			Если Строка(ТекПараметр.Параметр) = "СкладКомпании" Тогда
				ТекПараметр.Значение = Склады;
			КонецЕсли;
			Если Строка(ТекПараметр.Параметр) = "НоменклатураСлагаемое" Тогда
				ТекПараметр.Значение = НоменклатураСлагаемое;
			КонецЕсли;
			Если Строка(ТекПараметр.Параметр) = "НоменклатураСумма" Тогда
				ТекПараметр.Значение = НоменклатураСумма;
			КонецЕсли;
		КонецЦикла;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		
		
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ДляФМУ_ОстаткиНаРЦ(спВариантыОтчетов)	Экспорт
	
	Каталог = ".ФМУ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Обробка = "ВнешнийОтчет.ОстаткиДляФМУ.Форма.ФормаОтчета";	
		списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		
		Для Каждого Настройка Из списокНастроек цикл
			Если Настройка.Представление = "Остатки для ФМУ" Тогда 
				ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
				тзЦели = ВосстановленныеПараметры.Получить("ХранилищеГруппировок").Получить();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Если тзЦели = Неопределено ТОгда
			ТекстОшибки = "Не найдена настройка целей -Остатки для ФМУ- : "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - группировка не найдена", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		//тзГруппировки.Очистить();
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("ТаблицаЦелей", тзЦели);	
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаЦелей.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ТаблицаЦелей.Номенклатура КАК Номенклатура,
		|	ТаблицаЦелей.Цель КАК Цель
		|ПОМЕСТИТЬ ТаблицаЦелей
		|ИЗ
		|	&ТаблицаЦелей КАК ТаблицаЦелей";
		
		Запрос.Выполнить();
		
		ТабДок = Новый ТабличныйДокумент;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Период.Значение.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_СводныйФИЧ(спВариантыОтчетов)	Экспорт
	
	Каталог = "ФИЧ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		ТабДок = Новый ТабличныйДокумент;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		НачалоПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		НачалоПериода.Значение = Дата('20221201');
		КонецПериода = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		КонецПериода.Значение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала[Вариант.Представление]);
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		//СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_СводнаяРеализацияПоТМ(спВариантыОтчетов)	Экспорт
	
	Каталог = "Продажи ОПТа и Дистрибуции\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Книга = Новый ПакетОтображаемыхДокументов;
	
	Разделы = Новый СписокЗначений;
	Разделы.Добавить("Реализация 6 поставщ. розница PL","Розница Аттика",Истина);
	Разделы.Добавить("Реализация 6 поставщ. розница PL","Розница Табак-Дигма",Истина);
	Разделы.Добавить("Реализация ДИСТРИБУЦИЯ 6 поставщ.","Дистрибуция");
	Разделы.Добавить("Реализация ОПТ 6 поставщ.","ОПТ");
	
	ПодразделениЯРозницы = Новый Соответствие;
	ПодразделенияРозницы.Вставить("Розница Аттика",Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"));		//	ТС Аттика
	ПодразделенияРозницы.Вставить("Розница Табак-Дигма",Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"));	//	ТС Табак-Дигма
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Период = Новый СтандартныйПериод;
		
		Если Вариант.Представление = "СНачалаЭтогоГода" И Месяц(ТекущаяДата()) = 1 Тогда 
			Период.Вариант = ВариантСтандартногоПериода.ПрошлыйГод
		Иначе
			Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		КонецЕсли;
		
		Период_ = ПредставлениеПериода(Период.ДатаНачала,Период.ДатаОкончания);
		
		ТабДок = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("РеализацияПоТМ");
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облШапка = Макет.ПолучитьОбласть("Шапка");
		облСтрока = Макет.ПолучитьОбласть("Строка");
		облИтог = Макет.ПолучитьОбласть("Итог");
		облПусто = Макет.ПолучитьОбласть("Пусто");
		
		облЗаголовок.Параметры.Период = Период_;
		
		ТабДок.Вывести(облЗаголовок);
		
		Для Каждого Раздел ИЗ Разделы Цикл
			
			ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Раздел.Значение);
			
			Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
				ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
				Сообщить(ТекстОшибки);
				РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			Настройки = ВариантОтчета.Настройки.Получить();
			
			ПериодОтчета = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
			ПериодОтчета.Значение.Вариант = Период.Вариант;
			
			Если Раздел.Пометка Тогда
				Для Каждого ТекОтбор Из Настройки.Отбор.Элементы Цикл
					Если Строка(ТекОтбор.ЛевоеЗначение) = "СкладКомпании.Подразделение" Тогда
						ТекОтбор.Использование = Истина;
						ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
						ТекОтбор.ПравоеЗначение = ПодразделениЯРозницы.Получить(Раздел.Представление);
						//Иначе
						//	Если Строка(ТекОтбор.ЛевоеЗначение) = "ОтчетПоставщику" Тогда
						//		индексСтрокиОтбора = Настройки.Отбор.Элементы.Индекс(ТекОтбор);							
						//	КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
			//Если НЕ Раздел.Пометка Тогда
			//	Настройки.Отбор.Элементы.Удалить(индексСтрокиОтбора);
			//КонецЕсли;
			
			//ЭтоPL = ВариантОтчета.Отчет.ИмяОбъекта = "АнализПродажPL";
			Для Каждого ТекВыбор Из Настройки.Выбор.Элементы Цикл
				Если ТекВыбор.Поле = Новый ПолеКомпоновкиДанных(?(Раздел.Пометка,"Себестоимость","СебестоимостьУпр")) Тогда
					ТекВыбор.Использование = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Раздел.Пометка Тогда
				ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
				СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
			Иначе
				СхемаКомпоновкиДанных = Отчеты[ВариантОтчета.Отчет.Имя].Создать().СхемаКомпоновкиДанных;
			КонецЕсли;
			
			// Загрузка настроек
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
			
			// Компоновка макета
			КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
			
			МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
			// Инициализация процессора компоновки
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
			
			ТаблицаРезультат = Новый ТаблицаЗначений; 
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
			ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			облШапка.Параметры.Раздел = Раздел.Представление;
			ТабДок.Вывести(облШапка);
			
			Для Каждого строка ИЗ ТаблицаРезультат Цикл
				облСтрока.Параметры.ТоварнаяМарка = строка.НоменклатураТоварнаяМарка;
				Если Раздел.Пометка Тогда
					облСтрока.Параметры.Сумма = строка.СуммаОбщая;
					облСтрока.Параметры.Наценка_грн = строка.Наценка;
					облСтрока.Параметры.Наценка_процент = строка.ПроцентНаценки;
				Иначе
					облСтрока.Параметры.Сумма = строка.СуммаУпр;
					облСтрока.Параметры.Наценка_грн = строка.ДоходОборот;
					облСтрока.Параметры.Наценка_процент = строка.Наценка;
				КонецЕсли;
				ТабДок.Вывести(облСтрока);
			КонецЦикла;
			
			Если Раздел.Пометка Тогда
				облИтог.Параметры.Сумма = ТаблицаРезультат.Итог("СуммаОбщая");
				облИтог.Параметры.Наценка_грн = ТаблицаРезультат.Итог("Наценка");
				облИтог.Параметры.Наценка_процент = ?(ТаблицаРезультат.Итог("Себестоимость")=0,0,(ТаблицаРезультат.Итог("СуммаОбщая")-ТаблицаРезультат.Итог("Себестоимость"))/ТаблицаРезультат.Итог("Себестоимость")*100);
			Иначе
				облИтог.Параметры.Сумма = ТаблицаРезультат.Итог("СуммаУпр");
				облИтог.Параметры.Наценка_грн = ТаблицаРезультат.Итог("ДоходОборот");
				облИтог.Параметры.Наценка_процент = ?(ТаблицаРезультат.Итог("СебестоимостьУпр")=0,0,ТаблицаРезультат.Итог("ДоходОборот")/ТаблицаРезультат.Итог("СебестоимостьУпр")*100);
			КонецЕсли;
			ТабДок.Вывести(облИтог);
			
			ТабДок.Вывести(облПусто);
			
		КонецЦикла;
		
		Лист = Книга.Состав.Добавить();
		Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
		Лист.Наименование = Период_;
		
	КонецЦикла;
	
	ВсЁОк = ЗаписатьТабДок(Книга,Новый Структура("Значение,Представление,Пометка","Сводная реализация по ТМ","",Истина),СтруктураЗаписиЖурнала,Каталог);
	Если ВсЁОк Тогда
		ВыполненоОтчетов = ВыполненоОтчетов + 1;
	КонецЕсли;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ЗапуститьПродажиРозницыДляИТЮ(спВариантыОтчетов)	Экспорт
	
	Каталог = ".ИТЮ\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		
		ПериодОтчета = ПредставлениеПериода(Период.ДатаНачала,Период.ДатаОкончания);
		
		Выборка = ПолучитьПродажиРозницыДляИТЮ(Период.ДатаНачала,Период.ДатаОкончания);
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("ПродажиРозницыДляИТЮ");
		облШапка = Макет.ПолучитьОбласть("Шапка");
		облДанные = Макет.ПолучитьОбласть("Данные");
		
		ТабДок.Вывести(облШапка);
		
		Пока Выборка.Следующий() Цикл
			облДанные.Параметры.ПериодОтчета = ПериодОтчета;
			облДанные.Параметры.Заполнить(Выборка);				
			ТабДок.Вывести(облДанные);
		КонецЦикла;
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьТоварыБезПродажНовыйПлоский(спВариантыОтчетов)	Экспорт
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Если СтрНайти(Вариант.Значение,"Buffet") > 0 Тогда
			НастройкаПредставление = "ТС Buffet";
			Каталог = "Еженедельная отчетность Buffet\";
		ИначеЕсли СтрНайти(Вариант.Значение,"Аттика") > 0 Тогда
			НастройкаПредставление = "ТС Аттика";
			Каталог = "Еженедельная отчетность Аттика\";
		ИначеЕсли СтрНайти(Вариант.Значение,"Табак-Дигма") > 0 Тогда
			НастройкаПредставление = "ТС Табак-Дигма";
			Каталог = "Еженедельная отчетность Аттика\";
		ИначеЕсли СтрНайти(Вариант.Значение,"Фабрика Сыра") > 0 Тогда
			НастройкаПредставление = "Фабрика Сыра";
			Каталог = "Еженедельная отчетность Аттика\";
		КонецЕсли;
		
		ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант.Значение,Истина);
		
		Если НЕ ЗначениеЗаполнено(ВариантОтчета) ТОгда
			ТекстОшибки = "Не найден ВариантОтчета - "+Вариант.Значение;
			Сообщить(ТекстОшибки);
			РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - вариант отчета не найден", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		//Обробка = "ВнешнийОтчет.ОтчетТоварыБезДвиженияНовый.Форма.ФормаОтчета";	
		//списокНастроек = ХранилищеНастроекДанныхФорм.ПолучитьСписок(Обробка,"Доценко С.С.");
		//
		//Для Каждого Настройка Из списокНастроек цикл
		//	Если Настройка.Представление = НастройкаПредставление Тогда 
		//		ВосстановленныеПараметры = ХранилищеНастроекДанныхФорм.Загрузить(Обробка, Настройка.Значение,,"Доценко С.С.");
		//		тзОборачиваемость = ВосстановленныеПараметры.Получить("ХранилищеОборачиваемости").Получить();
		//		Прервать;
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Если тзОборачиваемость = Неопределено ТОгда
		//	ТекстОшибки = "Не найдены параметры Оборачиваемости: "+Вариант.Значение;
		//	Сообщить(ТекстОшибки);
		//	РезультатыВыполнения.СообщитьОбОшибке(Вариант.Значение + " - параметры Оборачиваемости не найдены", СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		//	Продолжить;
		//КонецЕсли;
		
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Период.Значение.Вариант = ВариантСтандартнойДатыНачала[Вариант.Представление];
		
		ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
		
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		
		тзОборачиваемость = ОбъектОтчет.ЗаполнитьСрокиПоТБД();
		
		ОбъектОтчет.ПолучитьТаблицуОстатков(тзОборачиваемость,МенеджерВТ,Период.Значение.Дата);
		
		СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
		
		// Загрузка настроек
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
		
		//ВидОформления = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
		//ВидОформления.Значение = "Античный"; //строка 
		//ВидОформления.Использование = Истина;
		//
		//ВыводОтбора = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"));
		//ВыводОтбора.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить; 
		//ВыводОтбора.Использование = Истина;
		//
		//РасположениеРеквизита = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеРеквизитов"));
		//РасположениеРеквизита.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;		
		//РасположениеРеквизита.Использование = Истина;
		
		// Компоновка макета
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,);
		
		// Инициализация процессора компоновки
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(ТабДок);
		ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
		
		Вариант.Представление = "";
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_ОстаткиИТЮ(спВариантыОтчетов)	Экспорт
	
	Вложения = Новый Массив;
	ТекущаяДата = ТекущаяДата();
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	Если ДеньНедели(ТекущаяДата) = 1 Тогда
		спВариантыОтчетов.Добавить("Остатки ИТЮ","ПрошлаяНеделя");
	КонецЕсли;
	Если День(ТекущаяДата) = 4 Тогда
		спВариантыОтчетов.Добавить("Остатки ИТЮ","ПрошлыйМесяц");
	КонецЕсли;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("ОстаткиИТЮ");
		облШапка = Макет.ПолучитьОбласть("Шапка");
		облДанные = Макет.ПолучитьОбласть("Данные");
		
		ТабДок.Вывести(облШапка);
		
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
		ПериодОтчета = ПредставлениеПериода(Период.ДатаНачала,Период.ДатаОкончания);
		ДатаНачала = Период.ДатаНачала;
		
		Пока ДатаНачала < Период.ДатаОкончания Цикл
			Выборка = ПолучитьОстаткиИТЮ(КонецДня(ДатаНачала));
			Пока Выборка.Следующий() Цикл
				облДанные.Параметры.Заполнить(Выборка);				
				ТабДок.Вывести(облДанные);
			КонецЦикла;
			ДатаНачала = ДатаНачала + 86400;
		КонецЦикла;
		
		Если НачалоДня(Период.ДатаНачала) = НачалоДня(Период.ДатаОкончания) Тогда 
			нПериод = "Day";
		ИначеЕсли Период.ДатаОкончания - Период.ДатаНачала > 604799 Тогда 
			нПериод = "Month";
		Иначе
			нПериод = "Week";
		КонецЕсли;
		
		Вариант.Значение = "STK_Stock"+нПериод+"UA_" + Формат(Период.ДатаОкончания,"ДФ=yyyyMMdd");  
		Вариант.Представление = "";
		Каталог = ".ИТЮ\";
		
		ВсЁОк = ЗаписатьТабДок(ТабДок,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
		ИмяФайлаПочта = "STK_Stock"+нПериод+"UA_" + Формат(Период.ДатаОкончания,"ДФ=yyyyMMdd") + ".xlsx";					
		
		ПотокФайла = Новый ПотокВПамяти();
		ТабДок.Записать(ПотокФайла,ТипФайлаТабличногоДокумента.XLSX);
		ДвоичныеДанныеФайла = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
		ВременноеХранилищеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		ОписаниеВложения = Новый Структура("Представление, АдресВоВременномХранилище", ИмяФайлаПочта, ВременноеХранилищеФайла);
		Вложения.Добавить(ОписаниеВложения);
		
	КонецЦикла;
	
	Получатели = Новый СписокЗначений;
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Белов Дмитрий Анатольевич"));
	Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Доценко Сергей Сергеевич"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Лохвицкий Сергей Викторович"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("ЛохвицкийСВ"));
	
	Тело = "Выгружено " + ВыполненоОтчетов + " Файла(ов).";
	
	СтрокаАдрес = "";
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	
	Для Каждого Получатель Из Получатели Цикл
		ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель.Значение,ВидКИ);
		
		Если ПустаяСтрока(ЭлАдрес) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ТекстОшибки = НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		РезультатыВыполнения.СообщитьОбОшибке(Вариант.Представление + ТекстОшибки, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("Копии","yurii.hlodnyi@impbrands.com,marina.miniailo@ua.imptob.com,erika.romaniuk@impbrands.com,mykyta.ternovyi@impbrands.com");
	ПараметрыПисьма.Вставить("СкрытыеКопии","sergey.lohvitskiy@digma.ua");
	ПараметрыПисьма.Вставить("Тема","Imperial Tobacco Ukraine. Звіти по залишкам продукції " + Формат(ТекущаяДата,"ДФ='yyyy-MM-dd'"));
	ПараметрыПисьма.Вставить("Тело",Тело);
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьОтчеты_НовыеКлиентыДистрибуции(спВариантыОтчетов)	Экспорт
	
	Каталог = "Продажи ОПТа и Дистрибуции\";
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ФоновоеФормированиеОтчетов";
	СтруктураЗаписиЖурнала.КлючОбработки = спВариантыОтчетов[0].Значение;
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.	Количество необходимых отчетов - "+Формат(спВариантыОтчетов.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	ВыполненоОтчетов = 0;
	
	Федоренко = Новый СписокЗначений;
	Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("3159423251"),"Федоренко");	//	Федоренко Иван Владимирович
	Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000002"));
	Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000013"));
	Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000014"));
	Федоренко.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("GL0000000003"));
	
	Кайданов = Новый СписокЗначений;
	Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("2919500119"),"Кайданов");	//	Кайданов Руслан Михайлович
	Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000009"));
	Кайданов.Добавить(Справочники.ФизическиеЛица.НайтиПоКоду("AC0000000016"));
	
	Для Каждого Вариант ИЗ спВариантыОтчетов Цикл
		
		Если Вариант.Значение = "Новые клиенты Дистрибуции" Тогда
			
			Менеджеры = Новый Массив;
			Менеджеры.Добавить(Федоренко);
			Менеджеры.Добавить(Кайданов);
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода[Вариант.Представление];
			ПериодОтчета = ПредставлениеПериода(Период.ДатаНачала,Период.ДатаОкончания);
			
			Книга = Новый ПакетОтображаемыхДокументов;
			
			Для Каждого Менеджер Из Менеджеры Цикл
				
				ТабДок = Новый ТабличныйДокумент;
				Макет = ПолучитьМакет("НовыеКлиенты");
				облШапка = Макет.ПолучитьОбласть("Шапка");
				облДанные = Макет.ПолучитьОбласть("Данные");
				
				облШапка.Параметры.ПериодОтчета = ПериодОтчета;
				ТабДок.Вывести(облШапка);
				
				Выборка = ПолучитьНовыеКлиентыДистрибуции(Период.ДатаНачала,Период.ДатаОкончания,Менеджер);
				
				Пока Выборка.Следующий() Цикл
					облДанные.Параметры.Заполнить(Выборка);
					облДанные.Параметры.ПроцентНаценки = ?(Выборка.Себестоимость=0,0,100*Выборка.Наценка/Выборка.Себестоимость);
					ТабДок.Вывести(облДанные);
				КонецЦикла;
				
				
				Лист = Книга.Состав.Добавить();
				Лист.Данные = ПоместитьВоВременноеХранилище(ТабДок);
				Лист.Наименование = Менеджер[0].Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВсЁОк = ЗаписатьТабДок(Книга,Вариант,СтруктураЗаписиЖурнала,Каталог);
		Если ВсЁОк Тогда
			ВыполненоОтчетов = ВыполненоОтчетов + 1;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. 	Количество выполненных отчетов - "+Формат(ВыполненоОтчетов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк И ВыполненоОтчетов>=спВариантыОтчетов.Количество());
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры


