

Функция ЛюбойGet(Запрос)
	
	тАгент = Запрос.ПараметрыURL["Predstavitel"];
	тЗапрос = Запрос.ПараметрыURL["Metod"];
	
	
	НастройкиАгента = ТК_МобильныйРабтаHTTP_Сервис.ПолучитьНастройкиАгена(тАгент);
	Если НастройкиАгента = Неопределено Или НастройкиАгента.Пустая() Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Настройки агента не найдены");
		Возврат Ответ;
	КонецЕсли;
	
	

	Если тЗапрос = "GetGoods" Тогда
		Артикул  = 	Запрос.ПараметрыЗапроса.Получить("Goods");
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,"Артикул "+Артикул+Символы.ПС+Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");
		СтрокаДляОтвета = ТК_МобильныйРабтаHTTP_Сервис.СформироватьПакетВыгрузкиТоваровПоАрткулу(НастройкиАгента,Артикул);
	ИначеЕсли тЗапрос =  "GetClients" Тогда
		ОКПО = 	Запрос.ПараметрыЗапроса.Получить("Clients");
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,"ОКПО "+ОКПО+Символы.ПС+Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");
		СтрокаДляОтвета = ТК_МобильныйРабтаHTTP_Сервис.СформироватьПакетВыгрузкиКонтрагента(НастройкиАгента,ОКПО);
	ИначеЕсли тЗапрос =  "GetPriceClients" Тогда
		КодДоговора = 	Запрос.ПараметрыЗапроса.Получить("DogovorClient");
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,"Код договора "+КодДоговора+Символы.ПС+Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");
		СтрокаДляОтвета =  ТК_МобильныйРабтаHTTP_Сервис.СформироватьПакетВыгрузкиЦенКонтрагентаПоДоговору(НастройкиАгента,КодДоговора);
	ИначеЕсли тЗапрос = "GetGoodsQuantity" Тогда
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,"Пакетная выгрузка "+Символы.ПС+Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");

		СтрокаДляОтвета =  ТК_МобильныйРабтаHTTP_Сервис.ВыгрузитьОстатки(НастройкиАгента);
	Иначе
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,"Пакетная выгрузка "+Символы.ПС+Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");
		СтрокаДляОтвета = ТК_МобильныйРабтаHTTP_Сервис.СформироватьПакетВыгрузки(НастройкиАгента,тЗапрос);
	КонецЕсли;
	
	
	//РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,СтрокаДляОтвета,тЗапрос,"ОТВЕТ");
	
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;

	
КонецФункции



Функция ЛюбойPost(Запрос)
	
	тАгент = Запрос.ПараметрыURL["Predstavitel"];
	тЗапрос = Запрос.ПараметрыURL["Metod"];
	
	
	НастройкиАгента = ТК_МобильныйРабтаHTTP_Сервис.ПолучитьНастройкиАгена(тАгент);
	Если НастройкиАгента = Неопределено Или НастройкиАгента.Пустая() Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Настройки агента не найдены");
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,Ответ.ПолучитьТелоКакСтроку(),тЗапрос,"ОТВЕТ");

		Возврат Ответ;
	КонецЕсли;
	
	РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,Запрос.ПолучитьТелоКакСтроку(),тЗапрос,"ВХ");
	
	Если тЗапрос =  "SendOrders" Тогда	
		СтрокаДляОтвета = ТК_МобильныйРабтаHTTP_Сервис.ПринятьЗаказы(НастройкиАгента,Запрос)
	Иначе 
	  	Ответ = Новый HTTPСервисОтвет(501);
		Ответ.УстановитьТелоИзСтроки("Не реализовано");
		РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,Ответ.ПолучитьТелоКакСтроку(),тЗапрос,"ОТВЕТ");
		Возврат Ответ;
	КонецЕсли;	
	
	РегистрыСведений.ТК_ЖурналМобильныхАгентов.ДобавитьЗапись(НастройкиАгента,СтрокаДляОтвета,тЗапрос,"ОТВЕТ");

	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	
	Возврат Ответ;

КонецФункции

