



Функция УчетнаяЗаписьКазначейства(Учетка)Экспорт
	
	РезВозврат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК сч
		|ИЗ
		|	РегистрСведений.ТК_КазначействоУчетныеЗаписиПочты КАК ТК_КазначействоУчетныеЗаписиПочты
		|ГДЕ
		|	ТК_КазначействоУчетныеЗаписиПочты.УчетнаяЗаписьЭлектроннойПочтыКазначейства = &Учетка";
	
	Запрос.УстановитьПараметр("Учетка", Учетка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РезВозврат = Истина;
	КонецЕсли;
	
	Возврат РезВозврат;	

КонецФункции
