#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



#Область ОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	спОбъект = Справочники.ВидыДоговоров.Аренда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БанковскийСчет.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Бонус.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Бонус;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПоставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПродажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПродажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.БухгалтерскаяКомиссияПоставка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);
	
	спОбъект = Справочники.ВидыДоговоров.БухгалтерскиеУслуги.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ВозвратнаяТара.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
		
	спОбъект = Справочники.ВидыДоговоров.ВыполнениеНИОКР.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Госорганы.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.ЗаймКредитГарантии.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПеремещениеДС.ПолучитьОбъект();
	спОбъект.Наименование = "Инкассация  ДС";
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.КомиссияПоставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Комиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.КомиссияПродажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Комиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Консалтинг.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.Маркетинг.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Обучение.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Охрана.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Перевозка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПодборПерсонала.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Подписка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Подряд.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Поставка.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Продажа.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	спОбъект.ВидДоговораОбратный = Справочники.ВидыДоговоров.Поставка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПоставкаПереводДолга.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПродажаМобильныхПополнений.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ПродажаПоКартам.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Прочее.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Ссуда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Страхование.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Субаренда.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ТранспортноеЭкспедирование.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	спОбъект = Справочники.ВидыДоговоров.УпрощеннаяКомиссия.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.УпрощеннаяКомиссия;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.Хранение.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	
	
	спОбъект = Справочники.ВидыДоговоров.ЮридическиеУслуги.ПолучитьОбъект();
	спОбъект.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(спОбъект);	

	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
