



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 	Макет  = Справочники.НоменклатураПоставщиков.ПолучитьМакет("ЗагрузкаИзФайла");
	ТабДок.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ТаблицаЗагрузки = Новый ТаблицаЗначений;
	ТаблицаЗагрузки.Колонки.Добавить("Номенклатура");
	ТаблицаЗагрузки.Колонки.Добавить("Наименование");
	ТаблицаЗагрузки.Колонки.Добавить("Артикул");
	
	ТаблицаСформирована = Истина;
	//ПереборТаблицы
	Для Стр = 2 По ТабДок.ВысотаТаблицы Цикл 
		тНаименованиеПоставщика = СокрЛП(ТабДок.Область(Стр, 1).Текст);
		тАртикулПоставщика = СокрЛП(ТабДок.Область(Стр, 4).Текст);
		тАртикул 		   = СокрЛП(ТабДок.Область(Стр, 3).Текст);
		тШтрихкод 		   = СокрЛП(ТабДок.Область(Стр, 2).Текст);
		
	    Номенклатура = Неопределено;
		Если ЗначениеЗаполнено(тШтрихкод) Тогда
			Номенклатура = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиТоварПоШтрихКоду(тШтрихкод);
		ИначеЕсли Номенклатура = Неопределено И ЗначениеЗаполнено(тАртикул) Тогда
			 Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",тАртикул);
			
		КонецЕсли;
		
	
		
		Если Номенклатура = Неопределено Или Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			ОбщегоНазначения.СообщитьПользователю("Обработка прервана!!!! Номер строки "+стр-1+". Не найдена номеклатура " + тШтрихкод+". Проверьте правильность заполнения и повторите загрузку.");
			ТаблицаСформирована = Ложь;
			Прервать;
		КонецЕсли;
		
		Если ПустаяСтрока(тАртикулПоставщика) Тогда
			ОбщегоНазначения.СообщитьПользователю("Номер строки "+стр-1+" не обработана, не заполнен артикул поставщика");
			Продолжить;
		КонецЕсли;
		
		
		
		НоваяСтрока = ТаблицаЗагрузки.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Наименование = тНаименованиеПоставщика;

		НоваяСтрока.Артикул = тАртикулПоставщика;
		
	КонецЦикла;
	
	Для Каждого стТоваров Из ТаблицаЗагрузки Цикл 
		
		Справочники.НоменклатураПоставщиков.СоздатьНоменклатуруПоставщика(Контрагент,стТоваров.Номенклатура,стТоваров.Артикул,стТоваров.Наименование);
		
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить контрагента",,"Контрагент");
		Возврат;
	КонецЕсли;
	ЗагрузитьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Загрузка выполнена");
	
КонецПроцедуры
