
#Область ПроцедурыЗаписиДвиженийВРегистр

Процедура ОтразитьОстаткиТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваровКомпании;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТоваровКомпании.Записывать = Истина;
	Движения.ОстаткиТоваровКомпании.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьТоварыКПоступлению(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТоварыКПоступлению;
	
	Если Отказ
		//ИЛИ Таблица.Количество() = 0 
		Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ТоварыКПоступлению.Записывать = Истина;
	Движения.ТоварыКПоступлению.Загрузить(Таблица);
	
КонецПроцедуры


Процедура ОтразаитьПартииТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровКомпании;
	
	Если Отказ  ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДвиженияПартииТоваровИзменение")Тогда
		Движения.ПартииТоваровКомпании.Записывать = ДополнительныеСвойства.ДвиженияПартииТоваровИзменение;
	Иначе
		Движения.ПартииТоваровКомпании.Записывать = Истина;
	КонецЕсли;
	
	Движения.ПартииТоваровКомпании.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПродажиТоваровКомпании(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажиТоваровКомпании;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПриходованиеТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПриходованиеТоваров;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ПриходованиеТоваров.Записывать = Истина;
	Движения.ПриходованиеТоваров.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразаитьПроизводство(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводство;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Производство.Записывать = Истина;
	Движения.Производство.Загрузить(Таблица);	
	
КонецПроцедуры

Процедура ОтразитьКвотыНаОтгрузку(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_КвотыНаОтгрузку;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_КвотыНаОтгрузку.Записывать = Истина;
	Движения.ТК_КвотыНаОтгрузку.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПравилаСписанияДопМатериалов(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_ПравилаСписанияДопМатериалов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_ПравилаСписанияДопМатериалов.Записывать = Истина;
	Движения.ТК_ПравилаСписанияДопМатериалов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОстаткиОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваровОрганизации;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиОрганизации.Записывать = Истина;
	Движения.ОстаткиОрганизации.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПотребностьОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПотребностиТоваровОрганизации;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ПотребностиОрганизаций.Записывать = Истина;
	Движения.ПотребностиОрганизаций.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПланирование(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТК_Планирование;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ТК_Планирование.Записывать = Истина;
	Движения.ТК_Планирование.Загрузить(Таблица);
	
КонецПроцедуры


Процедура ОтразитьКонсолидированныеПродажи(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКонсолидированныеПродажи;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.КонсолидированныеПродажи.Записывать = Истина;
	Движения.КонсолидированныеПродажи.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьПогрешностиДокументов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПогрешностиДокументов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ПогрешностиДокументов.Записывать = Истина;
	Движения.ПогрешностиДокументов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьРозничныеПродажиПодакцизныхТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРозничныеПродажиПодакцизныхТоваров;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.РозничныеПродажиПодакцизныхТоваров.Записывать = Истина;
	Движения.РозничныеПродажиПодакцизныхТоваров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьВозвратнаяТара(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВозвратнаяТара;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВозвратнаяТара.Записывать = Истина;
	Движения.ВозвратнаяТара.Загрузить(Таблица);	
	
КонецПроцедуры


Процедура ОтразаитьТоварыТМП(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваровТМП;
	
	Если Отказ  ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТоваровТМП.Записывать = Истина;
	Движения.ОстаткиТоваровТМП.Загрузить(Таблица);	
	
КонецПроцедуры


#КонецОбласти



Процедура УстановитьБлокировкуОстатоковТоваровКомпании(МенеджерВременныхТаблиц)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.СкладКомпании КАК СкладКомпании,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТаблицаТоваров КАК ТаблицаТоваров
	|		ПО (ИСТИНА)";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваровКомпании");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СкладКомпании", "СкладКомпании");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	
	Блокировка.Заблокировать();
	
	
КонецПроцедуры
// Функция формирует таблицу ошибок остатков товаров.
//
Функция ТаблицаОшибокОстатковТоваров() Экспорт
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Номенклатура");
	ТаблицаОшибок.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаОшибок.Колонки.Добавить("Склад");
	ТаблицаОшибок.Колонки.Добавить("Количество");
	ТаблицаОшибок.Колонки.Добавить("ЕдиницаИзмерения");
	
	Возврат ТаблицаОшибок;
	
КонецФункции 

// Процедура формирует таблицу остатков товаров компании.
//
// Параметры:
//	ДокументСсылка - Текущий документ
//	Склад - СправочникСсылка.СкладыКомпании - Склад документа
//	Дата - Дата документа
//	ДополнительныеСвойства - Структура - Дополнительные свойства документа
//	МенеджерВременныхТаблиц - Менеджер временных таблиц
Процедура ТаблицаОстатковТоваровКомпании(ДокументСсылка, Склад, Дата, ДополнительныеСвойства, МенеджерВременныхТаблиц) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КонтрольРезерва = Ложь;               
	Если ДополнительныеСвойства.Свойство("ВыполнитьКонтрольРезерва") Тогда
		КонтрольРезерва = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "";
	ДатаДокументаСдвинутаНазад = ДополнительныеСвойства.Свойство("СтараяДатаДокумента") И   Дата < ДополнительныеСвойства.СтараяДатаДокумента ;
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		
		ТекстЗапроса = ТекстЗапроса + 	"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ДвиженияДокумента
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании КАК Товары
		|ГДЕ
		|	Товары.Регистратор = &Ссылка
		|	И Товары.Активность
		|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И (Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры) В
		|			(ВЫБРАТЬ
		|				ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
		|				ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|			ИЗ
		|				ВтТаблицаТоваров КАК ВтТаблицаТоваров)
		|	И Товары.СкладКомпании = &СкладКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";	
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"
	|  ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиТоваров
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Момент,
	|			СкладКомпании = &СкладКомпании
	|				И (Номенклатура, ХарактеристикаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
	|						ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|					ИЗ
	|						ВтТаблицаТоваров КАК ВтТаблицаТоваров)) КАК Остатки
	|;
	|";
	
	Если КонтрольРезерва Тогда
		ТекстЗапроса = ТекстЗапроса+"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
		|	РезервыТоваровОстатки.Характеристика КАК Характеристика,
		|	РезервыТоваровОстатки.РезервОстаток КАК РезервОстаток
		|ПОМЕСТИТЬ втРезерв
		|ИЗ
		|	РегистрНакопления.РезервыТоваров.Остатки(
		|			&Момент,
		|			Склад = &СкладКомпании
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВтТаблицаТоваров.Номенклатура КАК Номенклатура,
		|						ВтТаблицаТоваров.ХарактеристикаНоменклатуры КАК Характеристика
		|					ИЗ
		|						ВтТаблицаТоваров КАК ВтТаблицаТоваров)) КАК РезервыТоваровОстатки
		|	ГДЕ
		|	РезервыТоваровОстатки.РезервОстаток > 0
		|;";
		
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса+"
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтТоварыДокумента.Номенклатура КАК Номенклатура,
	|		ВтТоварыДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(-ВтТоварыДокумента.Количество) КАК Количество
	|	ИЗ
	|		ВтТаблицаТоваров КАК ВтТоварыДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВтТоварыДокумента.ХарактеристикаНоменклатуры,
	|		ВтТоварыДокумента.Номенклатура
	|";	
	
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияДокумента.Номенклатура,
		|		ДвиженияДокумента.ХарактеристикаНоменклатуры,
		|		ДвиженияДокумента.Количество
		|	ИЗ
		|		ДвиженияДокумента КАК ДвиженияДокумента";
	КонецЕсли;
	
	Если КонтрольРезерва Тогда
		ТекстЗапроса = ТекстЗапроса +"
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		втРезерв.Номенклатура,
		|		втРезерв.Характеристика,
		|		-втРезерв.РезервОстаток
		|	ИЗ
		|		втРезерв КАК втРезерв";
		
	КонецЕсли;
	
	
	ТекстЗапроса = ТекстЗапроса +"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТоваров.Номенклатура,
	|		ОстаткиТоваров.ХарактеристикаНоменклатуры,
	|		ОстаткиТоваров.КоличествоОстаток
	|	ИЗ
	|		ОстаткиТоваров КАК ОстаткиТоваров) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Номенклатура
	|;";
	Если НЕ ДатаДокументаСдвинутаНазад Тогда
		ТекстЗапроса = ТекстЗапроса + "
		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДвиженияДокумента
		|; ";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса +"
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиТоваров";
	Запрос.Текст =  ТекстЗапроса;
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СкладКомпании", Склад);
	Запрос.УстановитьПараметр("Момент",?(ДополнительныеСвойства.ЭтоНовый,Неопределено, Новый Граница(Дата,ВидГраницы.Включая)));
	Запрос.Выполнить();
	
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОшибок(МенеджерВременныхТаблиц,ДополнительныеСвойства,ТаблицаОшибок,Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаОстатков.Количество КАК Количество
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|ГДЕ
	|	ТаблицаОстатков.Количество < 0
	|";
	
	РезультатЗпроса = Запрос.Выполнить();
	Если Не РезультатЗпроса.Пустой()  Тогда
		Если  Не ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "РазрешитьОтрицательныеОстатки", Ложь)  Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗпроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
	
КонецПроцедуры



#Область ПроверкаДублированияПредопределенныхЭлементов

Процедура ПроверитьРезервированиеЗаказовПокупателя(Проверка, ПараметрыПроверки)		Экспорт
	
	ПоДату = НачалоДня(ТекущаяДата()) - 2*24*60*60;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервыТоваровОстатки.Заказ КАК Заказ,
	|	РезервыТоваровОстатки.РезервОстаток КАК РезервОстаток,
	|	РезервыТоваровОстатки.Заказ.Автор КАК Автор
	|ИЗ
	|	РегистрНакопления.РезервыТоваров.Остатки(, ) КАК РезервыТоваровОстатки
	|ГДЕ
	|	РезервыТоваровОстатки.Заказ.Дата < &ПоДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПоДату", ПоДату);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Проблема = КонтрольВеденияУчета.ОписаниеПроблемы(Результат.Заказ, ПараметрыПроверки);
		
		Проблема.УточнениеПроблемы = НСтр("ru = 'Есть остаток по резерву '")+Результат.Заказ;
		//Проблема.Ответственный     =  Результат.Автор;
		Проблема.Вставить("ТорговаяПлощадка", Результат.Заказ.ТорговаяПлощадка);
		
		КонтрольВеденияУчета.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


