Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СхемаКомпоновкиДанных.НаборыДанных.Получить(1).Запрос = 
	СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.Получить(1).Запрос,"ВЫБРАТЬ ПЕРВЫЕ 3","ВЫБРАТЬ ПЕРВЫЕ "+Строка(КоличествоКонкурентов));
	//КомпоновщикНастроек.Настройки.Отбор.Элементы.Получить(0).ПравоеЗначение=Пользователи.АвторизованныйПользователь();
	//СхемаКомпоновкиДанных.ВариантыНастроек.Получить(0).Настройки.Отбор.Элементы.Получить(0).ПравоеЗначение=Пользователи.АвторизованныйПользователь();
КонецПроцедуры

