
&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере(ВыбЗнач)
	  Справочники.ПортативныеУстройстваВвода.ЗаполнитьТоварыПоУстройству(ВыбЗнач,Объект.Товары);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентовНаСервере(ВыбЗнач)
	  Справочники.ПортативныеУстройстваВвода.ЗаполнитьКонтрагентовПоУстройству(ВыбЗнач,Объект.Контрагенты);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	Перем ВыбЗнач;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,"Номенклатура");
	ПоказатьВводЗначения(Оповещение,ВыбЗнач,"Введите устройство",Тип("СправочникСсылка.ПортативныеУстройстваВвода"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВвода(ВыбЗнач,Параметр)Экспорт
	
	Если ВыбЗнач<>Неопределено Тогда
		Если Параметр = "Номенклатура" Тогда
			ЗаполнитьНоменклатуруНаСервере(ВыбЗнач);
		ИначеЕсли Параметр = "Контрагент" Тогда
			 ЗаполнитьКонтрагентовНаСервере(ВыбЗнач);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКонтрагентов(Команда)
	Перем ВыбЗнач;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,"Контрагент");
	ПоказатьВводЗначения(Оповещение,ВыбЗнач,"Введите устройство",Тип("СправочникСсылка.ПортативныеУстройстваВвода"));

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКонтрагентовПоИндексуСтроки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Номер строки с новой строки", 0, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(тСтрока, Параметры) Экспорт
	Если НЕ тСтрока = Неопределено Тогда
		ВсегоСтрок = СтрЧислоСтрок(тСтрока);
		счн = ВсегоСтрок; 
		Для ст = 1 по ВсегоСтрок Цикл 
			
			Попытка
				инд = Число(СтрПолучитьСтроку(тСтрока, счн));
			Исключение
				счн = счн-1;
				Продолжить;
			КонецПопытки;
			
			Объект.Контрагенты.Удалить(инд-1);
			счн = счн-1;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры;
