#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	//
	//Ограничение.Текст =
	//"РазрешитьЧтениеИзменение
	//|	ГДЕ
	//|	 ЗначениеРазрешено(ТорговаяПлощадка)";
	//
	//Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти




Процедура ЗаписатьИзмененияПоОснованию(Документ,ДокументОснование,Состояние,СтрудникМенеджер,ТорговаяПлощадкаСсылка)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК СсылкаОснование
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
	|ГДЕ
	|	НЕ СвязанныеДокументы.Ссылка = &ДокСканирование
	|	И НЕ СвязанныеДокументы.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ДокСканирование", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборСостояение = РегистрыСведений.ТК_СостояниеДокументов.СоздатьНаборЗаписей();
		НаборСостояение.Отбор.СсылкаНаОбъект.Установить(ВыборкаДетальныеЗаписи.СсылкаОснование);
		нЗапись = НаборСостояение.Добавить();
		нЗапись.СсылкаНаОбъект = ВыборкаДетальныеЗаписи.СсылкаОснование;
		нЗапись.Состояние = Состояние;
		нЗапись.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
		нЗапись.АвторИзменения = СтрудникМенеджер;
		нЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		НаборСостояение.Записать();
		типОснование = ТипЗнч(ВыборкаДетальныеЗаписи.СсылкаОснование);
		Если типОснование = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
			НаборСостояение = РегистрыСведений.ТК_ОчередьНаСборкуРезервов.СоздатьНаборЗаписей();
			НаборСостояение.Отбор.Документ.Установить(ВыборкаДетальныеЗаписи.СсылкаОснование);
			НаборСостояение.Прочитать();
			Если НаборСостояение.Количество() = 1 Тогда
				ЗаписьСостояния = НаборСостояение[0];
				ЗаписьСостояния.Статус = Состояние;
				НаборСостояение.Записать();
			КонецЕсли;
		//ИначеЕсли типОснование = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
	
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры


Функция ПолучитьСостояниеДокумента(Документ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТК_СостояниеДокументов.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
	|ГДЕ
	|	ТК_СостояниеДокументов.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.СтатусыСборкиРезервов.НеНачат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Возврат ВыборкаДетальныеЗаписи.Состояние;
	
КонецФункции

Процедура УстановитьСостояниеДокумента(Документ,СтруктураСостояние,ВключаяПодчиненный = Ложь)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ТК_СостояниеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(Документ);
	нЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(нЗапись,СтруктураСостояние);
	нЗапись.СсылкаНаОбъект = Документ;
	НаборЗаписей.ОбменДанными.Загрузка = Истина;

	НаборЗаписей.Записать();
	
	Если ВключаяПодчиненный Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров";
		
		Запрос.УстановитьПараметр("ДокументОснование", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();	
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ВыборкаДетальныеЗаписи.Ссылка,СтруктураСостояние,Ложь);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура УдалитьСостояниеДокумента(Документ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ТК_СостояниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = Документ;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры


//Документ собран/отгружен/Доставляется/Доставлен/принят считается проведенным
Функция ПолучитьАктуальныйСтатусДокумента(Документ)Экспорт
	текСтатус = ПолучитьСостояниеДокумента(Документ);
	Если текСтатус =  Перечисления.СтатусыСборкиРезервов.Собран
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Отгружен
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Доставляется
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Проведен
		ИЛИ текСтатус =  Перечисления.СтатусыСборкиРезервов.Доставлен Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции


#КонецОбласти
	
	
	
#КонецЕсли