#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	
	#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		
		// Запрещено редактировать документ введенный на основании "АссортиментныйКомитет"
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АссортиментныйКомитет") Тогда 
			Отказ = НЕ (РольДоступна("ПолныеПрава") ИЛИ ДополнительныеСвойства.Свойство("ОбрабткаЗаданием"));
			//ВызватьИсключение НСтр("ru = 'Документ созданный Ассортиментным Комитетом, редактировать запрещено!'; uk = 'Документ створений Асортиментним Комітетом, редагувати заборонено!'");
		КонецЕсли;
		
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		Если ЭтоНовый() Тогда
			ИнициализироватьДокумент(ДанныеЗаполнения);
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		//ПроверяемыеРеквизиты.Добавить("ТорговыеПлощадки");
		Если ОбщегоНазначенияТК.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект,ПроверяемыеРеквизиты) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		//Отказ = ТорговыеПлощадки.Количество() = 0;
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.ИзменениеАссортимента.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		АссортиментСервер.ОтразитьАссортимент(ДополнительныеСвойства, Движения, Отказ);
		
		ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		
		
	КонецПроцедуры
	
	Процедура ПриКопировании(ОбъектКопирования)
		ДокументОснование = "";	//	Тихий
	КонецПроцедуры
	
	#КонецОбласти
	
	
	
	
	
	
	
	
	#Область ИнициализацияИЗаполнение
	
	// Инициализирует документ
	//
	Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		
		Автор				  = Пользователи.ТекущийПользователь();
		ДатаВводаВАссортимент = НачалоДня(ТекущаяДатаСеанса());
		ХозОперация	 		  = Справочники.ХозОперации.ВводТоваровВАссортимент;
		ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
#КонецЕсли