


Функция ПолучитьМассивСкладовАктивныхЗаданий() Экспорт
	
		МассивСкладов = Новый Массив;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", "ФоновыеЗаданияТК.ВыполнитьВосстановлениеПартий");
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Для каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		МассивСкладов.Добавить(Справочники.СкладыКомпании.ПолучитьСкладПоКлючуФоновогоЗадания(ФоновоеЗадание.Ключ));
	КонецЦикла; 
	
	Возврат МассивСкладов;

	
КонецФункции

Функция ПолучитьМассивДоговоровАктивныхЗаданий() Экспорт
	
	МассивСкладов = Новый Массив;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", "ФоновыеЗаданияТК.ВыполнитьВосстановлениеВзаиморасчеты");
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Для каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		МассивСкладов.Добавить(Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоКлючуФоновогоЗадания(ФоновоеЗадание.Ключ));
	КонецЦикла; 
	
	Возврат МассивСкладов;

	
КонецФункции

Функция ПолучитьМассивОрганизацийАктивныхЗаданий() Экспорт
	
	МассивОтбора = Новый Массив;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	СтруктураОтбора.Вставить("ИмяМетода", "ФоновыеЗаданияТК.ВыполнитьВосстановлениеПоследовательностиПартийПоОрганизации");
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Для каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		МассивОтбора.Добавить(Справочники.Организации.ПолучитьОрганизациюПоКлючуФоновогоЗадания(ФоновоеЗадание.Ключ));
	КонецЦикла; 
	
	Возврат МассивОтбора;

	
КонецФункции



