
&НаКлиенте
Процедура ЗагрузитьКонтент(Команда)
Если Параметры.Ключ.Пустая() Тогда
		ВызватьИсключение("Необходимо сначала записать элемент !!!");
	КонецЕсли;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", НСтр("ru = 'Выберите файл с фото'"));
	ПараметрыДиалога.Вставить("Фильтр", НСтр("ru='все файлы (*.*)|*.*'"));
	ПараметрыДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Открытие);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, "question_" + СокрЛП(Объект.Код));
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, ПараметрыДиалога, УникальныйИдентификатор)
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(РезультатПомещенияФайлов, ИмяВСсылке) Экспорт
	Адрес = РезультатПомещенияФайлов.Хранение;
	ТекстОшибки = РезультатПомещенияФайлов.ОписаниеОшибки;
	ИмяВыбранногоФайла = РезультатПомещенияФайлов.Имя;
	
	Если ПустаяСтрока(ТекстОшибки) И ПустаяСтрока(Адрес) Тогда
		ТекстОшибки = НСтр("ru = ‘Ошибка передачи файла на сервер’");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = Новый Файл(ИмяВыбранногоФайла);
	РасширениеФайла = СтрЗаменить(ВыбранныйФайл.Расширение,".","");
	
	Объект.Контент = ОбработатьФайлНаСервере(Адрес,РасширениеФайла,ИмяВСсылке)
КонецПроцедуры

&НаСервере
Функция ОбработатьФайлНаСервере(Адрес, РасширениеФайла, ИмяВСсылке)
	
	// Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	// Получение имени временного файла
	ФайлФото = ПолучитьИмяВременногоФайла(РасширениеФайла);
	// Сохранение данных во временный файл
	Данные.Записать(ФайлФото);
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	// Обработка файла…
	ИмяБакета		= "edudbg";
	КлючДоступа		= "AKIA5IASEGZYFNOJFZJG";
	СекретныйКлюч	= "uZPLq17LTiyb9KnBgt8xluGwIkBAeb4vYrHj+Oz9";
	ИмяЗаписи		= ИмяВСсылке;
	ПутьКФайлу		= ФайлФото;
	ТипКонтента		= "image/" + РасширениеФайла;
	ЗаписьЛога		= " -ErrorVariable err -InformationVariable info -WarningVariable warn; ($err.ErrorRecord, $warn, $info) | Out-File " + ФайлЛога;
	
	ТекстКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"C:\Program Files\PowerShell\7\pwsh.exe -Command ""& {Write-S3Object -BucketName %1 -Region us-east-1 -AccessKey %2 -SecretKey %3 -Key %4 -File %5 -CannedACLName public-read -PublicReadOnly -ContentType %6%7}""", 
	ИмяБакета,
	КлючДоступа,
	СекретныйКлюч,
	ИмяЗаписи,
	ПутьКФайлу,
	ТипКонтента,
	ЗаписьЛога);
	
	КодВозврата = Неопределено;
	
	Попытка
		ЗапуститьПриложение(ТекстКоманды,,Истина,КодВозврата);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	// Хорошим тоном будет удалить временный файл
	УдалитьФайлы(ФайлФото);
	
	ТекстДок = Новый ТекстовыйДокумент;
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ТекстДок.Прочитать(ФайлЛога,КодировкаТекста.UTF8);
		ТекстЛога = ТекстДок.ПолучитьТекст();
		УдалитьФайлы(ФайлЛога);
	Иначе
		ТекстЛога = "";
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекстЛога) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + ТекстЛога);
		ВызватьИсключение(ТекстЛога);
	КонецЕсли;
	
	Ответ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"https://%1.s3.amazonaws.com/%2",
	ИмяБакета,
	ИмяЗаписи);
	
	Возврат Ответ;
	
КонецФункции
