

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	МассивИсточников = Новый Массив;
	//МассивИсточников.Добавить(Документы.ЗаказПокупателя.ПустаяСсылка().Метаданные());
	МассивИсточников.Добавить(Метаданные.Документы.ЗаказПокупателя);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = МассивИсточников;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанель;	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 0;
	нСтатус.Статус  = НСтр("ru = 'Все'; uk = 'Всі'");
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 1;
	нСтатус.Статус  = НСтр("ru = 'Не отгруженные'; uk = 'Не відвантажені'");
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 2;
	нСтатус.Статус  = НСтр("ru = 'Отгрузка не проведена'; uk = 'Відвантаження не проведене'");
	
	//нСтатус = СписокСтатусов.Добавить();
	//нСтатус.Порядок = 3;
	//нСтатус.Статус  = "Неотгруженные";
	
	нСтатус = СписокСтатусов.Добавить();
	нСтатус.Порядок = 4;
	нСтатус.Статус  = НСтр("ru = 'Отгрузка проведена'; uk = 'Відвантаження проведене'");
	
	ОбновитьКомандыПечати();
	
	Элементы.ОтборХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ЗаказПокупателя"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовПоСтатусу(0);
	УстановитьВидимостьЭлементовПоРежиму();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
		
	тПериодВыборки 	= Настройки.Получить("ПериодВыборки");
	тСрокПоставки	= Настройки.Получить("ОтборДатаОтгрузки");      
	тПодразделение 	= Настройки.Получить("ОтборПодразделениеКомпании");
	тОрганизация 	= Настройки.Получить("ОтборОрганизация");	
	тКонтрагент		= Настройки.Получить("ОтборКонтрагент");
	тСкладКомпании 	= Настройки.Получить("ОтборСкладКомпании");
	тХозОперация 	= Настройки.Получить("ОтборХозОперация");
	
	СтруктураОтбора = Новый Структура;
	
	//Если ЗначениеЗаполнено(тПериодВыборки) Тогда         
	//	СтруктураОтбора.Вставить("ПериодВыборки", тПериодВыборки);
	//Иначе
	//	Период = Новый СтандартныйПериод;
	//	Период.ДатаНачала = НачалоДня(ТекущаяДата() - 60*60*24*7);
	//	
	//	Настройки.Вставить("ПериодВыборки", Период);
	//	СтруктураОтбора.Вставить("ПериодВыборки", Период);
	//КонецЕсли;
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоДня(ТекущаяДата() - 60*60*24*7);
	
	Настройки.Вставить("ПериодВыборки", Период);
	СтруктураОтбора.Вставить("ПериодВыборки", Период);
		
	Если ЗначениеЗаполнено(тСрокПоставки) Тогда 
		СтруктураОтбора.Вставить("СрокПоставки", тСрокПоставки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тОрганизация) Тогда 
		СтруктураОтбора.Вставить("Организация", тОрганизация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тПодразделение) Тогда 
		СтруктураОтбора.Вставить("ПодразделениеКомпании", тПодразделение);
	Иначе
		ТекПользователь = Пользователи.ТекущийПользователь();
		тПодразделение = ТекПользователь.Подразделение;
		
		Настройки.Вставить("ОтборПодразделениеКомпании", тПодразделение);
		СтруктураОтбора.Вставить("ПодразделениеКомпании", тПодразделение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тКонтрагент) Тогда 
		СтруктураОтбора.Вставить("Контрагент", тКонтрагент);
	КонецЕсли;                       
	                                                      
	Если ЗначениеЗаполнено(тСкладКомпании) Тогда 
		СтруктураОтбора.Вставить("СкладКомпании", тСкладКомпании);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тХозОперация) Тогда 
		СтруктураОтбора.Вставить("ХозОперация", тХозОперация);
	КонецЕсли;
	
	УстановитьОтборСписка(Список, СтруктураОтбора);
	
	Если Настройки.Получить("КомплектПечатныхФорм") = Неопределено
		ИЛИ Настройки.Получить("ДеревоПечатныхФорм") = Неопределено Тогда
		
		ЗаполнитьКомплектПечатныхФормПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовДеревоЗаказов

&НаКлиенте
Процедура ДеревоЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Документ = Элемент.ТекущиеДанные.Документ;	
	
	Если Не ЗначениеЗаполнено(Документ) Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяТипаДокумента = ПолучитьИмяТипаДокумента(Документ);
	ОткрытьФорму("Документ."+ИмяТипаДокумента+".Форма.ФормаДокумента", Новый Структура("Ключ", Документ), ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗаказовФлажокПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоЗаказов.ТекущиеДанные;	
	СтрокаДерева = ДеревоЗаказов.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор());
	
	УстановитьФлажкиРекурсивно(СтрокаДерева, ТекСтрока.Флажок);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПечатныхФормФлажокПриИзменении(Элемент)

	ТекСтрока = Элементы.ДеревоПечатныхФорм.ТекущиеДанные;	
	СтрокаДерева = ДеревоПечатныхФорм.НайтиПоИдентификатору(ТекСтрока.ПолучитьИдентификатор());
	
	УстановитьФлажкиРекурсивно(СтрокаДерева, ТекСтрока.Флажок);	
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "СписокДокументОтгрузка"	Тогда 		
		ДокументОтгрузки = Элемент.ТекущиеДанные.ДокументОтгрузки;		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументОтгрузки) Тогда 			
			СтандартнаяОбработка = Ложь;
			
			ИмяТипаДокумента = ПолучитьИмяТипаДокумента(ДокументОтгрузки);
			ОткрытьФорму("Документ."+ИмяТипаДокумента+".Форма.ФормаДокумента", Новый Структура("Ключ", ДокументОтгрузки), ЭтаФорма);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовПриАктивизацииСтроки(Элемент)
	
	Порядок = Неопределено;
	
	ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Порядок > 0 Тогда 
		
		Порядок = ТекущиеДанные.Порядок;
	КонецЕсли;
	
	УстановитьОтборСписка(Список, Новый Структура("Порядок", Порядок));	
	УстановитьВидимостьЭлементовПоСтатусу(ТекущиеДанные.Порядок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораЗаказовФлажокПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ПересчитатьКоличествоВыбранныхЗаказов", 0.4, Истина); 
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ПериодВыборкиПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("ПериодВыборки", ПериодВыборки));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОтгрузкиПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("СрокПоставки", ОтборДатаОтгрузки));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Организация", ОтборОрганизация));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеКомпанииПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("ПодразделениеКомпании", ОтборПодразделениеКомпании));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Контрагент", ОтборКонтрагент));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладКомпанииПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("СкладКомпании", ОтборСкладКомпании));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборХозОперацияПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("ХозОперация", ОтборХозОперация));	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПечать(Элемент)
	
	ИмяКнопки = Элемент.Имя;
	
	ПрефиксПФ = ВРег(Лев(ИмяКнопки, 2));
	
	ТипДокумента = "";
	Если ПрефиксПФ = "ЗП" Тогда 
		ТипДокумента = "Документ.ЗаказПокупателя";
		МассивДокументов = ПолучитьМассивСсылокСписка("Выбранные", "ЗаказПокупателя");
	ИначеЕсли ПрефиксПФ = "ВП" Тогда 
		ТипДокумента = "Документ.ВыпускПродукции";
		МассивДокументов = ПолучитьМассивСсылокСписка("Выбранные", "ВыпускПродукции");
	ИначеЕсли ПрефиксПФ = "ПМ" Тогда 
		ТипДокумента = "Документ.ПеремещениеТоваров";
		МассивДокументов = ПолучитьМассивСсылокСписка("Выбранные", "ПеремещениеТоваров");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	ФормаПечати = Сред(ИмяКнопки, 4);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТипДокумента, ФормаПечати, МассивДокументов, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Печать_Комплект_Выделленное(Команда)
	ОчиститьСообщения();
	ПечатьКомплектаДокументов(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Печать_Комплект_Все(Команда)
	
	ОчиститьСообщения();
	
	ОповещениеЗавершениеВопрос = Новый ОписаниеОповещения("Печать_Комплект_Все_Продолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВопрос(
		ОповещениеЗавершениеВопрос,
		НСтр("ru = 'Выполнить печать комплекта документов для всех заказов, соответствующих отбору?
              |Данная операция может занять продолжительное время.
              |Продолжить?'; uk = 'Виконати друк комплекту документів для всіх замовлень, що відповідають відборам?
              |Ця операція може зайняти деякий час.
              |Продовжити?'"),
		РежимДиалогаВопрос.ДаНет,
		10,
		КодВозвратаДиалога.Нет,
		НСтр("ru = 'Печать комплекта документов'; uk = 'Друк комплекту документів'"),
		КодВозвратаДиалога.Нет);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать_Комплект_Все_Продолжение(Ответ, ДопПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ПечатьКомплектаДокументов(Истина);	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьКомплектаДокументов(Все = Ложь, МассивВыпусков = Неопределено)
	
	Если ТипЗнч(МассивВыпусков) <> Тип("Массив") Тогда 
		МассивВыпусков = ПолучитьМассивСсылокСписка(?(Все, "Все", "Выбранные"), "ВыпускПродукции");	
	КонецЕсли;
	
	Для Каждого Выпуск Из МассивВыпусков Цикл 
		
		Для Каждого ПФ Из КомплектПечатныхФорм Цикл 
			Если Не ПФ.Выбор Тогда 
				Продолжить;
			КонецЕсли;		
			
			ФормаПечати = "";
			Для Ит = 1 По ПФ.Количество Цикл 
				ФормаПечати = ФормаПечати + ?(ПустаяСтрока(ФормаПечати), "", ",") + ПФ.Имя;	
			КонецЦикла;
			
			Если Печать_ВыводитьНаПринтер Тогда
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Документ.ВыпускПродукции", 
					ФормаПечати, 
					Выпуск);
			Иначе		
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
					"Документ.ВыпускПродукции", 
					ФормаПечати, 
					Выпуск, 
					ЭтаФорма);			
			КонецЕсли;
				
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Отгрузка_ВыпускПродукции_Все(Команда)
	
	ОчиститьСообщения();
	
	ОповещениеЗавершениеВопрос = Новый ОписаниеОповещения("Отгрузка_ВыпускПродукции_Все_Продолжение", ЭтаФорма, Неопределено);
	
	ПоказатьВопрос(
		ОповещениеЗавершениеВопрос,
		НСтр("ru = 'Выполнить отгрузку всех заказов, соответствующих отбору?
              |Данная операция может занять продолжительное время.
              |Продолжить?'; uk = 'Виконати відвантаження всіх замовлень, що відповідають відборам?
              |Ця операція може зайняти деякий час.
              |Продовжити?'"),
		РежимДиалогаВопрос.ДаНет,
		10,
		КодВозвратаДиалога.Нет,
		НСтр("ru = 'Создание выпусков продукции'; uk = 'Створення випусків продукції'"),
		КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура Отгрузка_ВыпускПродукции_Все_Продолжение(Ответ, ДопПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ОтгрузитьЗаказы();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Отгрузка_ВыпускПродукции_Выделленное(Команда)
	ОчиститьСообщения();
	ОтгрузитьЗаказы();
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьЗаказы_Старый(Все = Ложь, МассивЗаказов = Неопределено)
	
	Если ТипЗнч(МассивЗаказов) <> Тип("Массив") Тогда 
		МассивЗаказов = ПолучитьМассивСсылокСписка(?(Все, "Все", "Выбранные"), "ЗаказПокупателя");
	КонецЕсли;
	
	Если МассивЗаказов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК Заказ,
	               |	ЗаказПокупателя.Дата КАК Заказ_Дата,
	               |	ЗаказПокупателя.Проведен КАК Заказ_Проведен,
	               |	ЗаказПокупателя.ПометкаУдаления КАК Заказ_ПометкаУдаления,
	               |	ЗаказПокупателя.СрокПоставки КАК СрокПоставки,
	               |	ВыпускПродукции.Ссылка КАК Выпуск,
	               |	ВыпускПродукции.Проведен КАК Выпуск_Проведен,
	               |	ВыпускПродукции.Дата КАК Выпуск_Дата
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	               |		ПО ЗаказПокупателя.Ссылка = ВыпускПродукции.ДокументОснование
	               |			И (НЕ ВыпускПродукции.ПометкаУдаления)
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка В(&МассивЗаказов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Заказ_Дата,
	               |	Заказ,
	               |	Выпуск_Дата
	               |ИТОГИ
	               |	МАКСИМУМ(Заказ_Дата),
	               |	МАКСИМУМ(Заказ_Проведен),
	               |	МАКСИМУМ(Заказ_ПометкаУдаления),
	               |	МАКСИМУМ(СрокПоставки)
	               |ПО
	               |	Заказ";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Обработано = 0;
	СОшибками = 0;
	
	Пока ВыборкаЗаказ.Следующий() Цикл 
		Если Не ВыборкаЗаказ.Заказ_Проведен ИЛИ ВыборкаЗаказ.Заказ_ПометкаУдаления Тогда 
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 %2. Выпуск не бдует сформирован...'; uk = 'Документ %1 %2. Випуск не буде сформований...'"),
					ВыборкаЗаказ.Заказ,
					?(ВыборкаЗаказ.Заказ_ПометкаУдаления, НСтр("ru = 'помечен на удаление'; uk = 'відмічений на видалення'"), НСтр("ru = 'не проведен'; uk = 'не проведений'"))),
				ВыборкаЗаказ.Заказ);					
			Продолжить;	
		КонецЕсли;
		
		ВыпускПродукции = Неопределено;
		ВыборкаВыпуски = ВыборкаЗаказ.Выбрать();
		Пока ВыборкаВыпуски.Следующий() Цикл 
			Если ВыборкаВыпуски.Выпуск = Null Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ВыпускПродукции = Неопределено Тогда 
				ВыпускПродукции = ВыборкаВыпуски.Выпуск;
			Иначе
				ВыпускОбъект = ВыборкаВыпуски.Выпуск.ПолучитьОбъект();
				Попытка
					ВыпускОбъект.УстановитьПометкуУдаления(Истина);
					
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Удален %1'; uk = 'Видалений %1'"),
							ВыпускОбъект),
						ВыборкаВыпуски.Выпуск);

				Исключение
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = '%1 Ошибка установки пометки удаления:
                                  |%2'; uk = '%1 Помилка встановлення помітки видалення:
                                  |%2'"),
							ВыпускОбъект,
							ОписаниеОшибки()),
						ВыборкаВыпуски.Выпуск);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыпускПродукции <> Неопределено Тогда 
			ВыпускОбъект = ВыпускПродукции.ПолучитьОбъект();
		Иначе
			ВыпускОбъект = Документы.ВыпускПродукции.СоздатьДокумент();
		КонецЕсли;
		
		ВыпускОбъект.Заполнить(ВыборкаЗаказ.Заказ);
		//ВыпускОбъект.Дата = ВыборкаЗаказ.Заказ_Дата;
		
		Попытка
			Если ПроводитьДокументы Тогда  
				ВыпускОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ВыпускОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1 %2",
					?(ПроводитьДокументы, НСтр("ru = 'Проведен'; uk = 'Проведений'"), НСтр("ru = 'Записан'; uk = 'Записаний'")),
					ВыпускОбъект),
				ВыпускОбъект.Ссылка);			
			
			Обработано = Обработано + 1;
		Исключение
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось %3 выпуск для %1.
                          |Ошибки: %2'; uk = 'Не вдалося %3 випуск для %1.
                          |Помилки: %2'"),
					ВыборкаЗаказ.Заказ,
					ОписаниеОшибки(),
					?(ПроводитьДокументы, НСтр("ru = 'провести'; uk = 'провести'"), НСтр("ru = 'записать'; uk = 'записати'"))),
				ВыборкаЗаказ.Заказ);
		
			СОшибками = СОшибками + 1;
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработано %1 заказов.
                  |Из них с ошибками %2.'; uk = 'Оброблено %1 замовлень.
                  |Із них з помилками %2.'"),
			Обработано,
			СОшибками));
			
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры



&НаКлиенте
Процедура НачатьВыборДляВыпуска(Команда)
	
	УстановитьВидимостьЭлементовПоРежиму("Выпуск");	
	
	Элементы.СтраницыОсновные.ТекущаяСтраница = Элементы.СтраницаТаблицаВыбораЗаказов;		
	
	НачатьВыборЗаказов("Выпуск");
			
	ПересчитатьКоличествоВыбранныхЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборДляПечати(Команда)
	
	УстановитьВидимостьЭлементовПоРежиму("Печать");
	
	НачатьВыборЗаказов("Печать");
	
	Элементы.СтраницыОсновные.ТекущаяСтраница = Элементы.СтраницаТаблицаВыбораЗаказов;
	
	ПересчитатьКоличествоВыбранныхЗаказов();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКомплектПоУмолчанию(Команда)
	ЗаполнитьКомплектПечатныхФормПоУмолчанию();
КонецПроцедуры

//Таблица Выбора заказов
&НаКлиенте
Процедура ВернутьсяНаОсновнуюСтраницу(Команда = Неопределено)
	
	Элементы.СтраницыОсновные.ТекущаяСтраница = Элементы.СтраницаОсновная;
	
	УстановитьВидимостьЭлементовПоРежиму();
	
	ДеревоЗаказов.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры


&НаКлиенте
Процедура Выбор_СнятьФлажки(Команда)
	
	УстановитьФлажкиРекурсивно(ДеревоЗаказов, Ложь);
	
	ПодключитьОбработчикОжидания("ПересчитатьКоличествоВыбранныхЗаказов", 0.3, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор_УстановитьФлажки(Команда)
	
	УстановитьФлажкиРекурсивно(ДеревоЗаказов, Истина);
	
	ПодключитьОбработчикОжидания("ПересчитатьКоличествоВыбранныхЗаказов", 0.3, Истина); 
	
КонецПроцедуры


&НаКлиенте
Процедура Выбор_СоздатьВыпускПродукции(Команда)
	
	ОчиститьСообщения();
		
	ОтгрузитьЗаказы();
	
	ВернутьсяНаОсновнуюСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор_НапечататьКомплектДокументов(Команда)
	
	ОчиститьСообщения();
	
	МассивДокументовПечать = ПолучитьМассивДляПечати();
	
	Если МассивДокументовПечать.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет выбранных документов для печати'; uk = 'Немає обраних документів для друку'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураДляПечати Из МассивДокументовПечать Цикл 
		Если Печать_ВыводитьНаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
				СтруктураДляПечати.ИмяМенеджераПечати,
				СтруктураДляПечати.ИменаМакетов,
				СтруктураДляПечати.Документ);
		Иначе		
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
				СтруктураДляПечати.ИмяМенеджераПечати,
				СтруктураДляПечати.ИменаМакетов,
				СтруктураДляПечати.Документ,
				ЭтаФорма);			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ПериодВыборки = Неопределено;
	Если ПараметрыОтбора.Свойство("ПериодВыборки", ПериодВыборки) Тогда 
		
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		ЭлементОтбораДанных = Неопределено;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПериод" Тогда
				ЭлементОтбораДанных = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПериодВыборки) Тогда 
			
			Если ЭлементОтбораДанных = Неопределено Тогда
				ГруппаОтборПериод = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтборПериод.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
				ГруппаОтборПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
				ГруппаОтборПериод.Использование = Истина;
				ГруппаОтборПериод.Представление = "ОтборПериод";
			Иначе
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Истина;
			КонецЕсли;	
			
			ГруппаДатаСортировки = ГруппаОтборПериод.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаДатаСортировки.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
			ГруппаДатаСортировки.Использование = Истина;
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаНачала) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаНачала;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаОкончания) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаОкончания;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;
			
			Если ГруппаДатаСортировки.Элементы.Количество() = 0 Тогда 
				ГруппаОтборПериод.Элементы.Удалить(ГруппаДатаСортировки);
			КонецЕсли;
			
		Иначе
			
			Если ЭлементОтбораДанных <> Неопределено Тогда
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Ложь;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Для Каждого текОтбор Из ПараметрыОтбора Цикл 		
		ИмяРеквизита = текОтбор.Ключ;
		Значение = текОтбор.Значение;
		
		Если текОтбор.Ключ = "ПериодВыборки" Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			ИмяРеквизита, 
			Значение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Значение));
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлажкиРекурсивно(ДеревоЗначений, Значение)
	
	Для Каждого Стр Из ДеревоЗначений.ПолучитьЭлементы() Цикл 
		Стр.Флажок = Значение;
		УстановитьФлажкиРекурсивно(Стр, Значение);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьКомандыПечати()
	
	ТаблицаПечатныхФорм = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ЗаказПокупателя);
	КартинкаПечать = БиблиотекаКартинок.Печать;
	
	Для Каждого Стр Из ТаблицаПечатныхФорм Цикл 
		Если Не Стр.Отключена Тогда 
			ИмяКоманды = "ЗП_" + Стр.Идентификатор;
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = Стр.Представление;
			НоваяКоманда.Действие = "КомандаПечать";
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаПечатьЗаказыПокупателей);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			НовыйЭлемент.Картинка = КартинкаПечать;
		КонецЕсли;		
	КонецЦикла;

	ТаблицаПечатныхФорм = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ВыпускПродукции);
	
	Для Каждого Стр Из ТаблицаПечатныхФорм Цикл 
		Если Не Стр.Отключена Тогда
			Отказ = Ложь;
			
			Если Стр.УсловияВидимости.Количество() > 0 Тогда
				Для Каждого Условие Из Стр.УсловияВидимости Цикл 
					Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Условие, "Реквизит", "") = "ХозОперация" 
						И Условие.Значение <> Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда 
						
						Отказ = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Не Отказ Тогда 
				ИмяКоманды = "ВП_" + Стр.Идентификатор;
				
				НоваяКоманда = Команды.Добавить(ИмяКоманды);
				НоваяКоманда.Заголовок = Стр.Представление;
				НоваяКоманда.Действие = "КомандаПечать";
				
				НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаПечатьВыпускПродукции);
				НовыйЭлемент.ИмяКоманды = ИмяКоманды;
				НовыйЭлемент.Картинка = КартинкаПечать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ТаблицаПечатныхФорм = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.ПеремещениеТоваров);
	
	Для Каждого Стр Из ТаблицаПечатныхФорм Цикл  
		Если Не Стр.Отключена Тогда 
			ИмяКоманды = "ПМ_" + Стр.Идентификатор;
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = Стр.Представление;
			НоваяКоманда.Действие = "КомандаПечать";
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаПечатьПеремещениеТоваров);
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			НовыйЭлемент.Картинка = КартинкаПечать;
		КонецЕсли;
	КонецЦикла;;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоСтатусу(Статус)
	
	Если Статус = Неопределено Тогда 
		Статус = 0;
	КонецЕсли;
	
	МассивВсехЭлементов = Новый Массив;
	МассивВсехЭлементов.Добавить("ПодменюВыпускПродукции");
	МассивВсехЭлементов.Добавить("ПодменюПечатьОбщая");
	МассивВсехЭлементов.Добавить("ПодменюПечать");
	МассивВсехЭлементов.Добавить("ГруппаПечатьЗаказыПокупателей");
	МассивВсехЭлементов.Добавить("ГруппаПечатьВыпускПродукции");
	МассивВсехЭлементов.Добавить("СписокГруппаПечатьКомплект");
	МассивВсехЭлементов.Добавить("СписокНачатьВыборДляВыпуска");
	МассивВсехЭлементов.Добавить("СписокНачатьВыборДляПечати");
	
	МассивВидимыхЭлементов = Новый Массив;
	Если Статус = 0 Тогда 
		МассивВидимыхЭлементов.Добавить("ПодменюПечать");
	Иначе
		МассивВидимыхЭлементов.Добавить("ПодменюПечатьОбщая");
		МассивВидимыхЭлементов.Добавить("ГруппаПечатьЗаказыПокупателей");
	КонецЕсли;
		
	Если Статус = 1 ИЛИ Статус = 2 Тогда 
		//МассивВидимыхЭлементов.Добавить("ПодменюВыпускПродукции");
		МассивВидимыхЭлементов.Добавить("СписокНачатьВыборДляВыпуска");
	КонецЕсли;
	
	Если Статус = 4 ИЛИ Статус = 2 Тогда 
		МассивВидимыхЭлементов.Добавить("ГруппаПечатьВыпускПродукции");
		//МассивВидимыхЭлементов.Добавить("СписокГруппаПечатьКомплект");
		МассивВидимыхЭлементов.Добавить("СписокНачатьВыборДляПечати");
	КонецЕсли;
		
	ОбщегоНазначенияТККлиентСервер.УстановитьВидимостьЭлементовПоМассиву(Элементы, МассивВсехЭлементов, МассивВидимыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоРежиму(Режим = "")
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("ДеревоЗаказовВыбор_СоздатьВыпускПродукции");
	МассивВсехРеквизитов.Добавить("ДеревоЗаказовВыбор_НапечататьКомплектДокументов");
	МассивВсехРеквизитов.Добавить("ГруппаНастройкиКомплектаДокументов");
	МассивВсехРеквизитов.Добавить("ПровдитьДокументы");
	МассивВсехРеквизитов.Добавить("Ссылка");
	
	МассивВидимыхРеквизитов = Новый Массив;		
	Если Режим = "Печать" Тогда 
		МассивВидимыхРеквизитов.Добавить("ДеревоЗаказовВыбор_НапечататьКомплектДокументов");
		МассивВидимыхРеквизитов.Добавить("ГруппаНастройкиКомплектаДокументов");
		МассивВидимыхРеквизитов.Добавить("Ссылка");	
	ИначеЕсли Режим = "Выпуск" Тогда 
		МассивВидимыхРеквизитов.Добавить("ДеревоЗаказовВыбор_СоздатьВыпускПродукции");
		МассивВидимыхРеквизитов.Добавить("ПровдитьДокументы");
		МассивВидимыхРеквизитов.Добавить("Ссылка");
	КонецЕсли;
		
	ОбщегоНазначенияТККлиентСервер.УстановитьВидимостьЭлементовПоМассиву(Элементы, МассивВсехРеквизитов, МассивВидимыхРеквизитов);
	
	МассивДоступности = Новый Массив;
	МассивДоступности.Добавить("БыстрыеОтборы");
	
	ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивДоступности, "Доступность", ПустаяСтрока(Режим)); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылокСписка(РежимВыбора = "Все", ТипДокумента)
	
	Если ТипДокумента = "ЗаказПокупателя" Тогда
		Поле = "Ссылка";
	ИначеЕсли ТипДокумента = "ВыпускПродукции" Тогда 
		Поле = "ДокументОтгрузки";
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Тип документа ""%1"" не определен. Обратитесь к разработчику...'; uk = 'Тип документу ""%1"" не визначений. Зверніться до розробника...'"),
						ТипДокумента);
						
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	               
	МассивСсылок = Новый Массив;
	
	Если РежимВыбора = "Все" Тогда 
		ТаблицаСписка = ПолучитьТаблицуСписка();
		МассивСсылок = ТаблицаСписка.ВыгрузитьКолонку(Поле);
	Иначе
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;		
		
		Если ТипДокумента = "ВыпускПродукции" Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ВыпускПродукции.ДокументОснование КАК ДокументОснование,
			               |	МАКСИМУМ(ВыпускПродукции.Ссылка) КАК Ссылка
			               |ИЗ
			               |	Документ.ВыпускПродукции КАК ВыпускПродукции
			               |ГДЕ
			               |	ВыпускПродукции.ДокументОснование В(&МассивЗаказов)
			               |	И НЕ ВыпускПродукции.ПометкаУдаления
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВыпускПродукции.ДокументОснование";
			
			Запрос.УстановитьПараметр("МассивЗаказов", ВыделенныеСтроки);
			тзВыпуски = Запрос.Выполнить().Выгрузить();			
			МассивСсылок = тзВыпуски.ВыгрузитьКолонку("Ссылка");	
			
		ИначеЕсли ТипДокумента = "ЗаказПокупателя" Тогда 
			МассивСсылок = ВыделенныеСтроки;	
		КонецЕсли;
	КонецЕсли;

	Возврат МассивСсылок;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуСписка()
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКомплектПечатныхФормПоУмолчанию()
	
	КомплектПечатныхФорм.Очистить();
	
	//НоваяСтрока = КомплектПечатныхФорм.Добавить();
	//НоваяСтрока.Выбор = Истина;
	//НоваяСтрока.Имя = "РасходнаяНакладная";
	//НоваяСтрока.Представление = НСтр("ru = 'Расходная накладная';uk='Видаткова накладна'");
	//НоваяСтрока.Количество = 4;
	//
	//НоваяСтрока = КомплектПечатныхФорм.Добавить();
	//НоваяСтрока.Выбор = Истина;
	//НоваяСтрока.Имя = "ДекларацияПроизводителя";
	//НоваяСтрока.Представление = НСтр("ru = 'Декларация производителя'; uk = 'Декларація виробника'");
	//НоваяСтрока.Количество = 1;
	//
	//НоваяСтрока = КомплектПечатныхФорм.Добавить();
	//НоваяСтрока.Выбор = Истина;
	//НоваяСтрока.Имя = "ТТН_ФС";
	//НоваяСтрока.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
	//НоваяСтрока.Количество = 2;
	
	//Заполним Дерево Печатных форм
	ЭлементыУр1 = ДеревоПечатныхФорм.ПолучитьЭлементы();
	ЭлементыУр1.Очистить();
	
	СтрокаХозОперация = ЭлементыУр1.Добавить();
	СтрокаХозОперация.Флажок = Истина;
	СтрокаХозОперация.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	СтрокаХозОперация.Представление = Строка(Справочники.ХозОперации.ЗаказПокупателя);
	
		ЭлементыУр2 = СтрокаХозОперация.ПолучитьЭлементы();
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "РасходнаяНакладная";
		СтрокаПФ.Представление = НСтр("ru = 'Расходная накладная';uk='Видаткова накладна'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "РасходнаяНакладнаяУКТВЭД";
		СтрокаПФ.Представление = НСтр("ru = 'Расходная накладная (с кодом УКТВЭД)'; uk = 'Видаткова накладна (з кодом УКТЗЕД)'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Ложь;
		СтрокаПФ.Имя = "РасходнаяНакладная";
		СтрокаПФ.Представление = НСтр("ru = 'Реализация товаров';uk='Реалізація товарів'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		СтрокаПФ.ИмяМенеджераПечати = "РеализацияТоваров";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Ложь;
		СтрокаПФ.Имя = "ДекларацияПроизводителя";
		СтрокаПФ.Представление = НСтр("ru = 'Декларация производителя реализация'; uk = 'Декларація виробника реалізація'");
		СтрокаПФ.Количество = 1;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		СтрокаПФ.ИмяМенеджераПечати = "РеализацияТоваров";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ДекларацияПроизводителя";
		СтрокаПФ.Представление = НСтр("ru = 'Декларация производителя'; uk = 'Декларація виробника'");
		СтрокаПФ.Количество = 1;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ТТН_ФС";
		СтрокаПФ.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
		СтрокаПФ.Количество = 2;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
	СтрокаХозОперация = ЭлементыУр1.Добавить();
	СтрокаХозОперация.Флажок = Истина;
	СтрокаХозОперация.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяФизОбмен;
	СтрокаХозОперация.Представление = Строка(Справочники.ХозОперации.ЗаказПокупателяФизОбмен);
	
		ЭлементыУр2 = СтрокаХозОперация.ПолучитьЭлементы();
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "РасходнаяНакладная";
		СтрокаПФ.Представление = НСтр("ru = 'Расходная накладная';uk='Видаткова накладна'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Ложь;
		СтрокаПФ.Имя = "РасходнаяНакладнаяР";
		СтрокаПФ.Представление = НСтр("ru = 'Реализация товаров';uk='Реалізація товарів'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		СтрокаПФ.ИмяМенеджераПечати = "РеализацияТоваров";

		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ДекларацияПроизводителя";
		СтрокаПФ.Представление = НСтр("ru = 'Декларация производителя'; uk = 'Декларація виробника'");
		СтрокаПФ.Количество = 1;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
				
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ТТН_ФС";
		СтрокаПФ.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
		СтрокаПФ.Количество = 2;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		

	СтрокаХозОперация = ЭлементыУр1.Добавить();
	СтрокаХозОперация.Флажок = Истина;
	СтрокаХозОперация.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяВнутренний;
	СтрокаХозОперация.Представление = Строка(Справочники.ХозОперации.ЗаказПокупателяВнутренний);
	
		ЭлементыУр2 = СтрокаХозОперация.ПолучитьЭлементы();
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ПеремещениеТоваров";
		СтрокаПФ.Представление = НСтр("ru = 'Перемещение товаров';uk='Переміщення товарів'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;
		СтрокаПФ.ИмяМенеджераПечати = "ПеремещениеТоваров";
				
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ТТН_ФС";
		СтрокаПФ.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
		СтрокаПФ.Количество = 2;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ТТН;
		СтрокаПФ.ИмяМенеджераПечати = "ТК_ТТН";
		
	СтрокаХозОперация = ЭлементыУр1.Добавить();
	СтрокаХозОперация.Флажок = Истина;
	СтрокаХозОперация.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство;
	СтрокаХозОперация.Представление = Строка(Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство);
	
		ЭлементыУр2 = СтрокаХозОперация.ПолучитьЭлементы();
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ПеремещениеТоваров";
		СтрокаПФ.Представление = НСтр("ru = 'Перемещение товаров';uk='Переміщення товарів'");
		СтрокаПФ.Количество = 4;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;
		СтрокаПФ.ИмяМенеджераПечати = "ПеремещениеТоваров";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ДекларацияПроизводителя";
		СтрокаПФ.Представление = НСтр("ru = 'Декларация производителя'; uk = 'Декларація виробника'");
		СтрокаПФ.Количество = 1;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ВыпускПродукции;
		СтрокаПФ.ИмяМенеджераПечати = "ВыпускПродукции";
		
		СтрокаПФ = ЭлементыУр2.Добавить();
		СтрокаПФ.Флажок = Истина;
		СтрокаПФ.Имя = "ТТН_ФС";
		СтрокаПФ.Представление = НСтр("ru = 'Товаро-транспортная накладная (Фабрика сыра)'; uk = 'Товаро-транспортна накладна (Фабрика сиру)'");
		СтрокаПФ.Количество = 2;
		СтрокаПФ.ХозОперация = Справочники.ХозОперации.ТТН;
		СтрокаПФ.ИмяМенеджераПечати = "ТК_ТТН";
		
		
КонецПроцедуры

&НаСервере
Процедура НачатьВыборЗаказов(Режим)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДеревоЗаказов.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЗаказПокупателя.Проведен
	               |			ТОГДА 1
	               |		КОГДА ЗаказПокупателя.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	ЗаказПокупателя.Ссылка КАК Документ,
	               |	ЗаказПокупателя.Дата КАК Дата,
	               |	ЗаказПокупателя.СрокПоставки КАК ДатаОтгрузки,
	               |	ЗаказПокупателя.ХозОперация КАК ХозОперация,
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.ДоговорВзаиморасчетов КАК Договор,
	               |	ЗаказПокупателя.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ЗаказПокупателя.Номер КАК Номер,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Комментарий КАК Комментарий
	               |ПОМЕСТИТЬ ВТ_Заказы
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка В(&Массив)
	               |	И ЗаказПокупателя.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВыпускПродукции.Проведен
	               |			ТОГДА 1
	               |		КОГДА ВыпускПродукции.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	ВыпускПродукции.Ссылка КАК Документ,
	               |	ВыпускПродукции.Дата КАК Дата,
	               |	ВыпускПродукции.ХозОперация КАК ХозОперация,
	               |	ВыпускПродукции.Организация КАК Организация,
	               |	ВыпускПродукции.Контрагент КАК Контрагент,
	               |	ВыпускПродукции.ДоговорВзаиморасчетов КАК Договор,
	               |	ВыпускПродукции.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ВыпускПродукции.Номер КАК Номер,
	               |	ВыпускПродукции.СуммаДокумента КАК СуммаДокумента,
	               |	ВыпускПродукции.Комментарий КАК Комментарий,
	               |	ВТ_Заказы.Документ КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Выпуски
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ВыпускПродукции
	               |		ПО ВТ_Заказы.Документ = ВыпускПродукции.ДокументОснование
	               |			И (НЕ ВыпускПродукции.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.Проведен
	               |			ТОГДА 1
	               |		КОГДА ПеремещениеТоваров.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	ПеремещениеТоваров.Ссылка КАК Документ,
	               |	ПеремещениеТоваров.Дата КАК Дата,
	               |	ПеремещениеТоваров.ХозОперация КАК ХозОперация,
	               |	ПеремещениеТоваров.Организация КАК Организация,
	               |	ПеремещениеТоваров.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ПеремещениеТоваров.Номер КАК Номер,
	               |	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента,
	               |	ПеремещениеТоваров.Комментарий КАК Комментарий,
	               |	ВТ_Выпуски.Документ КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Перемещения
	               |ИЗ
	               |	ВТ_Выпуски КАК ВТ_Выпуски
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ВТ_Выпуски.Документ = ПеремещениеТоваров.ДокументОснование
	               |			И (НЕ ПеремещениеТоваров.ПометкаУдаления)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.Проведен
	               |			ТОГДА 1
	               |		КОГДА ПеремещениеТоваров.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ПеремещениеТоваров.Ссылка,
	               |	ПеремещениеТоваров.Дата,
	               |	ПеремещениеТоваров.ХозОперация,
	               |	ПеремещениеТоваров.Организация,
	               |	ПеремещениеТоваров.РегламентированныйУчет,
	               |	ПеремещениеТоваров.Номер,
	               |	ПеремещениеТоваров.СуммаДокумента,
	               |	ПеремещениеТоваров.Комментарий,
	               |	ВТ_Заказы.Документ
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ВТ_Заказы.Документ = ПеремещениеТоваров.ДокументОснование
	               |			И (НЕ ПеремещениеТоваров.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.Проведен
	               |			ТОГДА 1
	               |		КОГДА ПеремещениеТоваров.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	ПеремещениеТоваров.Ссылка КАК Документ,
	               |	ПеремещениеТоваров.Дата КАК Дата,
	               |	ПеремещениеТоваров.ХозОперация КАК ХозОперация,
	               |	ПеремещениеТоваров.Организация КАК Организация,
	               |	ПеремещениеТоваров.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ПеремещениеТоваров.Номер КАК Номер,
	               |	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента,
	               |	ПеремещениеТоваров.Комментарий КАК Комментарий,
	               |	ВТ_Перемещения.Документ КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_ПеремещенияИзФилиала
	               |ИЗ
	               |	ВТ_Перемещения КАК ВТ_Перемещения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ВТ_Перемещения.Документ = ПеремещениеТоваров.ДокументОтгрузки
	               |			И (ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала))
	               |			И (НЕ ПеремещениеТоваров.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваров.Проведен
	               |			ТОГДА 1
	               |		КОГДА РеализацияТоваров.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	РеализацияТоваров.Ссылка КАК Документ,
	               |	РеализацияТоваров.Дата КАК Дата,
	               |	РеализацияТоваров.ХозОперация КАК ХозОперация,
	               |	РеализацияТоваров.Организация КАК Организация,
	               |	РеализацияТоваров.Контрагент КАК Контрагент,
	               |	РеализацияТоваров.ДоговорВзаиморасчетов КАК Договор,
	               |	РеализацияТоваров.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	РеализацияТоваров.Номер КАК Номер,
	               |	РеализацияТоваров.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваров.Комментарий КАК Комментарий,
	               |	ВТ_Заказы.Документ КАК ДокументОснование
	               |ПОМЕСТИТЬ Вт_Реализации
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК РеализацияТоваров
	               |		ПО ВТ_Заказы.Документ = РеализацияТоваров.ДокументОснование
	               |			И (НЕ РеализацияТоваров.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТК_ТТНИсточники.Ссылка.ПометкаУдаления
	               |			ТОГДА 3
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СтатусДокумента,
	               |	ТК_ТТНИсточники.Ссылка.Дата КАК Дата,
	               |	ТК_ТТНИсточники.Ссылка КАК Документ,
	               |	ТК_ТТНИсточники.Ссылка.ХозОперация КАК ХозОперация,
	               |	ТК_ТТНИсточники.Ссылка.Организация КАК Организация,
	               |	ВТ_Перемещения.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ТК_ТТНИсточники.Ссылка.Номер КАК Номер,
	               |	ТК_ТТНИсточники.Ссылка.Сумма КАК СуммаДокумента,
	               |	ТК_ТТНИсточники.Ссылка.Комментарий КАК Комментарий,
	               |	ВТ_Перемещения.Документ КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_ТТН
	               |ИЗ
	               |	Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Перемещения КАК ВТ_Перемещения
	               |		ПО ТК_ТТНИсточники.Документ = ВТ_Перемещения.Документ
	               |			И (НЕ ТК_ТТНИсточники.Ссылка.ПометкаУдаления)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Выпуски.СтатусДокумента КАК СтатусДокумента,
	               |	ВТ_Выпуски.Документ КАК Документ,
	               |	ВТ_Выпуски.Дата КАК Дата,
	               |	ВТ_Выпуски.ХозОперация КАК ХозОперация,
	               |	ВТ_Выпуски.Организация КАК Организация,
	               |	ВТ_Выпуски.Контрагент КАК Контрагент,
	               |	ВТ_Выпуски.Договор КАК Договор,
	               |	ВТ_Выпуски.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ВТ_Выпуски.Номер КАК Номер,
	               |	ВТ_Выпуски.СуммаДокумента КАК СуммаДокумента,
	               |	ВТ_Выпуски.Комментарий КАК Комментарий,
	               |	ВТ_Выпуски.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	ВТ_Выпуски КАК ВТ_Выпуски
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Перемещения.СтатусДокумента,
	               |	ВТ_Перемещения.Документ,
	               |	ВТ_Перемещения.Дата,
	               |	ВТ_Перемещения.ХозОперация,
	               |	ВТ_Перемещения.Организация,
	               |	NULL,
	               |	NULL,
	               |	ВТ_Перемещения.РегламентированныйУчет,
	               |	ВТ_Перемещения.Номер,
	               |	ВТ_Перемещения.СуммаДокумента,
	               |	ВТ_Перемещения.Комментарий,
	               |	ВТ_Перемещения.ДокументОснование
	               |ИЗ
	               |	ВТ_Перемещения КАК ВТ_Перемещения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ПеремещенияИзФилиала.СтатусДокумента,
	               |	ВТ_ПеремещенияИзФилиала.Документ,
	               |	ВТ_ПеремещенияИзФилиала.Дата,
	               |	ВТ_ПеремещенияИзФилиала.ХозОперация,
	               |	ВТ_ПеремещенияИзФилиала.Организация,
	               |	NULL,
	               |	NULL,
	               |	ВТ_ПеремещенияИзФилиала.РегламентированныйУчет,
	               |	ВТ_ПеремещенияИзФилиала.Номер,
	               |	ВТ_ПеремещенияИзФилиала.СуммаДокумента,
	               |	ВТ_ПеремещенияИзФилиала.Комментарий,
	               |	ВТ_ПеремещенияИзФилиала.ДокументОснование
	               |ИЗ
	               |	ВТ_ПеремещенияИзФилиала КАК ВТ_ПеремещенияИзФилиала
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ТТН.СтатусДокумента,
	               |	ВТ_ТТН.Документ,
	               |	ВТ_ТТН.Дата,
	               |	ВТ_ТТН.ХозОперация,
	               |	ВТ_ТТН.Организация,
	               |	NULL,
	               |	NULL,
	               |	ВТ_ТТН.РегламентированныйУчет,
	               |	ВТ_ТТН.Номер,
	               |	ВТ_ТТН.СуммаДокумента,
	               |	ВТ_ТТН.Комментарий,
	               |	ВТ_ТТН.ДокументОснование
	               |ИЗ
	               |	ВТ_ТТН КАК ВТ_ТТН
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Вт_Реализации.СтатусДокумента,
	               |	Вт_Реализации.Документ,
	               |	Вт_Реализации.Дата,
	               |	Вт_Реализации.ХозОперация,
	               |	Вт_Реализации.Организация,
	               |	Вт_Реализации.Контрагент,
	               |	Вт_Реализации.Договор,
	               |	Вт_Реализации.РегламентированныйУчет,
	               |	Вт_Реализации.Номер,
	               |	Вт_Реализации.СуммаДокумента,
	               |	Вт_Реализации.Комментарий,
	               |	Вт_Реализации.ДокументОснование
	               |ИЗ
	               |	Вт_Реализации КАК Вт_Реализации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	СтатусДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заказы.СтатусДокумента КАК СтатусДокумента,
	               |	ВТ_Заказы.Документ КАК Документ,
	               |	ВТ_Заказы.Дата КАК Дата,
	               |	ВТ_Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ВТ_Заказы.ХозОперация КАК ХозОперация,
	               |	ВТ_Заказы.Организация КАК Организация,
	               |	ВТ_Заказы.Контрагент КАК Контрагент,
	               |	ВТ_Заказы.Договор КАК Договор,
	               |	ВТ_Заказы.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ВТ_Заказы.Номер КАК Номер,
	               |	ВТ_Заказы.СуммаДокумента КАК СуммаДокумента,
	               |	ВТ_Заказы.Комментарий КАК Комментарий
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	МассивДокументов = ПолучитьМассивСсылокСписка("Все", "ЗаказПокупателя");	
	Запрос.УстановитьПараметр("Массив", МассивДокументов);	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ГраницаМассива = МассивРезультатов.ВГраница();
	
	тчДокументы = МассивРезультатов[ГраницаМассива-1].Выгрузить();
	тчДокументы.Индексы.Добавить("Документ, ДокументОснование");
	
	ВыборкаЗаказы = МассивРезультатов[ГраницаМассива].Выбрать();
	
	Пока ВыборкаЗаказы.Следующий() Цикл 
		НоваяСтрокаУр1 = ДеревоЗаказов.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУр1, ВыборкаЗаказы);
		
		ЗаполнитьДеревоРекурсивно(ВыборкаЗаказы.Документ, НоваяСтрокаУр1.ПолучитьЭлементы(), тчДокументы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРекурсивно(Документ, СтрокаДерева, тчДокументы)
	
	МассивСтрок = тчДокументы.НайтиСтроки(Новый Структура("ДокументОснование", Документ));
	
	Для Каждого нСтрока Из МассивСтрок Цикл 
		НоваяСтрока = СтрокаДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, нСтрока);
		
		ЗаполнитьДеревоРекурсивно(нСтрока.Документ, НоваяСтрока.ПолучитьЭлементы(), тчДокументы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКоличествоВыбранныхЗаказов()
	
	//КнопкаВыпуск = Элементы.ТаблицаВыбораЗаказовВыбор_СоздатьВыпускПродукции;
	//КнопкаПечать = Элементы.ТаблицаВыбораЗаказовВыбор_НапечататьКомплектДокументов;
	//
	////Выбрано = ТаблицаВыбораЗаказов.НайтиСтроки(Новый Структура("Флажок", Истина)).Количество();
	//
	//Выбрано = 0;
	//
	//КнопкаВыпуск.Заголовок = НСтр("ru = 'Создать выпуски продукции'; uk = 'Створити випуски продукції'") + ?(Выбрано <> 0, " (" + Выбрано + ")", "");
	//КнопкаПечать.Заголовок = НСтр("ru = 'Напечатать комплект документов'; uk = 'Надрукувати комплект документів'") + ?(Выбрано <> 0, " (" + Выбрано + ")", "");							
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяТипаДокумента(Знач Документ)	
	Возврат Документ.Метаданные().Имя;
КонецФункции



#Область Отгрузка

&НаСервереБезКонтекста
Функция ПолучитьТаблицуПодчиненныхДокументов()
	
	тзПодчиненныеДок = Новый ТаблицаЗначений;
	тзПодчиненныеДок.Колонки.Добавить("Флажок");
	тзПодчиненныеДок.Колонки.Добавить("Дата");
	тзПодчиненныеДок.Колонки.Добавить("Документ");
	тзПодчиненныеДок.Колонки.Добавить("СтатусДокумента");
	тзПодчиненныеДок.Колонки.Добавить("ХозОперация");
	тзПодчиненныеДок.Колонки.Добавить("РегламентированныйУчет");
	тзПодчиненныеДок.Колонки.Добавить("ДокументОснование");
		
	Возврат тзПодчиненныеДок;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьТЗПодчиненныеДокРекурсивно(ТаблицаЗначений, СтрокиЗаказ)
	
	Для Каждого Стр Из СтрокиЗаказ.ПолучитьЭлементы() Цикл 
		НоваяСтрока = ТаблицаЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.ДокументОснование = СтрокиЗаказ.Документ;
		
		ЗаполнитьТЗПодчиненныеДокРекурсивно(ТаблицаЗначений, Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТТН_ПеремещениеВФилиал(ТТН, ПеремещениеВФилиал)
	
	ТТН.Дата = ПеремещениеВФилиал.Дата;
	ТТН.Статус = Перечисления.СтатусыТТН.Черновик;
	ТТН.ХозОперация = Справочники.ХозОперации.ТТН;
	ТТН.ВидПеревозки = "автоперевезення";
	ТТН.Отправитель = Справочники.Организации.ПолучитьПредставлениеДляПечати(ПеремещениеВФилиал.Организация, Истина,,,,,ТТН.Дата, "uk");
	ТТН.ДолжностьОтветственногоОтправителя = "комірник";
	
	ТТН.ПунктОтправитель = ПеремещениеВФилиал.СкладКомпании.ТочкаДоставки;
	ТТН.ПунктПолучатель = ПеремещениеВФилиал.СкладКомпанииПолучатель.ТочкаДоставки;
	
	ЗаполнитьЗначенияСвойств(ТТН, ПеремещениеВФилиал, "Организация,ПодразделениеКомпании");
	
	ЗаказПокупателя = Неопределено;
	Если ПеремещениеВФилиал.РаспределениеОтгрузки.Количество() > 0 Тогда 
		ЗаказПокупателя = ПеремещениеВФилиал.РаспределениеОтгрузки[0].ЗаказПокупателя;
	ИначеЕсли ТипЗнч(ПеремещениеВФилиал.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ЗаказПокупателя = ПеремещениеВФилиал.ДокументОснование;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Контрагент");
	СтруктураРеквизитов.Вставить("Перевозчик");
	СтруктураРеквизитов.Вставить("Автомобиль");
	СтруктураРеквизитов.Вставить("Водитель");
	СтруктураРеквизитов.Вставить("НомерПрав");
	СтруктураРеквизитов.Вставить("Заказчик", ТТН.Отправитель);
	СтруктураРеквизитов.Вставить("Прицеп");
	СтруктураРеквизитов.Вставить("Основание");
	СтруктураРеквизитов.Вставить("НомерПЛ");
	СтруктураРеквизитов.Вставить("Экспедитор");
		
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда 		
	
		МассивИменСвойствДоговора = Новый Массив;
		МассивИменСвойствДоговора.Добавить("ТТН_Автомобиль");
		МассивИменСвойствДоговора.Добавить("ТТН_Заказчик");
		МассивИменСвойствДоговора.Добавить("ТТН_Перевозчик");
		МассивИменСвойствДоговора.Добавить("ТТН_Водитель");		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
		Запрос.УстановитьПараметр("МассивСвойств", МассивИменСвойствДоговора);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЗаказПокупателя.Контрагент КАК Контрагент,
		               |	ЗаказПокупателя.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДополнительныеСведения.Свойство.Имя КАК СвойствоИмя,
		               |	ДополнительныеСведения.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		               |ГДЕ
		               |	ДополнительныеСведения.Объект = ВЫРАЗИТЬ(&Ссылка КАК Документ.ЗаказПокупателя).ДоговорВзаиморасчетов
		               |	И ДополнительныеСведения.Свойство.Имя В(&МассивСвойств)";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		ВыборкаРеквизиты  = МассивРезультатов[0].Выбрать();
		ВыборкаПоДоговору = МассивРезультатов[1].Выбрать();
		
		Если ВыборкаРеквизиты.Следующий() Тогда 
			СтруктураРеквизитов.Контрагент = ВыборкаРеквизиты.Контрагент;		
			СтруктураРеквизитов.Заказчик = ВыборкаРеквизиты.Контрагент;
		КонецЕсли;
		
		Пока ВыборкаПоДоговору.Следующий() Цикл 
			
			Если ВыборкаПоДоговору.СвойствоИмя = "ТТН_Автомобиль" Тогда 
				
				СтруктураРеквизитов.Автомобиль = ВыборкаПоДоговору.Значение;
				
			ИначеЕсли ВыборкаПоДоговору.СвойствоИмя = "ТТН_Водитель" Тогда 
				
				Водитель = ВыборкаПоДоговору.Значение;				
				
				СтруктураРеквизитов.Водитель = Водитель;
				СтруктураРеквизитов.Экспедитор = Водитель;
				
				НомерПрав = "";
				Если ТипЗнч(Водитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
					НомерПрав = Справочники.ФизическиеЛица.ПолучитьНомерВодительскогоУдостоверения(Водитель, ТТН.Дата);
				КонецЕсли;
				
				СтруктураРеквизитов.НомерПрав = НомерПрав;
				
			ИначеЕсли ВыборкаПоДоговору.СвойствоИмя = "ТТН_Перевозчик" Тогда 				
				
				Перевозчик = ВыборкаПоДоговору.Значение;
				ТипРеквизитаПеревозчик = ТипЗнч(Перевозчик);
				
				СтруктураРеквизитов.Перевозчик = Перевозчик;
			ИначеЕсли ВыборкаПоДоговору.СвойствоИмя = "ТТН_Заказчик" Тогда 
				СтруктураРеквизитов.Заказчик = ВыборкаПоДоговору.Значение;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ТТН, СтруктураРеквизитов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПеремещениеВФилиал.Ссылка);	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПеремещениеТоваровТовары.Ссылка КАК Документ,
	               |	СУММА(ЕСТЬNULL(ПеремещениеТоваровТовары.ЕдиницаИзмерения.Вес, 0) * ПеремещениеТоваровТовары.КоличествоБазовое) КАК Масса
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Масса = 0;
	Если Выборка.Следующий() Тогда 
		Масса = Выборка.Масса;
	КонецЕсли;
	
	ТТН.Источники.Очистить();
	
	НоваяСтрока = ТТН.Источники.Добавить();
	НоваяСтрока.Документ = ПеремещениеВФилиал.Ссылка;
	НоваяСтрока.Масса = Масса;
	
	
КонецПроцедуры


&НаСервере
Функция Отгрузка_ВыпускСРеализацией(СтрокаЗаказ)
	
	ВсеОк = Истина;
	
	Заказ = СтрокаЗаказ.Документ;
	ДокументВыпуск = Неопределено;	
	
	тзПодчиненныеДок = ПолучитьТаблицуПодчиненныхДокументов();	
	ЗаполнитьТЗПодчиненныеДокРекурсивно(тзПодчиненныеДок, СтрокаЗаказ);
	
	ИспользуетсяТранзакция = Ложь;
	
	Попытка
		
		Если тзПодчиненныеДок.Количество() > 0 Тогда 
			тзПодчиненныеДок.Сортировать("СтатусДокумента Убыв, Дата Убыв");	
			
			Для Каждого Стр Из тзПодчиненныеДок Цикл 
				
				Если ДокументВыпуск = Неопределено 
					И ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ВыпускПродукции") Тогда 				
					
					//Заполним найденный выпуск продукции
					ДокументВыпуск = Стр.Документ.ПолучитьОбъект();
					
					Если (ДокументВыпуск.ПометкаУдаления ИЛИ ДокументВыпуск.Проведен) И Не ИспользуетсяТранзакция Тогда 						
						НачатьТранзакцию();						
						ИспользуетсяТранзакция = Истина;
					КонецЕсли;
					
					Если ДокументВыпуск.ПометкаУдаления Тогда 
						ДокументВыпуск.УстановитьПометкуУдаления(Ложь);
					ИначеЕсли ДокументВыпуск.Проведен Тогда 
						ДокументВыпуск.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
					
					Продолжить;
				КонецЕсли;
				
				//Пометим на удаление остальные подчиненные документы
				Если Не ИспользуетсяТранзакция Тогда 
					НачатьТранзакцию();						
					ИспользуетсяТранзакция = Истина;
				КонецЕсли;
				
				ДокОбъект = Стр.Документ.ПолучитьОБъект();
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если ДокументВыпуск = Неопределено Тогда 
			ДокументВыпуск = Документы.ВыпускПродукции.СоздатьДокумент();				
		КонецЕсли;	
		
		ДокументВыпуск.Заполнить(Заказ);
		
		Если ПроводитьДокументы Тогда 
			ДокументВыпуск.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки", Истина);
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		ДокументВыпуск.Записать(РежимЗаписи);
		
		Если ИспользуетсяТранзакция Тогда 
			ЗафиксироватьТранзакцию();	
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1 %2",
				?(ПроводитьДокументы, НСтр("ru = 'Проведен'; uk = 'Проведений'"), НСтр("ru = 'Записан'; uk = 'Записаний'")),
				ДокументВыпуск),
			ДокументВыпуск.Ссылка);			
		
	Исключение
		
		ВсеОк = Ложь;
		
		Если ИспользуетсяТранзакция Тогда 
			ОтменитьТранзакцию();	
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось %3 выпуск для %1.
                      |Ошибки: %2'; uk = 'Не вдалося %3 випуск для %1.
                      |Помилки: %2'"),
				Заказ,
				ОписаниеОшибки(),
				?(ПроводитьДокументы, НСтр("ru = 'провести'; uk = 'провести'"), НСтр("ru = 'записать'; uk = 'записати'"))),
			Заказ);
		
	КонецПопытки;
	
	Возврат ВсеОк;
КонецФункции

&НаСервере
Функция Отгрузка_ПеремещениеИВыпуск(СтрокаЗаказ)
	
	ВсеОк = Истина;
	
	Заказ = СтрокаЗаказ.Документ;
	
	ДокВыпуск = Неопределено;
	ДокПеремещениеВФилиал = Неопределено;
	ДокПеремещениеИзФилиала = Неопределено;
	ДокТТН = Неопределено;
	
	тзПодчиненныеДок = ПолучитьТаблицуПодчиненныхДокументов();	
	ЗаполнитьТЗПодчиненныеДокРекурсивно(тзПодчиненныеДок, СтрокаЗаказ);
	тзПодчиненныеДок.Сортировать("ХозОперация, СтатусДокумента Убыв, Дата Убыв");
	
	ИспользуетсяТранзакция = Ложь;	
	
	Попытка					
		Если тзПодчиненныеДок.Количество() > 0 Тогда
			
			МассивПодчиненныхДок = Новый Массив;
			
			//Ищем документ Выпуск продукции
			мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ХозОперация", Справочники.ХозОперации.ВыпускПродукции));
			КоличествоДокументов = мДокументы.Количество();
						
			Если КоличествоДокументов > 0 Тогда 
				ДокВыпуск = мДокументы[0].Документ.ПолучитьОбъект();
				МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
				
				Если КоличествоДокументов > 1 Тогда
					Для Ит = 1 По мДокументы.ВГраница() Цикл 
						текСтрока = мДокументы.Получить(Ит);
						
						Если текСтрока.СтатусДокумента <> 3 Тогда
							Попытка
								текДокумент = текСтрока.Документ.ПолучитьОбъект();
								текДокумент.УстановитьПометкуУдаления(Истина);
								
								текСтрока.СтатусДокумента = 3;
							Исключение
								ОбщегоНазначения.СообщитьПользователю(
									СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
										текСтрока.Документ),
									текСтрока.Документ);
							КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			//Ищем документ Перемещение товаров в филиал
			Если ДокВыпуск <> Неопределено Тогда 
				мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", ДокВыпуск.Ссылка, Справочники.ХозОперации.ПеремещениеТоваровВФилиал));
				КоличествоДокументов = мДокументы.Количество();
				
				Если КоличествоДокументов > 0 Тогда 
					ДокПеремещениеВФилиал = мДокументы[0].Документ.ПолучитьОбъект();
					МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
					
					Если КоличествоДокументов > 1 Тогда 
						Для Ит = 1 По мДокументы.ВГраница() Цикл 
							текСтрока = мДокументы.Получить(Ит);
							
							Если текСтрока.СтатусДокумента <> 3 Тогда
								Попытка
									текДокумент = текСтрока.Документ.ПолучитьОбъект();
									текДокумент.УстановитьПометкуУдаления(Истина);
									
									текСтрока.СтатусДокумента = 3;
								Исключение
									ОбщегоНазначения.СообщитьПользователю(
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
											текСтрока.Документ),
										текСтрока.Документ);
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//Ищем документ Перемещение товаров из филиала
			Если ДокПеремещениеВФилиал <> Неопределено Тогда 
				мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", ДокПеремещениеВФилиал.Ссылка, Справочники.ХозОперации.ПеремещениеТоваровИзФилиала));
				КоличествоДокументов = мДокументы.Количество();
				
				Если КоличествоДокументов > 0 Тогда 
					ДокПеремещениеИзФилиала = мДокументы[0].Документ.ПолучитьОбъект();
					МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
					
					Если КоличествоДокументов > 1 Тогда 
						Для Ит = 1 По мДокументы.ВГраница() Цикл 
							текСтрока = мДокументы.Получить(Ит);
							
							Если текСтрока.СтатусДокумента <> 3 Тогда
								Попытка
									текДокумент = текСтрока.Документ.ПолучитьОбъект();
									текДокумент.УстановитьПометкуУдаления(Истина);
									
									текСтрока.СтатусДокумента = 3;
								Исключение
									ОбщегоНазначения.СообщитьПользователю(
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
											текСтрока.Документ),
										текСтрока.Документ);
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;				
				
			КонецЕсли;
			
			//Ищем документ ТТН
			Если ДокПеремещениеВФилиал <> Неопределено Тогда 
				мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", ДокПеремещениеВФилиал.Ссылка, Справочники.ХозОперации.ТТН));
				КоличествоДокументов = мДокументы.Количество();
				
				Если КоличествоДокументов > 0 Тогда 
					ДокТТН = мДокументы[0].Документ.ПолучитьОбъект();
					МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
					
					Если КоличествоДокументов > 1 Тогда 
						Для Ит = 1 По мДокументы.ВГраница() Цикл 
							текСтрока = мДокументы.Получить(Ит);
							
							Если текСтрока.СтатусДокумента <> 3 Тогда
								Попытка
									текДокумент = текСтрока.Документ.ПолучитьОбъект();
									текДокумент.УстановитьПометкуУдаления(Истина);
									
									текСтрока.СтатусДокумента = 3;
								Исключение
									ОбщегоНазначения.СообщитьПользователю(
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
											текСтрока.Документ),
										текСтрока.Документ);
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;				
				
			КонецЕсли;			
						
			//Удаляем оставшиеся связанные документы
			Для Каждого текСтрока Из тзПодчиненныеДок Цикл 
				Если МассивПодчиненныхДок.Найти(текСтрока.Документ) <> Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				Если текСтрока.СтатусДокумента <> 3 Тогда 
					Попытка
						текДокумент = текСтрока.Документ.ПолучитьОбъект();
						текДокумент.УстановитьПометкуУдаления(Истина);
						
						текСтрока.СтатусДокумента = 3;
					Исключение
						ОбщегоНазначения.СообщитьПользователю(
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
								текСтрока.Документ),
							текСтрока.Документ);
					КонецПопытки;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если Не ИспользуетсяТранзакция Тогда 
			НачатьТранзакцию();						
			ИспользуетсяТранзакция = Истина;
		КонецЕсли;
				
		// Создаем выпуск продукции
		Если ДокВыпуск = Неопределено Тогда 
			ДокВыпуск = Документы.ВыпускПродукции.СоздатьДокумент();
		Иначе
			Если ДокВыпуск.ПометкаУдаления Тогда 
				ДокВыпуск.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		           
		ДокВыпуск.Заполнить(Заказ);
		ДокВыпуск.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки", Истина);
		ДокВыпуск.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ДокПеремещениеВФилиал = Неопределено Тогда 
			ДокПеремещениеВФилиал = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			Если ДокПеремещениеВФилиал.ПометкаУдаления Тогда 
				ДокПеремещениеВФилиал.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		ДокПеремещениеВФилиал.Заполнить(ДокВыпуск.Ссылка);		
		ДокПеремещениеВФилиал.Дата = ДокВыпуск.Дата + 1;	
		ДокПеремещениеВФилиал.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки", Истина);
		ДокПеремещениеВФилиал.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ДокПеремещениеИзФилиала = Неопределено Тогда 
			ДокПеремещениеИзФилиала = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			Если ДокПеремещениеИзФилиала.ПометкаУдаления Тогда 
				ДокПеремещениеИзФилиала.УстановитьПометкуУдаления(Ложь);	
			КонецЕсли;
		КонецЕсли;
		
		ДокПеремещениеИзФилиала.Заполнить(ДокПеремещениеВФилиал.Ссылка);
		ДокПеремещениеИзФилиала.Дата = ДокПеремещениеВФилиал.Дата + 1;
		ДокПеремещениеИзФилиала.Записать(РежимЗаписиДокумента.Запись);
		
		Если ДокТТН = Неопределено Тогда 
			ДокТТН = Документы.ТК_ТТН.СоздатьДокумент();
		Иначе
			Если ДокТТН.ПометкаУдаления Тогда 
				ДокТТН.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТТН_ПеремещениеВФилиал(ДокТТН, ДокПеремещениеВФилиал);
		ДокТТН.Записать(РежимЗаписиДокумента.Запись);
		
		Если ИспользуетсяТранзакция Тогда 
			ЗафиксироватьТранзакцию();
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;
	Исключение
		ВсеОк = Ложь;
		
		Если ИспользуетсяТранзакция Тогда 
			ОтменитьТранзакцию();	
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;		
		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось %3 отгрузку для %1.
                      |Ошибки: %2'; uk = 'Не вдалося %3 відвантаження для %1.
                      |Помилки: %2'"),
				Заказ,
				ОписаниеОшибки(),
				?(ПроводитьДокументы, НСтр("ru = 'провести'; uk = 'провести'"), НСтр("ru = 'записать'; uk = 'записати'"))),
			Заказ);		
		
	КонецПопытки;
	
	Возврат ВсеОк;
	
КонецФункции

&НаСервере
Функция Отгрузка_Перемещение(СтрокаЗаказ)
	
	ВсеОк = Истина;
	
	Заказ = СтрокаЗаказ.Документ;
	
	ДокПеремещениеВФилиал = Неопределено;
	ДокПеремещениеИзФилиала = Неопределено;
	ДокТТН = Неопределено;
	
	тзПодчиненныеДок = ПолучитьТаблицуПодчиненныхДокументов();	
	ЗаполнитьТЗПодчиненныеДокРекурсивно(тзПодчиненныеДок, СтрокаЗаказ);
	тзПодчиненныеДок.Сортировать("ХозОперация, СтатусДокумента Убыв, Дата Убыв");
	
	ИспользуетсяТранзакция = Ложь;	
	
	Попытка					
		Если тзПодчиненныеДок.Количество() > 0 Тогда
			
			МассивПодчиненныхДок = Новый Массив;
						
			//Ищем документ Перемещение товаров в филиал
			мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", Заказ, Справочники.ХозОперации.ПеремещениеТоваровВФилиал));
			КоличествоДокументов = мДокументы.Количество();
			
			Если КоличествоДокументов > 0 Тогда 
				ДокПеремещениеВФилиал = мДокументы[0].Документ.ПолучитьОбъект();
				МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
				
				Если КоличествоДокументов > 1 Тогда 
					Для Ит = 1 По мДокументы.ВГраница() Цикл 
						текСтрока = мДокументы.Получить(Ит);
						
						Если текСтрока.СтатусДокумента <> 3 Тогда
							Попытка
								текДокумент = текСтрока.Документ.ПолучитьОбъект();
								текДокумент.УстановитьПометкуУдаления(Истина);
								
								текСтрока.СтатусДокумента = 3;
							Исключение
								ОбщегоНазначения.СообщитьПользователю(
									СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
										текСтрока.Документ),
									текСтрока.Документ);
							КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
				
			//Ищем документ Перемещение товаров из филиала
			Если ДокПеремещениеВФилиал <> Неопределено Тогда 
				мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", ДокПеремещениеВФилиал.Ссылка, Справочники.ХозОперации.ПеремещениеТоваровИзФилиала));
				КоличествоДокументов = мДокументы.Количество();
				
				Если КоличествоДокументов > 0 Тогда 
					ДокПеремещениеИзФилиала = мДокументы[0].Документ.ПолучитьОбъект();
					МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
					
					Если КоличествоДокументов > 1 Тогда 
						Для Ит = 1 По мДокументы.ВГраница() Цикл 
							текСтрока = мДокументы.Получить(Ит);
							
							Если текСтрока.СтатусДокумента <> 3 Тогда
								Попытка
									текДокумент = текСтрока.Документ.ПолучитьОбъект();
									текДокумент.УстановитьПометкуУдаления(Истина);
									
									текСтрока.СтатусДокумента = 3;
								Исключение
									ОбщегоНазначения.СообщитьПользователю(
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
											текСтрока.Документ),
										текСтрока.Документ);
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;				
				
			КонецЕсли;
			
			//Ищем документ ТТН
			Если ДокПеремещениеВФилиал <> Неопределено Тогда 
				мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ДокументОснование, ХозОперация", ДокПеремещениеВФилиал.Ссылка, Справочники.ХозОперации.ТТН));
				КоличествоДокументов = мДокументы.Количество();
				
				Если КоличествоДокументов > 0 Тогда 
					ДокТТН = мДокументы[0].Документ.ПолучитьОбъект();
					МассивПодчиненныхДок.Добавить(мДокументы[0].Документ);
					
					Если КоличествоДокументов > 1 Тогда 
						Для Ит = 1 По мДокументы.ВГраница() Цикл 
							текСтрока = мДокументы.Получить(Ит);
							
							Если текСтрока.СтатусДокумента <> 3 Тогда
								Попытка
									текДокумент = текСтрока.Документ.ПолучитьОбъект();
									текДокумент.УстановитьПометкуУдаления(Истина);
									
									текСтрока.СтатусДокумента = 3;
								Исключение
									ОбщегоНазначения.СообщитьПользователю(
										СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
											текСтрока.Документ),
										текСтрока.Документ);
								КонецПопытки;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;				
				
			КонецЕсли;			
						
			//Удаляем оставшиеся связанные документы
			Для Каждого текСтрока Из тзПодчиненныеДок Цикл 
				Если МассивПодчиненныхДок.Найти(текСтрока.Документ) <> Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				
				Если текСтрока.СтатусДокумента <> 3 Тогда 
					Попытка
						текДокумент = текСтрока.Документ.ПолучитьОбъект();
						текДокумент.УстановитьПометкуУдаления(Истина);
						
						текСтрока.СтатусДокумента = 3;
					Исключение
						ОбщегоНазначения.СообщитьПользователю(
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = '    Не удалось установить пометку удаления на документ ""%1""'; uk = '    Не вдалося встановити помітку видалення на документ ""%1""'"),
								текСтрока.Документ),
							текСтрока.Документ);
					КонецПопытки;	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если Не ИспользуетсяТранзакция Тогда 
			НачатьТранзакцию();						
			ИспользуетсяТранзакция = Истина;
		КонецЕсли;
				
		Если ДокПеремещениеВФилиал = Неопределено Тогда 
			ДокПеремещениеВФилиал = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			Если ДокПеремещениеВФилиал.ПометкаУдаления Тогда 
				ДокПеремещениеВФилиал.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		ДокПеремещениеВФилиал.Заполнить(Заказ);		
		ДокПеремещениеВФилиал.Дата = Заказ.СрокПоставки + (60*60*12);	
		ДокПеремещениеВФилиал.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки", Истина);
		ДокПеремещениеВФилиал.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ДокПеремещениеИзФилиала = Неопределено Тогда 
			ДокПеремещениеИзФилиала = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			Если ДокПеремещениеИзФилиала.ПометкаУдаления Тогда 
				ДокПеремещениеИзФилиала.УстановитьПометкуУдаления(Ложь);	
			КонецЕсли;
		КонецЕсли;
		
		ДокПеремещениеИзФилиала.Заполнить(ДокПеремещениеВФилиал.Ссылка);
		ДокПеремещениеИзФилиала.Дата = ДокПеремещениеВФилиал.Дата + 1;
		ДокПеремещениеИзФилиала.Записать(РежимЗаписиДокумента.Запись);
		
		Если ДокТТН = Неопределено Тогда 
			ДокТТН = Документы.ТК_ТТН.СоздатьДокумент();
		Иначе
			Если ДокТТН.ПометкаУдаления Тогда 
				ДокТТН.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьТТН_ПеремещениеВФилиал(ДокТТН, ДокПеремещениеВФилиал);
		ДокТТН.Записать(РежимЗаписиДокумента.Запись);
		
		Если ИспользуетсяТранзакция Тогда 
			ЗафиксироватьТранзакцию();
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;
	Исключение
		ВсеОк = Ложь;
		
		Если ИспользуетсяТранзакция Тогда 
			ОтменитьТранзакцию();	
			ИспользуетсяТранзакция = Ложь;
		КонецЕсли;		
		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось %3 отгрузку для %1.
                      |Ошибки: %2'; uk = 'Не вдалося %3 відвантаження для %1.
                      |Помилки: %2'"),
				Заказ,
				ОписаниеОшибки(),
				?(ПроводитьДокументы, НСтр("ru = 'провести'; uk = 'провести'"), НСтр("ru = 'записать'; uk = 'записати'"))),
			Заказ);		
		
	КонецПопытки;
	
	Возврат ВсеОк;
	
КонецФункции


&НаСервере
Процедура ОтгрузитьЗаказы()
	
	Обработано = 0;
	СОшибками = 0;
	
	Для Каждого СтрЗаказ Из ДеревоЗаказов.ПолучитьЭлементы() Цикл 
		Если СтрЗаказ.Флажок Тогда 
			Успешно = Ложь;
			
			Если СтрЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя
				ИЛИ СтрЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяФизОбмен Тогда 
				
				Успешно = Отгрузка_ВыпускСРеализацией(СтрЗаказ);
			ИначеЕсли СтрЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство Тогда 
				Успешно = Отгрузка_ПеремещениеИВыпуск(СтрЗаказ);
			ИначеЕсли СтрЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателяВнутренний Тогда 
				Успешно = Отгрузка_Перемещение(СтрЗаказ);				
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 - для Хоз. операции ""%2"" не назначена схема отгрузки.
                              |Обратитесь к разработчику...'; uk = '%1 - для Госп. операції ""%2"" не призначена схема відвантаження.
                              |Зверніться до розробника...'"),
						СтрЗаказ.Документы,
						СтрЗаказ.ХозОперация),
					СтрЗаказ.Документы);
			КонецЕсли;
				
			Если Успешно Тогда 
				Обработано = Обработано + 1;
			Иначе
				СОшибками = СОшибками + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Обработано > 0 ИЛИ СОшибками > 0 Тогда		
		ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обработано %1 заказов.
	                  |Из них с ошибками %2.'; uk = 'Оброблено %1 замовлень.
	                  |Із них з помилками %2.'"),
				Обработано,
				СОшибками));
	КонецЕсли;
			
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьМассивДляПечати()
		
	МассивДокументовПечать = Новый Массив;
	НаборыКомплектовПечати = Новый Соответствие;
	
	Для Каждого стрХозОперация Из ДеревоПечатныхФорм.ПолучитьЭлементы() Цикл 
		Если Не стрХозОперация.Флажок Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивПФ = Новый Массив;
		Для Каждого стрПФ Из стрХозОперация.ПолучитьЭлементы() Цикл 
			Если Не стрПФ.Флажок ИЛИ стрПФ.Количество = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			СтруктураПФ = Новый Структура;
			СтруктураПФ.Вставить("ХозОперация", стрПФ.ХозОперация);
			СтруктураПФ.Вставить("ИмяМенеджераПечати", "Документ." + СокрЛП(стрПФ.ИмяМенеджераПечати));
			
			ИменаМакетов = "";
			Для Ит = 1 По стрПФ.Количество Цикл 
				ИменаМакетов = ИменаМакетов + ?(ПустаяСтрока(ИменаМакетов), "", ",") + стрПФ.Имя;	
			КонецЦикла;
			
			СтруктураПФ.Вставить("ИменаМакетов", ИменаМакетов);			
			
			МассивПФ.Добавить(СтруктураПФ);
		КонецЦикла;
		
		Если МассивПФ.Количество() > 0 Тогда 
			НаборыКомплектовПечати.Вставить(стрХозОперация.ХозОперация, МассивПФ);
		КонецЕсли;
	КонецЦикла;		
	
	Если НаборыКомплектовПечати.Количество() = 0 Тогда 
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет выбранных печатных форм для печати'; uk = 'Немає обраних друкованих форм для друку'"));
		Возврат МассивДокументовПечать;
	КонецЕсли;
	
	КэшОшибок = Новый Соответствие;
	Для Каждого стрЗаказ Из ДеревоЗаказов.ПолучитьЭлементы() Цикл 
		Если Не стрЗаказ.Флажок Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивПФ = НаборыКомплектовПечати.Получить(стрЗаказ.ХозОперация);
		Если МассивПФ = Неопределено Тогда 
			Если КэшОшибок.Получить(стрЗаказ.ХозОперация) = Неопределено Тогда 
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не установлен комплект печатных форм для хоз. операции заказа ""%1""'; uk = 'Не заповнений комплект друкованих форм для госп. операції замовлення ""%1""'"),
						стрЗаказ.ХозОперация));
						
				КэшОшибок.Вставить(стрЗаказ.ХозОперация, Истина);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		тзПодчиненныеДок = ПолучитьТаблицуПодчиненныхДокументов();	
		ЗаполнитьТЗПодчиненныеДокРекурсивно(тзПодчиненныеДок, стрЗаказ);
		тзПодчиненныеДок.Сортировать("ХозОперация, СтатусДокумента Убыв, Дата Убыв");
		
		Для Каждого СтруктураПФ Из МассивПФ Цикл 
			мДокументы = тзПодчиненныеДок.НайтиСтроки(Новый Структура("ХозОперация", СтруктураПФ.ХозОперация));			
			ЭтоПФТТН = ВРег(Лев(СтруктураПФ.ИменаМакетов, 3)) = "ТТН";
			
			Для Каждого стрДок Из мДокументы Цикл 
				Если Не стрДок.Флажок ИЛИ стрДок.СтатусДокумента = 3 Тогда 
					Продолжить;
				КонецЕсли;
				                            
				Если ЭтоПФТТН И Не стрДок.РегламентированныйУчет И Не Печать_ПечататьТТН Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураДляПечати = Новый Структура;				
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураДляПечати, СтруктураПФ);				
				СтруктураДляПечати.Вставить("Документ", стрДок.Документ);				
				
				МассивДокументовПечать.Добавить(СтруктураДляПечати);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивДокументовПечать;
КонецФункции


#КонецОбласти