
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса);
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);					
	ПартионныйУчет.ПодготовитьТаблицыВзаимозачета(Запрос,ДополнительныеСвойства);

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_Взаимозачет.Дата КАК Период,
	               |	ТК_Взаимозачет.Ссылка КАК Ссылка,
	               |	ТК_Взаимозачет.ХозОперация КАК ХозОперация,
	               |	ТК_Взаимозачет.Организация КАК Организация,
	               |	ТК_Взаимозачет.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ТК_Взаимозачет.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_Взаимозачет.ВалютаДокумента КАК ВалютаДокумента,
	               |	ТК_Взаимозачет.МоментВремени КАК МоментВремени,
	               |	ТК_Взаимозачет.РегламентированныйУчет КАК РегламентированныйУчет,
	               |	ТК_Взаимозачет.СуммаДокумента КАК СуммаДокумента,
	               |	ТК_Взаимозачет.Дебитор КАК Дебитор,
	               |	ТК_Взаимозачет.Кредитор КАК Кредитор,
	               |	ТК_Взаимозачет.КурсДокумента КАК КурсДокумента
	               |ИЗ
	               |	Документ.ТК_Взаимозачет КАК ТК_Взаимозачет
	               |ГДЕ
	               |	ТК_Взаимозачет.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 			Реквизиты.Период);
	Запрос.УстановитьПараметр("МоментВремени", 		Реквизиты.МоментВремени);
	Запрос.УстановитьПараметр("Ссылка", 			Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВалютаДокумента",	Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("ХозОперация", 		Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("РегламентированныйУчет", Реквизиты.РегламентированныйУчет);	
	Запрос.УстановитьПараметр("Дебитор",			Реквизиты.Дебитор);
	Запрос.УстановитьПараметр("Кредитор",			Реквизиты.Кредитор);
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);	
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Запрос.УстановитьПараметр("ВидДоговораПокупка", ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Покупка"));
	Запрос.УстановитьПараметр("ВидДоговораПродажа",	ПредопределенноеЗначение("Перечисление.ВидыДоговоров.Продажа"));

	ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет", Реквизиты.РегламентированныйУчет); 
	ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента", Реквизиты.КурсДокумента); 
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация", Реквизиты.ХозОперация); 

КонецПроцедуры

Функция ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса)
	
	
	ИмяРегистра = "ВтТаблицаСостав";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Дебитор КАК Дт_Контрагент,
	               |	&Кредитор КАК Кт_Контрагент,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК Дт_Договор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка КАК Дт_Покупка,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор КАК Кт_Договор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка КАК Кт_Покупка,
	               |	ТК_ВзаимозачетСостав.СделкаДебитор КАК Дт_Сделка,
	               |	ТК_ВзаимозачетСостав.СделкаКредитор КАК Кт_Сделка,
	               |	СУММА(ТК_ВзаимозачетСостав.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВтТаблицаСостав
	               |ИЗ
	               |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	               |ГДЕ
	               |	ТК_ВзаимозачетСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор,
	               |	ТК_ВзаимозачетСостав.СделкаКредитор,
	               |	ТК_ВзаимозачетСостав.СделкаДебитор,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка,
	               |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор.ВидДоговора.ВидДоговора = &ВидДоговораПокупка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("Взаиморасчеты");	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТК_ВзаимозачетСостав.Ссылка КАК Регистратор,
	                      |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК ДоговорКонтрагента
	                      |ПОМЕСТИТЬ втДоговора
	                      |ИЗ
	                      |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТК_ВзаимозачетСостав.Ссылка,
	                      |	ТК_ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор
	                      |ИЗ
	                      |	Документ.ТК_Взаимозачет.Состав КАК ТК_ВзаимозачетСостав
	                      |ГДЕ
	                      |	ТК_ВзаимозачетСостав.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	&Дата КАК Период,
	                      |	втДоговора.Регистратор КАК Регистратор,
	                      |	втДоговора.ДоговорКонтрагента КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	втДоговора КАК втДоговора");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата); 
		
	ТаблицыДляПоследовательности.Взаиморасчеты = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности",ТаблицыДляПоследовательности);
	
КонецПроцедуры

#КонецОбласти	


#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	                                            
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти	
