
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзРеестра")
		ИЛИ ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзКадастра")
		ИЛИ ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаПоНедвижимости") Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаВыдачи");
	КонецЕсли;
	Если ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияТабак")
		ИЛИ ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияАлкоголь") Тогда
		ПроверяемыеРеквизиты.Добавить("Номер");
		ПроверяемыеРеквизиты.Добавить("ДатаВыдачи");
		ПроверяемыеРеквизиты.Добавить("ДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
	КонецЕсли;
КонецПроцедуры
