
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Год = Запись.Месяц;
	Иначе
		Год = ТекущаяДата();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораМесяцев(Год,Элементы.Месяц.СписокВыбора)
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ЗаполнитьСписокВыбораМесяцев(Год,Элементы.Месяц.СписокВыбора)
КонецПроцедуры

	&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораМесяцев(Год, СписокМесяцев)
	СписокМесяцев.Очистить();
	
	Для Ит = 0 По 11 Цикл 
		тМесяц = НачалоМесяца(ДобавитьМесяц(НачалоГода(Год), Ит));
		СписокМесяцев.Добавить(тМесяц, Формат(тМесяц, "ДФ='MMMM yyyy'"));
	КонецЦикла;
КонецПроцедуры



