
#Область ПрограммныйИнтерфейс

// Возвращает валюту Управленческого Учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту РУ. Если валюта РУ не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты
//
Функция ПолучитьВалютуУправленческогоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции // ПолучитьВалютуУправленческогоУчета()

// Возвращает валюту регламентированного учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту РУ. Если валюта РУ не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты
//
Функция ПолучитьВалютуРегламентированногоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции // ПолучитьВалютуРегламентированногоУчета()

// Получает подразделение выбранного пользователя.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - Текущий пользователь
//
// Возвращаемое значение:
//	СправочникСсылка.Подразделения - Подразделение пользователя
//
Функция ПодразделениеПользователя(Пользователь, Подразделение = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Справочники.Пользователи.ПолучитьРеквизитыПользователя(Пользователь).Подразделение;
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции // ПодразделениеПользователя()

Функция ПолучитьНастройкуПодразделения(Подразделение) Экспорт 
	Возврат	Подразделение.ИспользоватьПротоколыСогласованныхЦен;
КонецФункции

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь - текущий пользователь программы
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Настройка, ПустоеЗначение = Неопределено,ЗначениеНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиПользователей[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК РегистрЗначениеПрав
	|
	|ГДЕ
	|	Пользователь = &Пользователь
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиПользователей[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()


// Функция возвращает значение по умолчанию для тсд объекта.
//
// Параметры:
//  ТорговаяПлощадка - торговая площадка ТСД
//  Настройка    - признак, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадка, Настройка, ПустоеЗначение = Неопределено,ЗначениеНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат ЗначениеНастройки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Настройка"   , ПланыВидовХарактеристик.НастройкиТСД[Настройка]);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Значение
	|ИЗ
	|	РегистрСведений.ТК_НастройкиТСД КАК РегистрЗначениеНастройки
	|
	|ГДЕ
	|	ТорговаяПлощадка = &ТорговаяПлощадка
	| И Настройка    = &Настройка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПустоеЗначение = Неопределено Тогда
		ПустоеЗначение = ПланыВидовХарактеристик.НастройкиТСД[Настройка].ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		
		Возврат ПустоеЗначение;
		
	ИначеЕсли Выборка.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Возврат ПустоеЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
		
	Иначе
		Возврат ПустоеЗначение;
		
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()



Функция ПолучитьХозОперацииДокумента(ТипДокумента)Экспорт
	
	МассивОпераций = Новый Массив;
	
	Если ТипДокумента = "АссортиментныйКомитет" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводНовогоТовараВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводТоваровВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыводТоваровИзАссортимента);
		МассивОпераций.Добавить(Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента);
		
	ИначеЕсли ТипДокумента = "ИзменениеАссортимента" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводТоваровВАссортимент);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыводТоваровИзАссортимента);
		МассивОпераций.Добавить(Справочники.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента);
		
	ИначеЕсли ТипДокумента = "ПротоколСогласованияЦен" Тогда 		
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПротоколСогласованияЦен);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПротоколСогласованияЦенАкция);
		
		
	ИначеЕсли ТипДокумента = "ИзменениеЦен" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ИзменениеЦен);
		
	ИначеЕсли ТипДокумента = "ПоступлениеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПоступлениеТоваров);		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПоступлениеТоваровТранзиты);
		
	ИначеЕсли ТипДокумента = "ЧекККМ" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Чек);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЧекНаВозврат);
		
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеремещениеТоваровИзФилиала);
		
	ИначеЕсли ТипДокумента = "СписаниеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.СписаниеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.СписаниеДополнительныхМатериалов);
		
	ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровПоставщикуТранзиты);
		
	ИначеЕсли ТипДокумента = "РеализацияТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
		МассивОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваровСписание);
		МассивОпераций.Добавить(Справочники.ХозОперации.АктОбОказанииУслуг);
		
	ИначеЕсли ТипДокумента = "ВозвратОтПокупателя" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);		
		
	ИначеЕсли ТипДокумента = "Инвентаризация" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ИнвентаризацияТоваров);
		
	ИначеЕсли ТипДокумента = "ЗаказПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуВнутренний);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуТранзиты);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуКонсолидированный);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПоставщикуТСД);
		
	ИначеЕсли ТипДокумента = "ЗаказПокупателя" Тогда 		
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателя);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяФизОбмен);
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяВнутренний);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство);
		
	ИначеЕсли ТипДокумента = "РезервированиеЗаказовПокупателя" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РезервированиеПокупателя);
		
	ИначеЕсли ТипДокумента = "ИзменениеПараметровСистемыЗаказов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПараметровСистемыЗаказов);
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПараметровСистемыЗаказовВыборочная);
		
	ИначеЕсли ТипДокумента = "ПересортицаТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПересортицаТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПеретариваниеТоваров);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПересортицаПоЗакрытиюСмены);
		МассивОпераций.Добавить(Справочники.ХозОперации.ПонижениеСортности);
		
	ИначеЕсли ТипДокумента = "ПриходныйКассовыйОрдер" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ПриходныйКассовыйОрдер);
		
	ИначеЕсли ТипДокумента = "РасходныйКассовыйОрдер" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РасходныйКассовыйОрдер);
		
	ИначеЕсли ТипДокумента = "ПоступлениеБезналичныхДенежныхСредств" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.БанковскаяВыпискаПоступление);
		
	ИначеЕсли ТипДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.БанковскаяВыпискаРасход);
		
	ИначеЕсли ТипДокумента = "Рецептура" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Рецептура);
		
	ИначеЕсли ТипДокумента = "ВыпускПродукции" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукции);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукцииСРеализацией);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВыпускПродукцииСПеремещением);
		
	ИначеЕсли ТипДокумента = "ЗаказПокупателяКазначейство" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаказПокупателяКазначейство);
		
	ИначеЕсли ТипДокумента = "ГрафикЗаказов" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаГрафикаЗаказа);
		
	ИначеЕсли ТипДокумента = "ГрафикИнвентаризаций" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаГрафикИнвентаризаций);
		
	ИначеЕсли ТипДокумента = "ОптимальноеКоличествоНоменклатуры" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаДопустимогоКоличестваНоменклатуры);
		
	ИначеЕсли ТипДокумента = "КорректировкаДолга" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаДолга);
		
	ИначеЕсли ТипДокумента = "ТК_НалоговаяНакладная" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладная);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяАктУслуг);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяОбыкновенняПродажа);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяРозничнаяПродажа);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяРозничнаяПродажаНеОблагаемая);
		МассивОпераций.Добавить(Справочники.ХозОперации.НалоговаяНакладнаяСводнаяКомпенсирующая);
		
	ИначеЕсли ТипДокумента = "НазначениеСкидок" Тогда
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаСкидки);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаСкидки);
		
	ИначеЕсли ТипДокумента = "ТК_Приложение2КНалоговойНакладной" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладной);	
		//МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладнойОблагаемыеОперацииВозврат);
		МассивОпераций.Добавить(Справочники.ХозОперации.Приложение2КНалоговойНакладнойИтоговаяРозницаОблагаемыеОперацииВозврат);				
		
	ИначеЕсли ТипДокумента = "ТК_УстановкаКвотНаОтгрузку" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаКвотНаОтгрузку);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаКвотНаОтгрузку);
		
	ИначеЕсли ТипДокумента = "КонсолидированныеОстаткиОрганизации" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КонсолидированныеПоступленияОрганизации);
		МассивОпераций.Добавить(Справочники.ХозОперации.КонсолидированныеОстаткиОрганизации);
		
	ИначеЕсли ТипДокумента = "ТК_УстановкаМаркетинга" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаМаркетинга);
		
	ИначеЕсли ТипДокумента = "РасчетБонусов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.РасчетБонусов);
		
	ИначеЕсли ТипДокумента = "ТК_Взаимозачет" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Взаимозачет);	
		
	ИначеЕсли ТипДокумента = "КорректировкаЗаказаПокупателя" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаЗаказаПокупателя);
		
	ИначеЕсли ТипДокумента = "СчетНаОплату" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.СчетНаОплату);
		
	ИначеЕсли ТипДокумента = "Антимонопольный" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Антимонопольный);
		
	ИначеЕсли ТипДокумента = "КорректировкаПартийТоваров" Тогда	
		
		МассивОпераций.Добавить(Справочники.ХозОперации.КорректировкаУчетныхДанных);
		
	ИначеЕсли ТипДокумента = "ТК_Переработка" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.Переработка);
		
	ИначеЕсли ТипДокумента = "ТК_ОприходованиеТоваров" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ОприходованиеТоваров);
		
	ИначеЕсли ТипДокумента = "ТК_Планирование" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПланирования);
		
	ИначеЕсли ТипДокумента = "ТК_ПравилаСписанияДопМатериалов" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.УстановкаПравилаСписанияДопМатериалов);
		МассивОпераций.Добавить(Справочники.ХозОперации.ОтменаПравилаСписанияДопМатериалов);
		
	ИначеЕсли ТипДокумента = "НачислениеКоммунальныхУслуг" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.НачислениеКоммунальныхУслуг);
		МассивОпераций.Добавить(Справочники.ХозОперации.ВводНачальныхПоказанийСчетчиков);
		
	ИначеЕсли ТипДокумента = "ТК_ЗаявкаНаВозвратПоставщику" Тогда 
		
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаявкаНаВозвратПоставщику);
		МассивОпераций.Добавить(Справочники.ХозОперации.ЗаявкаНаВозвратПоставщикуТранзиты);
		
	КонецЕсли;
	
	
	Возврат МассивОпераций
	
КонецФункции


// Возвращает массив диапазонов штучных штрихкодов.
//
// Параметры:
//		Нет
// Возвращаемое значение:
//		Массив - диапазоны штрихкодов
//
Функция ДиапазоныШтучныхШтрихкодов() Экспорт
	
	ДиапазоныШтучныхШтрихкодов = Новый Массив;
	
	НастройкиДиапазоновШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.НастройкиДиапазоновШтрихкодов();
	Для Каждого Настройка Из НастройкиДиапазоновШтрихкодов Цикл
		Если Не Настройка.Весовой Тогда
			ДиапазоныШтучныхШтрихкодов.Добавить(Настройка);
		КонецЕсли
	КонецЦикла;
	
	Возврат ДиапазоныШтучныхШтрихкодов;
	
КонецФункции


Функция ПолучитьДопСвойствоПоИмени(ИмяСвойства) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", ИмяСвойства);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбластьТочкиДоставки(ТочкаДоставки) Экспорт 
	
	Возврат ТочкаДоставки.Город.Область;
	
КонецФункции

Функция ЭтоВнутреннийКонтрагент(Контрагент) Экспорт 
	Возврат Справочники.Контрагенты.ЭтоВнутреннийКонтрагент(Контрагент);	
КонецФункции

Функция ПолучитьТаблицуУчетаХарактеристик(СкладКомпании) Экспорт 
	Возврат Справочники.СкладыКомпании.ПолучитьТаблицуУчетаХарактеристик(СкладКомпании);
КонецФункции

Функция ДоступноРазделениеТоваровПоОрганизациям(ТорговаяПлощадка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТорговыеПлощадки.РазделятьТоварыПоОрганизациям КАК РазделятьТоварыПоОрганизациям
	|ИЗ
	|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	|ГДЕ
	|	ТорговыеПлощадки.Ссылка = &ТорговаяПлощадка
	|	И ТорговыеПлощадки.РазделятьТоварыПоОрганизациям = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Область ФункцииПечати

Функция ПолучитьУсловияВидимостиКомандПечати(ИдентификаторКоманды, МенеджерПечати) Экспорт 
	
	МассивУсловий = Новый Массив;
	
	Если ИдентификаторКоманды = "Пустографка" И МенеджерПечати = "Документ.Инвентаризация" Тогда 
		
		МассивСкладовПустографки = Новый Массив;
		МассивСкладовПустографки.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("O460")); //Энгельса, 33 - Торговый зал (Основа Инфо)
		
		УсловиеВидимости = Новый Структура("Реквизит, ВидСравнения, Значение",
		"СкладКомпании",
		ВидСравнения.ВСписке,
		МассивСкладовПустографки);
		
		МассивУсловий.Добавить(УсловиеВидимости);								
		
	КонецЕсли;
	
	Возврат МассивУсловий;
	
КонецФункции

#КонецОбласти