
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция СформироватьОтчеты(Знач СписокОтчетов, Знач ПараметрыОтчетов) Экспорт 
	
	текДата 			= ТекущаяДата();
	НаДату		 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "НаДату", текДата);
	НачалоПериода 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "НачалоПериода", НачалоДня(текДата));
	КонецПериода		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "КонецПериода", КонецДня(текДата));
	
	Выполнено = 0;
	КолвоОтчетов = СписокОтчетов.Количество();
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подготовка данных для отчетов'; uk = 'Підготовка даних для звітів'"));
	
	
	МенеджерВременныхТаблиц = ПолучитьТаблицыВнешнегоИсточника(СписокОтчетов, ПараметрыОтчетов);
	ПараметрыОтчетов.Вставить("Результат", Новый Структура);	
	
	Если СписокОтчетов.Свойство("ОтчетОстаткиЕжедневный") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Остатки'; uk = 'Залишки'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетОстаткиЕжедневный(НаДату, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиЕжедневный") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи'; uk = 'Продажі'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиЕжедневный(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетСправочникПродукция") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Справочник продукция'; uk = 'Довідник продукція'"),
		Выполнено + 1,
		КолвоОтчетов));		
		
		СформироватьОтчетСправочникПродукция(НачалоПериода, КонецПериода, ПараметрыОтчетов);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиРегион") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по регионам'; uk = 'Продажі по регіонах'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиРегион(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиРЦ") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по РЦ'; uk = 'Продажі по РЦ'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиРЦ(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиСегмент") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по сегментам'; uk = 'Продажі по сегментах'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиСегмент(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиПроизводитель") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по производителям'; uk = 'Продажі по виробниках'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиПроизводитель(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиПроизводительРЦ") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по производителям и РЦ'; uk = 'Продажі по виробниках та РЦ'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиПроизводительРЦ(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиРЦТТ") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по РЦ и ТТ'; uk = 'Продажі по РЦ та ТТ'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиРЦТТ(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПродажиПроизводительСКЮ") Тогда 
		
		ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Формируется отчет ""%1""
		|%2 из %3'; uk = 'Формується звіт ""%1""
		|%2 із %3'"),
		НСтр("ru = 'Продажи по производителям и СКЮ'; uk = 'Продажі по виробниках та СКЮ'"),
		Выполнено + 1,
		КолвоОтчетов));
		
		СформироватьОтчетПродажиПроизводительСКЮ(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
		
		Выполнено = Выполнено + 1;
	КонецЕсли;
	
	Возврат ПараметрыОтчетов.Результат;
	
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицыВнешнегоИсточника(СписокОтчетов, ПараметрыОтчетов)
	
	СтруктураВнешТаблиц = ПолучитьСтруктуруВнешнихТаблиц(СписокОтчетов);
	Если СтруктураВнешТаблиц.Количество() = 0 Тогда 
		ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", Ложь);	
		Возврат Неопределено;
	КонецЕсли;
	
	ОшибкиПодключения = "";
	Подключено = ПодключениеКВнешнемуИсточнику(ОшибкиПодключения);
	Если Не Подключено Тогда 
		ОбщегоНазначения.СообщитьПользователю(ОшибкиПодключения);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные из внешнего источника не получены'; uk = 'Дані із зовнішнього джерела не отримані'"));
		ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", Ложь);	
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоПериода 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "НачалоПериода", НачалоДня(ТекущаяДата()));
	КонецПериода		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "КонецПериода", КонецДня(ТекущаяДата()));	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если СтруктураВнешТаблиц.Свойство("dbo_vSTOCKS") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vSTOCKS.PERIOD КАК PERIOD,
		|	dbo_vSTOCKS.RECORDER КАК RECORDER,
		|	dbo_vSTOCKS.WHOUSEID КАК WHOUSEID,
		|	dbo_vSTOCKS.PRODUCTID КАК PRODUCTID,
		|	dbo_vSTOCKS.BATCODE КАК BATCODE,
		|	dbo_vSTOCKS.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vSTOCKS.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vSTOCKS.STOCK_PACKS КАК STOCK_PACKS,
		|	dbo_vSTOCKS.PRODUCTEXTID КАК PRODUCTEXTID
		|ИЗ
		|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vSTOCKS КАК dbo_vSTOCKS
		|ГДЕ
		|	dbo_vSTOCKS.PERIOD = &PERIOD";
		
		Запрос.УстановитьПараметр("PERIOD", КонецДня(КонецПериода) + 1);
		ТЧ = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Таблица", ТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vSTOCKS.PERIOD КАК PERIOD,
		|	dbo_vSTOCKS.RECORDER КАК RECORDER,
		|	dbo_vSTOCKS.WHOUSEID КАК WHOUSEID,
		|	dbo_vSTOCKS.PRODUCTID КАК PRODUCTID,
		|	dbo_vSTOCKS.BATCODE КАК BATCODE,
		|	dbo_vSTOCKS.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vSTOCKS.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vSTOCKS.STOCK_PACKS КАК STOCK_PACKS,
		|	dbo_vSTOCKS.PRODUCTEXTID КАК PRODUCTEXTID
		|ПОМЕСТИТЬ dbo_vSTOCKS
		|ИЗ
		|	&Таблица КАК dbo_vSTOCKS";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если СтруктураВнешТаблиц.Свойство("dbo_vBranchSales") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vBranchSales.Period КАК Period,
		|	dbo_vBranchSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vBranchSales.WHOUSEGUID КАК WHOUSEGUID,
		|	dbo_vBranchSales.PRODUCTID КАК PRODUCTID,
		|	dbo_vBranchSales.PRODUCTGUID КАК PRODUCTGUID,
		|	dbo_vBranchSales.PRODUCTEXTID КАК PRODUCTEXTID,
		|	dbo_vBranchSales.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vBranchSales.BATCODE КАК BATCODE,
		|	dbo_vBranchSales.BARCODES КАК BARCODES,
		|	dbo_vBranchSales.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vBranchSales.SALES_PACKS КАК SALES_PACKS,
		|	dbo_vBranchSales.SALES_QTY КАК SALES_QTY,
		|	dbo_vBranchSales.SALES_SUM КАК SALES_SUM
		|ИЗ
		|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vBranchSales КАК dbo_vBranchSales
		|ГДЕ
		|	dbo_vBranchSales.Period МЕЖДУ &НачПериод И &КонПериод";
		
		Запрос.УстановитьПараметр("НачПериод", НачалоПериода);
		Запрос.УстановитьПараметр("КонПериод", КонецПериода);
		ТЧ = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Таблица", ТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vBranchSales.Period КАК Period,
		|	dbo_vBranchSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vBranchSales.WHOUSEGUID КАК WHOUSEGUID,
		|	dbo_vBranchSales.PRODUCTID КАК PRODUCTID,
		|	dbo_vBranchSales.PRODUCTGUID КАК PRODUCTGUID,
		|	dbo_vBranchSales.PRODUCTEXTID КАК PRODUCTEXTID,
		|	dbo_vBranchSales.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vBranchSales.BATCODE КАК BATCODE,
		|	dbo_vBranchSales.BARCODES КАК BARCODES,
		|	dbo_vBranchSales.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vBranchSales.SALES_PACKS КАК SALES_PACKS,
		|	dbo_vBranchSales.SALES_QTY КАК SALES_QTY,
		|	dbo_vBranchSales.SALES_SUM КАК SALES_SUM
		|ПОМЕСТИТЬ dbo_vBranchSales
		|ИЗ
		|	&Таблица КАК dbo_vBranchSales";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если СтруктураВнешТаблиц.Свойство("dbo_vRetailSales") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Period,
		|	dbo_vRetailSales.OUTLETID КАК OUTLETID,
		|	dbo_vRetailSales.OUTLETGUID КАК OUTLETGUID,
		|	dbo_vRetailSales.OUTLETEXTID КАК OUTLETEXTID,
		|	dbo_vRetailSales.OUTLETADDRESS КАК OUTLETADDRESS,
		|	dbo_vRetailSales.CITYCODE КАК CITYCODE,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.WHOUSEGUID КАК WHOUSEGUID,
		|	dbo_vRetailSales.PRODUCTGUID КАК PRODUCTGUID,
		|	dbo_vRetailSales.PRODUCTEXTID КАК PRODUCTEXTID,
		|	dbo_vRetailSales.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE КАК BATCODE,
		|	dbo_vRetailSales.BARCODES КАК BARCODES,
		|	dbo_vRetailSales.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vRetailSales.SALES_QTY КАК SALES_QTY,
		|	dbo_vRetailSales.SALES_PACKS КАК SALES_PACKS,
		|	dbo_vRetailSales.SALES_SUM КАК SALES_SUM
		|ИЗ
		|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.Period МЕЖДУ &НачПериод И &КонПериод";
		
		Запрос.УстановитьПараметр("НачПериод", НачалоПериода);
		Запрос.УстановитьПараметр("КонПериод", КонецПериода);
		ТЧ = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Таблица", ТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Period,
		|	dbo_vRetailSales.OUTLETID КАК OUTLETID,
		|	dbo_vRetailSales.OUTLETGUID КАК OUTLETGUID,
		|	dbo_vRetailSales.OUTLETEXTID КАК OUTLETEXTID,
		|	dbo_vRetailSales.OUTLETADDRESS КАК OUTLETADDRESS,
		|	dbo_vRetailSales.CITYCODE КАК CITYCODE,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.WHOUSEGUID КАК WHOUSEGUID,
		|	dbo_vRetailSales.PRODUCTGUID КАК PRODUCTGUID,
		|	dbo_vRetailSales.PRODUCTEXTID КАК PRODUCTEXTID,
		|	dbo_vRetailSales.PRODUCTNAME КАК PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE КАК BATCODE,
		|	dbo_vRetailSales.BARCODES КАК BARCODES,
		|	dbo_vRetailSales.MRP_PRICE КАК MRP_PRICE,
		|	dbo_vRetailSales.SALES_QTY КАК SALES_QTY,
		|	dbo_vRetailSales.SALES_PACKS КАК SALES_PACKS,
		|	dbo_vRetailSales.SALES_SUM КАК SALES_SUM
		|ПОМЕСТИТЬ dbo_vRetailSales
		|ИЗ
		|	&Таблица КАК dbo_vRetailSales";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если СтруктураВнешТаблиц.Свойство("dbo_vOUTLETS") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vOUTLETS.OUTLETID КАК OUTLETID,
		|	dbo_vOUTLETS.OUTLETGUID КАК OUTLETGUID,
		|	dbo_vOUTLETS.PARTNERNAME КАК PARTNERNAME,
		|	dbo_vOUTLETS.ZKPO КАК ZKPO,
		|	dbo_vOUTLETS.Area КАК Area,
		|	dbo_vOUTLETS.Territory КАК Territory,
		|	dbo_vOUTLETS.City КАК City,
		|	dbo_vOUTLETS.CityType КАК CityType,
		|	dbo_vOUTLETS.Street КАК Street,
		|	dbo_vOUTLETS.Home КАК Home,
		|	dbo_vOUTLETS.OUTLETEXTID КАК OUTLETEXTID,
		|	dbo_vOUTLETS.CITYCODE КАК CITYCODE
		|ИЗ
		|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vOUTLETS КАК dbo_vOUTLETS";
		
		ТЧ = Запрос.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Таблица", ТЧ);
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vOUTLETS.OUTLETID КАК OUTLETID,
		|	dbo_vOUTLETS.OUTLETGUID КАК OUTLETGUID,
		|	dbo_vOUTLETS.PARTNERNAME КАК PARTNERNAME,
		|	dbo_vOUTLETS.ZKPO КАК ZKPO,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.Area КАК СТРОКА(120)) КАК Area,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.Territory КАК СТРОКА(120)) КАК Territory,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.City КАК СТРОКА(120)) КАК City,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.CityType КАК СТРОКА(100)) КАК CityType,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.Street КАК СТРОКА(120)) КАК Street,
		|	ВЫРАЗИТЬ(dbo_vOUTLETS.Home КАК СТРОКА(20)) КАК Home,
		|	dbo_vOUTLETS.OUTLETEXTID КАК OUTLETEXTID,
		|	dbo_vOUTLETS.CITYCODE КАК CITYCODE
		|ПОМЕСТИТЬ dbo_vOUTLETS
		|ИЗ
		|	&Таблица КАК dbo_vOUTLETS";
		
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции

Функция СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, ПараметрыСКД = Неопределено, Отборы = Неопределено, СоответствиеПолейОтбора = Неопределено, Ошибки = "")
	
	ТаблицаРезультат = Новый ТаблицаЗначений; 		
	
	//Устанавливаем параметры
	Если ПараметрыСКД <> Неопределено Тогда 
		Для Каждого знПараметр Из ПараметрыСКД Цикл 
			нПараметр = Настройки.ПараметрыДанных.Элементы.Найти(знПараметр.Ключ);
			Если нПараметр <> Неопределено Тогда 
				нПараметр.Использование = Истина;
				нПараметр.Значение = знПараметр.Значение;			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Устанавливаем отборы			
	Если Отборы <> Неопределено И СоответствиеПолейОтбора <> Неопределено Тогда 
		Для Каждого Стр Из СоответствиеПолейОтбора Цикл 
			ИмяПоляОтбора = Стр.Ключ;
			ИмяПоляСКД = Стр.Значение;
			
			мСтрОтборы = Неопределено;
			Если Отборы.Свойство(ИмяПоляОтбора, мСтрОтборы) Тогда 
				Для Каждого стрОтбор Из мСтрОтборы Цикл 
					
					Если ЗначениеЗаполнено(ИмяПоляСКД) И ИмяПоляОтбора <> ИмяПоляСКД Тогда 
						мСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрОтбор.ИмяПоля, ".", Истина, Истина);
						ИмяПоля = "";
						Для Ит = 0 По мСлов.ВГраница() Цикл 
							Если Ит = 0 Тогда 
								ИмяПоля = ИмяПоляСКД;
							Иначе
								ИмяПоля = ИмяПоля + "." + мСлов.Получить(Ит);
							КонецЕсли;
						КонецЦикла;
					Иначе
						ИмяПоля = стрОтбор.ИмяПоля;
					КонецЕсли;
					
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, ИмяПоля, стрОтбор.ПравоеЗначение, стрОтбор.ВидСравнения,, Истина);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпновки)); 
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); 
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки; 
	ПараметрыНастройки = Настройки.ПараметрыДанных; 
	
	//Получим макет компоновки    
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпновки, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	//Через процессор компоновки получим результат
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;	
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	Возврат ТаблицаРезультат;
	
КонецФункции


Процедура СформироватьОтчетОстаткиЕжедневный(НаДату, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ЗапасНаДату");
	ТаблицаРезультат.Колонки.Добавить("КодДистрибьютора");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Артикул");
	ТаблицаРезультат.Колонки.Добавить("Номенклатура");
	ТаблицаРезультат.Колонки.Добавить("МРЦ_СКЮ");
	ТаблицаРезультат.Колонки.Добавить("КодСКЮ");
	ТаблицаРезультат.Колонки.Добавить("ОстатокВШт");
	ТаблицаРезультат.Колонки.Добавить("ЕдИзм");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос.WHOUSEID КАК WHOUSEID,
		|	ВложенныйЗапрос.BATCODE КАК BATCODE,
		|	ВложенныйЗапрос.MRP_PRICE КАК MRP_PRICE,
		|	СУММА(ВложенныйЗапрос.SALES_PACKS) КАК SALES_PACKS,
		|	СУММА(ВложенныйЗапрос.STOCK_PACKS) КАК STOCK_PACKS,
		|	ВложенныйЗапрос.PRODUCTNAME КАК PRODUCTNAME
		|ПОМЕСТИТЬ втОбщая
		|ИЗ
		|	(ВЫБРАТЬ
		|		dbo_vBranchSales.WHOUSEID КАК WHOUSEID,
		|		dbo_vBranchSales.PRODUCTID КАК PRODUCTID,
		|		dbo_vBranchSales.BATCODE КАК BATCODE,
		|		dbo_vBranchSales.MRP_PRICE КАК MRP_PRICE,
		|		dbo_vBranchSales.SALES_PACKS КАК SALES_PACKS,
		|		0 КАК STOCK_PACKS,
		|		dbo_vBranchSales.PRODUCTNAME КАК PRODUCTNAME
		|	ИЗ
		|		dbo_vBranchSales КАК dbo_vBranchSales
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		dbo_vSTOCKS.WHOUSEID,
		|		dbo_vSTOCKS.PRODUCTID,
		|		dbo_vSTOCKS.BATCODE,
		|		dbo_vSTOCKS.MRP_PRICE,
		|		0,
		|		dbo_vSTOCKS.STOCK_PACKS,
		|		dbo_vSTOCKS.PRODUCTNAME
		|	ИЗ
		|		dbo_vSTOCKS КАК dbo_vSTOCKS) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.WHOUSEID,
		|	ВложенныйЗапрос.MRP_PRICE,
		|	ВложенныйЗапрос.BATCODE,
		|	ВложенныйЗапрос.PRODUCTNAME
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбщая.WHOUSEID КАК WHOUSEID,
		|	втОбщая.BATCODE КАК BATCodeSKU,
		|	(ВЫРАЗИТЬ(втОбщая.MRP_PRICE КАК ЧИСЛО(15, 2))) / 100 КАК PRICE_MRP,
		|	втОбщая.SALES_PACKS КАК SALES_PACKS,
		|	втОбщая.STOCK_PACKS КАК STOCK_PACKS,
		|	втОбщая.PRODUCTNAME КАК ClientNameSKU
		|ИЗ
		|	втОбщая КАК втОбщая
		|ГДЕ
		|	НЕ втОбщая.BATCODE В (&мИсключенияБАТ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбщая.WHOUSEID КАК WHOUSEID,
		|	втОбщая.BATCODE КАК BATCodeSKU,
		|	втОбщая.BATCODE КАК ClientNameSKU,
		|	СУММА(втОбщая.SALES_PACKS) КАК SALES_PACKS,
		|	СУММА(втОбщая.STOCK_PACKS) КАК STOCK_PACKS
		|ИЗ
		|	втОбщая КАК втОбщая
		|ГДЕ
		|	втОбщая.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	втОбщая.WHOUSEID,
		|	втОбщая.BATCODE,
		|	втОбщая.BATCODE";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[1].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[2].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "BATCodeSKU,ClientNameSKU,PRICE_MRP,STOCK_PACKS,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "BATCodeSKU,ClientNameSKU,STOCK_PACKS,SALES_PACKS");			
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетОстаткиЕжедневный");
		Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("Период", НаДату);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("ЗапасНаДату"		,"DATES");
	СписокСтолбцов.Вставить("КодДистрибьютора"	,"WS_CODE");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("Артикул"			,"BRANDCODE");
	СписокСтолбцов.Вставить("Номенклатура"		,"BRAND");
	СписокСтолбцов.Вставить("МРЦ_СКЮ"			,"MRP");
	СписокСтолбцов.Вставить("КодСКЮ"			,"PMUBRAND");
	СписокСтолбцов.Вставить("ОстатокВШт"		,"STOCK");
	СписокСтолбцов.Вставить("ЕдИзм"				,"UM");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_stock_d_"+Формат(НаДату, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетОстаткиЕжедневный", СтруктураРезультат);
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиЕжедневный(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ДатаОтгрузки");
	ТаблицаРезультат.Колонки.Добавить("КодДистрибьютора");
	ТаблицаРезультат.Колонки.Добавить("КодТочки");
	ТаблицаРезультат.Колонки.Добавить("КатегорияКлиента");
	ТаблицаРезультат.Колонки.Добавить("Покупатель");
	ТаблицаРезультат.Колонки.Добавить("ТочкаДоставки");
	ТаблицаРезультат.Колонки.Добавить("Область");
	ТаблицаРезультат.Колонки.Добавить("Район");
	ТаблицаРезультат.Колонки.Добавить("Город");
	ТаблицаРезультат.Колонки.Добавить("АдресТД");
	ТаблицаРезультат.Колонки.Добавить("Global_ID");
	ТаблицаРезультат.Колонки.Добавить("ЄДРПОУ");
	ТаблицаРезультат.Колонки.Добавить("СпособДоставки");
	ТаблицаРезультат.Колонки.Добавить("КаналСбыта");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Регионал");
	ТаблицаРезультат.Колонки.Добавить("КодКлиента");
	ТаблицаРезультат.Колонки.Добавить("Артикул");
	ТаблицаРезультат.Колонки.Добавить("Номенклатура");
	ТаблицаРезультат.Колонки.Добавить("КодСКЮ");
	ТаблицаРезультат.Колонки.Добавить("ОборотВШт");
	ТаблицаРезультат.Колонки.Добавить("ЕдИзм");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажиЕжедневный");
		Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("ДатаОтгрузки"		,"DATES");
	СписокСтолбцов.Вставить("КодДистрибьютора"	,"WS_CODE");
	СписокСтолбцов.Вставить("КодТочки"			,"PMU_TT_CODE");
	СписокСтолбцов.Вставить("КатегорияКлиента"	,"CLIENTCATEGORY");
	СписокСтолбцов.Вставить("Покупатель"		,"CLIENT_LNAME");
	СписокСтолбцов.Вставить("ТочкаДоставки"		,"CLIENT_PNAME");
	СписокСтолбцов.Вставить("Область"			,"OBLAST");
	СписокСтолбцов.Вставить("Район"				,"DISTRICT");
	СписокСтолбцов.Вставить("Город"				,"SETTLEMENT");
	СписокСтолбцов.Вставить("АдресТД"			,"ADDRESS");
	СписокСтолбцов.Вставить("Global_ID"			,"CLIENT_TT_CODE");
	СписокСтолбцов.Вставить("ЄДРПОУ"			,"EDRPOU");
	СписокСтолбцов.Вставить("СпособДоставки"	,"DELIVERYTYPE");
	СписокСтолбцов.Вставить("КаналСбыта"		,"CHANNELTYPE");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("Регионал"			,"PURCHASEPLACE_VP");
	СписокСтолбцов.Вставить("КодКлиента"		,"AGENT");
	СписокСтолбцов.Вставить("Артикул"			,"BRANDCODE");
	СписокСтолбцов.Вставить("Номенклатура"		,"BRAND");
	СписокСтолбцов.Вставить("КодСКЮ"			,"PMUBRAND");
	СписокСтолбцов.Вставить("ОборотВШт"			,"SALE");
	СписокСтолбцов.Вставить("ЕдИзм"				,"UM");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_IMS_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиЕжедневный", СтруктураРезультат);	
	
КонецПроцедуры


Процедура СформироватьОтчетПродажиРегион(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("РегионКомпании");
	ТаблицаРезультат.Колонки.Добавить("ДопРегионКомпании");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		//Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиРегион").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("РегионКомпании"	,"REGION");
	СписокСтолбцов.Вставить("ДопРегионКомпании"	,"REGION_VP");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalRegion_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиРегион", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиРЦ(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Регионал");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиРЦ").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE_VP");
	//СписокСтолбцов.Вставить("Регионал"			,"PURCHASEPLACE_VP");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalWarehouse1_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиРЦ", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиСегмент(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("Сегмент");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиСегмент").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("Сегмент"			,"PMU_PRICE_SEGMENT");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalPriceSegment1_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиСегмент", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиПроизводитель(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("Производитель");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиПроизводитель").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("Производитель"		,"MANUFACTURER");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalProducer1_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиПроизводитель", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиПроизводительРЦ(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Регионал");
	ТаблицаРезультат.Колонки.Добавить("Производитель");
	ТаблицаРезультат.Колонки.Добавить("ТипТовара");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиПроизводительРЦ").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE_VP");
	//СписокСтолбцов.Вставить("Регионал"			,"PURCHASEPLACE_VP");
	СписокСтолбцов.Вставить("Производитель"		,"MANUFACTURER");
	СписокСтолбцов.Вставить("ТипТовара"			,"PRODUCT_TYPE");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalWarehouseProducer3_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиПроизводительРЦ", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиРЦТТ(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ДатаОтгрузки");
	ТаблицаРезультат.Колонки.Добавить("КодДистрибьютора");
	ТаблицаРезультат.Колонки.Добавить("КодТочки");
	ТаблицаРезультат.Колонки.Добавить("КатегорияКлиента");
	ТаблицаРезультат.Колонки.Добавить("Покупатель");
	ТаблицаРезультат.Колонки.Добавить("ТочкаДоставки");
	ТаблицаРезультат.Колонки.Добавить("Область");
	ТаблицаРезультат.Колонки.Добавить("Район");
	ТаблицаРезультат.Колонки.Добавить("Город");
	ТаблицаРезультат.Колонки.Добавить("АдресТД");
	ТаблицаРезультат.Колонки.Добавить("Global_ID");
	ТаблицаРезультат.Колонки.Добавить("ЄДРПОУ");
	ТаблицаРезультат.Колонки.Добавить("СпособДоставки");
	ТаблицаРезультат.Колонки.Добавить("КаналСбыта");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Регионал");
	ТаблицаРезультат.Колонки.Добавить("КодКлиента");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиРЦТТ").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("ДатаОтгрузки"		,"DATES");
	СписокСтолбцов.Вставить("КодДистрибьютора"	,"WS_CODE");
	СписокСтолбцов.Вставить("КодТочки"			,"PMU_TT_CODE");
	СписокСтолбцов.Вставить("КатегорияКлиента"	,"CLIENTCATEGORY");
	СписокСтолбцов.Вставить("Покупатель"		,"CLIENT_LNAME");
	СписокСтолбцов.Вставить("ТочкаДоставки"		,"CLIENT_PNAME");
	СписокСтолбцов.Вставить("Область"			,"OBLAST");
	СписокСтолбцов.Вставить("Район"				,"DISTRICT");
	СписокСтолбцов.Вставить("Город"				,"SETTLEMENT");
	СписокСтолбцов.Вставить("АдресТД"			,"ADDRESS");
	СписокСтолбцов.Вставить("Global_ID"			,"CLIENT_TT_CODE");
	СписокСтолбцов.Вставить("ЄДРПОУ"			,"EDRPOU");
	СписокСтолбцов.Вставить("СпособДоставки"	,"DELIVERYTYPE");
	СписокСтолбцов.Вставить("КаналСбыта"		,"CHANNELTYPE");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("Регионал"			,"PURCHASEPLACE_VP");
	СписокСтолбцов.Вставить("КодКлиента"		,"AGENT");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_TotalPos3_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиРЦТТ", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетПродажиПроизводительСКЮ(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
	
	Разделитель				= Символы.Таб;
	текДата 				= ТекущаяДата();	
	ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
	ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
	
	Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("НачалоПериода");
	ТаблицаРезультат.Колонки.Добавить("КодРЦ_ФМУ");
	ТаблицаРезультат.Колонки.Добавить("Производитель");
	ТаблицаРезультат.Колонки.Добавить("ТипТовара");
	ТаблицаРезультат.Колонки.Добавить("Артикул");
	ТаблицаРезультат.Колонки.Добавить("Номенклатура");
	ТаблицаРезультат.Колонки.Добавить("КодСКЮ");
	ТаблицаРезультат.Колонки.Добавить("ОборотМилШт");
	
	Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
		
		мИсключенияБАТ = Новый Массив;
		мИсключенияБАТ.Добавить("ITOTALIMPERIAL");
		мИсключенияБАТ.Добавить("JTOTALJTI001");
		мИсключенияБАТ.Добавить("LTOTALLTF001");
		мИсключенияБАТ.Добавить("LTOTALLTFCIGARILLOS001");
		мИсключенияБАТ.Добавить("PTOTALHEETS001");
		мИсключенияБАТ.Добавить("PTOTALPMI001");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("мИсключенияБАТ", мИсключенияБАТ);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.PRODUCTNAME КАК ClientNameSKU,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	НЕ dbo_vRetailSales.BATCODE В (&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.PRODUCTNAME,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.WHOUSEID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	dbo_vRetailSales.Period КАК Date,
		|	dbo_vRetailSales.OUTLETEXTID КАК CodeOutlet,
		|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
		|	dbo_vRetailSales.BATCODE КАК BATCodeSKU,
		|	dbo_vRetailSales.BATCODE КАК ClientNameSKU,
		|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК SALES_PACKS
		|ИЗ
		|	dbo_vRetailSales КАК dbo_vRetailSales
		|ГДЕ
		|	dbo_vRetailSales.BATCODE В(&мИсключенияБАТ)
		|
		|СГРУППИРОВАТЬ ПО
		|	dbo_vRetailSales.Period,
		|	dbo_vRetailSales.BATCODE,
		|	dbo_vRetailSales.OUTLETEXTID,
		|	dbo_vRetailSales.WHOUSEID";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаБАТ = МассивРезультатов[0].Выбрать();
		ВыборкаНеБАТ = МассивРезультатов[1].Выбрать();
		
		Пока ВыборкаБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 1;
			НоваяСтрока.BranchID = "GL000434";			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
		
		Пока ВыборкаНеБАТ.Следующий() Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Порядок = 3;
			НоваяСтрока.BranchID = "GL000434";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНеБАТ, "Date,CodeOutlet,BATCodeSKU,ClientNameSKU,SALES_PACKS");
		КонецЦикла;
	КонецЕсли;
	
	Если ИзВнутреннегоИсточника Тогда 
		
		СхемаКомпновки = ПолучитьМакет("ОтчетПродажи");
		Настройки = СхемаКомпновки.ВариантыНастроек.Найти("ОтчетПродажиПроизводительСКЮ").Настройки;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
		
		ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
		
		Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
		КонецЦикла;
	КонецЕсли;
	
	СписокСтолбцов = Новый Структура();
	СписокСтолбцов.Вставить("НачалоПериода"		,"DATES");
	СписокСтолбцов.Вставить("КодРЦ_ФМУ"			,"PURCHASEPLACE");
	СписокСтолбцов.Вставить("Производитель"		,"MANUFACTURER");
	СписокСтолбцов.Вставить("ТипТовара"			,"PRODUCT_TYPE");
	СписокСтолбцов.Вставить("Артикул"			,"BRANDCODE");
	СписокСтолбцов.Вставить("Номенклатура"		,"BRAND");
	СписокСтолбцов.Вставить("КодСКЮ"			,"PMUBRAND");
	СписокСтолбцов.Вставить("ОборотМилШт"		,"SALE");
	
	ТекстовыйДокумент = ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат);
	
	Если НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда 
		Период = "d";
	ИначеЕсли КонецПериода - НачалоПериода > 604800 Тогда 
		Период = "m";
	Иначе
		Период = "w";
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "71700001_WarehouseSKU6_" + Период + "_" + Формат(НачалоПериода, "ДФ=yyyyMMdd") + ".csv"); 
	
	Параметры.Результат.Вставить("ОтчетПродажиПроизводительСКЮ", СтруктураРезультат);	
	
КонецПроцедуры

Процедура СформироватьОтчетСправочникПродукция(НачалоПериода, КонецПериода, Параметры)
	
	СхемаКомпновки = ПолучитьМакет("ОтчетСправочникПродукция");
	Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
	СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
	
	Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
	
	////Соответствие имен полей отборов на форме и в схеме компоновки
	// - Ключ - Имя поля отбора формы
	// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
	//
	СоответствиеПолейОтбора = Новый Структура("Номенклатура");
	СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании", "ОтборПодразделениеКомпании");
	СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка", "ОтборТорговаяПлощадка");
	СоответствиеПолейОтбора.Вставить("СкладКомпании", "ОтборСкладКомпании");
	СоответствиеПолейОтбора.Вставить("Номенклатура");				
	СоответствиеПолейОтбора.Вставить("Контрагент", "ОтборПокупатель");
	СоответствиеПолейОтбора.Вставить("ТорговаяПлощадкаПолучатель", "ОтборТорговаяПлощадкаПолучатель");
	
	ТаблицаРезультат = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку("Родитель;Артикул;Номенклатура;Код СКЮ ФМУ;Сегментация;Кол-во в пачке");
	
	Для Каждого Стр Из ТаблицаРезультат Цикл 
		ТекстовыйДокумент.ДобавитьСтроку(СокрЛП(Стр.НоменклатураРодитель) + ";" + СокрЛП(Стр.Артикул) + ";" + СокрЛП(Стр.Номенклатура) + ";" + СокрЛП(Стр.КодСКЮ) + ";" + СокрЛП(Стр.Сегментация) + ";" + СокрЛП(Стр.КолвоВПачке));	
	КонецЦикла;                                
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
	СтруктураРезультат.Вставить("ИмяФайла", "Product PMU "+Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + ".csv");
	
	Параметры.Результат.Вставить("СправочникПродукция", СтруктураРезультат);		
	
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедурыИФункции

Функция ПодключениеКВнешнемуИсточнику(ТекстСообщения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = ПредопределенноеЗначение("СостояниеВнешнегоИсточникаДанных.Подключен") Тогда
		Возврат Истина;
	КонецЕсли;	
	
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
	Иначе
		ТекстСообщения = ТекстСообщения + НСтр("ru='Операционная система "+СистемнаяИнформация.ТипПлатформы +" не поддерживается.';uk='Операційна система "+ СистемнаяИнформация.ТипПлатформы +" не підтримується'")+Символы.ПС;
		
		Возврат Ложь
	КонецЕсли;
	
	ПараметрыПодключенияВИ = ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьОбщиеПараметрыСоединения();
	ПараметрыПодключенияВИ.АутентификацияСтандартная = Истина;
	ПараметрыПодключенияВИ.АутентификацияОС = Ложь;
	ПараметрыПодключенияВИ.ИмяПользователя = "1cuser"; 
	ПараметрыПодключенияВИ.Пароль = "fCG2eSvVd5mtqBpe";
	ПараметрыПодключенияВИ.СтрокаСоединения = СтрокаПодключения +";SERVER=NIELSENBIS;DATABASE=Attika_Tranzit;LANGUAGE=русский";
	
	ПараметрыПодключенияВИ.СУБД = "MSSQLServer";
	
	ВнешниеИсточникиДанных.NIELSENBIS.УстановитьОбщиеПараметрыСоединения(ПараметрыПодключенияВИ);
	
	Попытка
		ВнешниеИсточникиДанных.NIELSENBIS.УстановитьСоединение();
	Исключение
		ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
	КонецПопытки;
	
	Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = СостояниеВнешнегоИсточникаДанных.Подключен Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСтруктуруВнешнихТаблиц(СписокОтчетов)
	
	СтруктураВнешТаблиц = Новый Структура;
	
	Если СписокОтчетов.Свойство("ОтчетОптовыеПродажи") Тогда 
		СтруктураВнешТаблиц.Вставить("dbo_vSTOCKS");
		СтруктураВнешТаблиц.Вставить("dbo_vBranchSales");
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетДетальныеПродажи") Тогда 
		СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("СправочникТорговыеТочки") Тогда 
		СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
		СтруктураВнешТаблиц.Вставить("dbo_vOUTLETS");
	КонецЕсли;
	
	
	Возврат СтруктураВнешТаблиц;
	
КонецФункции

Функция ПолучитьСписокТаблицОтборов1(СписокОтчетов)
	
	СтруктураТаблицОтборов = Новый Структура;
	
	Если СписокОтчетов.Свойство("ОтчетОптовыеПродажи") Тогда 
		СтруктураТаблицОтборов.Вставить("ТаблицаСклады");
		СтруктураТаблицОтборов.Вставить("ТаблицаНоменклатура");
		СтруктураТаблицОтборов.Вставить("ТаблицаКонтрагенты");
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетДетальныеПродажи") Тогда 
		
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("ОтчетПриходПродукции") Тогда 
		
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("СправочникТорговыеТочки") Тогда 
		
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("СправочникПродукция") Тогда 
		
	КонецЕсли;
	
	Если СписокОтчетов.Свойство("СправочникСклады") Тогда 
		
	КонецЕсли;
	
	
	Возврат СтруктураТаблицОтборов;
	
КонецФункции

Функция ЗаполнитьТекстовыйДокумент(СписокСтолбцов,ТаблицаРезультат)
	Разделитель			= Символы.Таб;
	ТекстовыйДокумент	= Новый ТекстовыйДокумент;
	СтрокаЗаголовки		= "";
	номКол = 0;
	Для Каждого Колонка Из СписокСтолбцов Цикл
		номКол = 1 + номКол;
		СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Значение + ?(номКол = СписокСтолбцов.Количество(),"",Разделитель);
	КонецЦикла;
	ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
	Для Каждого Стр Из ТаблицаРезультат Цикл 
		номКол = 0;
		ТекСтрока = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			номКол = 1 + номКол;
			ИмяКолонки = Колонка.Ключ;
			Если ИмяКолонки = "ЗапасНаДату" Тогда 
				Значение = Формат(Стр[ИмяКолонки], "ДФ=yyyy-MM-dd");
			ИначеЕсли ИмяКолонки = "МРЦ_СКЮ" Тогда 
				Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=2; ЧРД=.; ЧГ=0");
			ИначеЕсли ИмяКолонки = "ДатаОтгрузки" Тогда 
				Значение = Формат(Стр[ИмяКолонки], "ДФ=yyyy-MM-dd");
			ИначеЕсли ИмяКолонки = "Global_ID" Тогда 				
				Значение = Формат(Стр[ИмяКолонки], "ЧГ=0");
			ИначеЕсли ИмяКолонки = "ОборотВШт" Тогда 				
				Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=0; ЧН=0; ЧГ=0");
			ИначеЕсли ИмяКолонки = "НачалоПериода" Тогда 
				Значение = Формат(Стр[ИмяКолонки], "ДФ=yyyy-MM-dd");
			ИначеЕсли ИмяКолонки = "ОборотМилШт" Тогда 				
				Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=6; ЧРД=.; ЧН=0; ЧГ=0");
			ИначеЕсли ИмяКолонки = "ОстатокВШт" Тогда 				
				Значение = Формат(Стр[ИмяКолонки], "ЧН=0; ЧГ=0");
			Иначе
				Значение = СокрЛП(Стр[ИмяКолонки]);
			КонецЕсли;
			Если ЗначениеЗаполнено(Значение) Тогда
				ТекСтрока = ТекСтрока + Значение + ?(номКол = СписокСтолбцов.Количество(),"",Разделитель);
			Иначе
				ТекСтрока = ТекСтрока + ?(номКол = СписокСтолбцов.Количество(),"",Разделитель);
			КонецЕсли;
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
	КонецЦикла;
	Возврат ТекстовыйДокумент;
КонецФункции

#КонецОбласти




#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
