#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаполнитьПорядокВОбъекте(ЭлементОбъект) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭлементОбъект.Ссылка);
	Запрос.УстановитьПараметр("Владелец", ЭлементОбъект.Владелец);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(ТК_МестаХранения.Порядок), 0) КАК Порядок
	               |ИЗ
	               |	Справочник.ТК_МестаХранения КАК ТК_МестаХранения
	               |ГДЕ
	               |	НЕ ТК_МестаХранения.ПометкаУдаления
	               |	И ТК_МестаХранения.Владелец = &Владелец
	               |	И ТК_МестаХранения.Ссылка <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Порядок = 1;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Порядок = Выборка.Порядок + 1;
	КонецЕсли;

	ЭлементОбъект.Порядок = Порядок;
	
КонецФункции


#КонецОбласти


#КонецЕсли
