#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Документ.ПоступлениеТоваров";
	//КомандаПечати.Идентификатор = "АктНедопоставки";
	//КомандаПечати.Представление = НСтр("ru = 'Акт недопоставки';uk='Акт недопостачання'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 		
	//МассивУсловий = Новый Массив;
	//МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ИспользоватьЦеныИзПротоколов", Истина, ВидСравнения.Равно));	
	////МассивУсловий.Добавить(Новый Структура("Реквизит, Значение, ВидСравнения", "ЕстьРасхождения", Истина, ВидСравнения.Равно));	
	//КомандаПечати.УсловияВидимости = МассивУсловий;
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом


Функция ПолучитьАктуальнуюРецептуру(Продукция, Подразделение = Неопределено, ТолькоОсновнаяРецептура = Ложь) Экспорт 
	
	ОтборПоПодразделению = ЗначениеЗаполнено(Подразделение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	Рецептура.Ссылка КАК Рецептура,
	               |	ВЫБОР
	               |		КОГДА Рецептура.ОсновнаяРецептура
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок,
	               |	Рецептура.Продукция КАК Продукция,
	               |	Рецептура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Рецептура.Количество КАК Количество,
	               |	Рецептура.Коэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.Рецептура КАК Рецептура
	               |ГДЕ
	               |	Рецептура.Проведен
	               |	И Рецептура.Актуальная
	               |	И Рецептура.Продукция = &Продукция
	               |	"+ ?(ТолькоОсновнаяРецептура, "И Рецептура.ОсновнаяРецептура", "") +"									   
	               |	"+ ?(ОтборПоПодразделению, "И Рецептура.ПодразделениеКомпании = &ПодразделениеКомпании", "") +"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	Рецептура.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Продукция", Продукция);
	
	Если ОтборПоПодразделению Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Рецептура 			= Выборка.Рецептура;
		ЕдиницаИзмерения 	= Выборка.ЕдиницаИзмерения;
		Количество			= Выборка.Количество;
		Коэффициент			= Выборка.Коэффициент;
	Иначе
		Рецептура 			= ПредопределенноеЗначение("Документ.Рецептура.ПустаяСсылка");
		ЕдиницаИзмерения 	= ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		Количество			= 0;
		Коэффициент			= 0;		
	КонецЕсли;
	
	Структура = Новый Структура("Рецептура, ЕдиницаИзмерения, Количество, Коэффициент",
									Рецептура,
									ЕдиницаИзмерения,
									Количество,
									Коэффициент);
									
	Возврат Структура;									
	
КонецФункции

#КонецОбласти	


#Область Печать


#КонецОбласти	




#Иначе
	
#КонецЕсли