
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ВернутьМассивСтатьиВозврата(ИспользоватьНаТДС=Истина)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОтвет = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьНаТДС",ИспользоватьНаТДС);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиВозврата.Ссылка КАК Ссылка,
		|	СтатьиВозврата.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СтатьиВозврата КАК СтатьиВозврата
		|ГДЕ
		|	СтатьиВозврата.ПометкаУдаления = ЛОЖЬ
		|	И СтатьиВозврата.ИспользоватьНаТДС = &ИспользоватьНаТДС";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтуктураСклада = Новый Структура("Статья,СтатьяUUID", ВыборкаДетальныеЗаписи.Наименование,Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
		МассивОтвет.Добавить(СтуктураСклада);

	КонецЦикла;
	
	Возврат МассивОтвет;
	
КонецФункции



#КонецОбласти







#КонецЕсли
