
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Период", ТекущаяДата());
	ПараметрыФормы.Отбор.Вставить("Номенклатура", ПараметрКоманды);
	
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "ОстаткиПартийСМрцЦена");
	
	ОткрытьФорму(
		"Отчет.ОстаткиПартийТоваров.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
