
&НаСервереБезКонтекста
Процедура ВыполнитьЗакрытиеНаСервере(НаДату, ДнейОтсрочки)
	Ошибки= "";
	Обработки.ЗакрытиеЗаказовПоставщику.СформироватьКорректировкуЗаказа(НаДату, ДнейОтсрочки, Ошибки);
	//РеквизитФормыВЗначение("Объект").СформироватьКорректировкуЗаказа(НаДату, ДнейОтсрочки, Ошибки);
	Если СтрДлина(Ошибки)<>0 Тогда
		Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытие(Команда)
	Если ЗначениеЗаполнено(НаДату) ТОгда
	ВыполнитьЗакрытиеНаСервере(НаДату, ДнейОтсрочки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДнейОтсрочки = 1;
	НаДату = ТекущаяДата();
КонецПроцедуры
