


Функция ПериодТБД(ТорговаяПлощадка)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ТБД_ПериодыСрезПоследних.Период КАК ПериодТБД
	|ИЗ                
	|	РегистрСведений.ТК_ТБД_Периоды.СрезПоследних(, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ТК_ТБД_ПериодыСрезПоследних";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Дата('00010101');
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПериодТБД;
	

КонецФункции
