
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Приоритет = ВернутьЗначение();
	Статус = ВернутьЗначениеСтатуса();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьЗначение()
	Возврат Перечисления.ПриоритетыСборки.Средний;	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьЗначениеСтатуса()
	Возврат Перечисления.СтатусыСборкиРезервов.Собран;	
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	СтруктураРезультат = Новый Структура;
	Если ПометкаСтатус Тогда
		СтруктураРезультат.Вставить("Статус", Статус);
	Иначе 
		СтруктураРезультат.Вставить("Статус", Неопределено);
	КонецЕсли;
	
	Если ПометкаПриоритет Тогда
		 СтруктураРезультат.Вставить("Приоритет", Приоритет);
	Иначе
		 СтруктураРезультат.Вставить("Приоритет", Неопределено);
	КонецЕсли;
	
	Закрыть(СтруктураРезультат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКарточку(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ЗаполнитьКатрочку", Истина);
	СтруктураРезультат.Вставить("Статус", 	 Статус);
	СтруктураРезультат.Вставить("Приоритет", Приоритет);
	СтруктураРезультат.Вставить("Сотрудник", Сотрудник);
	СтруктураРезультат.Вставить("СотрудникКонтроля", СотрудникКонтроля);
	СтруктураРезультат.Вставить("Упаковщик", Упаковщик);
	СтруктураРезультат.Вставить("НачалоСборки", НачалоСборки);
	СтруктураРезультат.Вставить("КонецСборки", КонецСборки);
	СтруктураРезультат.Вставить("НачалоКонтроля", НачалоКонтроля);
	СтруктураРезультат.Вставить("КонецКонтроля", КонецКонтроля);
	
	Закрыть(СтруктураРезультат);


КонецПроцедуры



