
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКураторамиНаСервере()
	Проверка = Истина;
	МассивПользователей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Пользователь,
	|	ИСТИНА КАК ЭтоКуратор
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Пользователь = Новый Структура();
		Пользователь.Вставить("Наименование",(Выборка.Пользователь.Наименование));
		Пользователь.Вставить("КодПоДРФО",СокрЛП(Выборка.Пользователь.Код));
		Пользователь.Вставить("ЭтоКуратор",Неопределено);
		МассивПользователей.Добавить(Пользователь);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	Рез = WS.RegisterVisitors(СтрокаJSON, Проверка);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Рез);
	ОтветРезультат = ПрочитатьJSON(Чтение);
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого стрСотрудник Из ОтветРезультат Цикл
		Работает = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(стрСотрудник, "ДоступРазрешен", Ложь);
		Если Работает Тогда
			стр = Объект.Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(стр,стрСотрудник,"Должность");
			стр.Работает = Работает;
			стр.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду(стрСотрудник.КодПоДРФО);
		КонецЕсли;
	КонецЦикла;
	_ВидимостьГруппаИнфо = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКураторами(Команда)
	ЗаполнитьКураторамиНаСервере();
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры

&НаСервере
Процедура ПроверитьРаботающихНаСервере()
	Проверка = Истина;
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого стрСотрудник Из Объект.Сотрудники Цикл
		Сотрудник = Новый Структура();
		Сотрудник.Вставить("Наименование",(стрСотрудник.Сотрудник.Наименование));
		//Сотрудник.Вставить("ДоступРазрешен",стрПосетитель.ДоступРазрешен);
		Сотрудник.Вставить("КодПоДРФО",СокрЛП(стрСотрудник.Сотрудник.Код));
		//Сотрудник.Вставить("ТелефонТК",СокрЛП(стрПосетитель.Телефон));
		Сотрудник.Вставить("ЭтоКуратор",Неопределено);
		МассивСотрудников.Добавить(Сотрудник);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивСотрудников); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Рез = WS.RegisterVisitors(СтрокаJSON, Проверка);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Рез);
	ОтветРезультат = ПрочитатьJSON(Чтение);
	
	Объект.Сотрудники.Очистить();
	Если Проверка Тогда
		ОтветМассивПосетителей = ОтветРезультат;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветРезультат.Результат.Description);
		ОтветМассивПосетителей = ОтветРезультат.МассивПользователей;
	КонецЕсли;
	
	Для Каждого стрСотрудник Из ОтветМассивПосетителей Цикл
		стр = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(стр,стрСотрудник);
		стр.Работает = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(стрСотрудник, "ДоступРазрешен",Ложь);
		стр.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду(стрСотрудник.КодПоДРФО);
	КонецЦикла;
	_ВидимостьГруппаИнфо = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаботающих(Команда)
	ПроверитьРаботающихНаСервере();
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры


