
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, Тихий.
// Все права защищены.)) 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область СлужебныйПрограммныйИнтерфейс


Процедура ЗаполнитьТаблицуДокументами (мДокументы, Заявки, Кратко) Экспорт
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить("0",3);
	СоответствиеКартинки.Вставить("1",5);
	СоответствиеКартинки.Вставить("2",7);
	СоответствиеКартинки.Вставить("3",8);
	СоответствиеКартинки.Вставить("4",1);
	СоответствиеКартинки.Вставить("5",0);
	
	Для каждого Документ Из мДокументы Цикл
		нСтрока = Заявки.Добавить();
		Поля = Документ.fields;
		нСтрока.ID = ГуидПоля(Документ.name);
		нСтрока.СрокВыполнения = МестноеВремя(Дата(1970,1,1) + Поля.datePlaneCompletion.integerValue/1000);
		нСтрока.Статус =  Перечисления.СтатусыСервисДеск[Число(Поля.status.integerValue)];
		нСтрока.Услуга = Справочники.УслугиСервисДеск.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.categoryRef.referenceValue)));
		Если Кратко Тогда Продолжить; КонецЕсли;
		нСтрока.Номер = Поля.number.integerValue;
		//нСтрока.Дата = ДатаИзСтроки(Поля.dateCreation.timestampValue);
		нСтрока.Дата = МестноеВремя(Дата(1970,1,1) + Поля.dateCreation.integerValue/1000);
		стрДатаВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля, "dateCompletion", Новый Структура("integerValue",0));
		нСтрока.ДатаВыполнения =  МестноеВремя(Дата(1970,1,1) + стрДатаВыполнения.integerValue/1000);
		нСтрока.ИндексСтатуса = СоответствиеКартинки.Получить(Поля.status.integerValue);
		нСтрока.Срочная = Поля.urgent.booleanValue;
		нСтрока.Просроченная = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля, "isExpiredCompletion", Новый Структура("booleanValue",Ложь)).booleanValue;
		нСтрока.АвтоЗакрытая = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля, "closedAfter24hours",  Новый Структура("booleanValue",Ложь)).booleanValue;
		нСтрока.Точка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.marketRef.referenceValue)));
		
		Инициатор = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.authorRef.referenceValue)));
		Если ПустаяСтрока(Инициатор.КоД) Тогда
			Инициатор = Справочники.Посетители.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.authorRef.referenceValue)));
		КонецЕсли;
		Если нСтрока.Статус = Перечисления.СтатусыСервисДеск.not_assigned Тогда
			Исполнитель = Неопределено;
		Иначе
			Исполнитель = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.responsibleUserRef.referenceValue)));
			Если ПустаяСтрока(Исполнитель.Код) Тогда
				Исполнитель = Справочники.Посетители.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидПоля(Поля.responsibleUserRef.referenceValue)));
			КонецЕсли;
		КонецЕсли;
		
		нСтрока.Инициатор = Инициатор;
		нСтрока.Исполнитель = Исполнитель;
		
		КомментарийВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля, "commentCompletion", Новый Структура("stringValue"));
		мФото = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля.urlsCreation.arrayValue, "values", Новый Массив);
		ФотоВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Поля, "urlsCompletion", Новый Структура("arrayValue"));
		стрФотоВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФотоВыполнения, "arrayValue", Новый Структура("arrayValue"));
		мФотоВыполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(стрФотоВыполнения, "values", Новый Массив);
		
		нСтрока.Описание = Поля.commentCreation.stringValue;
		нСтрока.КомментарийВыполнения = КомментарийВыполнения.stringValue;
		нСтрока.Фото = СтрокаИзМассиваСтрок(мФото);
		нСтрока.ФотоВыполнения = СтрокаИзМассиваСтрок(мФотоВыполнения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьКоллекцию (мДокументы, ТЗ) Экспорт
	
	//ТЗ = Новый ТаблицаЗначений;
	СоответствиеКолонок = Новый Соответствие;
	
	Для Каждого Документ Из мДокументы Цикл
		Поля = Документ.fields;
		Для Каждого Поле из Поля Цикл 
			нКолонка = ТЗ.Колонки.Найти(Поле.Ключ);
			Если нКолонка = Неопределено Тогда
				ТЗ.Колонки.Добавить(Поле.Ключ);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	Для Каждого Документ Из мДокументы Цикл
		нСтрока = ТЗ.Добавить();
		Поля = Документ.fields;
		Для Каждого Поле из Поля Цикл
			Для Каждого ПолеПоля из Поле.Значение Цикл
				нСтрока[Поле.Ключ] = ПолеПоля.Значение;	
			КонецЦикла; 
		КонецЦикла; 
		//ТЗ.количество()
		
	КонецЦикла;
	
КонецПроцедуры

Функция Токен(Параметры, СоединениеFire) Экспорт
	
	Результат = РегистрыСведений.ТокеныАутентификацииFirebase.Получить(Новый Структура("ProjectID, UserID", Параметры.Project_ID, Параметры.UserUID));
	Если Результат.ДействителенДо > ТекущаяДатаСеанса() Тогда
		idToken = Результат.Токен;
		Возврат idToken;
	Иначе
		СтрокаКоманды = "c:\install\firebaseshit\FirebaseShit.exe " + Параметры.UserUID;
		ФайлТокен = ПолучитьИмяВременногоФайла("txt");
		
		Попытка
			ЗапуститьПриложение("cmd /c "+СтрокаКоманды+" >"+ФайлТокен,,Истина);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		ТекстДок = Новый ТекстовыйДокумент;
		Файл = Новый Файл(ФайлТокен);
		Если Файл.Существует() Тогда
			ТекстДок.Прочитать(ФайлТокен,КодировкаТекста.UTF8);
			ТекстЛога = ТекстДок.ПолучитьТекст();
			УдалитьФайлы(ФайлТокен);
			CustomToken = Прав(ТекстЛога,СтрДлина(ТекстЛога)-20);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(CustomToken) Тогда
			Resource = "v1/accounts:signInWithCustomToken";
			АдресРесурса = Resource + "/?key=" + Параметры.Web_API_Key;
			ТелоЗапроса = ПодготовитьТелоЗапроса(Параметры, СоединениеFire, "SecureToken", CustomToken);
			СоединениеIdentity = СоединениеFire(Параметры.Service_IdentityToolkitAPI);
			
			ОтветHTTP = СоздатьДокумент_POST(Параметры, СоединениеIdentity, АдресРесурса, ТелоЗапроса, Истина);
			Если ОтветHTTP.КодСостояния = 200 Тогда
				ОтветДанные = Из_JSON(ОтветHTTP.ПолучитьТелоКакСтроку());
				idToken = ОтветДанные.idToken;
				Записать_idToken(Параметры, ОтветДанные.expiresIn, ОтветДанные.idToken);
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не получен CustomToken.");
		КонецЕсли;
		
		СоединениеIdentity = Неопределено;
		
		Возврат idToken;
	КонецЕсли;
КонецФункции

Функция ПолучитьДокументы_GET(Параметры, СоединениеFire, АдресРесурса, nextPageToken = "") Экспорт
	
	idToken = Токен(Параметры, СоединениеFire);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	ЗапросHTTP.Заголовки.Вставить("Authorization","Bearer "+idToken);
	
	ОтветHTTP = СоединениеFire.Получить(ЗапросHTTP);
	
	//Если ОтветHTTP.КодСостояния <> 200 Тогда
	//	Ошибка400("GET", АдресРесурса, ОтветHTTP);
	//КонецЕсли;
	
	Возврат ОтветHTTP;
	
КонецФункции

Функция СоздатьДокумент_POST(Параметры, СоединениеFire, АдресРесурса, ТелоЗапроса, get_token = Ложь) Экспорт
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	Если Не get_token ТоГда
		idToken = Токен(Параметры, СоединениеFire);
		ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + idToken);
	КонецЕсли;
	
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	ОтветHTTP = СоединениеFire.ОтправитьДляОбработки(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Ошибка400("POST", АдресРесурса, ОтветHTTP);
	КонецЕсли;
	
	Возврат ОтветHTTP;
	
КонецФункции

Функция ИзменитьДокументы_PATCH(Параметры, СоединениеFire, АдресРесурса, ТелоЗапроса, ТекстОшибок = "") Экспорт
	
	idToken = Токен(Параметры, СоединениеFire);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + idToken);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	ОтветHTTP = СоединениеFire.Изменить(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Ошибка400("PATCH", АдресРесурса, ОтветHTTP, ТекстОшибок);
	КонецЕсли;
	
	Возврат ОтветHTTP.КодСостояния = 200;
	
КонецФункции

Функция УдалитьДокумент_DELETE(Параметры, СоединениеFire, АдресРесурса) Экспорт
	
	idToken = Токен(Параметры, СоединениеFire);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
	ЗапросHTTP.Заголовки.Вставить("Authorization","Bearer "+idToken);
	
	ОтветHTTP = СоединениеFire.Удалить(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Ошибка400("DELETE", АдресРесурса, ОтветHTTP);
	КонецЕсли;
	
	Возврат ОтветHTTP;
	
КонецФункции


#КонецОбласти




#Область СлужебныеПроцедурыИФункции


Функция ГуидПоля(name)
	мCтрок = СтрРазделить(name,"/");
	ГуидПоля = мCтрок[мCтрок.Количество()-1];
	Возврат ГуидПоля;
КонецФункции





Функция СтрокаИзМассиваСтрок(МассивСтрок)
	СтрокаССылками = "";
	Для Каждого СсылкаНаФото Из МассивСтрок Цикл
		СтрокаССылками = СтрокаССылками + СсылкаНаФото.stringValue + ";";
	КонецЦикла;
	Возврат СтрокаССылками;
КонецФункции

Функция СоединениеFire(Сервис) Экспорт
	Возврат Новый HTTPСоединение(Сервис,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
КонецФункции

Функция В_JSON(Структура, Сериализатор = Ложь) Экспорт
	ЗаписьJSON	= Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	Если Сериализатор Тогда
		СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Структура, НазначениеТипаXML.Явное);
	Иначе
		ЗаписатьJSON(ЗаписьJSON, Структура);
	КонецЕсли;
	Возврат ЗаписьJSON.Закрыть(); 
КонецФункции

Функция Из_JSON(JSONСтрока, Сериализатор = Ложь) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Если Сериализатор Тогда
		Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	Иначе
		Результат = ПрочитатьJSON(ЧтениеJSON);
	КонецЕсли;
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции

Процедура Ошибка400(Метод, Адрес, ОтветHTTP, ТекстОшибок = "") Экспорт
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Ошибка %1 %2 %3%4%5'; uk = 'Помилка %1%1 %2 %3%4%5'"),
	Метод,
	ОтветHTTP.КодСостояния,
	Адрес,
	Символы.ПС,
	ОтветHTTP.ПолучитьТелоКакСтроку());
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	ТекстОшибок = ТекстОшибок + ?(ПустаяСтрока(ТекстОшибок),"",Символы.ПС) + ТекстОшибки;
КонецПроцедуры

//Функция ГеоТочка(стрГеометка)
//	НачальныйНомер = СтрНайти(стрГеометка,">");
//	ЧислоСимволов = СтрДлина(стрГеометка) - НачальныйНомер - 4;
//	ЗначениеГеометка = Сред(стрГеометка,1 + НачальныйНомер,ЧислоСимволов);
//	ЗначениеГеометка = СтрЗаменить(ЗначениеГеометка," ",",");
//	мГеометка = СтрРазделить(ЗначениеГеометка,",",Ложь);
//	Если мГеометка.Количество() = 2 Тогда
//		Широта = СокрЛП(мГеометка[0]);
//		Долгота = СокрЛП(мГеометка[1]);
//	Иначе
//		Широта = 90;
//		Долгота = 0;
//	КонецЕсли;
//	
//	Возврат Новый Структура("latitude, longitude", Широта, Долгота);
//	
//КонецФункции

//Функция ЭтоКуратор(Сотрудник)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
//	|ГДЕ
//	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
//	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Значение = &Сотрудник";
//	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат Не РезультатЗапроса.Пустой();
//	
//КонецФункции

//Функция ТелефонСотрудника(Сотрудник)
//	
//	МассивПосетителей = Новый Массив;
//	
//	Посетитель = Новый Структура();
//	Посетитель.Вставить("Наименование",(Сотрудник.Наименование));
//	//Посетитель.Вставить("ДоступРазрешен",стрПосетитель.ДоступРазрешен);
//	Посетитель.Вставить("КодПоДРФО",СокрЛП(Сотрудник.Код));
//	//Посетитель.Вставить("ТелефонТК",СокрЛП(стрПосетитель.Телефон));
//	Посетитель.Вставить("ЭтоКуратор",Ложь);
//	МассивПосетителей.Добавить(Посетитель);
//	
//	СтрокаJSON = В_JSON(МассивПосетителей);
//	
//	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
//	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
//	WS.Пользователь="ObmenSSL";
//	WS.Пароль ="bynthghbpf";
//	
//	Рез = WS.RegisterVisitors(СтрокаJSON, Истина);
//	
//	ОтветРезультат = Из_JSON(Рез);
//	Телефон = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтветРезультат[0], "Телефон", "");
//	
//	Возврат Телефон; 
//	
//КонецФункции

//Функция ЕстьДоступКЗаявкам(Сотрудник)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	УслугиСервисДескРоли.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.РолиСервисДеск.Сотрудники КАК РолиСервисДескСотрудники
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиСервисДеск.Роли КАК УслугиСервисДескРоли
//	|		ПО РолиСервисДескСотрудники.Ссылка = УслугиСервисДескРоли.Роль
//	|ГДЕ
//	|	РолиСервисДескСотрудники.Сотрудник = &Сотрудник
//	|	И УслугиСервисДескРоли.Ссылка ЕСТЬ НЕ NULL ";
//	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат Не РезультатЗапроса.Пустой();
//	
//КонецФункции
//
//Функция ЭтоСоздатель(Сотрудник)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	РолиСервисДескСотрудники.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.РолиСервисДеск.Сотрудники КАК РолиСервисДескСотрудники
//	|ГДЕ
//	|	РолиСервисДескСотрудники.Сотрудник = &Сотрудник
//	|	И РолиСервисДескСотрудники.Ссылка.Создание";
//	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат Не РезультатЗапроса.Пустой();
//	
//КонецФункции
//
//Функция ЭтоИсполнитель(Сотрудник)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	УслугиСервисДескРоли.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.РолиСервисДеск.Сотрудники КАК РолиСервисДескСотрудники
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиСервисДеск.Роли КАК УслугиСервисДескРоли
//	|		ПО РолиСервисДескСотрудники.Ссылка = УслугиСервисДескРоли.Роль
//	|ГДЕ
//	|	РолиСервисДескСотрудники.Сотрудник = &Сотрудник
//	|	И РолиСервисДескСотрудники.Ссылка.Выполнение
//	|	И УслугиСервисДескРоли.Ссылка ЕСТЬ НЕ NULL ";
//	
//	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат Не РезультатЗапроса.Пустой();
//	
//КонецФункции
//
//Функция ТочкиСотрудника1(Сотрудник)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ТерриторииИсполнителейТочки.Точка КАК Точка
//	|ИЗ
//	|	Справочник.ТерриторииИсполнителей.Точки КАК ТерриторииИсполнителейТочки
//	|ГДЕ
//	|	ТерриторииИсполнителейТочки.Ссылка.Владелец = &Владелец";
//	
//	Запрос.УстановитьПараметр("Владелец", Сотрудник);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат РезультатЗапроса.Выгрузить();
//	
//КонецФункции
//Функция ТочкиСотрудника(тчТочки)
//	
//	текДата = ТекущаяДата();
//	мТочки = тчТочки.ВыгрузитьКолонку("Точка");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка
//	|ИЗ
//	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
//	|ГДЕ
//	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ(&Ссылка)
//	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
//	|	И НЕ(ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия
//	|				И &текДата > ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия)";
//	
//	Запрос.УстановитьПараметр("Ссылка", мТочки);
//	Запрос.УстановитьПараметр("текДата", текДата);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Возврат РезультатЗапроса.Выгрузить();
//	
//КонецФункции

Процедура Записать_idToken(Параметры, expiresIn, idToken)
	МенеджерЗаписи = РегистрыСведений.ТокеныАутентификацииFirebase.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ProjectID = Параметры.Project_ID;
	МенеджерЗаписи.UserID = Параметры.UserUID;
	МенеджерЗаписи.Токен = idToken;
	МенеджерЗаписи.ДействителенДо = ТекущаяДатаСеанса() + Число(expiresIn);
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция МассивСсылок(Параметры,СоединениеFire,ВидДанных,Данные)
	
	МассивСсылок = Новый Массив;
	
	Если ВидДанных = "Курсы" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_reference = СсылкаНаДокумент(Параметры,СоединениеFire,"edu_courses",стрЭлемент.Курс);
			МассивСсылок.Добавить(Структура_reference);
		КонецЦикла;
		
	ИначеЕсли ВидДанных = "Лекции" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_reference = СсылкаНаДокумент(Параметры,СоединениеFire,"edu_lectures",стрЭлемент.Лекция);
			МассивСсылок.Добавить(Структура_reference);
		КонецЦикла;
		
	ИначеЕсли ВидДанных = "Пункты" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_Пункт = Новый Структура("mapValue",Новый Структура("fields", 
			Новый Структура("name, url",  Новый Структура("stringValue",стрЭлемент.Текст),  Новый Структура("stringValue",стрЭлемент.Картинка))));
			МассивСсылок.Добавить(Структура_Пункт);
		КонецЦикла;
		
	ИначеЕсли ВидДанных = "Вопросы" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_reference = СсылкаНаДокумент(Параметры,СоединениеFire,"edu_questions",стрЭлемент.Вопрос);
			МассивСсылок.Добавить(Структура_reference);
		КонецЦикла;
		
	ИначеЕсли ВидДанных = "Ответы" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_Ответ = Новый Структура("mapValue",Новый Структура("fields",
			Новый Структура("answer, correctValue", Новый Структура("stringValue",стрЭлемент.Ответ), Новый Структура("booleanValue",стрЭлемент.Правильный))));
			МассивСсылок.Добавить(Структура_Ответ);
		КонецЦикла;
		
	ИначеЕсли ВидДанных = "Подразделения" Тогда
		Для Каждого стрЭлемент Из Данные Цикл
			Структура_reference = СсылкаНаДокумент(Параметры,СоединениеFire,"subdivision",?(ТипЗнч(Данные) = Тип("Массив"), стрЭлемент, стрЭлемент.Подразделение));
			МассивСсылок.Добавить(Структура_reference);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый Структура("values",МассивСсылок);
	
КонецФункции

Функция СсылкаНаДокумент(Параметры, СоединениеFire, Коллекция, Ссылка, ДопПризнак = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда	
		documentId = Строка(Ссылка.УникальныйИдентификатор());
		АдресРесурса = ПодготовитьАдресРесурса("GET", Параметры.Project_ID, Коллекция, documentId);
		
		ОтветHTTP = ПолучитьДокументы_GET(Параметры, СоединениеFire, АдресРесурса);
		Если ОтветHTTP.КодСостояния = 200 И ДопПризнак = Истина И Коллекция = "sotrudniki" Тогда
			ОтветДанные = Из_JSON(ОтветHTTP.ПолучитьТелоКакСтроку());
			ЕстьВБазе = ОтветДанные.fields.type.integerValue = "1";
		Иначе
			ЕстьВБазе = ОтветHTTP.КодСостояния = 200;
		КонецЕсли;
		Если Не ЕстьВБазе Тогда
			ТелоЗапроса = ПодготовитьТелоЗапроса(Параметры, СоединениеFire, Коллекция, Ссылка, ДопПризнак);
			Если ДопПризнак = Истина И Коллекция = "sotrudniki" Тогда
				АдресРесурса = ПодготовитьАдресРесурса("PATCH", Параметры.Project_ID, Коллекция, documentId);
				ЕстьВБазе = ИзменитьДокументы_PATCH(Параметры, СоединениеFire, АдресРесурса, ТелоЗапроса);
			Иначе
				АдресРесурса = ПодготовитьАдресРесурса("POST", Параметры.Project_ID, Коллекция, documentId);
				ОтветHTTP = СоздатьДокумент_POST(Параметры, СоединениеFire, АдресРесурса, ТелоЗапроса);
				ЕстьВБазе = ОтветHTTP.КодСостояния = 200;
			КонецЕсли;
		КонецЕсли;
		Если ЕстьВБазе Тогда
			СтруктураОтвета = Из_JSON(ОтветHTTP.ПолучитьТелоКакСтроку());
			Возврат Новый Структура("referenceValue", СтруктураОтвета.name);
		КонецЕсли;
	Иначе
		Resource = "projects/"+"%1"+"/databases/(default)/documents/";
		Возврат Новый Структура("referenceValue", СтрШаблон(Resource,Параметры.Project_ID) + Коллекция + "/" + "00000000-0000-0000-0000-000000000000");
	КонецЕсли;
КонецФункции

Функция ПодготовитьАдресРесурса(МетодHTTP, Project_ID, Коллекция, documentId = "", nextPageToken = "", runQuery = "") Экспорт
	
	Resource = "/v1/projects/"+"%1"+"/databases/(default)/documents/";
	АдресРесурса = СтрШаблон(Resource, Project_ID) + "%1%2%3%4%5";
	
	Если МетодHTTP = "GET" Тогда		
		АдресРесурса = СтрШаблон(АдресРесурса,
		Коллекция,
		?(ПустаяСтрока(documentId), "", "/" + documentId),
		runQuery,
		//"?key=" + ПараметрыДляЗапроса.Web_API_Key,
		"?pageSize=100",
		?(ПустаяСтрока(nextPageToken), "", "&pageToken=" + nextPageToken));
		
	ИначеЕсли МетодHTTP = "POST" Тогда 
		АдресРесурса = СтрШаблон(АдресРесурса,
		Коллекция,
		?(ПустаяСтрока(documentId), "", "/?documentId=" + documentId),
		runQuery,
		//"?key=AIzaSyAPTAInQrcO7SJbxR4jjxJ9B2r2agrjwaA",// + ПараметрыДляЗапроса.Web_API_Key,
		"",
		"");
		
	ИначеЕсли МетодHTTP = "PATCH" Тогда 
		АдресРесурса = СтрШаблон(АдресРесурса,
		Коллекция,
		?(ПустаяСтрока(documentId), "", "/" + documentId),
		runQuery,
		//"?key=" + ПараметрыДляЗапроса.Web_API_Key,
		"",
		"");
		
	ИначеЕсли МетодHTTP = "DELETE" Тогда 
		АдресРесурса = СтрШаблон(АдресРесурса,
		Коллекция,
		?(ПустаяСтрока(documentId), "", "/" + documentId),
		runQuery,
		//"?key=" + ПараметрыДляЗапроса.Web_API_Key,
		"",
		"");
		
	КонецЕсли;
	
	Возврат АдресРесурса;
	
КонецФункции

Функция ПодготовитьТелоЗапроса(Параметры, СоединениеFire, Коллекция, Ссылка, ДопПризнак = Неопределено) Экспорт
	
	Если Коллекция = "SecureToken" Тогда
		Поля = Новый Структура("token, returnSecureToken",Ссылка,Истина);
		
	ИначеЕсли Коллекция = "edu_disciplines" Тогда
		Реквизиты = Новый Структура("Код, Наименование, Курсы, Подразделения, Порядок, ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(Реквизиты, Ссылка);
		
		Поля = Новый Структура("fields", Новый Структура("code, name, courses, subdivisions, priority, remote",
		Новый Структура("stringValue",	Реквизиты.Код),
		Новый Структура("stringValue",	Реквизиты.Наименование),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Курсы", Реквизиты.Курсы)),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Подразделения", Реквизиты.Подразделения)),
		Новый Структура("integerValue",	Реквизиты.Порядок),
		Новый Структура("booleanValue",	Реквизиты.ПометкаУдаления),
		));
		
	ИначеЕсли Коллекция = "edu_courses" Тогда
		Реквизиты = Новый Структура("Код, Наименование, Лекции, Вопросы, Порядок, ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(Реквизиты, Ссылка);
		
		Поля = Новый Структура("fields", Новый Структура("code, name, lectures, test_questions, priority, remote",
		Новый Структура("stringValue",	Реквизиты.Код),
		Новый Структура("stringValue",	Реквизиты.Наименование),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Лекции", Реквизиты.Лекции)),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Вопросы", Реквизиты.Вопросы)),
		Новый Структура("integerValue",	Реквизиты.Порядок),
		Новый Структура("booleanValue",	Реквизиты.ПометкаУдаления),
		));
		
	ИначеЕсли Коллекция = "edu_lectures" Тогда
		Реквизиты = Новый Структура("Код, Наименование, Контент, Содержание, Вопросы, Порядок, ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(Реквизиты, Ссылка);
		
		Поля = Новый Структура("fields", Новый Структура("code, name, items, test_questions, url, priority, remote",
		Новый Структура("stringValue",	Реквизиты.Код),
		Новый Структура("stringValue",	Реквизиты.Наименование),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Пункты", Реквизиты.Содержание)),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Вопросы", Реквизиты.Вопросы)),
		Новый Структура("stringValue",	Реквизиты.Контент),
		Новый Структура("integerValue",	Реквизиты.Порядок),
		Новый Структура("booleanValue",	Реквизиты.ПометкаУдаления),
		));
		
	ИначеЕсли Коллекция = "edu_questions" Тогда
		Реквизиты = Новый Структура("Код, Наименование, Контент, Ответы, ПометкаУдаления");
		ЗаполнитьЗначенияСвойств(Реквизиты, Ссылка);
		
		Поля = Новый Структура("fields", Новый Структура("code, question, url, variants, remote",
		Новый Структура("stringValue",	Реквизиты.Код),
		Новый Структура("stringValue",	Реквизиты.Наименование),
		Новый Структура("stringValue",	Реквизиты.Контент),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Ответы", Реквизиты.Ответы)),
		Новый Структура("booleanValue",	Реквизиты.ПометкаУдаления),
		));
		
	ИначеЕсли Коллекция = "edu_sotrudniki" Тогда
		Поля = Новый Структура("fields", Новый Структура("inn, name, kurator, prodavets, telephone, type, working, subdivisions, url",
		Новый Структура("stringValue",	Ссылка.Код),
		Новый Структура("stringValue",	Ссылка.ФИО),
		Новый Структура("booleanValue",	Ссылка.Куратор),
		Новый Структура("booleanValue",	Ссылка.Продавец),
		Новый Структура("stringValue",	Ссылка.Телефон),
		Новый Структура("integerValue",	Ссылка.Тип),
		Новый Структура("booleanValue",	Ссылка.Работает),
		Новый Структура("arrayValue",	МассивСсылок(Параметры,СоединениеFire,"Подразделения",Ссылка.Подразделения)),
		Новый Структура("stringValue",	Ссылка.Фото),
		));
		
	КонецЕсли;
	
	Возврат В_JSON(Поля);
	
КонецФункции



#КонецОбласти


#КонецЕсли