// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
&НаКлиенте
Перем СтароеЗначение, СтароеЗначениеДней, ЗакрываемБезВопросов, СписокДнейНедели;

// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ
&НаКлиенте
Процедура ОК(Команда)
	// сохраняем дни недели
	Стр="";
	СтрДни="";
	Для Сч=1 По 7 Цикл
		Стр = Стр + ?(ЭтаФорма["флДни"+Формат(Сч,"ЧГ=0")],Формат(Число(Сч),"ЧГ=0"),"");
		КолДней = Формат(ЭтаФорма["днДни"+Сч],"ЧЦ=2; ЧН=; ЧВН=");
		Если  КолДней<>"" И КолДней<>"00" Тогда
			СтрДни = СтрДни + ?(ЭтаФорма["флДни"+Формат(Сч,"ЧГ=0")],СписокДнейНедели[Сч-1].Значение+КолДней,"");
		КонецЕсли;
	КонецЦикла;
	ДниНедели = СокрЛП(Стр);
	ДеньПоставкиПоДнямНедели = СокрЛП(СтрДни); 
	ЗакрываемБезВопросов=Истина;
	Закрыть(?(Переодичность,ДеньПоставкиПоДнямНедели,ДниНедели));
КонецПроцедуры

// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// декодируем дни недели
	СтароеЗначение=ДниНедели;
	СтароеЗначениеДней = ДеньПоставкиПоДнямНедели;
	Для Сч=1 По 7 Цикл
		Если Переодичность Тогда
			Элементы["флДни"+Формат(Сч,"ЧГ=0")].ТолькоПросмотр = Истина;
		Иначе
			Элементы["днДни"+Формат(Сч,"ЧГ=0")].Видимость = Ложь;
		КонецЕсли;
		Если Найти(ДниНедели,Строка(Сч))>0 тогда
			ЭтаФорма["флДни"+Формат(Сч,"ЧГ=0")]=Истина;
			ЭтаФорма["днДни"+Сч] = Сред(ДеньПоставкиПоДнямНедели,Найти(ДеньПоставкиПоДнямНедели,СписокДнейНедели[Сч-1])+2,2);
		Иначе
			Элементы["днДни"+Формат(Сч,"ЧГ=0")].Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	ЗакрываемБезВопросов=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗакрываемБезВопросов Тогда
		ДниНедели = СтароеЗначение;
		ДеньПоставкиПоДнямНедели = СтароеЗначениеДней;
		ОК(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Переодичность = Параметры.Переодичность;
	ЭтотОбъект.ДниНедели = Параметры.ДниНедели;	
	ЭтотОбъект.ДеньПоставкиПоДнямНедели = Параметры.ДеньПоставкиПоДнямНедели;	
КонецПроцедуры

// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

СписокДнейНедели=Новый СписокЗначений;
СписокДнейНедели.Добавить("Пн");
СписокДнейНедели.Добавить("Вт");
СписокДнейНедели.Добавить("Ср");
СписокДнейНедели.Добавить("Чт");
СписокДнейНедели.Добавить("Пт");
СписокДнейНедели.Добавить("Сб");
СписокДнейНедели.Добавить("Вс");
