
&НаКлиенте
Процедура ОтправитьНаFTP(Команда)
	
	массивСсылок = Элементы.Список.ВыделенныеСтроки;
	ТК_ОбменEDI.ОтправкаFTPСообщенийПровайдеровЕDI(массивСсылок);	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьФайлОбмена(Команда)
	массивСсылок = Элементы.Список.ВыделенныеСтроки;
	ПерезаполнитьФайлОбменаНаСервере(массивСсылок);
	Элементы.Список.Обновить();
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ПерезаполнитьФайлОбменаНаСервере(МассивДокументов)
	Для Каждого ДокументСсылка Из МассивДокументов Цикл 
		ТК_ОбменEDI.СформироватьНовыйФайлОбмена(ДокументСсылка);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Функция СохранитьФайлОбменаНаСервере()
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	МассивФайлов = Новый Массив;
	Для Каждого СообщениеEDI Из  МассивСтрок Цикл 
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеФайла.Имя = СообщениеEDI.ИмяФайлаСообщения;
		ОписаниеФайла.Хранение = ПоместитьВоВременноеХранилище(СообщениеEDI.ФайлСообщения.Получить(),ЭтаФорма.УникальныйИдентификатор);
		
		МассивФайлов.Добавить(ОписаниеФайла);
	КонецЦикла;	
	
	
	Возврат МассивФайлов;
	
КонецФункции


&НаКлиенте
Процедура СохранитьФайлОбмена(Команда)
		
		
	
	ВыбратьКаталог();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталог()

	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКаталогаДокументовЗавершение", ЭтаФорма);
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
	ДиалогОткрытия.Заголовок = НСтр("ru = 'Выберите каталог сохранения .XML файлов'; uk = 'Оберіть каталог збереження .XML файлів'");
	ДиалогОткрытия.Каталог = "";
	
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаДокументовЗавершение(ИмяКаталога, ДопПараметры) Экспорт 
	
	Если ТипЗнч(ИмяКаталога) = Тип("Массив") И ИмяКаталога.Количество() > 0 Тогда 
		КаталогВыгрузки = ИмяКаталога[0];
		МассивФайлов = СохранитьФайлОбменаНаСервере();
		Если МассивФайлов = Неопределено   Тогда
			Возврат;	
		КонецЕсли;
		
		ОбработкаЗавершения = Новый ОписаниеОповещения("ОписаниеЗавершенияПолученияФайлов", ЭтотОбъект);
		НачатьПолучениеФайловССервера(ОбработкаЗавершения,МассивФайлов,КаталогВыгрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗавершенияПолученияФайлов(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
КонецПроцедуры
