#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда







Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры




Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата = ТекущаяДата();
	РегламентированныйУчет = Истина;
	Автор =  Пользователи.ТекущийПользователь();
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	СкладКомпании = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнойСклад",,СкладКомпании);	

КонецПроцедуры









Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ТК_ОчередьЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Заявка = Ссылка;
	НоваяЗапись.Статус = ?(ЭтотОбъект.ПометкаУдаления,1,0);
	НаборЗаписей.Записать();

	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Если ЗначениеЗаполнено(ДокументОтгрузки) Тогда 
		ДокументОтгрузки = Неопределено;
	КонецЕсли;
	Выполнено = Ложь;

КонецПроцедуры


#КонецЕсли
