



Процедура ЗарегистрироватьИзменения(Объект,Отказ,Замещение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУзлов = ТК_ОбменCentrПовтИсп.МассивУзловДляРегистрации();
	
	ТК_ОбменCentr.ЗарегистрироватьИзмененияВУзлах(Объект, МассивУзлов,Замещение);
	
КонецПроцедуры





Процедура ТК_Обмен_CenterПриЗаписиОбъектаДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	
	КонецЕсли;
	
	
	//Загрузка из базы ТК 
	Если Источник.ДополнительныеСвойства.Свойство("ОбменТК") Тогда
		Возврат;
	КонецЕсли;
	
	
	
	ЗарегистрироватьИзменения(Источник,Отказ);
КонецПроцедуры





#Область ОбменКонсолидация

Процедура ОбменДаннымиКонсолидацияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменConsolidation", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры


Процедура ТК_Обмен_КонсолидацияРегистрацияИзменений(Источник,Отказ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУзлов = ТК_ОбменCentrПовтИсп.МассивУзловКонсолицадия();
	
	ТК_ОбменCentr.ЗарегистрироватьИзмененияВУзлах(Источник, МассивУзлов,Ложь);
	
КонецПроцедуры



#КонецОбласти

