#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция НайтиУзелОбмена(КодУзла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменОбучение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменОбучение КАК ОбменОбучение
		|ГДЕ
		|	ОбменОбучение.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Возврат ПланыОбмена.ОбменОбучение.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции



Функция НастройкиУзла(КодУзла)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура("Service_CloudFirestoreAPI, Service_IdentityToolkitAPI, Project_ID, Web_API_Key, UserUID");
	УзелОбмена = НайтиУзелОбмена(КодУзла);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменОбучение.Service_CloudFirestoreAPI КАК Service_CloudFirestoreAPI,
		|	ОбменОбучение.Service_IdentityToolkitAPI КАК Service_IdentityToolkitAPI,
		|	ОбменОбучение.Project_ID КАК Project_ID,
		|	ОбменОбучение.Web_API_Key КАК Web_API_Key,
		|	ОбменОбучение.UserUID КАК UserUID
		|ИЗ
		|	ПланОбмена.ОбменОбучение КАК ОбменОбучение
		|ГДЕ
		|	ОбменОбучение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроек,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

	
	
	
#КонецЕсли