
&НаСервере
Процедура РазбитьНаСервере() Экспорт
	
	ФормаОбъекта = Документ;
	ТаблицаТовары = Документ.Товары;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Если НижнийПорог >= ТаблицаТовары.Итог("СуммаВсего") Тогда
		ОбщегоНазначения.СообщитьПользователю("Сумма Налоговой и так меньше порога, разбивать незачем !!!");
		Возврат
	ИначеЕсли ТаблицаТовары.Количество()=1 И (ТаблицаТовары[0].Количество=1 Или НижнийПорог<ТаблицаТовары[0].Цена) Тогда
		ОбщегоНазначения.СообщитьПользователю("Разбивка автоматически невозможна ! Попробуйте разбить вручную !!!");
		Возврат
	КонецЕсли;
	
	КопияТовары = ТаблицаТовары.Выгрузить();
	СуммаДокумента = 0;
	СуммаНакладных = 0;
	Попытка
		НачатьТранзакцию();
		
		//КонсолидированныеОстаткиОрганизации(Документ);
		ОбъектНН = ФормаОбъекта.Скопировать();
		ОбъектНН.Дата = ФормаОбъекта.Дата;
		ОбъектНН.УстановитьНовыйНомер();
		ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
		ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
		ОбъектНН.Товары.Очистить();
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС"); 
		СтруктураДействий.Вставить("ПересчитатьСуммуВсегоНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");

		Для Каждого стрТТНН Из КопияТовары Цикл
			ПорогСуммы = ГСЧ.СлучайноеЧисло(НижнийПорог, ВерхнийПорог); 
			
			НоваяСтрока = ОбъектНН.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
			НоваяСтрока.НомерСтрокиНН = НоваяСтрока.НомерСтроки; 
			СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаВсего;
			
			Если ПорогСуммы<=СуммаДокумента Тогда
				Пока ПорогСуммы<=СуммаДокумента Цикл
					НужноеКоличество = Цел((ПорогСуммы-СуммаДокумента+НоваяСтрока.СуммаВсего)/(НоваяСтрока.СуммаВсего/НоваяСтрока.Количество));
					ОстатокКоличества = НоваяСтрока.Количество - НужноеКоличество;
					Цена = НоваяСтрока.Цена;
					Если НужноеКоличество > 0 Тогда 
						НоваяСтрока.Количество = НужноеКоличество;	
						ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					Иначе
						Если ОбъектНН.Товары.Количество()=1 И ПорогСуммы<Цена Тогда
							ОбщегоНазначения.СообщитьПользователю("Т.к цена позиции больше порога, строку не дробим !!!");
							ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
							//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
							ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
							СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
							Если КопияТовары.Индекс(стрТТНН) <> КопияТовары.Количество()-1 Тогда
								СуммаДокумента = 0;
								ОбъектНН = ФормаОбъекта.Скопировать();
								ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
								ОбъектНН.УстановитьНовыйНомер();
								ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
								ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
								ОбъектНН.Товары.Очистить();
							КонецЕсли;
							Прервать;
						Иначе
							ОбъектНН.Товары.Удалить(НоваяСтрока);
							
							ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
							ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
							СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;

							ОбъектНН = ФормаОбъекта.Скопировать();
							ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
							ОбъектНН.УстановитьНовыйНомер();
							ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
							ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
							ОбъектНН.Товары.Очистить();
							
							НоваяСтрока = ОбъектНН.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
							СуммаДокумента = НоваяСтрока.СуммаВсего;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
					ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
					СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
					
					ОбъектНН = ФормаОбъекта.Скопировать();
					//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
					//ПорогСуммы = ГСЧ.СлучайноеЧисло(НижнийПорог, ВерхнийПорог);
					ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
					ОбъектНН.УстановитьНовыйНомер();
					ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
					ОбъектНН.ДокументОснование = ФормаОбъекта.ДокументОснование;
					ОбъектНН.Товары.Очистить();
					НоваяСтрока = ОбъектНН.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
					НоваяСтрока.Количество = ОстатокКоличества;	
					НоваяСтрока.Цена = Цена;	
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					СуммаДокумента = НоваяСтрока.СуммаВсего;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ОбъектНН.Ссылка) Тогда
			ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
			//КонсолидированныеОстаткиОрганизации(ОбъектНН.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
			СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
		КонецЕсли;
		
		НН = ФормаОбъекта.Ссылка.ПолучитьОбъект();
		НН.ПометкаУдаления = Истина;
		НН.Записать(РежимЗаписиДокумента.ОтменаПроведения);

		ЗафиксироватьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Обработка завершена !  "+Формат(НН.СуммаДокумента,"ЧДЦ=2")+" и "+Формат(СуммаНакладных,"ЧДЦ=2"));
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	
КонецПроцедуры

Процедура КонсолидированныеОстаткиОрганизации(СсылкаНН)
	
	Если СсылкаНН.ХозОперация = Справочники.ХозОперации.НалоговаяНакладнаяОбыкновенняПродажа ИЛИ СсылкаНН.ХозОперация = Справочники.ХозОперации.НалоговаяНакладная Тогда
		Если СсылкаНН.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Внутренний Тогда
			ОргДляОтгр = Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ",СсылкаНН.Контрагент.КодПоЕДРПОУ);
			Если ОргДляОтгр =   Справочники.Организации.ПустаяСсылка() Тогда Возврат; КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
			|	ДоговорыКонтрагентов.Организация КАК Организация
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Организация = &Организация
			|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
			|	И ДоговорыКонтрагентов.ВидДоговора.ВидДоговора = &ВидДоговора";
			
			Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Покупка);
			Запрос.УстановитьПараметр("Контрагент", СсылкаНН.Организация.Контрагент);
			Запрос.УстановитьПараметр("Организация", ОргДляОтгр);
			
			РезВыборка = Запрос.Выполнить().Выбрать();
			Если РезВыборка.Следующий() Тогда
				ПодрДляОтгр = РезВыборка.Подразделение;
				ОргДоговора = РезВыборка.Организация;
			Иначе
				Возврат;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонсолидированныеОстаткиОрганизации.Ссылка,
			|	КонсолидированныеОстаткиОрганизации.ПометкаУдаления
			|ИЗ
			|	Документ.КонсолидированныеОстаткиОрганизации КАК КонсолидированныеОстаткиОрганизации
			|ГДЕ
			|	КонсолидированныеОстаткиОрганизации.ИДДокументаОтгрузки = &ИДДокументаОтгрузки";
			
			Запрос.УстановитьПараметр("ИДДокументаОтгрузки", Строка(СсылкаНН.УникальныйИдентификатор()));
			
			
			тзПодчиненные = Запрос.Выполнить().Выгрузить();
			
			Если СсылкаНН.ПометкаУдаления Тогда
				Для Каждого стзПодчиненные Из тзПодчиненные Цикл 
					Если НЕ стзПодчиненные.ПометкаУдаления тогда
						КООу = стзПодчиненные.Ссылка.ПолучитьОбъект();
						КООу.УстановитьПометкуУдаления(Истина);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если тзПодчиненные.Количество()=0 Тогда
					КОО = Документы.КонсолидированныеОстаткиОрганизации.СоздатьДокумент();
				Иначе 
					КОО = тзПодчиненные[0].Ссылка.ПолучитьОбъект();
					КОО.Товары.Очистить();
					Если КОО.ПометкаУдаления тогда
						КОО.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					
					Для Сч=2 По тзПодчиненные.Количество() Цикл 
						стзПодчиненные = тзПодчиненные[Сч-1];
						Если НЕ стзПодчиненные.ПометкаУдаления тогда
							КООу = стзПодчиненные.Ссылка.ПолучитьОбъект();
							КООу.УстановитьПометкуУдаления(Истина);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				КОО.УстановитьВремя(РежимАвтоВремя.Первым);
				КОО.ХозОперация = Справочники.ХозОперации.КонсолидированныеПоступленияОрганизации;
				КОО.Дата = СсылкаНН.Дата;
				КОО.УстановитьНовыйНомер();
				КОО.ПодразделениеКомпании =ПодрДляОтгр; 
				КОО.Организация = ОргДоговора;
				КОО.Контрагент = СсылкаНН.Организация.Контрагент;
				КОО.Автор = СсылкаНН.Автор;
				КОО.ДоговорВзаиморасчетов = СсылкаНН.ДоговорВзаиморасчетов; 
				КОО.Заполнить(Неопределено);
				КОО.ИДДокументаОтгрузки = СсылкаНН.УникальныйИдентификатор();
				
				Для Каждого СтрТ ИЗ СсылкаНН.Товары Цикл 
					Строка = КОО.Товары.Добавить();
					Строка.ВидДвижения					= Перечисления.ВидыДвижений.Приход;
					Строка.Номенклатура					= СтрТ.Номенклатура;
					Строка.ХарактеристикаНоменклатуры	= СтрТ.ХарактеристикаНоменклатуры;
					Строка.Коэффициент					= СтрТ.Коэффициент;
					Строка.КоличествоБазовое			= СтрТ.Количество*СтрТ.Коэффициент;
					Строка.ЕдиницаИзмерения				= СтрТ.ЕдиницаИзмерения;
					Строка.СтавкаНДС					= СтрТ.СтавкаНДС;
					Строка.Количество					= Стрт.Количество;
					Строка.Сумма						= СтрТ.СуммаВсего;
					Строка.СуммаНДС						= Стрт.СуммаНДС;
					Строка.СуммаВсего					= СтрТ.СуммаВсего;
					Строка.Цена							= СтрТ.Цена;
					Строка.СуммаБезНалогов				= СтрТ.СуммаВсего - СтрТ.СуммаНДС;
					Строка.ЦенаБезНалогов				= (СтрТ.СуммаВсего - СтрТ.СуммаНДС)/(СтрТ.Количество*СтрТ.Коэффициент);
				КонецЦикла;
				
				Попытка
					КОО.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
				Исключение
					Сообщить("Ошибка проведения документа "+КОО+" пробуем записать");
					Попытка
						КОО.Записать();
					Исключение
					КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


