

// Возвращает числовое значение ставки НДС по значению 
//
// Параметры:
// 		СтавкаНДС - Справочник.СтавкиНДС - значение  СтавкиНДС
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом
//
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ОсновнаяСтавкаНДС") 
		ИЛИ  СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС20А5") Тогда
		
		Возврат 0.2;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС7") Тогда
		
		Возврат 0.07;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции // ПолучитьСтавкуНДСЧислом()


// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если НЕ СуммаВключаетНДС Тогда
		СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ОШИБОК ОКРУГЛЕНИЯ НДС

// Процедура корректирует построчные ошибки округления НДС так, 
// чтобы итоговый НДС по ставке совпадал с расчитанным НДС по базе
//
// Параметры:
//  ТабличнаяЧасть       - табличная часть, для которой следует пересчитать НДС
//  ДокументОбъект       - объект редактируемого документа.
//
Процедура ПересчитатьНДСсУчетомПогрешностиОкругления(ТабличнаяЧасть, ДокументСсылка, СуммаВключаетНДС, ПогрешностиОкругления, ПредставлениеТабличнойЧасти = "", ПредставлениеВалюты = "", ИмяРеквизитаСумма    = "Сумма", ИмяРеквизитаСуммаНДС = "СуммаНДС", ИмяРеквизитаНДССтавка = "НДССтавка", ДополнениеКТексту ="") Экспорт
    Перем СуммаНДСДоОкругления;    // для проверки наличия изменения в сумме НДС по документу
    Перем СуммаНДСПослеОкругления; // для проверки наличия изменения в сумме НДС по документу
	

	// Запомним сумма и сумму НДС до округления
	СуммаНДСДоОкругления = ТабличнаяЧасть.Итог(ИмяРеквизитаСуммаНДС);
	СуммаДоОкругления    = ТабличнаяЧасть.Итог(ИмяРеквизитаСумма) + СуммаНДСДоОкругления;
	
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		СтрокаТаблицы[ИмяРеквизитаСуммаНДС] = РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы[ИмяРеквизитаСумма],
	                                                   Истина,
	                                                   СуммаВключаетНДС,
	                                                   СтрокаТаблицы[ИмяРеквизитаНДССтавка],
	                                                   ПогрешностиОкругления);
	КонецЦикла;
	
	// Рассчитаем сумму НДС после устранения ошибок округления
	СуммаНДСПослеОкругления = ТабличнаяЧасть.Итог(ИмяРеквизитаСуммаНДС);
	СуммаПослеОкругления    = ТабличнаяЧасть.Итог(ИмяРеквизитаСумма) + СуммаНДСПослеОкругления;

	// Сравним суммы до и после округления
	Если СуммаНДСПослеОкругления <> СуммаНДСДоОкругления Тогда
		// Если суммы отличаются, сообщим об этом пользователю
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='После исправления погрешностей округления сумма НДС%1 табличной части %2 изменилась (было %3, стало %4)';uk='Після виправлення погрішностей округлення сума ПДВ%1 табличної частини %2 змінилася (було %3, стало %4)'"), ДополнениеКТексту, ПредставлениеТабличнойЧасти, ОбщегоНазначенияТККлиентСервер.ФорматСумм(СуммаНДСДоОкругления, ПредставлениеВалюты), ОбщегоНазначенияТККлиентСервер.ФорматСумм(СуммаНДСПослеОкругления,ПредставлениеВалюты));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
		// изменилась общая сумма документа - сообщим об этом пользователю 
		Если (Не СуммаВключаетНДС) Тогда
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='После исправления погрешностей округления общая сумма%1 табличной части %2 изменилась (было %3, стало %4)';uk='Після виправлення погрішностей округлення загальна сума%1 табличної частини %2 змінилася (було %3, стало %4)'"), ДополнениеКТексту, ПредставлениеТабличнойЧасти, ОбщегоНазначенияТККлиентСервер.ФорматСумм(СуммаДоОкругления,ПредставлениеВалюты), ОбщегоНазначенияТККлиентСервер.ФорматСумм(СуммаПослеОкругления,ПредставлениеВалюты));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры // ПересчитатьНДСсУчетомПогрешностиОкругления


// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДСсУчетомПогрешности(Сумма, УчитыватьНДС, СуммаВключаетНДС, ПеречислениеСтавкаНДС,
	               СоответствиеПогрешностей = Неопределено) Экспорт

	СтавкаНДС = ПеречислениеСтавкаНДС; //ПолучитьСтавкуНДСЧислом(ПеречислениеСтавкаНДС)*100;
				   
	Если УчитыватьНДС Тогда 
		Если СуммаВключаетНДС Тогда
			СуммаНДС = ОбщегоНазначенияТККлиентСервер.ОкруглитьСУчетомПогрешности(Сумма * СтавкаНДС / (100 + СтавкаНДС), 2, , СоответствиеПогрешностей, ПеречислениеСтавкаНДС);
		Иначе
			СуммаНДС = ОбщегоНазначенияТККлиентСервер.ОкруглитьСУчетомПогрешности(Сумма * СтавкаНДС / 100              , 2, , СоответствиеПогрешностей, ПеречислениеСтавкаНДС);
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДССУчетомПогрешности()
