
#Область Подписки


Процедура ОбменМобильноеПриложениеСправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТипЗначения  = ТипЗнч(Источник);
	//
	Если ТипЗначения = Тип("СправочникОбъект.Номенклатура") Тогда
		Если НЕ НужнаРегистрацияНоменклатуры(Источник.Ссылка) Тогда
			Возврат;
		КонецЕсли;
	МассивУзлов = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();	
	ИначеЕсли ТипЗначения = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
		МассивУзлов = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена(,Источник.Подразделение);
	ИначеЕсли ТипЗначения = Тип("СправочникОбъект.Контрагенты") Тогда
		МассивУзлов = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбменаПоКонтрагенту(Источник.Ссылка);

	ИначеЕсли ТипЗначения = Тип("СправочникОбъект.ТочкиДоставки") Тогда
		МассивУзлов = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбменаПоКонтрагенту(Источник.Владелец);
	ИначеЕсли ТипЗначения = Тип("СправочникОбъект.МаршрутыАгентов") Тогда
		МассивУзлов = Новый Массив;
		МассивУзлов.Добавить(Источник.Владелец);
	Иначе
		Возврат;
	КонецЕсли;
	
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ОбменМобильноеПриложениеРегистрСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если Источник.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		МассивУзлов = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбменаПоТипуЦен(Источник.ДополнительныеСвойства.ДляПроведения.Ссылка.ТипЦен);
		Если МассивУзлов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого ТекЗапись Из Источник Цикл
			
			НаборЗаписей = РегистрыСведений.ЦеныДляРегистрации.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ТекЗапись.Период);
			НаборЗаписей.Отбор.ТипЦен.Установить(ТекЗапись.ТипЦен);
			НаборЗаписей.Отбор.Номенклатура.Установить(ТекЗапись.Номенклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(ТекЗапись.Характеристика);
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора,ТекЗапись,"ТипЦен,Номенклатура,Характеристика,Период");
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, НаборЗаписей);
			
		КонецЦикла;	

	КонецЕсли
	
	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Функция СтруктураОтвета() Экспорт
	
	КомпонентыОбмена = Новый Структура;
	КомпонентыОбмена.Вставить("УзелКорреспондента", НЕОПРЕДЕЛЕНО);
	КомпонентыОбмена.Вставить("Комментарий", "");
	КомпонентыОбмена.Вставить("ДействиеПриОбмене", НЕОПРЕДЕЛЕНО);
	КомпонентыОбмена.Вставить("РезультатВыполненияОбмена", НЕОПРЕДЕЛЕНО);
	КомпонентыОбмена.Вставить("ДатаНачала", Дата("00010101000000"));
	КомпонентыОбмена.Вставить("ДатаОкончания", Дата("00010101000000"));
	КомпонентыОбмена.Вставить("ResultMessage", "");
	КомпонентыОбмена.Вставить("Success", ИСТИНА);
	КомпонентыОбмена.Вставить("Continue", ЛОЖЬ);
	
	Возврат КомпонентыОбмена;
	
КонецФункции


Функция СоздатьОбъектXDTO(ТипОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.digma.ua/SB/MobileExchange", ТипОбъекта));
	
КонецФункции // СоздатьОбъектXDTO()

Функция ПолучитьКоличествоОбъектовВПакете()
	
	Возврат 100;
	
КонецФункции

Процедура ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом(МобильныйКлиент, НомерСообщения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередиСообщенийОбменаСМобильнымиКлиентами.НомерСообщения
	|ИЗ
	|	РегистрСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами КАК ОчередиСообщенийОбменаСМобильнымиКлиентами
	|ГДЕ
	|	ОчередиСообщенийОбменаСМобильнымиКлиентами.МобильныйКлиент = &МобильныйКлиент
	|	И (&НомерСообщения = НЕОПРЕДЕЛЕНО
	|			ИЛИ ОчередиСообщенийОбменаСМобильнымиКлиентами.НомерСообщения <= &НомерСообщения)";
	
	Запрос.УстановитьПараметр("МобильныйКлиент", МобильныйКлиент);
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	ВыборкаСообщений = Результат.Выбрать();
	Пока ВыборкаСообщений.Следующий() Цикл
		
		НаборЗаписей.Отбор.МобильныйКлиент.Установить(МобильныйКлиент);
		НаборЗаписей.Отбор.НомерСообщения.Установить(ВыборкаСообщений.НомерСообщения);
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры // ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом()

Процедура ПроверитьОчередьСообщенийОбмена(УзелОбмена, Знач НомерПринятого) Экспорт

	НомерСообщенияОчереди = НомерПринятого + 1;
	
	Отбор = Новый Структура("МобильныйКлиент", УзелОбмена);
	Порядок = "НомерСообщения Возр";
	ВыборкаСообщенийОбмена = РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами.Выбрать(Отбор, Порядок);
	
	Пока ВыборкаСообщенийОбмена.Следующий() Цикл
		
		Если ВыборкаСообщенийОбмена.НомерСообщения < НомерСообщенияОчереди Тогда
			
			Продолжить;
			
		ИначеЕсли ВыборкаСообщенийОбмена.НомерСообщения > НомерСообщенияОчереди Тогда
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru='Обмен с мобильным клиентом.Проверка очереди сообщений обмена';uk='Обмін з мобільним клієнтом.Перевірка черги повідомлень обміну'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				ВыборкаСообщенийОбмена.МобильныйКлиент,
				НСтр("ru='Нарушен порядок следования сообщений обмена.';uk='Порушений порядок проходження повідомлень обміну.'"));
				
			// Обнуляем счетчики принятых и отправленных сообщений для перерегистрации и отправки всех данных при следующем обмене.
			ПереинициализироватьСчетчикиСообщенийНаУзлеПланаОбмена(УзелОбмена);
			
			ВызватьИсключение(НСтр("ru='Не удалось выполнить отправку данных. Подробности см. в Журнале регистрации информационной базы.';uk='Не вдалося виконати відправлення даних. Подробиці див. у Журналі реєстрації інформаційної бази.'"));
			
		КонецЕсли;
		
		НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
	КонецЦикла;

КонецПроцедуры

Функция НужнаРегистрацияНоменклатуры(СылкаНоменклатуры)
	
	НужнаРегистрация = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.МобильноеПриложениеСтруктураКаталога КАК МобильноеПриложениеСтруктураКаталога
		|ГДЕ
		|	МобильноеПриложениеСтруктураКаталога.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", СылкаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		НужнаРегистрация = Ложь;
	КонецЕсли;
	
	Возврат НужнаРегистрация;
	
КонецФункции

Процедура ПереинициализироватьСчетчикиСообщенийНаУзлеПланаОбмена(УзелОбмена) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзелОбменаОбъект = УзелОбмена.ПолучитьОбъект();
	УзелОбменаОбъект.НомерПринятого = 0;
	УзелОбменаОбъект.НомерОтправленного = 0;
	УзелОбменаОбъект.Записать();
	
	НаборЗаписей = РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МобильныйКлиент.Установить(УзелОбмена);
	НаборЗаписей.Записать();
	

	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПереинициализироватьСчетчикиСообщенийНаУзлеПланаОбмена()

Функция ПолучитьСообщениеОбменаПоНомеру(УзелОбмена, НомерСообщенияОбмена) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередиСообщенийОбменаСМобильнымиКлиентами.СообщениеОбмена
	|ИЗ
	|	РегистрСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами КАК ОчередиСообщенийОбменаСМобильнымиКлиентами
	|ГДЕ
	|	ОчередиСообщенийОбменаСМобильнымиКлиентами.МобильныйКлиент = &МобильныйКлиент
	|	И ОчередиСообщенийОбменаСМобильнымиКлиентами.НомерСообщения = &НомерСообщения";
	
	Запрос.УстановитьПараметр("МобильныйКлиент", УзелОбмена);
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщенияОбмена);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СообщениеОбмена;

КонецФункции // ПолучитьСообщениеОбменаПоНомеру()

Функция ОчередьСообщенийСформирована(ИдентификаторЗадания, ЕстьОшибки, СообщениеОбОшибке = "") Экспорт

	ЗаписьЖурналаРегистрации("Отладка", УровеньЖурналаРегистрации.Информация,,, "Идентификатор задания " + Строка(ИдентификаторЗадания));
	Попытка
		ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
		Возврат ЗаданиеВыполнено;
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЕстьОшибки = Истина;
		ЗаписьЖурналаРегистрации("Отладка", УровеньЖурналаРегистрации.Ошибка,,, "Идентификатор задания " + Строка(ИдентификаторЗадания));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции // ЗаданиеФормированияОчередиЗавершеноУспешно()

#КонецОбласти



#Область Сериализация


Функция СериализацияГруппаЦенообразования(Данные, КоличествоОбъектов)
	
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("TipNomItem");
	ПередаваемыйОбъект.Id = XMLстрока(Данные);
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
	
	Возврат ПередаваемыйОбъект;
	
КонецФункции

Функция СериализацияВидУчета(Данные, КоличествоОбъектов)
	
	ПередаваемыйОбъект =  XMLстрока(Данные);
	
	Возврат ПередаваемыйОбъект;
	
КонецФункции

Функция СериализацияНоменклатура(Данные, КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("NomItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		ПередаваемыйОбъект.Group = ПолучитьОбъектXDTO(Данные.Родитель, КоличествоОбъектов);
	КонецЕсли;
	Если Данные.ЭтоГруппа Тогда
		ПередаваемыйОбъект.ThisIsGroup = Истина;
		Возврат ПередаваемыйОбъект;
	Иначе
		ПередаваемыйОбъект.ThisIsGroup = Ложь;
	КонецЕсли;
	ПередаваемыйОбъект.Article = Данные.Артикул;
	Если ЗначениеЗаполнено(Данные.ГруппаЦенообразования) Тогда
		ПередаваемыйОбъект.TipNom  = ПолучитьОбъектXDTO(Данные.ГруппаЦенообразования,КоличествоОбъектов);
	КонецЕсли;
	
	
	ПередаваемыйОбъект.BarCode = СокрЛП(Данные.ОсновнойШтрихКод);
	ПередаваемыйОбъект.KvoOs = Данные.ОсновнаяЕдиницаИзмерения.Коэффициент;
	ПередаваемыйОбъект.KvoUp = Данные.ЕдиницаИзмеренияУпаковки.Коэффициент;


	
	Возврат ПередаваемыйОбъект;
	
КонецФункции

Функция СериализацияХарактеристикаНоменклатуры(Данные,КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("HarItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления ИЛИ Данные.НеАктивная;
	Если ЗначениеЗаполнено(Данные.Владелец) Тогда
		ПередаваемыйОбъект.NomItem = ПолучитьОбъектXDTO(Данные.Владелец, КоличествоОбъектов);
	КонецЕсли;
	ПередаваемыйОбъект.mrc = Данные.ЗначениеМРЦ;
	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериализацияТипЦен(Данные,КоличествоОбъектов)
	Если Данные.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("TypePriceItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериализацияСкладыКомпании(Данные,КоличествоОбъектов)
	Если Данные.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("StocItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;

	ПередаваемыйОбъект.VidSklada  = Данные.ВидСклада.ИмяПредопределенныхДанных;
	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериализацияКонтрагент(Данные,КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("BuyerItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериализацияДоговорКонтрагента(Данные,КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("ContractItem");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;
	ПередаваемыйОбъект.BuyerItem = ПолучитьОбъектXDTO(Данные.Контрагент,КоличествоОбъектов);
	
	
	ДобавляемыеСтрокиТип = ПередаваемыйОбъект.Свойства().Получить("PricesType_List").Тип;
	ДобавляемыеСтроки = ФабрикаXDTO.Создать(ДобавляемыеСтрокиТип);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_УсловияЦенообразования.Период КАК Период,
		|	ТК_УсловияЦенообразования.ГруппаЦенообразования КАК ГруппаЦенообразования,
		|	ТК_УсловияЦенообразования.ВидУчета КАК ВидУчета,
		|	ТК_УсловияЦенообразования.НачалоДействия КАК НачалоДействия,
		|	ТК_УсловияЦенообразования.КонецДействия КАК КонецДействия,
		|	ТК_УсловияЦенообразования.Действует КАК Действует,
		|	ТК_УсловияЦенообразования.ТипЦены КАК ТипЦены
		|ИЗ
		|	РегистрСведений.ТК_УсловияЦенообразования КАК ТК_УсловияЦенообразования
		|ГДЕ
		|	ТК_УсловияЦенообразования.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Данные.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		ДобавляемаяСтрокаТип = ДобавляемыеСтроки.Свойства().Получить("PricesType").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		ДобавляемаяСтрока.Date = ВыборкаДетальныеЗаписи.Период;
		ДобавляемаяСтрока.TipNom = ПолучитьОбъектXDTO(ВыборкаДетальныеЗаписи.ГруппаЦенообразования,КоличествоОбъектов);
		ДобавляемаяСтрока.TypeUcheta = ПолучитьОбъектXDTO(ВыборкаДетальныеЗаписи.ВидУчета,КоличествоОбъектов);
		ДобавляемаяСтрока.Date1 = ВыборкаДетальныеЗаписи.НачалоДействия;
		ДобавляемаяСтрока.Date2 = ВыборкаДетальныеЗаписи.КонецДействия;
		ДобавляемаяСтрока.Valid = ВыборкаДетальныеЗаписи.Действует;
		ДобавляемаяСтрока.TypePrice = ПолучитьОбъектXDTO(ВыборкаДетальныеЗаписи.ТипЦены,КоличествоОбъектов);

		
		ДобавляемыеСтроки.PricesType.Добавить(ДобавляемаяСтрока);

	КонецЦикла;
	
	
	
	ПередаваемыйОбъект.PricesType_List = ДобавляемыеСтроки;

	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериалицацияЦеныНоменклатуры(Данные, КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("Prices");
	Номенклатура = Данные.Отбор.Номенклатура.Значение;
	Характеристика = Данные.Отбор.Характеристика.Значение;
	ДатаПереоценки = Данные.Отбор.Период.Значение;
	ТипЦен         = Данные.Отбор.ТипЦен.Значение;
	
	ПередаваемыйОбъект.Date = ДатаПереоценки;

	Если ЗначениеЗаполнено(ТипЦен) Тогда
		ПередаваемыйОбъект.TypePrice = ПолучитьОбъектXDTO(ТипЦен, КоличествоОбъектов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПередаваемыйОбъект.Nomenclature = ПолучитьОбъектXDTO(Номенклатура, КоличествоОбъектов);
	КонецЕсли;
	Если ЗначениеЗаполнено(Характеристика)Тогда
		ПередаваемыйОбъект.Characteristic = ПолучитьОбъектXDTO(Характеристика, КоличествоОбъектов);
	КонецЕсли;
	ПередаваемыйОбъект.Price = Окр(ЦенообразованиеСервер.ПолучитьЦенуПоОтбору("Цены",Новый Структура("ТипЦенЗакупки,Дата,Номенклатура,ХарактеристикаНоменклатуры,ТипЦен",Ложь,ДатаПереоценки,Номенклатура,Характеристика,ТипЦен)),2);

	Возврат ПередаваемыйОбъект;
	
КонецФункции

Функция СериализацияТочкиДоставки(Данные,КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("Delivery");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления ИЛИ НЕ Данные.Действует;
	ПередаваемыйОбъект.BuyerItem = ПолучитьОбъектXDTO(Данные.Владелец,КоличествоОбъектов);
	
	Возврат ПередаваемыйОбъект;

КонецФункции

Функция СериализацияМаршрутыАгентов(Данные,КоличествоОбъектов)
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("Routes");
	ПередаваемыйОбъект.Id = Строка(Данные.Ссылка.УникальныйИдентификатор());
	ПередаваемыйОбъект.Name = Данные.Наименование;
	ПередаваемыйОбъект.DeletionMark = Данные.ПометкаУдаления;

	ДобавляемаяСтрокиТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
	Для Каждого СтрКонтрагент Из Данные.СписокКонтрагентов Цикл 
		Если Не ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда Продолжить; КонецЕсли;
		ДобавляемыеСтроки = ФабрикаXDTO.Создать(ДобавляемаяСтрокиТип);
		ДобавляемыеСтроки.Buyer =  ПолучитьОбъектXDTO(СтрКонтрагент.Контрагент,КоличествоОбъектов);
		ПередаваемыйОбъект.Item.Добавить(ДобавляемыеСтроки);
	КонецЦикла;
	
	Возврат ПередаваемыйОбъект;
	
КонецФункции


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьОбъектXDTO(Данные, КоличествоОбъектов) Экспорт
	
	ПередаваемыйОбъект = Неопределено;
	ТипОбъекта = ТипЗнч(Данные);
	Попытка 
		Если ТипОбъекта = Тип("СправочникСсылка.Номенклатура") ИЛИ ТипОбъекта = Тип("СправочникОбъект.Номенклатура") Тогда
			ПередаваемыйОбъект = СериализацияНоменклатура(Данные,КоличествоОбъектов);   //  спр Номенклатура
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ГруппыЦенообразования") Тогда      // спр Группы ценообразования
			ПередаваемыйОбъект = СериализацияГруппаЦенообразования(Данные,КоличествоОбъектов);
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") ИЛИ ТипОбъекта = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
			ПередаваемыйОбъект = СериализацияХарактеристикаНоменклатуры(Данные,КоличествоОбъектов);  //Характеристики (МРЦ)
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ТипыЦен") ИЛИ ТипОбъекта = Тип("СправочникОбъект.ТипыЦен") Тогда
			ПередаваемыйОбъект = СериализацияТипЦен(Данные,КоличествоОбъектов);         // Типы цен
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипОбъекта = Тип("СправочникОбъект.Контрагенты") Тогда
			ПередаваемыйОбъект = СериализацияКонтрагент(Данные,КоличествоОбъектов);     //Контрагент
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ДоговорыКонтрагентов") ИЛИ ТипОбъекта = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
			ПередаваемыйОбъект = СериализацияДоговорКонтрагента(Данные,КоличествоОбъектов);     //Договор контрагента
		ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЦеныДляРегистрации") Тогда 	
			ПередаваемыйОбъект = СериалицацияЦеныНоменклатуры(Данные,КоличествоОбъектов);   // Цены
		ИначеЕсли ТипОбъекта = Тип("ПеречислениеСсылка.ВидыУчета") Тогда 	
			ПередаваемыйОбъект = СериализацияВидУчета(Данные,КоличествоОбъектов);   // Перечисление Виды учета
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.СкладыКомпании") ИЛИ ТипОбъекта = Тип("СправочникОбъект.СкладыКомпании") Тогда  	
			ПередаваемыйОбъект = СериализацияСкладыКомпании(Данные,КоличествоОбъектов);   // спр Склады
		ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ТочкиДоставки") ИЛИ ТипОбъекта = Тип("СправочникОбъект.ТочкиДоставки") Тогда  	
			ПередаваемыйОбъект = СериализацияТочкиДоставки(Данные,КоличествоОбъектов);   // спр Точки доставки
		ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.МаршрутыАгентов") ИЛИ ТипОбъекта = Тип("СправочникСсылка.МаршрутыАгентов") Тогда
			ПередаваемыйОбъект = СериализацияМаршрутыАгентов(Данные,КоличествоОбъектов)  // справочник Маршруты агентов
			
		КонецЕсли;
	Исключение
		ПредставлениеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными с мобильный приложением. Получение пакета обмена.';uk='Обмін даними з мобільний додатком. Отримання пакету обміну.'"),
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);

		ВызватьИсключение(ПредставлениеОшибки);
	КонецПопытки;
	
	КоличествоОбъектов = КоличествоОбъектов + 1;

	
	Возврат ПередаваемыйОбъект;
	
КонецФункции // ПолучитьОбъектXDTO()

#КонецОбласти






#Область ВыгрузкаВМобильноеПриложение

Функция НачалоОбмена(ВерсияМобильногоПриложения, ИдентификаторМобильногоУстройства,НомерОтправленного,НомерПринятого) Экспорт
	СтруктураОтвета = СтруктураОтвета();
	СтруктураОтвета.Вставить("DeleteAppData", Ложь);
	НужнаИнициализацияУзла = Ложь;
	
	Если ВерсияМобильногоПриложения = "1" Тогда
		СтруктураОтвета.Success = Ложь;
		СтруктураОтвета.ResultMessage = НСтр("ru='Требуется обновление мобильного приложения.';uk='Потрібне оновлення мобільного додатку.'");
		ВозвращаемыйСписок = СоздатьОбъектXDTO("Permit");
		ЗаполнитьЗначенияСвойств(ВозвращаемыйСписок, СтруктураОтвета);
		
		Возврат ВозвращаемыйСписок;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ГлавныйУзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.ЭтотУзел();
	
	Если ГлавныйУзелОбмена.Код <> "001" Тогда
		
		ГлавныйУзелОбъект = ГлавныйУзелОбмена.ПолучитьОбъект();
		ГлавныйУзелОбъект.Код = "001";
		ГлавныйУзелОбъект.Наименование = НСтр("ru='Центральный';uk='Центральний'");
		ГлавныйУзелОбъект.Записать();
		
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьУзелОбменаМобильногоУстройства(ИдентификаторМобильногоУстройства);
	
	Если УзелОбмена.Пустая() Тогда
		СтруктураОтвета.Success = Ложь;
		СтруктураОтвета.ResultMessage = НСтр("ru='Синхронизация с устройством не настроена.';uk='Синхронізація з пристроєм не настроєна.'");
		ВозвращаемыйСписок = СоздатьОбъектXDTO("Permit");
		ЗаполнитьЗначенияСвойств(ВозвращаемыйСписок, СтруктураОтвета);
		Возврат ВозвращаемыйСписок;
	ИначеЕсли УзелОбмена.ПометкаУдаления ИЛИ УзелОбмена.ДоступЗапрещен Тогда
		СтруктураОтвета.Success = Ложь;
		СтруктураОтвета.DeleteAppData = Истина;
		СтруктураОтвета.ResultMessage = НСтр("ru='Соединение с устройством запрещено.';uk='З''єднання з пристроєм заборонено'");
		ВозвращаемыйСписок = СоздатьОбъектXDTO("Permit");
		ЗаполнитьЗначенияСвойств(ВозвращаемыйСписок, СтруктураОтвета);
		Возврат ВозвращаемыйСписок;
	ИначеЕсли УзелОбмена.Пользователь <> Пользователи.ТекущийПользователь() Тогда
		СтруктураОтвета.Success = Ложь;
		ТекстОтвета = НСтр("ru='Для устройства уже определен другой пользователь приложения.
		|Сценарий использования одного устройства разными пользователями одновременно не поддерживается
		|текущей версией конфигурации. Если другой пользователь больше не использует это устройство,
		|обратитесь к администратору вашей ИБ для открепления настройки другого пользователя от этого устройства.'
		|;uk='Для пристрою вже визначений інший користувач програми.
		|Сценарій використання одного пристрою різними користувачами одночасно не підтримується
		|поточною версією конфігурації. Якщо інший користувач більше не використовує це пристрій,
		|зверніться до адміністратора вашої ІБ для відкріплення настройки  іншого користувача від цього пристрою.'");
		СтруктураОтвета.ResultMessage = ТекстОтвета;

		ВозвращаемыйСписок = СоздатьОбъектXDTO("Permit");
		ЗаполнитьЗначенияСвойств(ВозвращаемыйСписок, СтруктураОтвета);
		Возврат ВозвращаемыйСписок;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(УзелОбмена.ПодразделениеКомпании) 
		И Справочники.ПодразделенияКомпании.ЭтоФабрикаСыра(УзелОбмена.ПодразделениеКомпании) 
		И НЕ ЗначениеЗаполнено(УзелОбмена.СкладАгента) Тогда
		
		Узел = УзелОбмена.ПолучитьОбъект();
		СкладКомпании = Справочники.СкладыКомпании.НайтиПоНаименованию("Мобильный склад "+Строка(УзелОбмена.Пользователь),Истина);
		
		Если СкладКомпании.Пустая() Тогда
			НовыйСклад = Справочники.СкладыКомпании.СоздатьЭлемент();
			НовыйСклад.Подразделение = УзелОбмена.ПодразделениеКомпании;
			НовыйСклад.ВидСклада = Справочники.ВидыСкладов.МобильныйСклад;
			НовыйСклад.Наименование = "Мобильный склад "+Строка(УзелОбмена.Пользователь);
			НовыйСклад.Родитель = Справочники.СкладыКомпании.НайтиПоКоду("ФС000001");
			НовыйСклад.ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000281");
			Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(НовыйСклад.ТорговаяПлощадка);
			АдресДоставки =  Справочники.ТорговыеПлощадки.НайтиПоНаименованию(УзелОбмена.Пользователь,Истина);
			Если АдресДоставки.Пустая() Тогда
				НовыйАдресДоставки = Справочники.ТочкиДоставки.СоздатьЭлемент();
				НовыйАдресДоставки.Владелец = Организация.Контрагент;
				НовыйАдресДоставки.Наименование = НовыйСклад.Наименование;
				НовыйАдресДоставки.УстановитьНовыйКод("MO");
				НовыйАдресДоставки.Записать();;
				НовыйСклад.ТочкаДоставки = НовыйАдресДоставки.Ссылка;
				
			Иначе
				НовыйСклад.ТочкаДоставки = АдресДоставки;
			КонецЕсли;
			
			НовыйСклад.Ответственный = УзелОбмена.Пользователь;
			НовыйСклад.УстановитьНовыйКод("MO");
			НовыйСклад.Записать();
			Узел.СкладАгента = НовыйСклад.Ссылка;
		Иначе 
			Узел.СкладАгента = СкладКомпании;
		КонецЕсли;
		
		Узел.Записать();
		НужнаИнициализацияУзла = Истина;
	КонецЕсли;
	
		
	
	
	
	Если УзелОбмена.НомерОтправленного <> НомерОтправленного ИЛИ
		УзелОбмена.НомерПринятого <> НомерПринятого Тогда
		
		Узел = УзелОбмена.ПолучитьОбъект();
		Узел.НомерОтправленного = НомерОтправленного;
		Узел.НомерПринятого = НомерПринятого;
		Узел.Записать();
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
		ЗапуститьФоновоеЗаданиеРегистрацииПоУзлуОбмена(УзелОбмена,УзелОбмена.Код);
		НужнаИнициализацияУзла = Истина;
	КонецЕсли;
	СтруктураОтвета.Вставить("NewExchange",НужнаИнициализацияУзла);
	
		
	ВозвращаемыйСписок = СоздатьОбъектXDTO("Permit");
	ЗаполнитьЗначенияСвойств(ВозвращаемыйСписок, СтруктураОтвета);
	
	Если НужнаИнициализацияУзла Тогда
		КоличествоОбъектов = 0;
		ВС = СоздатьОбъектXDTO("Objects");
		
		ОбъектXDTO = ПолучитьОбъектXDTO(УзелОбмена.СкладАгента, КоличествоОбъектов);
		Если ОбъектXDTO <> Неопределено Тогда
			ВС.objects.Добавить(ОбъектXDTO);
		КонецЕсли;

		ОбъектXDTO = ПолучитьОбъектXDTO(УзелОбмена.ПрофильНастроек.СкладЗаказа, КоличествоОбъектов);
		Если ОбъектXDTO <> Неопределено Тогда
			ВС.objects.Добавить(ОбъектXDTO);
		КонецЕсли;

		ЗаписьXML = Новый ЗаписьXML;
		
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВС);
		
		
		СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
		ВозвращаемыйСписок.Data = СообщениеОбмена;
	КонецЕсли;
	

	
	Возврат ВозвращаемыйСписок;


КонецФункции

Функция ПолучитьСообщениеОбмена(УзелОбмена, НомерСообщенияОбмена, ИдентификаторЗадания) Экспорт

	СтруктураОтвета = Новый Структура("Подождать, ПродолжитьЗагрузку, ПрерватьЗагрузку, СообщениеОбмена", Ложь, Истина, Ложь, Неопределено);
	
	СообщениеОбмена = ПолучитьСообщениеОбменаПоНомеру(УзелОбмена, НомерСообщенияОбмена);
	Если СообщениеОбмена <> Неопределено Тогда
		СтруктураОтвета.СообщениеОбмена = СообщениеОбмена;
		Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));
	КонецЕсли;
	
	// Если сообщения нет в очереди, проверим состояние выполнения фонового задания.
	ЕстьОшибки = Ложь;
	СообщениеОбОшибке = "";
	ОчередьСообщенийСформирована = ОчередьСообщенийСформирована(ИдентификаторЗадания, ЕстьОшибки, СообщениеОбОшибке);
	
	НужноОчиститьОчередьСообщений = Ложь;
	// Если есть ошибки, сбрасываем счетчики сообщений для переотправки данных при следующем сеансе обмена.
	Если ЕстьОшибки Тогда
		ПереинициализироватьСчетчикиСообщенийНаУзлеПланаОбмена(УзелОбмена);
		НужноОчиститьОчередьСообщений = Истина;
		ВызватьИсключение(СообщениеОбОшибке);
	КонецЕсли;
	
	// Если нет сообщений и очередь была сформирована, считаем что все пакеты успешно получены, иначе ожидаем пакеты.
	Если ОчередьСообщенийСформирована Тогда
		СтруктураОтвета.Подождать = Ложь;
		СтруктураОтвета.ПродолжитьЗагрузку = Ложь;
		НужноОчиститьОчередьСообщений = Истина;
	Иначе
		СтруктураОтвета.Подождать = Истина;
		СтруктураОтвета.ПродолжитьЗагрузку = НЕ ЕстьОшибки;
	КонецЕсли;
	
	СтруктураОтвета.ПрерватьЗагрузку = ЕстьОшибки;
	
	Если НужноОчиститьОчередьСообщений Тогда
		
		ОтборЗадания = Новый Структура("Ключ", Строка(ИдентификаторЗадания));
		МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗадания);
		
		Если МассивЗаданий.Количество() = 0  Тогда // Если очистка не запускалась, то запустить.
			
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(УзелОбмена);
			
			ИмяФункции = "ОбменМобильноеПриложение.ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом";
			
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(
				ИмяФункции,
				МассивПараметров,
				Строка(ИдентификаторЗадания),
				НСтр("ru='Очистка очереди сообщений с мобильным клиентом';uk='Очищення черги повідомлень з мобільним клієнтом'"));
				
			СтруктураОтвета.Подождать = Истина; // Подождем очистку.
			СтруктураОтвета.ПродолжитьЗагрузку = Истина;
			
		Иначе
			
			Если МассивЗаданий[0].Состояние = СостояниеФоновогоЗадания.Активно Тогда
				СтруктураОтвета.Подождать = Истина; // Подождем очистку.
				СтруктураОтвета.ПродолжитьЗагрузку = Истина;
			КонецЕсли;
			
		КонецЕСли;
		
	КонецЕсли;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));

КонецФункции



Функция ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	Возврат ЗаписьXML;
	
КонецФункции


Процедура ЗапуститьФормированиеОчередиСообщенийОбмена(УзелОбмена, КодМобильногоКомпьютера, НомерПринятого, НужнаИнициализацияУзла, ИдентификаторЗадания, ЭтоНовыйОбмен = Ложь) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(УзелОбмена);
	МассивПараметров.Добавить(НомерПринятого);
	МассивПараметров.Добавить(НужнаИнициализацияУзла);
	МассивПараметров.Добавить(ЭтоНовыйОбмен);
	
	ИмяФункции = "ОбменМобильноеПриложение.СформироватьОчередьСообщенийОбмена";
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(
		ИмяФункции,
		МассивПараметров,
		,
		КодМобильногоКомпьютера);
		
	ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
КонецПроцедуры

Функция СформироватьОчередьСообщенийОбмена(УзелОбмена, НомерПринятого, НужнаИнициализацияУзла = Ложь, ЭтоНовыйОбмен = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если НужнаИнициализацияУзла Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
		ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом(УзелОбмена);
		ЗарегистрироватьИзмененияДанных(УзелОбмена);
	Иначе
		ОчиститьОчередьСообщенийОбменаСМобильнымКлиентом(УзелОбмена, НомерПринятого);
	КонецЕсли;
	
	НомерСообщенияОчереди = УзелОбмена.НомерОтправленного;
	
	// Запись данных в очередь.
	СериализоватьИДобавитьДанныеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, ЭтоНовыйОбмен);
	
	// Проверка порядка следования сообщений обмена.
	ПроверитьОчередьСообщенийОбмена(УзелОбмена, НомерПринятого);
	
	// Удаляем регистрацию изменений для сообщений обмена, помещенных в очередь.
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
	
КонецФункции // СформироватьОчередьСообщенийОбмена()



Процедура СериализоватьИДобавитьДанныеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, ЭтоНовыйОбмен) Экспорт
	
	ЗаписьСообщения = Неопределено;
	ЗаписьXML = ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения);
	
	ВозвращаемыйСписок = СоздатьОбъектXDTO("Objects");
	
	КоличествоОбъектов = 0; // Счетчик объектов.
	
	// Запись справочников и документов
	СериализоватьИДобавитьСправочникиИДокументыВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов);
	
	//// Запись остатков
	СериализоватьИДобавитьОстаткиЗапасовВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов);
	// Взаиморасчеты
	СериализоватьИДобавитьВзаиморасчетыВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов); 
	
	СериализоватьИДобавитьРолиВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок,УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов);
	
	//Если ЭтоНовыйОбмен Тогда
	//	// Запись ролей.
	//	ОбменМобильноеПриложениеПравилаВыгрузки.СериализоватьИДобавитьРолиВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок,УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов);
	//	// Запись сведений о компании.
	//	ОбменМобильноеПриложениеПравилаВыгрузки.СериализоватьИДобавитьСведенияОКомпанииВОбъектXDTO(ВозвращаемыйСписок, КоличествоОбъектов);
	//	// НастройкиНалогооблажения
	//	ОбменМобильноеПриложениеПравилаВыгрузки.СериализоватьИДобавитьСведенияОНастрокахНалогооблаженияВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов);
	//КонецЕсли;
	//
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
	
	ЗаписьСообщения.ЗакончитьЗапись();
	СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
	НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
	ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена);

КонецПроцедуры // СериализоватьИДобавитьДанныеВОчередьСообщенийОбмена()



Процедура СериализоватьИДобавитьСправочникиИДокументыВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов)Экспорт
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
		Если КоличествоОбъектов >= ПолучитьКоличествоОбъектовВПакете() Тогда
			
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
			ЗаписьСообщения.ЗакончитьЗапись();
			СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
			НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
			ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена);
			
			ЗаписьXML = ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения);
			ВозвращаемыйСписок = СоздатьОбъектXDTO("Objects");
			
			КоличествоОбъектов = 0;
			
		КонецЕсли;
		
		Данные = ВыборкаИзменений.Получить();
		
		//// Если перенос данных не нужен, то, возможно, необходимо записать удаление данных.
		//Если НЕ ОбменМобильноеПриложениеОбщее.НуженПереносДанных(Данные, УзелОбмена) Тогда
		//	
		//	// Получаем значение с возможным удалением данных.
		//	УдалениеДанных(Данные);
		//	
		//КонецЕсли;
		
		ОбъектXDTO = ПолучитьОбъектXDTO(Данные, КоличествоОбъектов);
		Если ОбъектXDTO <> Неопределено Тогда
			ВозвращаемыйСписок.objects.Добавить(ОбъектXDTO);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СериализоватьИДобавитьСправочникиИДокументыВОбъектXDTO()

Процедура СериализоватьИДобавитьОстаткиЗапасовВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов) Экспорт

	
	Настройки = ПланыОбмена.ОбменМобильноеПриложение.НастройкиУзла(УзелОбмена);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ вт_Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ОстаткиТоваровКомпанииОстатки.СкладКомпании,
		//|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		//|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
		//|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		//|ИЗ
		//|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладЗаказа) КАК ОстаткиТоваровКомпанииОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Остатки.СкладКомпании КАК СкладКомпании,
		|	вт_Остатки.Номенклатура КАК Номенклатура,
		|	вт_Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	вт_Остатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	вт_Остатки КАК вт_Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МобильноеПриложениеСтруктураКаталога КАК МобильноеПриложениеСтруктураКаталога
		|		ПО вт_Остатки.Номенклатура = МобильноеПриложениеСтруктураКаталога.Номенклатура
		|			И (МобильноеПриложениеСтруктураКаталога.НастройкаМобильногоПриложения = &НастройкаМобильногоПриложения)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладКомпании"
	);
	Запрос.УстановитьПараметр("СкладКомпании",Настройки.СкладАгента);
//	Запрос.УстановитьПараметр("СкладЗаказа",Настройки.СкладЗаказа);

	Запрос.УстановитьПараметр("НастройкаМобильногоПриложения",Настройки.ПрофильНастроек);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОстатков = Результат.Выбрать();
	
	
	
	Пока ВыборкаОстатков.СледующийПоЗначениюПоля("СкладКомпании") Цикл 
		
		ПередаваемыйОбъект = СоздатьОбъектXDTO("Remains");
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;


		ПередаваемыйОбъект.id =  Строка(ВыборкаОстатков.СкладКомпании.УникальныйИдентификатор());
		ПередаваемыйОбъект.name = Строка(ВыборкаОстатков.СкладКомпании);
		КоличествоОбъектов = КоличествоОбъектов + 1;

		
		Пока ВыборкаОстатков.Следующий() Цикл
			
			КоличествоОбъектов = КоличествоОбъектов + 1;
			Если КоличествоОбъектов >= ПолучитьКоличествоОбъектовВПакете() Тогда
				
				ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
				
				ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
				ЗаписьСообщения.ЗакончитьЗапись();
				
				СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
				НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
				ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена);
				
				ЗаписьXML = ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения);
				ВозвращаемыйСписок = СоздатьОбъектXDTO("Objects");
				ПередаваемыйОбъект = СоздатьОбъектXDTO("Remains");
				ПередаваемыйОбъект.id =  Строка(ВыборкаОстатков.СкладКомпании.УникальныйИдентификатор());
				ПередаваемыйОбъект.name = Строка(ВыборкаОстатков.СкладКомпании);
				
				
				КоличествоОбъектов = 0;
				
			КонецЕсли;
			
			
			ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
			ДобавляемаяСтрока.Nomenclature = ПолучитьОбъектXDTO(ВыборкаОстатков.Номенклатура, КоличествоОбъектов);
			ДобавляемаяСтрока.Quantity = ВыборкаОстатков.КоличествоОстаток;
			ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
			
		КонецЦикла;
		
		
		
		ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
		
	КонецЦикла;
	
	//Если ПередаваемыйОбъект <> Неопределено Тогда
	//	ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	//КонецЕсли;
	//
КонецПроцедуры // ЗаписатьОстаткиСКонтролемКоличестваОбъектов()

Процедура СериализоватьИДобавитьВзаиморасчетыВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок, УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов) Экспорт

	
	Настройки = ПланыОбмена.ОбменМобильноеПриложение.НастройкиУзла(УзелОбмена);
	массивКонтрагенты  = Настройки.ПрофильНастроек.Контрагенты.Выгрузить(,"Контрагент");
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПокупателямиОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	РасчетыСПокупателямиОстатки.РегламентированныйУчет КАК РегламентированныйУчет,
	|	РасчетыСПокупателямиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			,
	|			Контрагент в (&Контрагент)
	|				И ДоговорВзаиморасчетов.Подразделение = &Подразделение) КАК РасчетыСПокупателямиОстатки"
	);
	Запрос.УстановитьПараметр("Контрагент",массивКонтрагенты);
	Запрос.УстановитьПараметр("Подразделение",Настройки.ПодразделениеКомпании);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОстатков = Результат.Выбрать();
	
	ПередаваемыйОбъект = СоздатьОбъектXDTO("Debt");
	ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("Item").Тип;
	
	
	Пока ВыборкаОстатков.Следующий() Цикл
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
		Если КоличествоОбъектов >= ПолучитьКоличествоОбъектовВПакете() Тогда
			
			ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
			
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
			ЗаписьСообщения.ЗакончитьЗапись();
			
			СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
			НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
			ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена);
			
			ЗаписьXML = ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения);
			ВозвращаемыйСписок = СоздатьОбъектXDTO("Objects");
			ПередаваемыйОбъект = СоздатьОбъектXDTO("Debt");
			
			
			КоличествоОбъектов = 0;
			
		КонецЕсли;
		
		
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		ДобавляемаяСтрока.Buyer = ПолучитьОбъектXDTO(ВыборкаОстатков.Контрагент, КоличествоОбъектов);
		ДобавляемаяСтрока.Contract = Строка(ВыборкаОстатков.ДоговорВзаиморасчетов.УникальныйИдентификатор());
		ДобавляемаяСтрока.Regl = ВыборкаОстатков.РегламентированныйУчет;
		ДобавляемаяСтрока.Summ =  ВыборкаОстатков.СуммаОстаток;
		ПередаваемыйОбъект.Item.Добавить(ДобавляемаяСтрока);
		
	КонецЦикла;
	
	
	
	ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	
		//
КонецПроцедуры // ЗаписатьОстаткиСКонтролемКоличестваОбъектов()

Процедура СериализоватьИДобавитьРолиВОбъектXDTO(ЗаписьСообщения, ЗаписьXML, ВозвращаемыйСписок,УзелОбмена, НомерСообщенияОчереди, КоличествоОбъектов)
	

	ПередаваемыйОбъект = СоздатьОбъектXDTO("Roles");
	
	Для каждого ТекРоль Из УзелОбмена.Роли Цикл
		
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
		Если КоличествоОбъектов >= ПолучитьКоличествоОбъектовВПакете() Тогда
			
			ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
			
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
			ЗаписьСообщения.ЗакончитьЗапись();
			
			СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
			НомерСообщенияОчереди = НомерСообщенияОчереди + 1;
			ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена);
			
			ЗаписьXML = ПолучитьЗаписьXMLДляСообщенияОбмена(УзелОбмена, ЗаписьСообщения);
			ВозвращаемыйСписок = СоздатьОбъектXDTO("Objects");
			ПередаваемыйОбъект = СоздатьОбъектXDTO("Roles");
			
			КоличествоОбъектов = 0;
			
		КонецЕсли;
		
		ДобавляемаяСтрокаТип = ПередаваемыйОбъект.Свойства().Получить("role").Тип;
		ДобавляемаяСтрока = ФабрикаXDTO.Создать(ДобавляемаяСтрокаТип);
		ДобавляемаяСтрока.name = Строка(ТекРоль.Роль);
		ПередаваемыйОбъект.Role.Добавить(ДобавляемаяСтрока);
		
	КонецЦикла;
	
	Если ПередаваемыйОбъект <> Неопределено Тогда
		ВозвращаемыйСписок.objects.Добавить(ПередаваемыйОбъект);
	КонецЕсли;
	
	
КонецПроцедуры



Процедура ЗапуститьФоновоеЗаданиеРегистрацииПоУзлуОбмена(УзелОбмена,КодМобильногоКомпьютера)Экспорт
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(УзелОбмена);
	
	ИмяФункции = "ОбменМобильноеПриложение.ЗарегистрироватьИзмененияДанных";
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(
		ИмяФункции,
		МассивПараметров,
		,
		КодМобильногоКомпьютера);

КонецПроцедуры

Процедура ЗапуститьФоновоеЗаданиеРегистрациЦениПоУзлуОбмена(УзелОбмена,МассивЦен,КодМобильногоКомпьютера)Экспорт
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(УзелОбмена);
	МассивПараметров.Добавить(МассивЦен);
	
	ИмяФункции = "ОбменМобильноеПриложение.ЗарегистрироватьИзменениеДанныхЦены";
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить(
		ИмяФункции,
		МассивПараметров,
		,
		КодМобильногоКомпьютера);

КонецПроцедуры


Процедура ЗарегистрироватьИзмененияДанных(УзелОбмена) Экспорт
	
	
	 УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МобильноеПриложениеСтруктураКаталога.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	РегистрСведений.МобильноеПриложениеСтруктураКаталога КАК МобильноеПриложениеСтруктураКаталога
		|ГДЕ
		|	МобильноеПриложениеСтруктураКаталога.НастройкаМобильногоПриложения = &НастройкаМобильногоПриложения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура КАК Ссылка
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиМобильногоПриложения.Контрагенты КАК НастройкиМобильногоПриложенияКонтрагенты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменМобильноеПриложение КАК ОбменМобильноеПриложение
		|			ПО (ОбменМобильноеПриложение.ПрофильНастроек = НастройкиМобильногоПриложенияКонтрагенты.Ссылка)
		|		ПО ДоговорыКонтрагентов.Контрагент = НастройкиМобильногоПриложенияКонтрагенты.Контрагент
		|ГДЕ
		|	ДоговорыКонтрагентов.Подразделение = &Подразделение
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Продажа)
		|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
		|	И ДоговорыКонтрагентов.ДатаНачалаДействия <= &ТекДата
		|	И ДоговорыКонтрагентов.ДатаОкончанияДействия >= &ТекДата
		|	И ОбменМобильноеПриложение.Ссылка = &УзелОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиМобильногоПриложенияКонтрагенты.Контрагент
		|ИЗ
		|	Справочник.НастройкиМобильногоПриложения.Контрагенты КАК НастройкиМобильногоПриложенияКонтрагенты
		|ГДЕ
		|	НастройкиМобильногоПриложенияКонтрагенты.Ссылка = &НастройкаМобильногоПриложения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТочкиДоставки.Ссылка
		|ИЗ
		|	Справочник.НастройкиМобильногоПриложения.Контрагенты КАК НастройкиМобильногоПриложенияКонтрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
		|		ПО НастройкиМобильногоПриложенияКонтрагенты.Контрагент = ТочкиДоставки.Владелец
		|ГДЕ
		|	НастройкиМобильногоПриложенияКонтрагенты.Ссылка = &НастройкаМобильногоПриложения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутыАгентов.Ссылка
		|ИЗ
		|	Справочник.МаршрутыАгентов КАК МаршрутыАгентов
		|ГДЕ
		|	МаршрутыАгентов.Владелец = &УзелОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбменМобильноеПриложение.СкладАгента
		|ИЗ
		|	ПланОбмена.ОбменМобильноеПриложение КАК ОбменМобильноеПриложение
		|ГДЕ
		|	ОбменМобильноеПриложение.Ссылка = &УзелОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиМобильногоПриложения.СкладЗаказа
		|ИЗ
		|	Справочник.НастройкиМобильногоПриложения КАК НастройкиМобильногоПриложения
		|ГДЕ
		|	НастройкиМобильногоПриложения.Ссылка = &НастройкаМобильногоПриложения";
	
	Запрос.УстановитьПараметр("НастройкаМобильногоПриложения", УзелОбмена.ПрофильНастроек);
	Запрос.УстановитьПараметр("Подразделение", УзелОбмена.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	ЗаРегистрироватьИзменениеДанныхЦены(УзелОбмена,Неопределено,Запрос.МенеджерВременныхТаблиц);
		
КонецПроцедуры // ЗарегистрироватьИзмененияДанных()

Процедура ЗарегистрироватьИзменениеДанныхЦены(УзелОбмена,МассивЦен = Неопределено,МенеджерВременныхТаблиц=Неопределено)Экспорт
	
	 УстановитьПривилегированныйРежим(Истина);
	 Если МассивЦен = Неопределено Тогда
		 МассивЦен = УзелОбмена.ПрофильНастроек.ВидыЦен.ВыгрузитьКолонку("ВидЦены");
	 КонецЕсли;

	 Если МенеджерВременныхТаблиц = Неопределено Тогда
		 
		 Запрос = Новый Запрос;
		 Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		 Запрос.Текст = 
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		 |	МобильноеПриложениеСтруктураКаталога.Номенклатура КАК Номенклатура
		 |ПОМЕСТИТЬ ВТ_Номенклатура
		 |ИЗ
		 |	РегистрСведений.МобильноеПриложениеСтруктураКаталога КАК МобильноеПриложениеСтруктураКаталога
		 |ГДЕ
		 |	МобильноеПриложениеСтруктураКаталога.НастройкаМобильногоПриложения = &НастройкаМобильногоПриложения";
		 
		 Запрос.УстановитьПараметр("НастройкаМобильногоПриложения", УзелОбмена.ПрофильНастроек);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		 
	 КонецЕсли;
	 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Цены.Период КАК Период,
	|	Цены.ТипЦен КАК ТипЦен,
	|	Цены.Номенклатура КАК Номенклатура,
	|	Цены.Характеристика КАК Характеристика,
	|	Цены.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены КАК Цены
	|ГДЕ
	|	Цены.Период >= &Период
	|	И Цены.ТипЦен В(&МассивЦен)
	|	И Цены.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_Номенклатура.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТ_Номенклатура КАК ВТ_Номенклатура)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Период,
	|	ЦеныСрезПоследних.ТипЦен,
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.Характеристика,
	|	ЦеныСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Период,
	|			ТипЦен В (&МассивЦен)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Номенклатура.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Номенклатура КАК ВТ_Номенклатура)) КАК ЦеныСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивЦен", МассивЦен);
	
	Попытка 
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		ош = ОписаниеОшибки();
		ВызватьИсключение(ош);
	КонецПопытки;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		НаборЗаписей = РегистрыСведений.ЦеныДляРегистрации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ТипЦен.Установить(ВыборкаДетальныеЗаписи.ТипЦен);
		НаборЗаписей.Отбор.Номенклатура.Установить(ВыборкаДетальныеЗаписи.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(ВыборкаДетальныеЗаписи.Характеристика);
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора,ВыборкаДетальныеЗаписи,"ТипЦен,Номенклатура,Характеристика,Период");
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, НаборЗаписей);
	КонецЦикла;
	
	
	
КонецПроцедуры



Процедура ДобавитьСообщениеВОчередьСообщенийОбмена(УзелОбмена, НомерСообщенияОчереди, СообщениеОбмена) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МобильныйКлиент.Установить(УзелОбмена);
	НаборЗаписей.Отбор.НомерСообщения.Установить(НомерСообщенияОчереди);
	НаборЗаписей.Прочитать();
	
	// Если сообщение с таким номером уже есть в очереди, генерируем исключение.
	Если НаборЗаписей.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Обмен с мобильным клиентом.Добавление сообщения в очередь сообщений обмена';uk='Обмін з мобільним клієнтом.Додавання повідомлення в чергу повідомлень обміну'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			УзелОбмена,
			НСтр("ru = 'Очередь сообщений обмена уже содержит сообщение с номером " + НомерСообщенияОчереди + ".'"));
			
		// Обнуляем счетчики принятых и отправленных сообщений для перерегистрации и отправки всех данных при следующем обмене.
		ПереинициализироватьСчетчикиСообщенийНаУзлеПланаОбмена(УзелОбмена);
		
		ВызватьИсключение(НСтр("ru='Не удалось выполнить отправку данных. Подробности см. в Журнале регистрации информационной базы.';uk='Не вдалося виконати відправлення даних. Подробиці див. у Журналі реєстрації інформаційної бази.'"));
		
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.МобильныйКлиент = УзелОбмена;
	НоваяЗапись.НомерСообщения = НомерСообщенияОчереди;
	НоваяЗапись.СообщениеОбмена = СообщениеОбмена;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ДобавитьСообщениеВОчередьСообщенийОбмена()



#КонецОбласти



Процедура ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеОбмена, ОчиститьИзменения = Ложь, ЭтоНовыйОбмен = Ложь,СтруктураОтвета) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	Попытка
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	Исключение
		Ош = ОписаниеОшибки();
		ВызватьИсключение (ош);
	КонецПопытки;

	
	Если ОчиститьИзменения Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	КонецЕсли;
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://www.digma.ua/SB/MobileExchange", "Objects");
	
	Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
	ЗагрузитьОбъекты(УзелОбмена, Объекты,СтруктураОтвета);
	
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();
	
КонецПроцедуры // ОбработатьПринятыйПакетЗагрузки()



Процедура ЗагрузитьОбъекты(УзелОбмена, Объекты, СтруктураОтвета)
	
	ДокументыДляОтложенногоПроведения = Новый ТаблицаЗначений;
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("ДокументId");
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("ДокументТип");
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("Сообщение");
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("Успешно");
	ДокументыДляОтложенногоПроведения.Колонки.Добавить("Проведен");


	НастройкиУзлаОбмена = ПланыОбмена.ОбменМобильноеПриложение.НастройкиУзла(УзелОбмена);
	Если Объекты <> Неопределено Тогда
		Для каждого ОбъектXDTO Из Объекты.objects Цикл
			ТипОбъектаХDTO = ОбъектXDTO.Тип().Имя;
			Если ТипОбъектаХDTO = "DocInvoice" Тогда
				Если ОбъектXDTO.TypeDoc = "ПродажаМобильныйСклад" Тогда
					НайтиСоздатьОтгрузкуМобильныйСклад(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения);
				ИначеЕсли  ОбъектXDTO.TypeDoc = "ЗаказНаФизобмен" Тогда
					 НайтиСоздатьВозвратПокупателя(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения);
				Иначе
					НайтиСоздатьЗаказПокупателя(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	СериализоватьРеузльтатЗагрузки(ДокументыДляОтложенногоПроведения,СтруктураОтвета);
	
	
КонецПроцедуры // ЗагрузитьОбъекты()

Процедура НайтиСоздатьОтгрузкуМобильныйСклад(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения)
	
	
	
	УстановитьПривилегированныйРежим(Истина);

	СтрСообщение = ДокументыДляОтложенногоПроведения.Добавить();
	СтрСообщение.ДокументId = ОбъектXDTO.Id;
	СтрСообщение.ДокументТип = ОбъектXDTO.TypeDoc;
	СтрСообщение.Успешно = Истина;
	СтрСообщение.Проведен = Истина;

		
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Документы.РеализацияТоваров.ПолучитьСсылку(Идентификатор);

	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		Объект = Документы.РеализацияТоваров.СоздатьДокумент();
		Объект.УстановитьСсылкуНового(Ссылка);
	Иначе
		Если Объект.Проведен Тогда
			СтрСообщение.Сообщение = "Документ уже проведен, повторная загрузка не возможна!";
			СтрСообщение.Успешно = Ложь;
			Возврат;
		КонецЕсли;
		Объект.Товары.Очистить();
	КонецЕсли;
	
	Объект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.Автор = Пользователи.ТекущийПользователь();
	Объект.GuidСистемыСоздания =  ОбъектXDTO.Id;
	Объект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.BuyerUUID));
	Объект.ДоговорВзаиморасчетов =  Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ContracUUID));
	Объект.Организация = Объект.ДоговорВзаиморасчетов.Организация;
	Объект.ПодразделениеКомпании =  НастройкиУзлаОбмена.ПодразделениеКомпании;
	Объект.СкладКомпании         = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.StocItemUUID));
	Объект.ТочкаДоставки         = Справочники.ТочкиДоставки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.DeliveryUUID));
	Объект.ТипЦен =   Объект.ДоговорВзаиморасчетов.ТипЦен;
	Объект.ВалютаДокумента =   Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	Объект.КурсДокумента = 1;
	Объект.РегламентированныйУчет = ОбъектXDTO.Regl;
	Объект.Менеджер = Объект.ДоговорВзаиморасчетов.Менеджер;
	Объект.Ответственный = Объект.Автор.ФизическоеЛицо;
	Объект.ТорговаяПлощадка = Объект.СкладКомпании.ТорговаяПлощадка;
	Объект.Комментарий = ОбъектXDTO.Comment;


	ТаблицаТоваров =   ОбъектXDTO.Items;
	для Каждого СтрТовары Из ТаблицаТоваров.Item Цикл 
		 НоваяСтрока = Объект.Товары.Добавить();
		 НоваяСтрока.Номенклатура =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрТовары.NomUUID));
		 НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		 НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	 	 НоваяСтрока.КоличествоБазовое =   СтрТовары.Quantity;
		 НоваяСтрока.Количество =   СтрТовары.Quantity;
		 НоваяСтрока.Цена       =   СтрТовары.Price;
		 НоваяСтрока.Сумма      =   СтрТовары.Total;
		 НоваяСтрока.СуммаВсего  =   СтрТовары.Total;

	КонецЦикла;
	
	
	ТаблицаТоваровДкумент = Объект.Товары.Выгрузить();
	
	СтруктураДействий = Новый Структура;

	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Организация,ТорговаяПлощадка,ТипСтавкиНДС",Объект.Организация,Объект.ТорговаяПлощадка,"Реализация"));
	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");

	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваровДкумент, СтруктураДействий, Неопределено);
	
	Объект.Товары.Загрузить(ТаблицаТоваровДкумент);
	текстОшибки = "";
	Попытка
		
		Если Объект.ПроверитьЗаполнение()Тогда
			
			Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		Иначе
			Если Объект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				текстОшибки = текстОшибки + Объект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст()+Символы.ПС;	
			Иначе
				текстОшибки = текстОшибки + "Ошибка проверки корректности документа"+Символы.ПС;
			КонецЕсли;
			ВызватьИсключение(текстОшибки);
		КонецЕсли;

	Исключение
		опОшибка = ОписаниеОшибки();
		СтрСообщение.Сообщение = опОшибка;
		СтрСообщение.Успешно = Ложь;
		СтрСообщение.Проведен = Ложь;
	
	КонецПопытки;
	
	
	
КонецПроцедуры

Процедура НайтиСоздатьЗаказПокупателя(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения)
	
	СтрСообщение = ДокументыДляОтложенногоПроведения.Добавить();
	СтрСообщение.ДокументId = ОбъектXDTO.Id;
	СтрСообщение.ДокументТип = ОбъектXDTO.TypeDoc;
	СтрСообщение.Успешно = Истина;
	СтрСообщение.Проведен = Истина;

	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Документы.ЗаказПокупателя.ПолучитьСсылку(Идентификатор);
	
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		Объект = Документы.ЗаказПокупателя.СоздатьДокумент();
		Объект.УстановитьСсылкуНового(Ссылка);
	Иначе
		Если Объект.Проведен Тогда
			СтрСообщение.Сообщение = "Документ уже проведен, повторная загрузка не возможна!";
			СтрСообщение.Успешно = Ложь;

			Возврат;
		КонецЕсли;
		Объект.Товары.Очистить();
	КонецЕсли;
	
	Если ОбъектXDTO.TypeDoc = "ЗаказНаМобильныйСклад" Тогда
		ХозОперация = Справочники.ХозОперации.ЗаказПокупателяВнутреннийПроизводство;
	ИначеЕсли ОбъектXDTO.TypeDoc = "ЗаказНаФизобмен" Тогда	
		ХозОперация = Справочники.ХозОперации.ЗаказПокупателяФизОбмен;
	Иначе
		ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	КонецЕсли;
	
	
	СписокВидовДоговора = Новый СписокЗначений;
	СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));

	Объект.ХозОперация = ХозОперация;
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.Автор = Пользователи.ТекущийПользователь();
	Объект.GuidСистемыСоздания =  ОбъектXDTO.Id;
	Объект.ПодразделениеКомпании = НастройкиУзлаОбмена.ПодразделениеКомпании;
	Объект.ТорговаяПлощадка  = НастройкиУзлаОбмена.СкладЗаказа.ТорговаяПлощадка;
	Объект.СрокПоставки = ОбъектXDTO.DatePos;
	
	Если ОбъектXDTO.TypeDoc = "ЗаказНаМобильныйСклад" Тогда
		Объект.Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Объект.ТорговаяПлощадка,ТекущаяДатаСеанса());
		Объект.Контрагент = Объект.Организация.Контрагент;
		Объект.СкладКомпании = НастройкиУзлаОбмена.СкладЗаказа;
		Объект.ТорговаяПлощадкаПолучатель =  НастройкиУзлаОбмена.СкладАгента.ТорговаяПлощадка;
		Объект.ДоговорВзаиморасчетов = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(
		Объект.Контрагент,Объект.Организация,Объект.ПодразделениеКомпании,СписокВидовДоговора,,ТекущаяДатаСеанса());
		Объект.ТочкаДоставки = НастройкиУзлаОбмена.СкладАгента.ТочкаДоставки;
	Иначе
		Объект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.BuyerUUID));
		Объект.ДоговорВзаиморасчетов =  Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ContracUUID));
		Объект.Организация = Объект.ДоговорВзаиморасчетов.Организация;
		Объект.СкладКомпании         = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.StocItemUUID));
		Объект.ТочкаДоставки         = Справочники.ТочкиДоставки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.DeliveryUUID));
		
	КонецЕсли;
	
	Объект.ТипЦен =   Объект.ДоговорВзаиморасчетов.ТипЦен;
	Объект.ВалютаДокумента =   Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	Объект.КурсДокумента = 1;
	Объект.РегламентированныйУчет = ОбъектXDTO.Regl;
	Объект.Менеджер = Объект.Автор.ФизическоеЛицо;
	Объект.Комментарий = ОбъектXDTO.Comment;
	
	
	ТаблицаТоваров =   ОбъектXDTO.Items;
	для Каждого СтрТовары Из ТаблицаТоваров.Item Цикл 
		 НоваяСтрока = Объект.Товары.Добавить();
		 НоваяСтрока.Номенклатура =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрТовары.NomUUID));
		 НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		 НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	 	 НоваяСтрока.КоличествоБазовое =   СтрТовары.Quantity;
		 НоваяСтрока.Количество =   СтрТовары.Quantity;
		 НоваяСтрока.Цена       =   СтрТовары.Price;
		 НоваяСтрока.Сумма      =   СтрТовары.Total;
		 НоваяСтрока.СуммаВсего  =   СтрТовары.Total;

	КонецЦикла;
	
	ТаблицаТоваровДкумент = Объект.Товары.Выгрузить();
	
	
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Организация,ТорговаяПлощадка,ТипСтавкиНДС",Объект.Организация,Объект.ТорговаяПлощадка,"Реализация"));
	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
	
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	
	Если ОбъектXDTO.TypeDoc = "ЗаказНаМобильныйСклад" Тогда
		ТаблицаТоваровДкумент.Колонки.Добавить("ГруппаЦенообразования");
		ТаблицаТоваровДкумент.Колонки.Добавить("ТипЦен");
		ТаблицаТоваровДкумент.Колонки.Добавить("ХарактеристикиИспользуются");
		ТаблицаТоваровДкумент.Колонки.Добавить("Остаток");
		
		
		СтруктураДействий.Вставить("ЗаполнитьГруппуЦенообразования",	Новый Структура("Номенклатура","ГруппаЦенообразования"));
		СтруктураДействий.Вставить("ЦеныИзДоговора",ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровТипаЦенПоДоговору(Объект));
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект));
		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
		СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);
		
	КонецЕсли;
	
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваровДкумент, СтруктураДействий, Неопределено);
	
	Объект.Товары.Загрузить(ТаблицаТоваровДкумент);
	
	
	текстОшибки = "";
	
	Попытка
		Если Объект.ПроверитьЗаполнение()Тогда
			Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		Иначе
			Если Объект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				текстОшибки = текстОшибки + Объект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст()+Символы.ПС;	
			Иначе
				текстОшибки = текстОшибки + "Ошибка проверки корректности документа"+Символы.ПС;
			КонецЕсли;
			ВызватьИсключение(текстОшибки);
		КонецЕсли;

	Исключение
		опОшибка = ОписаниеОшибки();
		СтрСообщение.Сообщение = опОшибка;
		СтрСообщение.Успешно = Ложь;
		СтрСообщение.Проведен = Ложь;

	КонецПопытки;
	

	
КонецПроцедуры

Процедура НайтиСоздатьВозвратПокупателя(ОбъектXDTO,НастройкиУзлаОбмена,ДокументыДляОтложенногоПроведения)
	
	СтрСообщение = ДокументыДляОтложенногоПроведения.Добавить();
	СтрСообщение.ДокументId = ОбъектXDTO.Id;
	СтрСообщение.ДокументТип = ОбъектXDTO.TypeDoc;
	СтрСообщение.Успешно = Истина;
	СтрСообщение.Проведен = Истина;

	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(ОбъектXDTO.Id);
	Ссылка = Документы.ВозвратОтПокупателя.ПолучитьСсылку(Идентификатор);
	
	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		Объект = Документы.ВозвратОтПокупателя.СоздатьДокумент();
		Объект.УстановитьСсылкуНового(Ссылка);
	Иначе
		Если Объект.Проведен Тогда
			СтрСообщение.Сообщение = "Документ уже проведен, повторная загрузка не возможна!";
			СтрСообщение.Успешно = Ложь;

			Возврат;
		КонецЕсли;
		Объект.Товары.Очистить();
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателя;
	
	//
	//СписокВидовДоговора = Новый СписокЗначений;
	//СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));

	Объект.ХозОперация = ХозОперация;
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.Автор = Пользователи.ТекущийПользователь();
	Объект.GuidСистемыСоздания =  ОбъектXDTO.Id;
	Объект.ПодразделениеКомпании = НастройкиУзлаОбмена.ПодразделениеКомпании;
	Объект.ТорговаяПлощадка  = НастройкиУзлаОбмена.СкладЗаказа.ТорговаяПлощадка;
	
	Объект.Контрагент            = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.BuyerUUID));
	Объект.ДоговорВзаиморасчетов =  Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ContracUUID));
	Объект.Организация           = Объект.ДоговорВзаиморасчетов.Организация;
	Если ЗначениеЗаполнено(НастройкиУзлаОбмена.СкладВозвратов) Тогда
		Объект.СкладКомпании = НастройкиУзлаОбмена.СкладВозвратов;
	Иначе
		Объект.СкладКомпании = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.StocItemUUID));
	КонецЕсли;
	Объект.ТочкаДоставки         = Справочники.ТочкиДоставки.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.DeliveryUUID));
		
	
	Объект.ТипЦен =   Объект.ДоговорВзаиморасчетов.ТипЦен;
	Объект.ВалютаДокумента =   Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	Объект.КурсДокумента = 1;
	Объект.РегламентированныйУчет = ОбъектXDTO.Regl;
	//*Объект.Менеджер = Объект.Автор.ФизическоеЛицо;
	Объект.Комментарий = ОбъектXDTO.Comment;
	
	
	ТаблицаТоваров =   ОбъектXDTO.Items;
	для Каждого СтрТовары Из ТаблицаТоваров.Item Цикл 
		 НоваяСтрока = Объект.Товары.Добавить();
		 НоваяСтрока.Номенклатура =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрТовары.NomUUID));
		 НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		 НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	 	 НоваяСтрока.КоличествоБазовое =   СтрТовары.Quantity;
		 НоваяСтрока.Количество =   СтрТовары.Quantity;
		 НоваяСтрока.Цена       =   СтрТовары.Price;
		 НоваяСтрока.Сумма      =   СтрТовары.Total;
		 НоваяСтрока.СуммаВсего  =   СтрТовары.Total;

	КонецЦикла;
	
	ТаблицаТоваровДкумент = Объект.Товары.Выгрузить();
	
	
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Организация,ТорговаяПлощадка,ТипСтавкиНДС",Объект.Организация,Объект.ТорговаяПлощадка,"Реализация"));
	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
	
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТаблицаТоваровДкумент, СтруктураДействий, Неопределено);
	
	Объект.Товары.Загрузить(ТаблицаТоваровДкумент);
	
	
	текстОшибки = "";
	
	Попытка
		Если Объект.ПроверитьЗаполнение()Тогда
			Объект.Записать(РежимЗаписиДокумента.Запись);
		Иначе
			Если Объект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				текстОшибки = текстОшибки + Объект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст()+Символы.ПС;	
			Иначе
				текстОшибки = текстОшибки + "Ошибка проверки корректности документа"+Символы.ПС;
			КонецЕсли;
			ВызватьИсключение(текстОшибки);
		КонецЕсли;

	Исключение
		опОшибка = ОписаниеОшибки();
		СтрСообщение.Сообщение = опОшибка;
		СтрСообщение.Успешно = Ложь;
		СтрСообщение.Проведен = Ложь;

	КонецПопытки;
	

	
КонецПроцедуры


Процедура СериализоватьРеузльтатЗагрузки(ДокументыДляОтложенногоПроведения,СтруктураОтвета)
	
	Если ДокументыДляОтложенногоПроведения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВС = СоздатьОбъектXDTO("Objects");
	
	Для Каждого СтрДок Из ДокументыДляОтложенногоПроведения Цикл 
		
		ПередаваемыйОбъект = СоздатьОбъектXDTO("result");
		ПередаваемыйОбъект.Id = СтрДок.ДокументId;
		ПередаваемыйОбъект.Name = СтрДок.ДокументТип;
		ПередаваемыйОбъект.ReadOnly = СтрДок.Успешно;
		ПередаваемыйОбъект.Comment = СтрДок.Сообщение;
		ПередаваемыйОбъект.prov = СтрДок.Проведен;

		ВС.objects.Добавить(ПередаваемыйОбъект);
		
	КонецЦикла;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВС);
	
	
	СообщениеОбмена = Новый ХранилищеЗначения(ЗаписьXML.Закрыть());
	СтруктураОтвета.ДанныеОбмена = СообщениеОбмена;

КонецПроцедуры
