#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для передачи в параметрах вспомогательных методов (см. ниже).
//       Соответствует 1 параметру процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки этого отчета,
//       уже сформированные при помощи функции ВариантыОтчетов.ОписаниеОтчета() и готовые к изменению.
//       См. "Свойства для изменения" процедуры ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь);
//
// Примеры:
//
//  1. Установка описания варианта.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Описание = НСтр("ru = '<Описание>'");
//
//  2. Отключение варианта отчета.
//    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//    НастройкиВарианта.Включен = Ложь;
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиОтчета.Размещение.Вставить(Метаданные.Подсистемы.ТК_Анкетирование);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыАнкетирования");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по результатам анкетирования списком'; uk = 'Звіт по результатам анкетування списком'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТК_Анкетирование);
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыПодробные");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по результатам анкетирования подробно'; uk = 'Звіт по результатам анкетування детально'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТК_Анкетирование);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыШтрафы");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по штрафам и премиям'; uk = 'Звіт по штрафам та преміям'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТК_Анкетирование);	
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "БланкНачисленийПоАнкетам");
	//НастройкиВарианта.Описание = НСтр("ru = 'Бланк начислений'; uk = 'Звіт по штрафам та преміям'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТК_Анкетирование);	
	
	
КонецПроцедуры
   
Функция ПолучитьWSСсылкуЗарплатаАттика(Пользователь = "", Пароль = "") Экспорт 
	
	ВсеОк = Истина;	
	WS = Неопределено;
	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда 
		Пользователь = "obmenTK_ws";
		Пароль = "<fhf<fy";	
	КонецЕсли;
	
	Попытка
		
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/work_UU_Zarplata_Attika/ws/cwd2.1cws?wsdl", Пользователь, Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));               
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пользователь = Пользователь;
		WS.Пароль = Пароль;
		
	Исключение 
		ВсеОк = Ложь;
		Результат.Вставить("Сообщение", ОписаниеОшибки());		
	КонецПопытки;
	
	Результат.Вставить("Успешно", ВсеОк);
	Результат.Вставить("WS", WS);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти
	
	
	
	
	
	
	
	
	
	
#КонецЕсли