
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		ПартионныйУчет.ТекстЗапросаВтТекущиеДвиженияПартииТоваров(ТекстыЗапроса);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПроведениеПоПартиям") Тогда	
		
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
		//	ПартионныйУчет.ТекстЗапросаВтТекущиеДвиженияПартииТоваров(ТекстыЗапроса);
		
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		ПартионныйУчет.ПодготовитьТаблицуСписанияПартийТоваровПеремещение(Запрос, ДополнительныеСвойства);
		ПартионныйУчет.ПодготовитьТаблицуОприходованияТоваров(Запрос, ДополнительныеСвойства);
		ПартионныйУчет.ПодготовитьТаблицуТоваровТМП(Запрос, ДополнительныеСвойства);
		
		
	Иначе
		
		ТекстЗапросаВтТаблицаЗаказы(Запрос, ТекстыЗапроса, Регистры);
		
		ТекстЗапросаТаблицаОстаткиТоваровКомпании(Запрос, ТекстыЗапроса, Регистры);
		Если НЕ ДополнительныеСвойства.ДляПроведения.БратьСтоимостьИзДокумента Тогда
			ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры);
		КонецЕсли;
		
		//Если ДокументСсылка.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
		//	ТекстЗапросаТаблицаОбработкаЗаказовПоставщику(Запрос, ТекстыЗапроса, Регистры);
		//КонецЕсли;
		
		// Исполнение запроса и выгрузка полученных таблиц для движений.
		ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
		ПартионныйУчет.ПодготовитьТаблицуСписанияПартийТоваровПеремещение(Запрос, ДополнительныеСвойства);
		ПартионныйУчет.ПодготовитьТаблицуОприходованияТоваров(Запрос, ДополнительныеСвойства);
		ПартионныйУчет.ПодготовитьТаблицуТоваровТМП(Запрос, ДополнительныеСвойства);
		
		Если ДополнительныеСвойства.ДляПроведения.ЗакрытиеЗаказов < 2 Тогда
			ЗаказыСервер.ПодготовитьТаблицуЗакрытияЗаказовПокупателя(Запрос, ДополнительныеСвойства);
			ЗаказыСервер.ПодготовитьТаблицуЗакрытияРезервовПокупателя(Запрос, ДополнительныеСвойства);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;//Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ХозОперация КАК ХозОперация,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
	|	ДанныеДокумента.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ДанныеДокумента.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ДанныеДокумента.СкладКомпанииПолучатель
	|		ИНАЧЕ ДанныеДокумента.СкладКомпании
	|	КОНЕЦ КАК СкладКомпании,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ДанныеДокумента.СкладКомпанииПолучатель.ТипЦенСебестоимости
	|		ИНАЧЕ ДанныеДокумента.СкладКомпании.ТипЦенСебестоимости
	|	КОНЕЦ КАК ТипЦенСебестоимости,
	|	ДанныеДокумента.КурсДокумента КАК КурсДокумента,
	|	ДанныеДокумента.РегламентированныйУчет КАК РегламентированныйУчет,
	|	ДанныеДокумента.ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель,
	|	ДанныеДокумента.СкладКомпании КАК СкладКомпанииОтправитель,
	|	ДанныеДокумента.СкладКомпанииПолучатель КАК СкладКомпанииПолучатель,
	|	ДанныеДокумента.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДанныеДокумента.БратьСтоимостьИзДокумента КАК БратьСтоимостьИзДокумента,
	|	ДанныеДокумента.ЗакрытиеЗаказовПокупателей КАК ЗакрытиеЗаказовПокупателей,
	|	ДанныеДокумента.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СтатьяВозврата = ЗНАЧЕНИЕ(Справочник.СтатьиВозврата.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДанныеДокумента.СкладКомпанииПолучатель = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДокумента.СкладКомпанииПолучатель.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
	|	КОНЕЦ КАК ПолучательТНП,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СкладКомпании = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ДанныеДокумента.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
	|	КОНЕЦ КАК ОтправительТНП,
	|	ДанныеДокумента.СтатьяВозврата КАК СтатьяВозврата
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	ХарактеристикиОтклОтправитель 	= Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(Реквизиты.СкладКомпанииОтправитель, Реквизиты.Период);
	ХарактеристикиОтклПолучатель 	= Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(Реквизиты.СкладКомпанииПолучатель, Реквизиты.Период);
	
	
	Запрос.УстановитьПараметр("Ссылка",                                   ДокументСсылка);
	Запрос.УстановитьПараметр("МоментВремени",                            Новый МоментВремени(Реквизиты.Период,ДокументСсылка));
	Запрос.УстановитьПараметр("Период",                                   Реквизиты.Период);
	Запрос.УстановитьПараметр("НачалоМесяцаПериода",                      НачалоМесяца(Реквизиты.Период));
	Запрос.УстановитьПараметр("Валюта",                                   Реквизиты.Валюта);
	Запрос.УстановитьПараметр("Организация",                              Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",                    Реквизиты.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ТорговаяПлощадка",                         Реквизиты.ТорговаяПлощадка);
	Запрос.УстановитьПараметр("ТорговаяПлощадкаПолучатель",               Реквизиты.ТорговаяПлощадкаПолучатель);
	Запрос.УстановитьПараметр("СкладКомпании",                            Реквизиты.СкладКомпании);
	Запрос.УстановитьПараметр("СкладКомпанииПолучатель",                  Реквизиты.СкладКомпанииПолучатель);
	Запрос.УстановитьПараметр("ТипЦенСебестоимости",                      Реквизиты.ТипЦенСебестоимости);
	Запрос.УстановитьПараметр("ДокументОтгрузки",                         Реквизиты.ДокументОтгрузки);
	Запрос.УстановитьПараметр("ХозОперация",                              Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("ДокументОснование",                        Реквизиты.ДокументОснование);
	
	Запрос.УстановитьПараметр("ХарактеристикиОтклОтправитель",            ХарактеристикиОтклОтправитель);
	Запрос.УстановитьПараметр("ХарактеристикиОтклПолучатель",             ХарактеристикиОтклПолучатель);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании",Реквизиты.ПодразделениеКомпании);
	ДополнительныеСвойства.ДляПроведения.Вставить("ТорговаяПлощадка",Реквизиты.ТорговаяПлощадка);
	ДополнительныеСвойства.ДляПроведения.Вставить("СкладКомпании",Реквизиты.СкладКомпании);
	ДополнительныеСвойства.ДляПроведения.Вставить("СкладКомпанииПолучатель",Реквизиты.СкладКомпанииПолучатель);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ТипЦенСебестоимости",Реквизиты.ТипЦенСебестоимости);
	ДополнительныеСвойства.ДляПроведения.Вставить("Валюта",Реквизиты.Валюта);
	ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента",Реквизиты.КурсДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("ТипЦенСебестоимости",Реквизиты.ТипЦенСебестоимости);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет",Реквизиты.РегламентированныйУчет);
	ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация",Реквизиты.ХозОперация);
	ДополнительныеСвойства.ДляПроведения.Вставить("ДокументОтгрузки",Реквизиты.ДокументОтгрузки);
	ДополнительныеСвойства.ДляПроведения.Вставить("БратьСтоимостьИзДокумента",Реквизиты.БратьСтоимостьИзДокумента);
	ДополнительныеСвойства.ДляПроведения.Вставить("ЗакрытиеЗаказов",Реквизиты.ЗакрытиеЗаказовПокупателей);
	ДополнительныеСвойства.ДляПроведения.Вставить("ДокументОснование",Реквизиты.ДокументОснование);
	ДополнительныеСвойства.ДляПроведения.Вставить("ПолучательТНП",Реквизиты.ПолучательТНП);
	ДополнительныеСвойства.ДляПроведения.Вставить("ОтправительТНП",Реквизиты.ОтправительТНП);
	ДополнительныеСвойства.ДляПроведения.Вставить("СтатьяВозврата",Реквизиты.СтатьяВозврата);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ХарактеристикиОтклОтправитель", ХарактеристикиОтклОтправитель);
	ДополнительныеСвойства.ДляПроведения.Вставить("ХарактеристикиОтклПолучатель", ХарактеристикиОтклПолучатель);
	ДополнительныеСвойства.ДляПроведения.Вставить("СтрокВДокументе", ДокументСсылка.Товары.Количество());
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТовары";
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДокТовары.НомерСтроки КАК НомерСтроки,
	|	ДокТовары.Номенклатура КАК Номенклатура,
	|	ДокТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДокТовары.Коэффициент КАК Коэффициент,
	|	ДокТовары.КоличествоБазовое КАК Количество,
	|	ДокТовары.Цена КАК Цена,
	|	ДокТовары.Сумма КАК Сумма,
	|	ДокТовары.СтавкаНДС КАК СтавкаНДС,
	|	ДокТовары.СуммаНДС КАК СуммаНДС,
	|	ДокТовары.СуммаВсего КАК СуммаВсего,
	|	ДокТовары.Ссылка.ХозОперация КАК ХозОперация,
	|	ДокТовары.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ДокТовары.Ссылка.СкладКомпанииПолучатель КАК СкладКомпанииПолучатель,
	|	ДокТовары.Ссылка.РегламентированныйУчет КАК РегламентированныйУчет,
	|	ВЫБОР
	|		КОГДА ДокТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ВыпускПродукции
	|			ТОГДА ВЫРАЗИТЬ(ДокТовары.Ссылка.ДокументОснование КАК Документ.ВыпускПродукции)
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Партия
	|ПОМЕСТИТЬ ВтТаблицаТовары
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ДокТовары
	|ГДЕ
	|	ДокТовары.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаЗаказы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ВтТаблицаЗаказы";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли;
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПеремещениеТоваровРаспределениеОтгрузки.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВтТаблицаЗаказы
	|ИЗ
	|	Документ.ПеремещениеТоваров.РаспределениеОтгрузки КАК ПеремещениеТоваровРаспределениеОтгрузки
	|ГДЕ
	|	ПеремещениеТоваровРаспределениеОтгрузки.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ИЛИ &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров)
	|				ТОГДА ПеремещениеТоваровРаспределениеОтгрузки.ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваров.ДокументОснование
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ИЛИ &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров)
	|				ТОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОстаткиТоваровКомпании(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ОстаткиТоваровКомпании";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ВтТаблицаТовары.СкладКомпании КАК СкладКомпании,
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклОтправитель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
	|	ВтТаблицаТовары.ХозОперация КАК ХозОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХозОперация,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.СкладКомпании,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклОтправитель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	ВтТаблицаТовары.СкладКомпанииПолучатель,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклПолучатель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ,
	|	СУММА(ВтТаблицаТовары.Количество),
	|	ВтТаблицаТовары.ХозОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХозОперация,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.СкладКомпанииПолучатель,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклПолучатель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	ВтТаблицаТовары.СкладКомпании,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклОтправитель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ,
	|	СУММА(ВтТаблицаТовары.Количество),
	|	ВтТаблицаТовары.ХозОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХозОперация,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.СкладКомпании,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклОтправитель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&Период,
	|	ВтТаблицаТовары.СкладКомпанииПолучатель,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклПолучатель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ,
	|	СУММА(ВтТаблицаТовары.Количество),
	|	ВтТаблицаТовары.ХозОперация
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.ХозОперация,
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.СкладКомпанииПолучатель,
	|	ВЫБОР
	|		КОГДА &ХарактеристикиОтклПолучатель
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|	КОНЕЦ"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаТоварыКПоступлению(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ТоварыКПоступлению";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="
	// Перемещение в филиал
	|	ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Ссылка КАК ДокументПоступления,
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВтТаблицаТовары.Количество) КАК КПоступлению,
	|	&ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	&ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|
	| ОБЪЕДИНИТЬ ВСЕ
	|
	// Перемещение в из филиала
	//
	|	ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&ДокументОтгрузки КАК ДокументПоступления,
	|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВтТаблицаТовары.Количество) КАК КПоступлению,
	|	&ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадка,
	|	&ПодразделениеКомпании КАК ПодразделениеКомпании
	
	|ИЗ
	|	ВтТаблицаТовары КАК ВтТаблицаТовары
	|ГДЕ
	|	ВтТаблицаТовары.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТаблицаТовары.Номенклатура,
	|	ВтТаблицаТовары.ХарактеристикаНоменклатуры
	|"; 
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОбработкаЗаказовПоставщику(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ОбработкаЗаказовПоставщику";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	//Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
	//	ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	//КонецЕсли;
	
	Если ТипЗнч(Запрос.Параметры.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ТекстЗапроса ="ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	ЗаказПокупателяРаспределениеЗаказовПоставщиков.ЗаказПоставщику КАК ЗаказПоставщику,
		|	&ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадка,
		|	1 КАК Обработан,
		|	&ХозОперация КАК ХозОперация
		|ИЗ
		|	Документ.ЗаказПокупателя.РаспределениеЗаказовПоставщиков КАК ЗаказПокупателяРаспределениеЗаказовПоставщиков
		|ГДЕ
		|	ЗаказПокупателяРаспределениеЗаказовПоставщиков.Ссылка = &ДокументОснование";
		
	ИначеЕсли ТипЗнч(Запрос.Параметры.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ТекстЗапроса ="ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	&ДокументОснование КАК ЗаказПоставщику,
		|	&ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадка,
		|	1 КАК Обработан,
		|	&ХозОперация КАК ХозОперация
		|ГДЕ
		|	&ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)";
	Иначе
		Возврат "";
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти


#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("ПартииТоваров");	
	
	ТаблицаПоследовательности = Новый ТаблицаЗначений;
	ТаблицаПоследовательности.Колонки.Добавить("Период");
	ТаблицаПоследовательности.Колонки.Добавить("Регистратор");
	ТаблицаПоследовательности.Колонки.Добавить("СкладКомпании");
	
	НоваяСтрока = ТаблицаПоследовательности.Добавить();
	НоваяСтрока.Регистратор   = Ссылка;
	НоваяСтрока.СкладКомпании = ДополнительныеСвойства.ДляПроведения.СкладКомпании;
	НоваяСтрока.Период   	  = Ссылка.Дата;
	
	Если ДополнительныеСвойства.ДляПроведения.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
		НоваяСтрока = ТаблицаПоследовательности.Добавить();
		НоваяСтрока.Регистратор   = Ссылка;
		НоваяСтрока.СкладКомпании = ДополнительныеСвойства.ДляПроведения.СкладКомпанииПолучатель;
		НоваяСтрока.Период   	  = Ссылка.Дата;
		
	КонецЕсли;
	
	ТаблицыДляПоследовательности.ПартииТоваров = ТаблицаПоследовательности;
	
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности",ТаблицыДляПоследовательности);
	
КонецПроцедуры


#КонецОбласти


#Область ПрограммныйИнтерфейс

// Заполняет таблицу реквизитов, зависимых от хозяйственной операции
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - хозяйственная операция соглашения
//	МассивВсехРеквизитов - Массив - реквизиты, которые не зависят от хозяйственной операции
//	МассивРеквизитовОперации - Массив - реквизиты, которые зависят от хозяйственной операции
//
Процедура ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("ТорговаяПлощадка");
	МассивВсехРеквизитов.Добавить("ТорговаяПлощадкаПолучатель");
	
	МассивРеквизитовОперации = Новый Массив;
	
	Если ХозяйственнаяОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Перемещение товаров
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "Документ.ПеремещениеТоваров";
	КомандаПечати.Идентификатор = "ПеремещениеТоваров";
	КомандаПечати.Представление = НСтр("ru = 'Перемещение товаров';uk='Переміщення товарів'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
	// Перемещение товаров 2 шт.
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "Документ.ПеремещениеТоваров";
	КомандаПечати.Идентификатор = "ПеремещениеТоваровДвойная";
	КомандаПечати.Представление = НСтр("ru = 'Перемещение товаров 2 шт. на лист';uk='Переміщення товарів 2 шт. на лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; 		
	
	// Перемещение товаров Вендинг
	КомандаПечати = КомандыПечати.Добавить(); 
	КомандаПечати.МенеджерПечати = "Документ.ПеремещениеТоваров";
	КомандаПечати.Идентификатор = "ПеремещениеТоваровВендинг";
	КомандаПечати.Представление = НСтр("ru = 'Перемещение товаров Вендинг';uk='Переміщення товарів Вендінг'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	МассивУсловийРН = Новый Массив;
	МассивУсловийРН.Добавить(Новый Структура("Реквизит, ВидСравнения, Значение", 
	"СкладКомпании.ИД_Автомата",
	ПредопределенноеЗначение("ВидСравнения.Больше"),
	0));		
	//КомандаПечати.УсловияВидимости.Добавить(Новый Структура("Реквизит,ВидСравнения","СкладКомпании.ИД_Автомата",ВидСравненияКомпоновкиДанных.Заполнено)); 		
	КомандаПечати.УсловияВидимости=МассивУсловийРН; 		
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И (ЗначениеРазрешено(ТорговаяПлощадка)
	|		ИЛИ ЗначениеРазрешено(ТорговаяПлощадкаПолучатель))";
	
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Устанавливает параметры загрузки.
//
// Параметры:
//  Параметры - Структура - параметры загрузки данных из файла.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                               находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                               являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	Товары = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Штрихкод КАК СТРОКА(200)) КАК Штрихкод,
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(25)) КАК Артикул,
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Номенклатура КАК СТРОКА(100)) КАК Номенклатура,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставления
	|ИЗ
	|	&ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Ссылка,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоАртикулу
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО ДанныеДляСопоставления.Артикул = спрНоменклатура.Артикул
	|			И (ДанныеДляСопоставления.Артикул <> """")
	|			И (НЕ спрНоменклатура.ЭтоГруппа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСопоставления.Штрихкод КАК Штрихкод,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставленияПоШтрихКоду
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|ГДЕ
	|	НЕ ДанныеДляСопоставления.Идентификатор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу)
	|	И ДанныеДляСопоставления.Штрихкод <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Ссылка,
	|	ДанныеДляСопоставленияПоШтрихКоду.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоШтрихкоду
	|ИЗ
	|	ДанныеДляСопоставленияПоШтрихКоду КАК ДанныеДляСопоставленияПоШтрихКоду
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ДанныеДляСопоставленияПоШтрихКоду.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСопоставления.Номенклатура КАК Номенклатура,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставленияПоНаименованию
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|ГДЕ
	|	НЕ ДанныеДляСопоставления.Идентификатор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу
	|		
	|				ОБЪЕДИНИТЬ ВСЕ
	|		
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоШтрихкоду КАК СопоставленнаяНоменклатураПоШтрихкоду)
	|	И ДанныеДляСопоставления.Номенклатура <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Ссылка,
	|	ДанныеДляСопоставленияПоНаименованию.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоНаименованию
	|ИЗ
	|	ДанныеДляСопоставленияПоНаименованию КАК ДанныеДляСопоставленияПоНаименованию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО ДанныеДляСопоставленияПоНаименованию.Номенклатура = спрНоменклатура.Наименование
	|			И (НЕ спрНоменклатура.ЭтоГруппа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоНаименованию.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоНаименованию.Ссылка) КАК Ссылка,
	|	""Наименование"" КАК ПолеПоиска,
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоНаименованию.Идентификатор) КАК Количество
	|ИЗ
	|	СопоставленнаяНоменклатураПоНаименованию КАК СопоставленнаяНоменклатураПоНаименованию
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоНаименованию.Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоАртикулу.Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоАртикулу.Ссылка),
	|	""Артикул"",
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоАртикулу.Идентификатор)
	|ИЗ
	|	СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоАртикулу.Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоШтрихкоду.Ссылка),
	|	""Штрихкод"",
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор)
	|ИЗ
	|	СопоставленнаяНоменклатураПоШтрихкоду КАК СопоставленнаяНоменклатураПоШтрихкоду
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор";
	
	Запрос.УстановитьПараметр("ДанныеДляСопоставления", ЗагружаемыеДанные);
	
	ТаблицаНоменклатура = Запрос.Выполнить().Выгрузить();	
	ТаблицаНоменклатура.Индексы.Добавить("Идентификатор");
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл 
		Товар = Товары.Добавить();
		
		Товар.Идентификатор = СтрокаТаблицы.Идентификатор;
		Товар.Количество = СтрокаТаблицы.Количество;
		
		нСтрока = ТаблицаНоменклатура.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		Если нСтрока <> Неопределено Тогда 			
			Если нСтрока.Количество = 1 Тогда 
				
				Товар.Номенклатура = нСтрока.Ссылка;			
				
			ИначеЕсли нСтрока.Количество > 1 Тогда 
				
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор;
				ЗаписьОНеоднозначности.Колонка = "Номенклатура";
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	ПоместитьВоВременноеХранилище(Товары, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//    ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//    ИмяКолонки               - Строка - Имя колонки, в который возникла неоднозначность. 
//    СписокНеоднозначностей    - Массив  - Массив для заполнения с неоднозначными данными.
//    ЗагружаемыеЗначенияСтрока - Строка  - Загружаемые данные, на основании которых возникла неоднозначность.
//    ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "Номенклатура" Тогда 
		Запрос = Новый Запрос;
		
		ТекстГде = "";
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Артикул) Тогда 
			ТекстГде = "И спрНоменклатура.Артикул = &Артикул";
			Запрос.УстановитьПараметр("Артикул", ЗагружаемыеЗначенияСтрока.Артикул);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Номенклатура) Тогда 
			ТекстГде = ?(ПустаяСтрока(ТекстГде), "И ", ТекстГде + " ИЛИ ") + "спрНоменклатура.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Номенклатура);
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК спрНоменклатура
		|ГДЕ
		|	НЕ спрНоменклатура.ЭтоГруппа" + ТекстГде;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла


Процедура ЗаполнитьХарактеристикиПоОстаткамПартий(ДокументОбъект) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаЗаполнения = ДокументОбъект.Дата;
	Если Не ЗначениеЗаполнено(ДатаЗаполнения) Тогда 
		ДатаЗаполнения = ТекущаяДата();
	КонецЕсли;
	
	Если Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокументОбъект.СкладКомпании, ДатаЗаполнения) Тогда 
		Возврат;
	КонецЕсли;		
	
	ТаблЧастьТовары = ДокументОбъект.Товары;
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("МоментВремени", ДокументОбъект.МоментВремени());
	Запрос.УстановитьПараметр("Склад", ДокументОбъект.СкладКомпании);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("тчТовары", ТаблЧастьТовары.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеТоваровТовары.Коэффициент КАК Коэффициент,
	|	ПеремещениеТоваровТовары.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Товары
	|ИЗ
	|	&тчТовары КАК ПеремещениеТоваровТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(вт_Товары.НомерСтроки) КАК нСтр,
	|	вт_Товары.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	вт_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	вт_Товары.Коэффициент КАК Коэффициент,
	|	СУММА(вт_Товары.Количество) КАК Количество,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(вт_Товары.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик, ЛОЖЬ) КАК ХарактеристикиИспользуются
	|ПОМЕСТИТЬ сверн_Товары
	|ИЗ
	|	вт_Товары КАК вт_Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Товары.Номенклатура,
	|	вт_Товары.ЕдиницаИзмерения,
	|	вт_Товары.Коэффициент,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(вт_Товары.Номенклатура КАК Справочник.Номенклатура).ИспользованиеХарактеристик, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.Сортировка КАК Сортировка,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			СкладКомпании = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						сверн_Товары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						сверн_Товары КАК сверн_Товары
	|					ГДЕ
	|						сверн_Товары.ХарактеристикиИспользуются)) КАК ОстаткиТоваровКомпанииОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
	|	РезервыТоваровОстатки.Характеристика КАК Характеристика,
	|	РезервыТоваровОстатки.РезервОстаток КАК РезервОстаток
	|ПОМЕСТИТЬ вт_Резервы
	|ИЗ
	|	РегистрНакопления.РезервыТоваров.Остатки(
	|			,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						сверн_Товары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						сверн_Товары КАК сверн_Товары
	|					ГДЕ
	|						сверн_Товары.ХарактеристикиИспользуются)) КАК РезервыТоваровОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Остатки.Номенклатура КАК Номенклатура,
	|	вт_Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	вт_Остатки.КоличествоОстаток - ЕСТЬNULL(вт_Резервы.РезервОстаток, 0) КАК КолВоСвободно
	|ИЗ
	|	вт_Остатки КАК вт_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Резервы КАК вт_Резервы
	|		ПО вт_Остатки.Номенклатура = вт_Резервы.Номенклатура
	|			И вт_Остатки.ХарактеристикаНоменклатуры = вт_Резервы.Характеристика
	|ГДЕ
	|	вт_Остатки.КоличествоОстаток - ЕСТЬNULL(вт_Резервы.РезервОстаток, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт_Остатки.Номенклатура,
	|	вт_Остатки.Сортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	сверн_Товары.нСтр КАК нСтр,
	|	сверн_Товары.Номенклатура КАК Номенклатура,
	|	сверн_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	сверн_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	сверн_Товары.Коэффициент КАК Коэффициент,
	|	сверн_Товары.Количество КАК Количество,
	|	сверн_Товары.ХарактеристикиИспользуются КАК ХарактеристикиИспользуются
	|ИЗ
	|	сверн_Товары КАК сверн_Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	нСтр";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	тзХарактеристики = МассивРезультатов[4].Выгрузить();
	тзХарактеристики.Индексы.Добавить("Номенклатура");
	
	тзТовары = МассивРезультатов[5].Выгрузить();
	
	ТаблЧастьТовары.Очистить();
	
	Для Каждого стрТовары Из тзТовары Цикл 
		текКоэффициент = ?(стрТовары.Коэффициент = 0, 1, стрТовары.Коэффициент);
		КолВоСписатьБаз = стрТовары.Количество * текКоэффициент;
		
		нСтроки = тзХарактеристики.НайтиСтроки(Новый Структура("Номенклатура", стрТовары.Номенклатура));	
		Для Каждого стрХарактеристика Из нСтроки Цикл 
			текСвободно = стрХарактеристика.КолВоСвободно;
			Если текСвободно < 1 Тогда 
				Продолжить;
			КонецЕсли;
			
			КолВоСписать = Цел(Мин(КолВоСписатьБаз, текСвободно)/текКоэффициент);
			Если КолВоСписать > 0 Тогда 
				НоваяСтрока = ТаблЧастьТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
				НоваяСтрока.ХарактеристикаНоменклатуры = стрХарактеристика.ХарактеристикаНоменклатуры;
				НоваяСтрока.Количество = КолВоСписать;
				
				КолВоСписатьБаз = КолВоСписатьБаз - КолВоСписать * текКоэффициент;
				стрХарактеристика.КолВоСвободно = текСвободно - КолВоСписать * текКоэффициент;
			КонецЕсли;
			
			Если КолВоСписатьБаз < 1 Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;			
		
		Если КолВоСписатьБаз > 0 Тогда 
			КолВоСписать = Цел(КолВоСписатьБаз/текКоэффициент);
			Если КолВоСписать > 0 Тогда 
				НоваяСтрока = ТаблЧастьТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары);
				НоваяСтрока.Количество = КолВоСписать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти	


#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ТипЗнч(ПараметрыПечати) <> Тип("Структура") Тогда 
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	
	// Перемещение товаров
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеТоваров") Тогда    
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеТоваров",
		НСтр("ru = 'Перемещение товаров';uk='Переміщення товарів'"), 
		ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваров");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеТоваровПорядокСигаретный") Тогда    
		
		ПараметрыПечати.Вставить("Порядок", "Сигареты");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеТоваровПорядокСигаретный",
		НСтр("ru = 'Перемещение товаров (Сигаретный маршрут)'; uk = 'Переміщення товарів (Сигаретний маршрут)'"), 
		ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваров");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеТоваровПорядокПивной") Тогда    
		
		ПараметрыПечати.Вставить("Порядок", "Пиво");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеТоваровПорядокПивной",
		НСтр("ru = 'Перемещение товаров (Пивной маршрут)'; uk = 'Переміщення товарів (Пивний маршрут)'"), 
		ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваров");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеТоваровДвойная") Тогда    
		
		ПараметрыПечати.Вставить("Порядок", "Сигареты");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеТоваровДвойная",
		НСтр("ru = 'Перемещение товаров 2 шт. на лист';uk='Переміщення товарів 2 шт. на лист'"), 
		ПечатьПеремещениеТоваровДвойная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваров");
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеТоваровВендинг") Тогда    
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПеремещениеТоваровВендинг",
		НСтр("ru = 'Перемещение товаров Вендинг';uk='Переміщення товарів Вендінг'"), 
		ПечатьПеремещениеТоваровВендинг(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваровВендинг");
		
	КонецЕсли;	
	
КонецПроцедуры

// Перемещение товаров
Функция ПечатьПеремещениеТоваров(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)  Экспорт
	
	Порядок		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "Порядок", "");
	СсылкаТТН	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "СсылкаТТН", "");
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	//Бутыли = Новый СписокЗначений;
	//Бутыли.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0783314"));		//	Бутыль 7л
	//Бутыли.Добавить(Справочники.Номенклатура.НайтиПоКоду("249990"));		//	Бутыль 18,9л Полифлекс
	Бутыли = ТК_СправочникиПовтИсп.ЗначенияСвойства("ЕмкостьБутыля").ВыгрузитьКолонку("Объект");
	
	
	Если Порядок = "Сигареты" Тогда 
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	ПорядокСигаретный,ТорговаяПлощадкаПолучатель";
	ИначеЕсли Порядок = "Пиво" Тогда 
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	ПорядокПивной,ТорговаяПлощадкаПолучатель";
	ИначеЕсли Порядок = "ПакетДокументов" Тогда 
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	Дата,ТорговаяПлощадкаПолучатель";
	КонецЕсли;		
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПеремещениеТоваров.Ссылка КАК Ссылка,
	               |	ПеремещениеТоваров.Номер КАК Номер,
	               |	ПеремещениеТоваров.Дата КАК Дата,
	               |	ПеремещениеТоваров.ХозОперация КАК ХозОперация,
	               |	ПеремещениеТоваров.Организация КАК Организация,
	               |	ПеремещениеТоваров.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	               |	ПеремещениеТоваров.Организация.НаименованиеПолное КАК ПредставлениеПоставщика,
	               |	ПеремещениеТоваров.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ПеремещениеТоваров.ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель,
	               |	ПеремещениеТоваров.СкладКомпании КАК ПредставлениеОтправителя,
	               |	ПеремещениеТоваров.СкладКомпанииПолучатель КАК ПредставлениеПолучателя,
	               |	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента,
	               |	ПеремещениеТоваров.ИДДокументаОтгрузки КАК ИДДокументаОтгрузки,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки.Порядок, 0)
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.Порядок, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПорядокПивной,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки.ПорядокСигаретный, 0)
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.ПорядокСигаретный, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПорядокСигаретный,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	               |			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	               |				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки
	               |		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	               |			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТочкаДоставки,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваров.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИЗФилиала)
	               |			ТОГДА ПеремещениеТоваров.СкладКомпании.ТочкаДоставки
	               |		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	               |				И ПеремещениеТоваров.ДокументОснование.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	               |			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).СкладКомпании.ТочкаДоставки
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК АдресОтправителя,
	               |	ТК_ТТНИсточники.НомерСтроки КАК НомерСтроки,
	               |	ВЫРАЗИТЬ(ПеремещениеТоваров.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	               |	ПеремещениеТоваров.Товары.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.Артикул КАК Артикул,
	               |		Номенклатура КАК Номенклатура,
	               |		Номенклатура.НаименованиеПолное КАК ТоварПредставление,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		Количество КАК Количество,
	               |		КоличествоБазовое КАК КоличествоБазовое,
	               |		Цена КАК Цена,
	               |		Сумма КАК СуммаВсего,
	               |		ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |			И НЕ ПеремещениеТоваров.Товары.Номенклатура В (&Бутыли) КАК ЭтоТара,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ПеремещениеТоваров.Товары.ЕдиницаИзмерения
	               |			ИНАЧЕ ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки
	               |		КОНЕЦ КАК ЕдиницаИзмеренияУпаковки,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ПеремещениеТоваров.Товары.Коэффициент
	               |			ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент, 0)
	               |		КОНЕЦ КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ПеремещениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |		КОНЕЦ КАК ОсновнаяЕдиницаИзмерения,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияЯщиков
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	               |		КОНЕЦ КАК ЕдиницаИзмеренияЯщиков,
	               |		ВЫБОР
	               |			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	               |				ТОГДА ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ЕдиницаИзмеренияЯщиковКоэффициент
	               |	) КАК Товары
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТК_ТТН.Источники КАК ТК_ТТНИсточники
	               |		ПО (ТК_ТТНИсточники.Ссылка = &СсылкаТТН)
	               |			И (ПеремещениеТоваров.Ссылка = ТК_ТТНИсточники.Документ
	               |				ИЛИ ПеремещениеТоваров.Ссылка = ТК_ТТНИсточники.Отгрузка)
	               |ГДЕ
	               |	ПеремещениеТоваров.Ссылка В(&МассивСсылок)" + СортировкаЗапроса;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("СсылкаТТН", СсылкаТТН);	
	Запрос.УстановитьПараметр("Бутыли", Бутыли);	
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПеремещениеТоваров";
	
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСлева  = 5;
	ТабличныйДокумент.ПолеСнизу  = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваров");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокВФилиал = Макет.ПолучитьОбласть("ЗаголовокВФилиал");	
	ОбластьЗаголовокТара	= Макет.ПолучитьОбласть("ЗаголовокТара");	
	ОбластьПоставщик 		= Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 		= Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьРазделитель		= Макет.ПолучитьОбласть("Разделитель");
	ОбластьДопИнформация	= Макет.ПолучитьОбласть("ДопИнформация");

	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ЭтоПеремещениеВФилиал = ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
		
		ЗаголовокЛок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Перемещение товаров №%1 от %2'; uk = 'Переміщення товарів №%1 від %2'", КодЯзыкаПечать),
		СокрЛП(ВыборкаДокументов.Номер),
		Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаДокументов.Дата), "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		
		СтруктураШапки = Новый Структура;
		СтруктураШапки.Вставить("ТекстЗаголовка", ЗаголовокЛок);
		СтруктураШапки.Вставить("ТекстЗаголовкаТара", НСтр("ru = 'Возврат тары к '; uk = 'Повернення тари до '") + ЗаголовокЛок);		
		СтруктураШапки.Вставить("ПредставлениеПоставщика", "");		
		СтруктураШапки.Вставить("ПредставлениеОтправителя", "");
		//СтруктураШапки.Вставить("АдресОтправителя", "");						
		
		НомерМаршрута = 0;
		Если Порядок = "Пиво" Тогда 
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокПивной/1000);
		Иначе
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокСигаретный/100);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерМаршрута) Тогда 
			СтруктураШапки.Вставить("Маршрут", "Маршрут " + НомерМаршрута);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураШапки, ВыборкаДокументов);
		
		СтруктураШапки.Вставить("АдресПоставщика", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.Организация, "ЮридическийАдресОрганизации",, ТекущаяДата()));		
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ПредставлениеПолучателя) Тогда
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ПредставлениеПолучателя);
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДокументов.ТорговаяПлощадкаПолучатель) Тогда 
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ТорговаяПлощадкаПолучатель);	
		Иначе
			СтруктураШапки.Вставить("ПредставлениеПолучателя", "");						
		КонецЕсли;
		
		//Если ВыборкаДокументов.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал И ЗначениеЗаполнено(
		Если ЗначениеЗаполнено(ВыборкаДокументов.АдресОтправителя) Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", ВыборкаДокументов.АдресОтправителя);
		ИначеЕсли ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадка,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;				
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ТочкаДоставки) Тогда
			СтруктураШапки.Вставить("АдресПолучателя", ВыборкаДокументов.ТочкаДоставки);
		ИначеЕсли ЭтоПеремещениеВФилиал Тогда
			СтруктураШапки.Вставить("АдресПолучателя",УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадкаПолучатель,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;
		
		
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;				
		
		Если ЭтоПеремещениеВФилиал Тогда 
			
			ИДД = "";
			Если НЕ ПустаяСтрока(ВыборкаДокументов.ИДДокументаОтгрузки) Тогда 
				ИДД = ВыборкаДокументов.ИДДокументаОтгрузки;
			Иначе
				ИДД = Строка(ВыборкаДокументов.Ссылка.УникальныйИдентификатор());
			КонецЕсли;
			
			Попытка
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(ИДД,1,125);
				ОбластьЗаголовокВФилиал.Рисунки.QRКод.Картинка = Новый Картинка(ДанныеQRКода);
			Исключение КонецПопытки;
			
			ОбластьЗаголовокВФилиал.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокВФилиал);
			
		Иначе
			
			ОбластьЗаголовок.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
		КонецЕсли;
		
		ОбластьПоставщик.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПоставщик);
		
		ОбластьПокупатель.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПокупатель);
		
		МассивДопИнформации = Новый Массив;
		Если Не ПустаяСтрока(СокрЛП(ВыборкаДокументов.Комментарий)) Тогда 
			МассивДопИнформации.Добавить(
			Новый Структура("НазваниеПараметра, ЗначениеПараметра",
			НСтр("ru = 'Комментарий:'; uk = 'Коментар:'", КодЯзыкаПечать),
			СокрЛП(ВыборкаДокументов.Комментарий)));
		КонецЕсли;
		
		Для Каждого ДопИнформация Из МассивДопИнформации Цикл 
			ОбластьДопИнформация.Параметры.Заполнить(ДопИнформация);
			ТабличныйДокумент.Вывести(ОбластьДопИнформация);
		КонецЦикла;
		
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		
		нпп 			= 0;
		КоличествоМест 	= 0;
		СуммаВсего 		= 0;
		СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
		ЕстьТара 		= Ложь;
		
		ВыборкаТовары = ВыборкаДокументов.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			нпп = нпп + 1;			
			
			Если Не ЕстьТара И ЭтоПеремещениеВФилиал И ВыборкаТовары.ЭтоТара Тогда 
				ЕстьТара = Истина;
			КонецЕсли;
			
			СтруктураСтроки = Новый Структура("Номенклатура, Цена, СуммаВсего");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары);			
			
			СтруктураСтроки.Вставить("НомерСтроки", нпп);
			
			стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
			СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + СокрЛП(ВыборкаТовары.ХарактеристикаНоменклатуры), ""));
			СтруктураСтроки.Вставить("КоличествоПредставление", Строка(ВыборкаТовары.Количество) + " " + Строка(ВыборкаТовары.ЕдиницаИзмерения));
			
			КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
			ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
			ВыборкаТовары.Номенклатура,
			ВыборкаТовары.КоличествоБазовое,
			ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
			ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
			СтруктураИтоговМест);
			
			СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			СуммаВсего = СуммаВсего + ВыборкаТовары.СуммаВсего;
		КонецЦикла;
		
		СтруктураПодвала = Новый Структура;	
		СтруктураПодвала.Вставить("Всего", СуммаВсего);		
		СтруктураПодвала.Вставить("ВсегоМест", ТК_УправлениеПечатью.ПредставлениеИтоговКоличестваМест(СтруктураИтоговМест, КодЯзыкаПечать));
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПодвала);
		ТабличныйДокумент.Вывести(ОбластьИтого);		
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		Если ЕстьТара Тогда 
			
			ТабличныйДокумент.Вывести(ОбластьРазделитель);			
			ОбластьЗаголовокТара.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТара);
			ТабличныйДокумент.Вывести(ОбластьПоставщик);
			ТабличныйДокумент.Вывести(ОбластьПокупатель);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
			нпп = 0;
			ВыборкаТовары.Сбросить();
			Пока ВыборкаТовары.Следующий() Цикл 
				Если Не ВыборкаТовары.ЭтоТара Тогда 
					Продолжить;
				КонецЕсли;
				
				нпп = нпп + 1;
				
				СтруктураСтроки = Новый Структура("Номенклатура, КоличествоПредставление, Цена, СуммаВсего");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары, "Номенклатура, Цена");
				СтруктураСтроки.Вставить("НомерСтроки", нпп);				
				
				стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
				СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + СокрЛП(ВыборкаТовары.ХарактеристикаНоменклатуры), ""));
				
				КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
				ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
				ВыборкаТовары.Номенклатура,
				ВыборкаТовары.КоличествоБазовое,
				ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
				ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
				СтруктураИтоговМест);
				
				СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);									
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
				ТабличныйДокумент.Вывести(ОбластьСтрока);				
			КонецЦикла;			
			
			ОбластьИтого.Параметры.ВсегоМест = "";
			ОбластьИтого.Параметры.Всего = "";
			ТабличныйДокумент.Вывести(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Перемещение товаров 2 шт.
Функция ПечатьПеремещениеТоваровДвойная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)  Экспорт
	
	Порядок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "Порядок", "");
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	Бутыли = ТК_СправочникиПовтИсп.ЗначенияСвойства("ЕмкостьБутыля").ВыгрузитьКолонку("Объект");
	
	Если Порядок = "Сигареты" Тогда 
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	ПорядокСигаретный,ТорговаяПлощадкаПолучатель";
	ИначеЕсли Порядок = "Пиво" Тогда 
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	ПорядокПивной,ТорговаяПлощадкаПолучатель";
	Иначе
		СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
		|	Дата,ТорговаяПлощадкаПолучатель";
	КонецЕсли;		
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.ХозОперация КАК ХозОперация,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	|	ПеремещениеТоваров.Организация.НаименованиеПолное КАК ПредставлениеПоставщика,
	|	ПеремещениеТоваров.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПеремещениеТоваров.ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель,
	|	ПеремещениеТоваров.СкладКомпании КАК ПредставлениеОтправителя,
	|	ПеремещениеТоваров.СкладКомпанииПолучатель КАК ПредставлениеПолучателя,
	|	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента,
	|	ПеремещениеТоваров.ИДДокументаОтгрузки КАК ИДДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки.Порядок, 0)
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.Порядок, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПивной,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки.ПорядокСигаретный, 0)
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.ПорядокСигаретный, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокСигаретный,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваров.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки
	|		КОГДА ПеремещениеТоваров.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваров.СкладКомпанииПолучатель.ТочкаДоставки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТочкаДоставки,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИЗФилиала)
	|			ТОГДА ПеремещениеТоваров.СкладКомпании.ТочкаДоставки
	|		КОГДА ПеремещениеТоваров.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|				И ПеремещениеТоваров.ДокументОснование.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваров.ДокументОснование КАК Документ.ПеремещениеТоваров).СкладКомпании.ТочкаДоставки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресОтправителя,
	|	ПеремещениеТоваров.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК ТоварПредставление,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		КоличествоБазовое КАК КоличествоБазовое,
	|		Цена КАК Цена,
	|		Сумма КАК СуммаВсего,
	|		ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			И НЕ ПеремещениеТоваров.Товары.Номенклатура В (&Бутыли) КАК ЭтоТара,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ПеремещениеТоваров.Товары.ЕдиницаИзмерения
	|			ИНАЧЕ ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки
	|		КОНЕЦ КАК ЕдиницаИзмеренияУпаковки,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ПеремещениеТоваров.Товары.Коэффициент
	|			ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент, 0)
	|		КОНЕЦ КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ПеремещениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|		КОНЕЦ КАК ОсновнаяЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияЯщиков
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|		КОНЕЦ КАК ЕдиницаИзмеренияЯщиков,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|				ТОГДА ЕСТЬNULL(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЕдиницаИзмеренияЯщиковКоэффициент
	|	) КАК Товары
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивСсылок)" + СортировкаЗапроса;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("Бутыли", Бутыли);	
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПеремещениеТоваровДвойная";
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваровДвойная");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокВФилиал = Макет.ПолучитьОбласть("ЗаголовокВФилиал");	
	ОбластьЗаголовокТара	= Макет.ПолучитьОбласть("ЗаголовокТара");	
	ОбластьПоставщик 		= Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 		= Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьРазделитель		= Макет.ПолучитьОбласть("Разделитель");
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ЭтоПеремещениеВФилиал = ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
		
		ЗаголовокЛок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Перемещение товаров №%1 от %2'; uk = 'Переміщення товарів №%1 від %2'", КодЯзыкаПечать),
		СокрЛП(ВыборкаДокументов.Номер),
		Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаДокументов.Дата), "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		
		СтруктураШапки = Новый Структура;
		СтруктураШапки.Вставить("ТекстЗаголовка", ЗаголовокЛок);
		СтруктураШапки.Вставить("ТекстЗаголовкаТара", НСтр("ru = 'Возврат тары к '; uk = 'Повернення тари до '") + ЗаголовокЛок);		
		СтруктураШапки.Вставить("ПредставлениеПоставщика", "");		
		СтруктураШапки.Вставить("ПредставлениеОтправителя", "");
		//СтруктураШапки.Вставить("АдресОтправителя", "");						
		
		НомерМаршрута = 0;
		Если Порядок = "Пиво" Тогда 
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокПивной/1000);
		Иначе
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокСигаретный/100);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерМаршрута) Тогда 
			СтруктураШапки.Вставить("Маршрут", "Маршрут " + НомерМаршрута);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураШапки, ВыборкаДокументов);
		
		СтруктураШапки.Вставить("АдресПоставщика", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.Организация, "ЮридическийАдресОрганизации",, ТекущаяДата()));		
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ПредставлениеПолучателя) Тогда
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ПредставлениеПолучателя);
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДокументов.ТорговаяПлощадкаПолучатель) Тогда 
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ТорговаяПлощадкаПолучатель);	
		Иначе
			СтруктураШапки.Вставить("ПредставлениеПолучателя", "");						
		КонецЕсли;
		
		//Если ВыборкаДокументов.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал И ЗначениеЗаполнено(
		Если ЗначениеЗаполнено(ВыборкаДокументов.АдресОтправителя) Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", ВыборкаДокументов.АдресОтправителя);
		ИначеЕсли ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадка,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;				
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ТочкаДоставки) Тогда
			СтруктураШапки.Вставить("АдресПолучателя", ВыборкаДокументов.ТочкаДоставки);
		ИначеЕсли ЭтоПеремещениеВФилиал Тогда
			СтруктураШапки.Вставить("АдресПолучателя",УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадкаПолучатель,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;
		
		
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;				
		
		Если ЭтоПеремещениеВФилиал Тогда 
			
			ИДД = "";
			Если НЕ ПустаяСтрока(ВыборкаДокументов.ИДДокументаОтгрузки) Тогда 
				ИДД = ВыборкаДокументов.ИДДокументаОтгрузки;
			Иначе
				ИДД = Строка(ВыборкаДокументов.Ссылка.УникальныйИдентификатор());
			КонецЕсли;
			
			Попытка
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(ИДД,1,125);
				ОбластьЗаголовокВФилиал.Рисунки.QRКод.Картинка = Новый Картинка(ДанныеQRКода);
				ОбластьЗаголовокВФилиал.Рисунки.QRКод1.Картинка = Новый Картинка(ДанныеQRКода);
			Исключение КонецПопытки;
			
			ОбластьЗаголовокВФилиал.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокВФилиал);
			
		Иначе
			
			ОбластьЗаголовок.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
		КонецЕсли;
		
		ОбластьПоставщик.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПоставщик);
		
		ОбластьПокупатель.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПокупатель);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		нпп 			= 0;
		КоличествоМест 	= 0;
		СуммаВсего 		= 0;
		СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
		ЕстьТара 		= Ложь;
		
		ВыборкаТовары = ВыборкаДокументов.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			нпп = нпп + 1;			
			
			Если Не ЕстьТара И ЭтоПеремещениеВФилиал И ВыборкаТовары.ЭтоТара Тогда 
				ЕстьТара = Истина;
			КонецЕсли;
			
			СтруктураСтроки = Новый Структура("Номенклатура, Цена, СуммаВсего");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары);			
			
			СтруктураСтроки.Вставить("НомерСтроки", нпп);
			
			стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
			СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + СокрЛП(ВыборкаТовары.ХарактеристикаНоменклатуры), ""));
			СтруктураСтроки.Вставить("КоличествоПредставление", Строка(ВыборкаТовары.Количество) + " " + Строка(ВыборкаТовары.ЕдиницаИзмерения));
			
			КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
			ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
			ВыборкаТовары.Номенклатура,
			ВыборкаТовары.КоличествоБазовое,
			ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
			ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
			СтруктураИтоговМест);
			
			СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			СуммаВсего = СуммаВсего + ВыборкаТовары.СуммаВсего;
		КонецЦикла;
		
		СтруктураПодвала = Новый Структура;	
		СтруктураПодвала.Вставить("Всего", СуммаВсего);		
		СтруктураПодвала.Вставить("ВсегоМест", ТК_УправлениеПечатью.ПредставлениеИтоговКоличестваМест(СтруктураИтоговМест, КодЯзыкаПечать));
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПодвала);
		ТабличныйДокумент.Вывести(ОбластьИтого);		
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		Если ЕстьТара Тогда 
			
			ТабличныйДокумент.Вывести(ОбластьРазделитель);			
			ОбластьЗаголовокТара.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТара);
			ТабличныйДокумент.Вывести(ОбластьПоставщик);
			ТабличныйДокумент.Вывести(ОбластьПокупатель);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
			нпп = 0;
			ВыборкаТовары.Сбросить();
			Пока ВыборкаТовары.Следующий() Цикл 
				Если Не ВыборкаТовары.ЭтоТара Тогда 
					Продолжить;
				КонецЕсли;
				
				нпп = нпп + 1;
				
				СтруктураСтроки = Новый Структура("Номенклатура, КоличествоПредставление, Цена, СуммаВсего");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары, "Номенклатура, Цена");
				СтруктураСтроки.Вставить("НомерСтроки", нпп);				
				
				стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
				СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.ХарактеристикаНоменклатуры), ", " + СокрЛП(ВыборкаТовары.ХарактеристикаНоменклатуры), ""));
				
				КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
				ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
				ВыборкаТовары.Номенклатура,
				ВыборкаТовары.КоличествоБазовое,
				ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
				ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
				СтруктураИтоговМест);
				
				СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);									
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
				ТабличныйДокумент.Вывести(ОбластьСтрока);				
			КонецЦикла;			
			
			ОбластьИтого.Параметры.ВсегоМест = "";
			ОбластьИтого.Параметры.Всего = "";
			ТабличныйДокумент.Вывести(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Перемещение товаров Вендинг
Функция ПечатьПеремещениеТоваровВендинг(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)  Экспорт
	
	Порядок		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "Порядок", "");
	СсылкаТТН	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "СсылкаТТН", "");
	ДатаПечати	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПечати, "ДатаПечати", Неопределено);
	//Бутыли = Новый СписокЗначений;
	//Бутыли.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0783314"));		//	Бутыль 7л
	//Бутыли.Добавить(Справочники.Номенклатура.НайтиПоКоду("249990"));		//	Бутыль 18,9л Полифлекс
	Бутыли = ТК_СправочникиПовтИсп.ЗначенияСвойства("ЕмкостьБутыля").ВыгрузитьКолонку("Объект");
	
	
	//Если Порядок = "Сигареты" Тогда 
	//	СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
	//	|	ПорядокСигаретный,ТорговаяПлощадкаПолучатель";
	//ИначеЕсли Порядок = "Пиво" Тогда 
	//	СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
	//	|	ПорядокПивной,ТорговаяПлощадкаПолучатель";
	//ИначеЕсли Порядок = "ПакетДокументов" Тогда 
	//	СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//Иначе
	СортировкаЗапроса = "УПОРЯДОЧИТЬ ПО
	|	Дата,ТорговаяПлощадкаПолучатель";
	//КонецЕсли;		
	
	ОбработкаВендинг = Обработки.ВендингАвтоматы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.Номер КАК Номер,
	|	ПеремещениеТоваровТовары.Ссылка.Дата КАК Дата,
	|	ПеремещениеТоваровТовары.Ссылка.ХозОперация КАК ХозОперация,
	|	ПеремещениеТоваровТовары.Ссылка.Организация КАК Организация,
	|	ПеремещениеТоваровТовары.Ссылка.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	|	ПеремещениеТоваровТовары.Ссылка.Организация.НаименованиеПолное КАК ПредставлениеПоставщика,
	|	ПеремещениеТоваровТовары.Ссылка.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПеремещениеТоваровТовары.Ссылка.ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель,
	|	ПеремещениеТоваровТовары.Ссылка.СкладКомпании КАК ПредставлениеОтправителя,
	|	ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель КАК ПредставлениеПолучателя,
	|	ПеремещениеТоваровТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ПеремещениеТоваровТовары.Ссылка.ИДДокументаОтгрузки КАК ИДДокументаОтгрузки,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТочкаДоставки.Порядок, 0)
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваровТовары.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Ссылка.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.Порядок, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокПивной,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТочкаДоставки.ПорядокСигаретный, 0)
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваровТовары.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Ссылка.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки.ПорядокСигаретный, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПорядокСигаретный,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТочкаДоставки
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ЗаказПокупателя
	|				И ПеремещениеТоваровТовары.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Ссылка.ДокументОснование КАК Документ.ЗаказПокупателя).ТочкаДоставки
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель <> ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТочкаДоставки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТочкаДоставки,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИЗФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ТочкаДоставки
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПеремещениеТоваров
	|				И ПеремещениеТоваровТовары.Ссылка.ДокументОснование.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Ссылка.ДокументОснование КАК Документ.ПеремещениеТоваров).СкладКомпании.ТочкаДоставки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресОтправителя,
	|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное КАК ТоварПредставление,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеТоваровТовары.Количество КАК Количество,
	|	ПеремещениеТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
	|	ПеремещениеТоваровТовары.Цена КАК Цена,
	|	ПеремещениеТоваровТовары.Сумма КАК СуммаВсего,
	|	ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|		И НЕ ПеремещениеТоваровТовары.Номенклатура В (&Бутыли) КАК ЭтоТара,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ПеремещениеТоваровТовары.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки
	|	КОНЕЦ КАК ЕдиницаИзмеренияУпаковки,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ПеремещениеТоваровТовары.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент, 0)
	|	КОНЕЦ КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ОсновнаяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК ЕдиницаИзмеренияЯщиков,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Тара)
	|			ТОГДА ЕСТЬNULL(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕдиницаИзмеренияЯщиковКоэффициент,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата.Рядов
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата.Рядов
	|	КОНЕЦ КАК Рядов,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ВидАвтомата.Ячеек
	|		КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ВидАвтомата.Ячеек
	|	КОНЕЦ КАК Ячеек,
	|	ЕСТЬNULL(ПланограммаАвтоматаСрезПоследних.Ячейка, 0) КАК Ячейка,
	|	ЦеныСрезПоследних.Цена КАК ЦенаРоз
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланограммаАвтомата.СрезПоследних КАК ПланограммаАвтоматаСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ПланограммаАвтоматаСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ПланограммаАвтоматаСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель
	|			КОНЕЦ = ПланограммаАвтоматаСрезПоследних.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&НаДату, ) КАК ЦеныСрезПоследних
	|		ПО ПеремещениеТоваровТовары.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|			И ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.Характеристика
	|			И (ВЫБОР
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли
	|				КОГДА ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|					ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель.ТипЦенРозничнойТорговли
	|			КОНЕЦ = ЦеныСрезПоследних.ТипЦен)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Ячейка
	|ИТОГИ
	|	МАКСИМУМ(ПорядокПивной),
	|	МАКСИМУМ(ПорядокСигаретный),
	|	МАКСИМУМ(ТочкаДоставки),
	|	МАКСИМУМ(АдресОтправителя),
	|	МАКСИМУМ(Рядов)
	|ПО
	|	Ссылка";// + СортировкаЗапроса;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	Запрос.УстановитьПараметр("СсылкаТТН", СсылкаТТН);	
	Запрос.УстановитьПараметр("Бутыли", Бутыли);	
	Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Заполним параметры табличного документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПеремещениеТоваровВендинг";
	
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева  = 0;
	ТабличныйДокумент.ПолеСнизу  = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	КодЯзыкаПечать = "uk"; //КодЛокализацииИнформационнойБазы();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_ПеремещениеТоваровВендинг");
	Макет.КодЯзыка = КодЯзыкаПечать;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокВФилиал = Макет.ПолучитьОбласть("ЗаголовокВФилиал");	
	ОбластьЗаголовокТара	= Макет.ПолучитьОбласть("ЗаголовокТара");	
	ОбластьПоставщик 		= Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель 		= Макет.ПолучитьОбласть("Покупатель");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ШапкаТаблицы");	
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
	ОбластьПодписи 			= Макет.ПолучитьОбласть("Подписи");
	ОбластьРазделитель		= Макет.ПолучитьОбласть("Разделитель");
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваров") Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Эта печатная форма предназначена только для филиалов (%1)'; uk = 'Ця друкована форма призначена лише для філій (%1)'"),
			ВыборкаДокументов.Ссылка));
			Продолжить;
		КонецЕсли;
		
		ЭтоПеремещениеВФилиал = ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
		
		Если ЭтоПеремещениеВФилиал И ВыборкаДокументов.ПредставлениеОтправителя.ВидАвтомата = ПредопределенноеЗначение("Справочник.ВидыВендингАвтоматов.ПустаяСсылка")
			ИЛИ НЕ ЭтоПеремещениеВФилиал И ВыборкаДокументов.ПредставлениеПолучателя.ВидАвтомата = ПредопределенноеЗначение("Справочник.ВидыВендингАвтоматов.ПустаяСсылка")Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Эта печатная форма предназначена только для Вендинга (%1)'; uk = 'Ця друкована форма призначена лише для Вендінга (%1)'"),
			ВыборкаДокументов.Ссылка));
			Продолжить;
		КонецЕсли;
		
		//	получаем остатки автомата
		СкладКомпании = ?(ЭтоПеремещениеВФилиал,ВыборкаДокументов.ПредставлениеОтправителя,ВыборкаДокументов.ПредставлениеПолучателя);
		Ответ = ОбработкаВендинг.ПолучитьДанные_GET("automat/"+Формат(СкладКомпании.ИД_Автомата,"ЧГ=0")+"/cell/");
		
		Если Ответ.КодСостояния > 399 Тогда
			ОбработкаВендинг.Ошибка404(Ответ,"GET");
			Продолжить;;
		КонецЕсли;
		
		ТаблицаОстатков = ОбработкаВендинг.ПолучитьТаблицаЗначений();
		
		Для каждого мСтрока Из Ответ.Данные Цикл
			стрОстатки = ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(стрОстатки,мСтрока);
			стрОстатки.Артикул = Формат(мСтрока.article,"ЧГ=0");
		КонецЦикла;
		
		ЗаголовокЛок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Перемещение товаров №%1 от %2'; uk = 'Переміщення товарів №%1 від %2'", КодЯзыкаПечать),
		СокрЛП(ВыборкаДокументов.Номер),
		Формат(?(ЗначениеЗаполнено(ДатаПечати),ДатаПечати,ВыборкаДокументов.Дата), "Л="+КодЯзыкаПечать+"; ДЛФ=DD"));
		
		СтруктураШапки = Новый Структура;
		СтруктураШапки.Вставить("ТекстЗаголовка", ЗаголовокЛок);
		СтруктураШапки.Вставить("ТекстЗаголовкаТара", НСтр("ru = 'Возврат тары к '; uk = 'Повернення тари до '") + ЗаголовокЛок);		
		СтруктураШапки.Вставить("ПредставлениеПоставщика", "");		
		СтруктураШапки.Вставить("ПредставлениеОтправителя", "");
		//СтруктураШапки.Вставить("АдресОтправителя", "");						
		
		НомерМаршрута = 0;
		Если Порядок = "Пиво" Тогда 
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокПивной/1000);
		Иначе
			НомерМаршрута = Цел(ВыборкаДокументов.ПорядокСигаретный/100);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерМаршрута) Тогда 
			СтруктураШапки.Вставить("Маршрут", "Маршрут " + НомерМаршрута);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураШапки, ВыборкаДокументов);
		
		СтруктураШапки.Вставить("АдресПоставщика", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.Организация, "ЮридическийАдресОрганизации",, ТекущаяДата()));		
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ПредставлениеПолучателя) Тогда
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ПредставлениеПолучателя);
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДокументов.ТорговаяПлощадкаПолучатель) Тогда 
			СтруктураШапки.Вставить("ПредставлениеПолучателя", ВыборкаДокументов.ТорговаяПлощадкаПолучатель);	
		Иначе
			СтруктураШапки.Вставить("ПредставлениеПолучателя", "");						
		КонецЕсли;
		
		//Если ВыборкаДокументов.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал И ЗначениеЗаполнено(
		Если ЗначениеЗаполнено(ВыборкаДокументов.АдресОтправителя) Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", ВыборкаДокументов.АдресОтправителя);
		ИначеЕсли ВыборкаДокументов.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровИзФилиала") Тогда 
			СтруктураШапки.Вставить("АдресОтправителя", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадка,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;				
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.ТочкаДоставки) Тогда
			СтруктураШапки.Вставить("АдресПолучателя", ВыборкаДокументов.ТочкаДоставки);
		ИначеЕсли ЭтоПеремещениеВФилиал Тогда
			СтруктураШапки.Вставить("АдресПолучателя",УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаДокументов.ТорговаяПлощадкаПолучатель,"ЮридическийАдресТорговойПлощадки",,ТекущаяДата()));
		КонецЕсли;
		
		
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;				
		
		//Если ЭтоПеремещениеВФилиал Тогда 
		//	
		//	ИДД = "";
		//	Если НЕ ПустаяСтрока(ВыборкаДокументов.ИДДокументаОтгрузки) Тогда 
		//		ИДД = ВыборкаДокументов.ИДДокументаОтгрузки;
		//	Иначе
		//		ИДД = Строка(ВыборкаДокументов.Ссылка.УникальныйИдентификатор());
		//	КонецЕсли;
		//	
		//	Попытка
		//		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(ИДД,1,125);
		//		ОбластьЗаголовокВФилиал.Рисунки.QRКод.Картинка = Новый Картинка(ДанныеQRКода);
		//	Исключение КонецПопытки;
		//	
		//	ОбластьЗаголовокВФилиал.Параметры.Заполнить(СтруктураШапки);
		//	ТабличныйДокумент.Вывести(ОбластьЗаголовокВФилиал);
		//	
		//Иначе
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//КонецЕсли;
		
		ОбластьПоставщик.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПоставщик);
		
		ОбластьПокупатель.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьПокупатель);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		нпп 			= 0;
		КоличествоМест 	= 0;
		СуммаВсего 		= 0;
		СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
		ЕстьТара 		= Ложь;
		
		тзРотацияВитрины = ОбработкаВендинг.ПолучитьТаблицаЗначений();
		
		ВыборкаТовары = ВыборкаДокументов.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			нпп = нпп + 1;			
			
			//	Проверка на новое МРЦ
			мОстатки = ТаблицаОстатков.НайтиСтроки(Новый Структура("Артикул,maxRetailPrice",ВыборкаТовары.Артикул,ВыборкаТовары.Характеристика.ЗначениеМРЦ * 100));
			
			ЭтоНовоеМРЦ = мОстатки.Количество() = 0;
			
			Если ЭтоНовоеМРЦ Тогда
				тзОстаткиМРЦ = ТаблицаОстатков.Скопировать(Новый Структура("Артикул",ВыборкаТовары.Артикул));
				тзОстаткиМРЦ.Сортировать("order Убыв");
				
				нСтрока = тзРотацияВитрины.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрока,ВыборкаТовары);
				Если тзОстаткиМРЦ.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(нСтрока,тзОстаткиМРЦ[0],,"Номенклатура,Характеристика,Ячейка");
				КонецЕсли;
				нСтрока.СортировкаМРЦ = ВыборкаТовары.Характеристика.Сортировка;
			КонецЕсли;
			
			Если Не ЕстьТара И ЭтоПеремещениеВФилиал И ВыборкаТовары.ЭтоТара Тогда 
				ЕстьТара = Истина;
			КонецЕсли;
			
			СтруктураСтроки = Новый Структура("Номенклатура, Цена, СуммаВсего, ЦенаРоз");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары);			
			
			СтруктураСтроки.Вставить("НомерСтроки", нпп);
			
			стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
			СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.Характеристика), ", " + СокрЛП(ВыборкаТовары.Характеристика), ""));
			СтруктураСтроки.Вставить("КоличествоПредставление", Строка(ВыборкаТовары.Количество) + " " + Строка(ВыборкаТовары.ЕдиницаИзмерения));
			
			КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
			ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
			ВыборкаТовары.Номенклатура,
			ВыборкаТовары.КоличествоБазовое,
			ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
			ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
			ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
			СтруктураИтоговМест);
			
			СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);
			
			Если ВыборкаТовары.Ячейка = 0 Тогда
				СтруктураСтроки.Вставить("Ячейка", "");
				СтруктураСтроки.Вставить("_Ячейка","");
			Иначе
				Ячейка = ОбработкаВендинг.ИмяЯчейки(ВыборкаТовары.Рядов,ВыборкаТовары.Ячеек,ВыборкаТовары.Ячейка);
				СтруктураСтроки.Вставить("Ячейка", Ячейка);
				СтруктураСтроки.Вставить("_Ячейка","("+Прав("00"+ВыборкаТовары.Ячейка,3)+")");
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			СуммаВсего = СуммаВсего + ВыборкаТовары.СуммаВсего;
		КонецЦикла;
		
		СтруктураПодвала = Новый Структура;	
		СтруктураПодвала.Вставить("Всего", СуммаВсего);		
		СтруктураПодвала.Вставить("ВсегоМест", ТК_УправлениеПечатью.ПредставлениеИтоговКоличестваМест(СтруктураИтоговМест, КодЯзыкаПечать));
		
		ОбластьИтого.Параметры.Заполнить(СтруктураПодвала);
		ТабличныйДокумент.Вывести(ОбластьИтого);		
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		Если ЕстьТара Тогда 
			
			ТабличныйДокумент.Вывести(ОбластьРазделитель);			
			ОбластьЗаголовокТара.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТара);
			ТабличныйДокумент.Вывести(ОбластьПоставщик);
			ТабличныйДокумент.Вывести(ОбластьПокупатель);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			СтруктураИтоговМест = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
			нпп = 0;
			ВыборкаТовары.Сбросить();
			Пока ВыборкаТовары.Следующий() Цикл 
				Если Не ВыборкаТовары.ЭтоТара Тогда 
					Продолжить;
				КонецЕсли;
				
				нпп = нпп + 1;
				
				СтруктураСтроки = Новый Структура("Номенклатура, КоличествоПредставление, Цена, СуммаВсего");
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаТовары, "Номенклатура, Цена");
				СтруктураСтроки.Вставить("НомерСтроки", нпп);				
				
				стрНоменклатура = СокрЛП(ВыборкаТовары.Артикул) +  " " + СокрЛП(ВыборкаТовары.ТоварПредставление);						
				СтруктураСтроки.Вставить("ТоварПредставление", стрНоменклатура + ?(Не ПустаяСтрока(ВыборкаТовары.Характеристика), ", " + СокрЛП(ВыборкаТовары.Характеристика), ""));
				
				КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
				ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
				ВыборкаТовары.Номенклатура,
				ВыборкаТовары.КоличествоБазовое,
				ВыборкаТовары.ОсновнаяЕдиницаИзмерения,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиков,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковки,
				ВыборкаТовары.ОсновнаяЕдиницаИзмеренияКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияЯщиковКоэффициент,
				ВыборкаТовары.ЕдиницаИзмеренияУпаковкиКоэффициент),
				СтруктураИтоговМест);
				
				СтруктураСтроки.Вставить("КоличествоМестПредставление", КоличествоМестПредставление);									
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
				ТабличныйДокумент.Вывести(ОбластьСтрока);				
			КонецЦикла;			
			
			ОбластьИтого.Параметры.ВсегоМест = "";
			ОбластьИтого.Параметры.Всего = "";
			ТабличныйДокумент.Вывести(ОбластьИтого);
			ТабличныйДокумент.Вывести(ОбластьПодписи);
			
		КонецЕсли;
		
		Если тзРотацияВитрины.Количество() > 0 Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ОбластьЗаголовокРТ 		= Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапкаТаблицыРТ	= Макет.ПолучитьОбласть("ШапкаТаблицыРТ");
			ОбластьСтрокаРТ 		= Макет.ПолучитьОбласть("СтрокаРТ");
			ОбластьИтогоРТ 			= Макет.ПолучитьОбласть("ИтогоРТ");
			
			ОбластьЗаголовокРТ.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ротация витрины к Перемещение товаров №%1 от %2'; uk = 'Ротація вітрини до Переміщення товарів №%1 від %2'", КодЯзыкаПечать),
			СокрЛП(ВыборкаДокументов.Номер),
			Формат(ВыборкаДокументов.Дата, "ДФ=dd.MM.yyyy"));
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокРТ);
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыРТ);
			
			НомерСтроки = 0;
			мНоменклатураДляЗаменыВитрины = ОбщегоНазначенияКлиентСервер.СвернутьМассив(тзРотацияВитрины.ВыгрузитьКолонку("Номенклатура"));
			
			Для Каждого стрНоменклатура Из мНоменклатураДляЗаменыВитрины Цикл
				тзНовоеМРЦ = тзРотацияВитрины.Скопировать(Новый Структура("Номенклатура",стрНоменклатура));
				тзНовоеМРЦ.Сортировать("СортировкаМРЦ Убыв");
				СтрокаЗаменыВитрины = тзНовоеМРЦ[0];
				
				НомерСтроки = 1 + НомерСтроки;
				ЯчейкаУ = ОбработкаВендинг.ИмяЯчейки(ВыборкаДокументов.Рядов,ВыборкаДокументов.Ячеек,СтрокаЗаменыВитрины.number);
				ЯчейкаВ = ОбработкаВендинг.ИмяЯчейки(ВыборкаДокументов.Рядов,ВыборкаДокументов.Ячеек,СтрокаЗаменыВитрины.Ячейка);
				СтруктураРотации = Новый Структура;
				СтруктураРотации.Вставить("НомерСтроки",НомерСтроки);
				СтруктураРотации.Вставить("Артикул",СтрокаЗаменыВитрины.Артикул);
				СтруктураРотации.Вставить("ТоварНаименование",СтрокаЗаменыВитрины.Номенклатура);
				СтруктураРотации.Вставить("Количество","1 шт");
				СтруктураРотации.Вставить("ЯчейкаУ",ЯчейкаУ);
				СтруктураРотации.Вставить("_ЯчейкаУ",?(СтрокаЗаменыВитрины.number=0,"","("+СтрокаЗаменыВитрины.number+")"));
				СтруктураРотации.Вставить("МРЦУ",СтрокаЗаменыВитрины.maxRetailPrice/100);
				СтруктураРотации.Вставить("ЯчейкаВ",ЯчейкаВ);
				СтруктураРотации.Вставить("_ЯчейкаВ","("+СтрокаЗаменыВитрины.Ячейка+")");
				СтруктураРотации.Вставить("МРЦВ",СтрокаЗаменыВитрины.Характеристика.ЗначениеМРЦ);
				ОбластьСтрокаРТ.Параметры.Заполнить(СтруктураРотации);
				ТабличныйДокумент.Вывести(ОбластьСтрокаРТ);
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьИтогоРТ);
			
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти	





#КонецЕсли
