#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =	
	 "РазрешитьЧтение
	|ГДЕ
	|    ЧтениеОбъектаРазрешено(БанковскийСчет)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|    ИзменениеОбъектаРазрешено(БанковскийСчет)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом
#КонецОбласти



Функция ТерминалПриват()Экспорт
	
	Возврат Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("000000007");
	
КонецФункции


#КонецОбласти
	
	
	
#КонецЕсли
