




Процедура ПередЗаписью(Отказ)
	
	
	ЗарегистрироватьOS = ЭтоНовый();
	
	Если НЕ ЗарегистрироватьOS Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.НеВыгружатьВОборудование КАК НеВыгружатьВОборудование
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		ПризнакНеВыгружать = ВыборкаДетальныеЗаписи.НеВыгружатьВОборудование;
		ЗарегистрироватьOS = НеВыгружатьВОборудование <> ПризнакНеВыгружать;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗарегистрироватьOS",ЗарегистрироватьOS);
	
	
КонецПроцедуры





