
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПараметрКоманды;

		Состояние(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 начат обмен данными с фронт OS';uk='%1 розпочатий обмін даними з фронт OS'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT"))
		,,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='по узлу обмена ""%1""...';uk='по вузлу обміну ""%1""...'"),
			УзелОбмена));
			
	ОбменВыполненСервер(УзелОбмена);
		
	ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 ""%2""';uk='%1 ""%2""'"),
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДЛФ=DT"),
			УзелОбмена) 
		,,
		НСтр("ru='Обмен с фронт OS завершен';uk='Обмін з фронт OS завершений'"),
		БиблиотекаКартинок.Информация32);
		


	
КонецПроцедуры
	
&НаСервере
Функция ОбменВыполненСервер(УзелОбмена)

	Если ПланыОбмена.ОбменФронт.ПолучитьЭтотУзелПланаОбмена(УзелОбмена) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если УзелОбмена.ПометкаУдаления Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбменФронтСобытия.ВыполнитьОбмен(УзелОбмена, НСтр("ru='Интерактивный обмен';uk='Інтерактивний обмін'"));
	
	Возврат Истина;
	
КонецФункции
