
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область ПрограммныйИнтерфейс
	
	Функция СформироватьОтчеты(Знач СписокОтчетов, Знач ПараметрыОтчетов) Экспорт 
		
		текДата 			= ТекущаяДата();
		НачалоПериода 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "НачалоПериода", НачалоДня(текДата));
		КонецПериода		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "КонецПериода", КонецДня(текДата));
		
		Выполнено = 0;
		КолвоОтчетов = СписокОтчетов.Количество();
		
		ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подготовка данных для отчетов'; uk = 'Підготовка даних для звітів'"));
		
		
		МенеджерВременныхТаблиц = ПолучитьТаблицыВнешнегоИсточника(СписокОтчетов, ПараметрыОтчетов);
		ПараметрыОтчетов.Вставить("Результат", Новый Структура);	
		
		Если СписокОтчетов.Свойство("ОтчетПродажи") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Продажи'; uk = 'Продажі'"),
			Выполнено + 1,
			КолвоОтчетов));
			
			СформироватьОтчетПродажи(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетОстатки") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Остатки'; uk = 'Залишки'"),
			Выполнено + 1,
			КолвоОтчетов));
			
			СформироватьОтчетОстатки(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоРегионам") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Продажи по регионам'; uk = 'Продажі по регіонам'"),
			Выполнено + 1,
			КолвоОтчетов));
			
			СформироватьОтчетПродажиПоРегионам(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);				
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоСкладам") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Продажи по складам'; uk = 'Продажі по складам'"),
			Выполнено + 1,
			КолвоОтчетов));
			
			СформироватьОтчетПродажиПоСкладам(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);				
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоТочкам") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Продажи по точкам'; uk = 'Продажі по точкам'"),
			Выполнено + 1,
			КолвоОтчетов));		
			
			СформироватьОтчетПродажиПоТочкам(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетТочкиДоставки") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Точки доставки'; uk = 'Точки доставки'"),
			Выполнено + 1,
			КолвоОтчетов));		
			
			СформироватьОтчетТочкиДоставки(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетДляДистрибьюторов") Тогда 
			
			ДлительныеОперации.СообщитьПрогресс(Цел(Выполнено/(КолвоОтчетов + 1) * 100), 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Формируется отчет ""%1""
			|%2 из %3'; uk = 'Формується звіт ""%1""
			|%2 із %3'"),
			НСтр("ru = 'Для дистрибьюторов'; uk = 'Для дистрибуторів'"),
			Выполнено + 1,
			КолвоОтчетов));		
			
			СформироватьОтчетДляДистрибьюторов(НачалоПериода, КонецПериода, ПараметрыОтчетов, МенеджерВременныхТаблиц);
			
			Выполнено = Выполнено + 1;
		КонецЕсли;
		
		Возврат ПараметрыОтчетов.Результат;
		
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область СлужебныеПроцедурыИФункции
	
	Функция ПолучитьТаблицыВнешнегоИсточника(СписокОтчетов, ПараметрыОтчетов)
		
		СтруктураВнешТаблиц = ПолучитьСтруктуруВнешнихТаблиц(СписокОтчетов);
		Если СтруктураВнешТаблиц.Количество() = 0 Тогда 
			ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", Ложь);	
			Возврат Неопределено;
		КонецЕсли;
		
		ОшибкиПодключения = "";
		//Подключено = ПодключениеКВнешнемуИсточнику(ОшибкиПодключения);
		//Если Не Подключено Тогда 
		//	ОбщегоНазначения.СообщитьПользователю(ОшибкиПодключения);
		//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные из внешнего источника не получены'; uk = 'Дані із зовнішнього джерела не отримані'"));
		//	ПараметрыОтчетов.Вставить("ИзВнешнегоИсточника", Ложь);	
		//	Возврат Неопределено;
		//КонецЕсли;
		//
		УстановитьПривилегированныйРежим(Истина);
		
		НачалоПериода 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "НачалоПериода", НачалоДня(ТекущаяДата()));
		КонецПериода		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "КонецПериода", КонецДня(ТекущаяДата()));	
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Если СтруктураВнешТаблиц.Свойство("dbo_vSTOCKS") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vSTOCKS.PERIOD КАК PERIOD,
			|	dbo_vSTOCKS.RECORDER КАК RECORDER,
			|	dbo_vSTOCKS.WHOUSEID КАК WHOUSEID,
			|	dbo_vSTOCKS.PRODUCTID КАК PRODUCTID,
			|	dbo_vSTOCKS.BATCODE КАК BATCODE,
			|	dbo_vSTOCKS.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vSTOCKS.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vSTOCKS.STOCK_PACKS КАК STOCK_PACKS,
			|	dbo_vSTOCKS.PRODUCTEXTID КАК PRODUCTEXTID
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vSTOCKS КАК dbo_vSTOCKS
			|ГДЕ
			|	dbo_vSTOCKS.PERIOD = &PERIOD";
			
			Запрос.УстановитьПараметр("PERIOD", КонецДня(КонецПериода) + 1);
			ТЧ = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Таблица", ТЧ);
			ТекстЗапроса = "ВЫБРАТЬ
			|	dbo_vSTOCKS.PERIOD КАК PERIOD,
			|	dbo_vSTOCKS.RECORDER КАК RECORDER,
			|	dbo_vSTOCKS.WHOUSEID КАК WHOUSEID,
			|	dbo_vSTOCKS.PRODUCTID КАК PRODUCTID,
			|	dbo_vSTOCKS.BATCODE КАК BATCODE,
			|	dbo_vSTOCKS.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vSTOCKS.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vSTOCKS.STOCK_PACKS КАК STOCK_PACKS,
			|	dbo_vSTOCKS.PRODUCTEXTID КАК PRODUCTEXTID
			|ПОМЕСТИТЬ dbo_vSTOCKS
			|ИЗ
			|	&Таблица КАК dbo_vSTOCKS";
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "Отборы", новый Структура());
			
			Отбор = ПоискиОтбора(Отборы,"Номенклатура"); 
			Если Отбор.Свойство("Номенклатура") Тогда
				Запрос.УстановитьПараметр("Номенклатура", Отбор.Номенклатура);
				ТекстОтбораНоменклатура = "И Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)";
			Иначе
				ТекстОтбораНоменклатура = "И Истина" + Символы.ПС;
			КонецЕсли;
			
			Если Отбор.Свойство("ТоварнаяМарка") Тогда
				Запрос.УстановитьПараметр("ТоварнаяМарка", Отбор.ТоварнаяМарка);
				ТекстОтбораТМ = "И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)";
			Иначе
				ТекстОтбораТМ = "И Истина" + Символы.пс;
			КонецЕсли;
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ТекстОтбораНоменклатура,ТекстОтбораТМ);
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Если СтруктураВнешТаблиц.Свойство("dbo_vBranchSales") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vBranchSales.Period КАК Period,
			|	dbo_vBranchSales.WHOUSEID КАК WHOUSEID,
			|	dbo_vBranchSales.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vBranchSales.PRODUCTID КАК PRODUCTID,
			|	dbo_vBranchSales.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vBranchSales.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vBranchSales.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vBranchSales.BATCODE КАК BATCODE,
			|	dbo_vBranchSales.BARCODES КАК BARCODES,
			|	dbo_vBranchSales.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vBranchSales.SALES_PACKS КАК SALES_PACKS,
			|	dbo_vBranchSales.SALES_QTY КАК SALES_QTY,
			|	dbo_vBranchSales.SALES_SUM КАК SALES_SUM
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vBranchSales КАК dbo_vBranchSales
			|ГДЕ
			|	dbo_vBranchSales.Period МЕЖДУ &НачПериод И &КонПериод";
			
			Запрос.УстановитьПараметр("НачПериод", НачалоПериода);
			Запрос.УстановитьПараметр("КонПериод", КонецПериода);
			ТЧ = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Таблица", ТЧ);
			ТекстЗапроса = "ВЫБРАТЬ
			|	Продажи.Period КАК Period,
			|	Продажи.WHOUSEID КАК WHOUSEID,
			|	Продажи.WHOUSEGUID КАК WHOUSEGUID,
			|	Продажи.PRODUCTID КАК PRODUCTID,
			|	Продажи.PRODUCTGUID КАК PRODUCTGUID,
			|	Продажи.PRODUCTEXTID КАК PRODUCTEXTID,
			|	Продажи.PRODUCTNAME КАК PRODUCTNAME,
			|	Продажи.BATCODE КАК BATCODE,
			|	Продажи.BARCODES КАК BARCODES,
			|	Продажи.MRP_PRICE КАК MRP_PRICE,
			|	Продажи.SALES_PACKS КАК SALES_PACKS,
			|	Продажи.SALES_QTY КАК SALES_QTY,
			|	Продажи.SALES_SUM КАК SALES_SUM
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	&Таблица КАК Продажи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	dbo_vBranchSales.Period КАК Period,
			|	dbo_vBranchSales.WHOUSEID КАК WHOUSEID,
			|	dbo_vBranchSales.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vBranchSales.PRODUCTID КАК PRODUCTID,
			|	dbo_vBranchSales.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vBranchSales.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vBranchSales.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vBranchSales.BATCODE КАК BATCODE,
			|	dbo_vBranchSales.BARCODES КАК BARCODES,
			|	dbo_vBranchSales.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vBranchSales.SALES_PACKS КАК SALES_PACKS,
			|	dbo_vBranchSales.SALES_QTY КАК SALES_QTY,
			|	dbo_vBranchSales.SALES_SUM КАК SALES_SUM
			|ПОМЕСТИТЬ dbo_vBranchSales
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Продажи КАК dbo_vBranchSales
			|		ПО Номенклатура.Артикул = dbo_vBranchSales.PRODUCTEXTID
			|ГДЕ
			|	ИСТИНА
			|    %1
			|	%2	";
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "Отборы", новый Структура());
			
			Отбор = ПоискиОтбора(Отборы,"Номенклатура"); 
			Если Отбор.Свойство("Номенклатура") Тогда
				Запрос.УстановитьПараметр("Номенклатура", Отбор.Номенклатура);
				ТекстОтбораНоменклатура = "И Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)";
			Иначе
				ТекстОтбораНоменклатура = "И Истина" + Символы.ПС;
			КонецЕсли;
			
			Если Отбор.Свойство("ТоварнаяМарка") Тогда
				Запрос.УстановитьПараметр("ТоварнаяМарка", Отбор.ТоварнаяМарка);
				ТекстОтбораТМ = "И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)";
			Иначе
				ТекстОтбораТМ = "И Истина" + Символы.пс;
			КонецЕсли;
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ТекстОтбораНоменклатура,ТекстОтбораТМ);
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Если СтруктураВнешТаблиц.Свойство("dbo_vRetailSales") Тогда 
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vRetailSales.Period КАК Period,
			|	dbo_vRetailSales.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales.BATCODE КАК BATCODE,
			|	dbo_vRetailSales.BARCODES КАК BARCODES,
			|	dbo_vRetailSales.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales.SALES_QTY КАК SALES_QTY,
			|	dbo_vRetailSales.SALES_PACKS КАК SALES_PACKS,
			|	dbo_vRetailSales.JTICODE КАК JTICODE,
			|	dbo_vRetailSales.SALES_SUM КАК SALES_SUM
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vRetailSales КАК dbo_vRetailSales
			|ГДЕ
			|	dbo_vRetailSales.Period МЕЖДУ &НачПериод И &КонПериод";
			
			Запрос.УстановитьПараметр("НачПериод", НачалоПериода);
			Запрос.УстановитьПараметр("КонПериод", КонецПериода);
			ТЧ = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Таблица", ТЧ);
			ТекстЗапроса = "ВЫБРАТЬ
			|	dbo_vRetailSales.Period КАК Period,
			|	dbo_vRetailSales.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales.BATCODE КАК BATCODE,
			|	dbo_vRetailSales.BARCODES КАК BARCODES,
			|	dbo_vRetailSales.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales.SALES_QTY КАК SALES_QTY,
			|	dbo_vRetailSales.SALES_PACKS КАК SALES_PACKS,
			|	dbo_vRetailSales.JTICODE КАК JTICODE,
			|	dbo_vRetailSales.SALES_SUM КАК SALES_SUM
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	&Таблица КАК dbo_vRetailSales
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	dbo_vRetailSales.Period КАК Period,
			|	dbo_vRetailSales.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales.BATCODE КАК BATCODE,
			|	dbo_vRetailSales.BARCODES КАК BARCODES,
			|	dbo_vRetailSales.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales.SALES_QTY КАК SALES_QTY,
			|	dbo_vRetailSales.SALES_PACKS КАК SALES_PACKS,
			|	dbo_vRetailSales.JTICODE КАК JTICODE,
			|	dbo_vRetailSales.SALES_SUM КАК SALES_SUM
			|ПОМЕСТИТЬ dbo_vRetailSales
			|ИЗ
			|	Продажи КАК dbo_vRetailSales
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО dbo_vRetailSales.PRODUCTEXTID = Номенклатура.Артикул
			|ГДЕ
			|	ИСТИНА
			|    %1
			|    %2";
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "Отборы", новый Структура());
			
			Отбор = ПоискиОтбора(Отборы,"Номенклатура"); 
			Если Отбор.Свойство("Номенклатура") Тогда
				Запрос.УстановитьПараметр("Номенклатура", Отбор.Номенклатура);
				ТекстОтбораНоменклатура = "И Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)";
			Иначе
				ТекстОтбораНоменклатура = "И Истина" + Символы.ПС;
			КонецЕсли;
			
			Если Отбор.Свойство("ТоварнаяМарка") Тогда
				Запрос.УстановитьПараметр("ТоварнаяМарка", Отбор.ТоварнаяМарка);
				ТекстОтбораТМ = "И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)";
			Иначе
				ТекстОтбораТМ = "И Истина" + Символы.пс;
			КонецЕсли;
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ТекстОтбораНоменклатура,ТекстОтбораТМ);
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Если СтруктураВнешТаблиц.Свойство("dbo_vRetailSales3") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vRetailSales2.Period КАК Period,
			|	dbo_vRetailSales2.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales2.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales2.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales2.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales2.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales2.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales2.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales2.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales2.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales2.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales2.BATCODE КАК BATCODE,
			|	dbo_vRetailSales2.BARCODES КАК BARCODES,
			|	dbo_vRetailSales2.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales2.SALES_QTY КАК SALES_QTY2,
			|	dbo_vRetailSales2.SALES_PACKS КАК SALES_PACKS2,  					   
			|	dbo_vRetailSales2.JTICODE КАК JTICODE,
			|	dbo_vRetailSales2.SALES_SUM КАК SALES_SUM2
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vRetailSales КАК dbo_vRetailSales2
			|ГДЕ
			|	dbo_vRetailSales2.Period МЕЖДУ &НачПериод2 И &КонПериод2";
			
			Запрос.УстановитьПараметр("НачПериод2", ДобавитьМесяц(НачалоМесяца(НачалоПериода),-2));
			Запрос.УстановитьПараметр("КонПериод2", ДобавитьМесяц(НачалоМесяца(КонецПериода),-2));
			ТЧ2 = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vRetailSales1.Period КАК Period,
			|	dbo_vRetailSales1.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales1.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales1.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales1.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales1.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales1.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales1.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales1.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales1.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales1.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales1.BATCODE КАК BATCODE,
			|	dbo_vRetailSales1.BARCODES КАК BARCODES,
			|	dbo_vRetailSales1.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales1.SALES_QTY КАК SALES_QTY1,
			|	dbo_vRetailSales1.JTICODE КАК JTICODE,
			|	dbo_vRetailSales1.SALES_PACKS КАК SALES_PACKS1,
			|	dbo_vRetailSales1.SALES_SUM КАК SALES_SUM1
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vRetailSales КАК dbo_vRetailSales1
			|ГДЕ
			|	dbo_vRetailSales1.Period МЕЖДУ &НачПериод1 И &КонПериод1";
			
			Запрос.УстановитьПараметр("НачПериод1", ДобавитьМесяц(НачалоМесяца(НачалоПериода),-1));
			Запрос.УстановитьПараметр("КонПериод1", ДобавитьМесяц(НачалоМесяца(КонецПериода),-1));
			ТЧ1 = Запрос.Выполнить().Выгрузить();
			
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Таблица1", ТЧ1);
			Запрос.УстановитьПараметр("Таблица2", ТЧ2);
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	dbo_vRetailSales1.Period КАК Period,
			|	dbo_vRetailSales1.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales1.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales1.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales1.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales1.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales1.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales1.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales1.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales1.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales1.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales1.BATCODE КАК BATCODE,
			|	dbo_vRetailSales1.BARCODES КАК BARCODES,
			|	dbo_vRetailSales1.MRP_PRICE КАК MRP_PRICE,
			|	dbo_vRetailSales1.SALES_QTY1 КАК SALES_QTY1,
			|	dbo_vRetailSales1.SALES_PACKS1 КАК SALES_PACKS1,
			|	dbo_vRetailSales1.SALES_SUM1 КАК SALES_SUM1,
			|	0 КАК SALES_QTY2,
			|	0 КАК SALES_PACKS2,
			|	0 КАК SALES_SUM2,
			|	dbo_vRetailSales1.JTICODE КАК JTICODE
			|ПОМЕСТИТЬ dbo_vRetailSales1
			|ИЗ
			|	&Таблица1 КАК dbo_vRetailSales1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	dbo_vRetailSales2.Period КАК Period,
			|	dbo_vRetailSales2.OUTLETID КАК OUTLETID,
			|	dbo_vRetailSales2.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vRetailSales2.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vRetailSales2.OUTLETADDRESS КАК OUTLETADDRESS,
			|	dbo_vRetailSales2.CITYCODE КАК CITYCODE,
			|	dbo_vRetailSales2.WHOUSEID КАК WHOUSEID,
			|	dbo_vRetailSales2.WHOUSEGUID КАК WHOUSEGUID,
			|	dbo_vRetailSales2.PRODUCTGUID КАК PRODUCTGUID,
			|	dbo_vRetailSales2.PRODUCTEXTID КАК PRODUCTEXTID,
			|	dbo_vRetailSales2.PRODUCTNAME КАК PRODUCTNAME,
			|	dbo_vRetailSales2.BATCODE КАК BATCODE,
			|	dbo_vRetailSales2.BARCODES КАК BARCODES,
			|	dbo_vRetailSales2.MRP_PRICE КАК MRP_PRICE,
			|	0 КАК SALES_QTY1,
			|	0 КАК SALES_PACKS1,
			|	0 КАК SALES_SUM1,
			|	dbo_vRetailSales2.SALES_QTY2 КАК SALES_QTY2,
			|	dbo_vRetailSales2.SALES_SUM2 КАК SALES_PACKS2,
			|	dbo_vRetailSales2.SALES_PACKS2 КАК SALES_SUM2,
			|	dbo_vRetailSales2.JTICODE КАК JTICODE
			|ПОМЕСТИТЬ dbo_vRetailSales2
			|ИЗ
			|	&Таблица2 КАК dbo_vRetailSales2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.Period КАК Period,
			|	ВложенныйЗапрос.OUTLETID КАК OUTLETID,
			|	ВложенныйЗапрос.OUTLETGUID КАК OUTLETGUID,
			|	ВложенныйЗапрос.OUTLETEXTID КАК OUTLETEXTID,
			|	ВложенныйЗапрос.OUTLETADDRESS КАК OUTLETADDRESS,
			|	ВложенныйЗапрос.CITYCODE КАК CITYCODE,
			|	ВложенныйЗапрос.WHOUSEID КАК WHOUSEID,
			|	ВложенныйЗапрос.WHOUSEGUID КАК WHOUSEGUID,
			|	ВложенныйЗапрос.PRODUCTGUID КАК PRODUCTGUID,
			|	ВложенныйЗапрос.PRODUCTEXTID КАК PRODUCTEXTID,
			|	ВложенныйЗапрос.PRODUCTNAME КАК PRODUCTNAME,
			|	ВложенныйЗапрос.BATCODE КАК BATCODE,
			|	ВложенныйЗапрос.BARCODES КАК BARCODES,
			|	ВложенныйЗапрос.MRP_PRICE КАК MRP_PRICE,
			|	СУММА(ВложенныйЗапрос.SALES_QTY1) КАК SALES_QTY1,
			|	СУММА(ВложенныйЗапрос.SALES_PACKS1) КАК SALES_PACKS1,
			|	СУММА(ВложенныйЗапрос.SALES_SUM1) КАК SALES_SUM1,
			|	СУММА(ВложенныйЗапрос.SALES_QTY2) КАК SALES_QTY2,
			|	СУММА(ВложенныйЗапрос.SALES_PACKS2) КАК SALES_PACKS2,
			|	СУММА(ВложенныйЗапрос.SALES_SUM2) КАК SALES_SUM2,
			|	ВложенныйЗапрос.JTICODE КАК JTICODE
			|ПОМЕСТИТЬ dbo_vRetailSales3
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			dbo_vRetailSales1.Period КАК Period,
			|			dbo_vRetailSales1.OUTLETID КАК OUTLETID,
			|			dbo_vRetailSales1.OUTLETGUID КАК OUTLETGUID,
			|			dbo_vRetailSales1.OUTLETEXTID КАК OUTLETEXTID,
			|			dbo_vRetailSales1.OUTLETADDRESS КАК OUTLETADDRESS,
			|			dbo_vRetailSales1.CITYCODE КАК CITYCODE,
			|			dbo_vRetailSales1.WHOUSEID КАК WHOUSEID,
			|			dbo_vRetailSales1.WHOUSEGUID КАК WHOUSEGUID,
			|			dbo_vRetailSales1.PRODUCTGUID КАК PRODUCTGUID,
			|			dbo_vRetailSales1.PRODUCTEXTID КАК PRODUCTEXTID,
			|			dbo_vRetailSales1.PRODUCTNAME КАК PRODUCTNAME,
			|			dbo_vRetailSales1.BATCODE КАК BATCODE,
			|			dbo_vRetailSales1.BARCODES КАК BARCODES,
			|			dbo_vRetailSales1.MRP_PRICE КАК MRP_PRICE,
			|			dbo_vRetailSales1.SALES_QTY1 КАК SALES_QTY1,
			|			dbo_vRetailSales1.SALES_PACKS1 КАК SALES_PACKS1,
			|			dbo_vRetailSales1.SALES_SUM1 КАК SALES_SUM1,
			|			dbo_vRetailSales1.SALES_QTY2 КАК SALES_QTY2,
			|			dbo_vRetailSales1.SALES_PACKS2 КАК SALES_PACKS2,
			|			dbo_vRetailSales1.SALES_SUM2 КАК SALES_SUM2,
			|			dbo_vRetailSales1.JTICODE КАК JTICODE
			|		ИЗ
			|			dbo_vRetailSales1 КАК dbo_vRetailSales1
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			dbo_vRetailSales2.Period,
			|			dbo_vRetailSales2.OUTLETID,
			|			dbo_vRetailSales2.OUTLETGUID,
			|			dbo_vRetailSales2.OUTLETEXTID,
			|			dbo_vRetailSales2.OUTLETADDRESS,
			|			dbo_vRetailSales2.CITYCODE,
			|			dbo_vRetailSales2.WHOUSEID,
			|			dbo_vRetailSales2.WHOUSEGUID,
			|			dbo_vRetailSales2.PRODUCTGUID,
			|			dbo_vRetailSales2.PRODUCTEXTID,
			|			dbo_vRetailSales2.PRODUCTNAME,
			|			dbo_vRetailSales2.BATCODE,
			|			dbo_vRetailSales2.BARCODES,
			|			dbo_vRetailSales2.MRP_PRICE,
			|			dbo_vRetailSales2.SALES_QTY1,
			|			dbo_vRetailSales2.SALES_PACKS1,
			|			dbo_vRetailSales2.SALES_SUM1,
			|			dbo_vRetailSales2.SALES_QTY2,
			|			dbo_vRetailSales2.SALES_PACKS2,
			|			dbo_vRetailSales2.SALES_SUM2,
			|			dbo_vRetailSales2.JTICODE
			|		ИЗ
			|			dbo_vRetailSales2 КАК dbo_vRetailSales2) КАК ВложенныйЗапрос
			|		ПО Номенклатура.Артикул = ВложенныйЗапрос.PRODUCTEXTID
			|ГДЕ
			|	ИСТИНА
			|    %1
			|    %2
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.PRODUCTNAME,
			|	ВложенныйЗапрос.MRP_PRICE,
			|	ВложенныйЗапрос.JTICODE,
			|	ВложенныйЗапрос.BATCODE,
			|	ВложенныйЗапрос.BARCODES,
			|	ВложенныйЗапрос.Period,
			|	ВложенныйЗапрос.OUTLETID,
			|	ВложенныйЗапрос.OUTLETGUID,
			|	ВложенныйЗапрос.OUTLETEXTID,
			|	ВложенныйЗапрос.OUTLETADDRESS,
			|	ВложенныйЗапрос.WHOUSEGUID,
			|	ВложенныйЗапрос.PRODUCTGUID,
			|	ВложенныйЗапрос.WHOUSEID,
			|	ВложенныйЗапрос.CITYCODE,
			|	ВложенныйЗапрос.PRODUCTEXTID";
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчетов, "Отборы", новый Структура());
			
			Отбор = ПоискиОтбора(Отборы,"Номенклатура"); 
			Если Отбор.Свойство("Номенклатура") Тогда
				Запрос.УстановитьПараметр("Номенклатура", Отбор.Номенклатура);
				ТекстОтбораНоменклатура = "И Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)";
			Иначе
				ТекстОтбораНоменклатура = "И Истина" + Символы.ПС;
			КонецЕсли;
			
			Если Отбор.Свойство("ТоварнаяМарка") Тогда
				Запрос.УстановитьПараметр("ТоварнаяМарка", Отбор.ТоварнаяМарка);
				ТекстОтбораТМ = "И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)";
			Иначе
				ТекстОтбораТМ = "И Истина" + Символы.пс;
			КонецЕсли;
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ТекстОтбораНоменклатура,ТекстОтбораТМ);
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		
		Если СтруктураВнешТаблиц.Свойство("dbo_vOUTLETS") Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vOUTLETS.OUTLETID КАК OUTLETID,
			|	dbo_vOUTLETS.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vOUTLETS.PARTNERNAME КАК PARTNERNAME,
			|	dbo_vOUTLETS.ZKPO КАК ZKPO,
			|	dbo_vOUTLETS.Area КАК Area,
			|	dbo_vOUTLETS.Territory КАК Territory,
			|	dbo_vOUTLETS.City КАК City,
			|	dbo_vOUTLETS.CityType КАК CityType,
			|	dbo_vOUTLETS.Street КАК Street,
			|	dbo_vOUTLETS.Home КАК Home,
			|	dbo_vOUTLETS.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vOUTLETS.JTICODE КАК JTICODE,
			|	dbo_vOUTLETS.CITYCODE КАК CITYCODE
			|ИЗ
			|	ВнешнийИсточникДанных.NIELSENBIS.Таблица.dbo_vOUTLETS КАК dbo_vOUTLETS";
			
			ТЧ = Запрос.Выполнить().Выгрузить();
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("Таблица", ТЧ);
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vOUTLETS.OUTLETID КАК OUTLETID,
			|	dbo_vOUTLETS.OUTLETGUID КАК OUTLETGUID,
			|	dbo_vOUTLETS.PARTNERNAME КАК PARTNERNAME,
			|	dbo_vOUTLETS.ZKPO КАК ZKPO,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Area КАК СТРОКА(120)) КАК Area,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Territory КАК СТРОКА(120)) КАК Territory,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.City КАК СТРОКА(120)) КАК City,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.CityType КАК СТРОКА(100)) КАК CityType,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Street КАК СТРОКА(120)) КАК Street,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Home КАК СТРОКА(20)) КАК Home,
			|	dbo_vOUTLETS.OUTLETEXTID КАК OUTLETEXTID,
			|	dbo_vOUTLETS.JTICODE КАК JTICODE,
			|	dbo_vOUTLETS.CITYCODE КАК CITYCODE
			|ПОМЕСТИТЬ dbo_vOUTLETS
			|ИЗ
			|	&Таблица КАК dbo_vOUTLETS";
			
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		
		Возврат МенеджерВременныхТаблиц;
		
	КонецФункции
	
	Функция СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, ПараметрыСКД = Неопределено, Отборы = Неопределено, СоответствиеПолейОтбора = Неопределено, Ошибки = "")
		
		ТаблицаРезультат = Новый ТаблицаЗначений; 		
		
		//Устанавливаем параметры
		Если ПараметрыСКД <> Неопределено Тогда 
			Для Каждого знПараметр Из ПараметрыСКД Цикл 
				нПараметр = Настройки.ПараметрыДанных.Элементы.Найти(знПараметр.Ключ);
				Если нПараметр <> Неопределено Тогда 
					нПараметр.Использование = Истина;
					нПараметр.Значение = знПараметр.Значение;			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Устанавливаем отборы			
		Если Отборы <> Неопределено И СоответствиеПолейОтбора <> Неопределено Тогда 
			Для Каждого Стр Из СоответствиеПолейОтбора Цикл 
				ИмяПоляОтбора = Стр.Ключ;
				ИмяПоляСКД = Стр.Значение;
				
				мСтрОтборы = Неопределено;
				Если Отборы.Свойство(ИмяПоляОтбора, мСтрОтборы) Тогда 
					Для Каждого стрОтбор Из мСтрОтборы Цикл 
						
						Если ЗначениеЗаполнено(ИмяПоляСКД) И ИмяПоляОтбора <> ИмяПоляСКД Тогда 
							мСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрОтбор.ИмяПоля, ".", Истина, Истина);
							ИмяПоля = "";
							Для Ит = 0 По мСлов.ВГраница() Цикл 
								Если Ит = 0 Тогда 
									ИмяПоля = ИмяПоляСКД;
								Иначе
									ИмяПоля = ИмяПоля + "." + мСлов.Получить(Ит);
								КонецЕсли;
							КонецЦикла;
						Иначе
							ИмяПоля = стрОтбор.ИмяПоля;
						КонецЕсли;
						
						ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, ИмяПоля, стрОтбор.ПравоеЗначение, стрОтбор.ВидСравнения,, Истина);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпновки)); 
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); 
		
		НастройкиКомпоновщика = КомпоновщикНастроек.Настройки; 
		ПараметрыНастройки = Настройки.ПараметрыДанных; 
		
		//Получим макет компоновки    
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпновки, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
		
		//Через процессор компоновки получим результат
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;	
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
		
		Возврат ТаблицаРезультат;
		
	КонецФункции
	
	
	Процедура СформироватьОтчетПродажи(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		текДата 				= ТекущаяДата();	
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
			Возврат;
		КонецЕсли;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("WHCode");
		ТаблицаРезультат.Колонки.Добавить("CustomerTo");
		ТаблицаРезультат.Колонки.Добавить("JTIBrandCode");
		ТаблицаРезультат.Колонки.Добавить("Price");
		ТаблицаРезультат.Колонки.Добавить("Stock", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));
		ТаблицаРезультат.Колонки.Добавить("UM");
		ТаблицаРезультат.Колонки.Добавить("MRP", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		ТаблицаРезультат.Колонки.Добавить("Sales", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));	
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	""W1-888637166"" КАК WHCode,
			|	ДополнительныеСведения.Значение КАК JTIBrandCode,
			|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК Sales,
			|	dbo_vRetailSales.JTICODE КАК CustomerTo,
			|	2 КАК UM,
			|	"""" КАК Price,
			|	0 КАК Stock,
			|	dbo_vRetailSales.MRP_PRICE / 100 КАК MRP
			|ИЗ
			|	dbo_vRetailSales КАК dbo_vRetailSales
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|		ПО dbo_vRetailSales.PRODUCTEXTID = ДополнительныеСведения.Объект.Артикул
			|			И (ДополнительныеСведения.Свойство.Имя = ""BrandCodeJTI"")
			|			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
			|ГДЕ
			|	dbo_vRetailSales.JTICODE <> """"
			|
			|СГРУППИРОВАТЬ ПО
			|	ДополнительныеСведения.Значение,
			|	dbo_vRetailSales.JTICODE,
			|	dbo_vRetailSales.MRP_PRICE / 100
			|
			|УПОРЯДОЧИТЬ ПО
			|	WHCode,
			|	JTIBrandCode";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИзВнутреннегоИсточника Тогда 
			
			СхемаКомпновки = ПолучитьМакет("Отчет1");
			Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
			
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
			СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
			
			////Соответствие имен полей отборов на форме и в схеме компоновки
			// - Ключ - Имя поля отбора формы
			// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
			//
			СоответствиеПолейОтбора = Новый Структура;
			СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
			СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
			СоответствиеПолейОтбора.Вставить("СкладКомпании");
			СоответствиеПолейОтбора.Вставить("Номенклатура");				
			СоответствиеПолейОтбора.Вставить("Контрагент", "Покупатель");
			
			ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
			
			Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
			КонецЦикла;
		КонецЕсли;
		
		СписокСтолбцов = Новый Структура("WHCode,CustomerTo,JTIBrandCode,Sales,Price,Stock,UM,MRP");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				
				Если ИмяКолонки = "Sales" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=0; ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет1_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("Отчет1", СтруктураРезультат);
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетОстатки(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		текДата 				= ТекущаяДата();	
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
			Возврат;
		КонецЕсли;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("WHCode");
		ТаблицаРезультат.Колонки.Добавить("CustomerTo");
		ТаблицаРезультат.Колонки.Добавить("JTIBrandCode");
		ТаблицаРезультат.Колонки.Добавить("Price");
		ТаблицаРезультат.Колонки.Добавить("Stock", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));
		ТаблицаРезультат.Колонки.Добавить("UM");
		ТаблицаРезультат.Колонки.Добавить("MRP");
		ТаблицаРезультат.Колонки.Добавить("Sales", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));	
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
			
			Отбор = ПоискиОтбора(Отборы,"Номенклатура"); 
			Если Отбор.Свойство("Номенклатура") Тогда
				Запрос.УстановитьПараметр("Номенклатура", Отбор.Номенклатура);
				ТекстОтбораНоменклатура = "И Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура)";
			Иначе
				ТекстОтбораНоменклатура = "И Истина" + Символы.ПС;
			КонецЕсли;
			
			Если Отбор.Свойство("ТоварнаяМарка") Тогда
				Запрос.УстановитьПараметр("ТоварнаяМарка", Отбор.ТоварнаяМарка);
				ТекстОтбораТМ = "И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ (&ТоварнаяМарка)";
			Иначе
				ТекстОтбораТМ = "И Истина" + Символы.пс;
			КонецЕсли;
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	""W1-888637166"" КАК WHCode,
			|	ДополнительныеСведения.Значение КАК JTIBrandCode,
			|	СУММА(dbo_vSTOCKS.STOCK_PACKS) КАК Stock,
			|	dbo_vSTOCKS.MRP_PRICE / 100 КАК MRP,
			|	2 КАК UM,
			|	0 КАК Sales,
			|	"""" КАК Price,
			|	"""" КАК CustomerTo
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ dbo_vSTOCKS КАК dbo_vSTOCKS
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|			ПО dbo_vSTOCKS.PRODUCTEXTID = ДополнительныеСведения.Объект.Артикул
			|				И (ДополнительныеСведения.Свойство.Имя = ""BrandCodeJTI"")
			|				И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
			|		ПО Номенклатура.Артикул = dbo_vSTOCKS.PRODUCTEXTID
			|ГДЕ
			|	ИСТИНА
			|	 %1
			|	 %2
			|
			|СГРУППИРОВАТЬ ПО
			|	ДополнительныеСведения.Значение,
			|	dbo_vSTOCKS.MRP_PRICE / 100";
			
			Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса,ТекстОтбораНоменклатура,ТекстОтбораТМ);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИзВнутреннегоИсточника Тогда 
			
			СхемаКомпновки = ПолучитьМакет("Отчет1b");
			Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
			
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
			СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
			
			СоответствиеПолейОтбора = Новый Структура;
			СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
			СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
			СоответствиеПолейОтбора.Вставить("СкладКомпании");
			СоответствиеПолейОтбора.Вставить("Номенклатура");				
			СоответствиеПолейОтбора.Вставить("Контрагент", "Покупатель");
			
			ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
			
			Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
			КонецЦикла;
		КонецЕсли;
		
		
		СписокСтолбцов = Новый Структура("WHCode,CustomerTo,JTIBrandCode,Sales,Price,Stock,UM,MRP");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				
				Если ИмяКолонки = "Stock" или ИмяКолонки = "Sales" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧН=0; ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет 1b_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("Отчет1b", СтруктураРезультат);	
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетПродажиПоТочкам(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		текДата 				= ТекущаяДата();	
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
			Возврат;
		КонецЕсли;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("WHCode");
		ТаблицаРезультат.Колонки.Добавить("DistributorOutletCode");
		ТаблицаРезультат.Колонки.Добавить("SiebelOutletCode");
		ТаблицаРезультат.Колонки.Добавить("City");
		ТаблицаРезультат.Колонки.Добавить("OutletName");
		ТаблицаРезультат.Колонки.Добавить("ActualAddress");
		ТаблицаРезультат.Колонки.Добавить("LegalAddress");
		ТаблицаРезультат.Колонки.Добавить("Channel");
		ТаблицаРезультат.Колонки.Добавить("JTIBrandCode");
		ТаблицаРезультат.Колонки.Добавить("Sales");	
		ТаблицаРезультат.Колонки.Добавить("UM");	
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	""W1-888637166"" КАК WHCode,
			|	dbo_vOUTLETS.OUTLETID КАК DistributorOutletCode,
			|	dbo_vOUTLETS.City КАК City,
			|	dbo_vOUTLETS.PARTNERNAME КАК OutletName,
			|	dbo_vRetailSales.OUTLETADDRESS КАК ActualAddress,
			|	dbo_vRetailSales.OUTLETADDRESS КАК LegalAddress,
			|	dbo_vRetailSales.JTICODE КАК SiebelOutletCode,
			|	7 КАК Channel,
			|	СУММА(dbo_vRetailSales.SALES_PACKS) КАК Sales,
			|	2 КАК UM,
			|	ДополнительныеСведения.Значение КАК JTIBrandCode
			|ИЗ
			|	dbo_vOUTLETS КАК dbo_vOUTLETS
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ dbo_vRetailSales КАК dbo_vRetailSales
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|			ПО dbo_vRetailSales.PRODUCTEXTID = ДополнительныеСведения.Объект.Артикул
			|				И (ДополнительныеСведения.Свойство.Имя = ""BrandCodeJTI"")
			|				И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
			|		ПО dbo_vOUTLETS.OUTLETID = dbo_vRetailSales.OUTLETID
			|ГДЕ
			|	dbo_vRetailSales.JTICODE <> """"
			|
			|СГРУППИРОВАТЬ ПО
			|	dbo_vOUTLETS.PARTNERNAME,
			|	dbo_vOUTLETS.City,
			|	dbo_vOUTLETS.OUTLETID,
			|	dbo_vRetailSales.OUTLETADDRESS,
			|	ДополнительныеСведения.Значение,
			|	dbo_vRetailSales.JTICODE,
			|	dbo_vRetailSales.OUTLETADDRESS
			|
			|УПОРЯДОЧИТЬ ПО
			|	WHCode";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
		КонецЕсли;
		
		Если ИзВнутреннегоИсточника Тогда 
			
			СхемаКомпновки = ПолучитьМакет("Отчет10");
			Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
			
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
			СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
			
			////Соответствие имен полей отборов на форме и в схеме компоновки
			// - Ключ - Имя поля отбора формы
			// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
			//
			СоответствиеПолейОтбора = Новый Структура;
			СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
			СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
			СоответствиеПолейОтбора.Вставить("СкладКомпании");
			СоответствиеПолейОтбора.Вставить("Номенклатура");				
			СоответствиеПолейОтбора.Вставить("Контрагент", "Покупатель");
			
			ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
			
			Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
			КонецЦикла;
		КонецЕсли;
		
		СписокСтолбцов = Новый Структура("WHCode, DistributorOutletCode, SiebelOutletCode, City, OutletName, ActualAddress, LegalAddress, Channel, JTIBrandCode, Sales, UM");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				Если ИмяКолонки = "Sales" или ИмяКолонки = "DistributorOutletCode" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет10_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("Отчет10", СтруктураРезультат);		
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетТочкиДоставки(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		СхемаКомпновки = ПолучитьМакет("Отчет11");
		Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);	
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент", "Покупатель");
		
		ТаблицаРезультат = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	dbo_vOUTLETS.OUTLETID КАК КодТочки,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА dbo_vRetailSales3.SALES_PACKS2 = 0
			|				ТОГДА ""N""
			|			ИНАЧЕ ""Y""
			|		КОНЕЦ) КАК ФактПродажи2,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА dbo_vRetailSales3.SALES_PACKS1 = 0
			|				ТОГДА ""N""
			|			ИНАЧЕ ""Y""
			|		КОНЕЦ) КАК ФактПродажи1,
			|	dbo_vOUTLETS.City КАК НаселенныйПункт,
			|	dbo_vRetailSales3.OUTLETADDRESS КАК РСПОтгрузки,
			|	3 КАК КаналСбыта,
			|	dbo_vOUTLETS.PARTNERNAME КАК НаименованиеКлиента,
			|	dbo_vOUTLETS.PARTNERNAME КАК Покупатель,
			|	dbo_vOUTLETS.ZKPO КАК КодЕГРПОУ,
			|	dbo_vRetailSales3.JTICODE КАК SiebelOutletCode,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Area КАК СТРОКА(120)) КАК Область,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Territory КАК СТРОКА(120)) КАК Район,
			|	dbo_vRetailSales3.OUTLETADDRESS КАК Адрес,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Street КАК СТРОКА(120)) КАК Улица,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Home КАК СТРОКА(20)) КАК НомерДома,
			|	"""" КАК Категория,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.JTICODE КАК СТРОКА(50)) КАК КодJTI,
			|	"""" КАК МенеджерКод,
			|	"""" КАК МенеджерИмя
			|ИЗ
			|	dbo_vOUTLETS КАК dbo_vOUTLETS
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ dbo_vRetailSales3 КАК dbo_vRetailSales3
			|		ПО dbo_vOUTLETS.OUTLETID = dbo_vRetailSales3.OUTLETID
			|ГДЕ
			|	dbo_vRetailSales3.JTICODE <> """"
			|
			|СГРУППИРОВАТЬ ПО
			|	dbo_vOUTLETS.PARTNERNAME,
			|	dbo_vOUTLETS.City,
			|	dbo_vOUTLETS.OUTLETID,
			|	dbo_vRetailSales3.OUTLETADDRESS,
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Area КАК СТРОКА(120)),
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Territory КАК СТРОКА(120)),
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Street КАК СТРОКА(120)),
			|	ВЫРАЗИТЬ(dbo_vOUTLETS.Home КАК СТРОКА(20)),
			|	dbo_vOUTLETS.ZKPO,
			|	dbo_vRetailSales3.JTICODE,
			|	dbo_vOUTLETS.JTICODE,
			|	dbo_vOUTLETS.PARTNERNAME,
			|	dbo_vRetailSales3.OUTLETADDRESS
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодТочки";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
		КонецЕсли;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		
		СтрокаЗаголовки = "КодТочки; -2-…МЕСЯЦ; -1-…МЕСЯЦ; РЦ Отгрузки; Менеджер(код); Менеджер(имя); КаналСбыта; НаименованиеКлиента; КодЕГРПОУ; Покупатель; Область; Район; НаселённыйПункт; Адрес; Улица; НомерДома; Категория; КодJTI;";
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		СписокСтолбцов = Новый Структура("КодТочки, ФактПродажи2, ФактПродажи1, РЦ_Отгрузки, МенеджерКод, МенеджерИмя, КаналСбыта, НаименованиеКлиента, КодЕГРПОУ, Покупатель, Область, Район, НаселённыйПункт, Адрес, Улица, НомерДома, Категория, КодJTI");
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				Если ИмяКолонки = "КодТочки" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		текДата = ТекущаяДата();	
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет11_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("Отчет11", СтруктураРезультат);			
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетПродажиПоРегионам(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		СхемаКомпновки = ПолучитьМакет("Отчет2");
		Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);	
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент");
		
		ТаблицаРезультат = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	""North R3"" КАК JTIRegionCode,
			|	СУММА(dbo_vRetailSales.SALES_PACKS * 20) КАК SalesVolume,
			|	""1"" КАК UM
			|ИЗ
			|	dbo_vRetailSales КАК dbo_vRetailSales
			|ГДЕ
			|	dbo_vRetailSales.JTICODE <> """"";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НайденыеСтроки = ТаблицаРезультат.НайтиСтроки(Новый Структура("JTIRegionCode", "North R3"));
				Если НайденыеСтроки.КОличество() = 0 ТОгда
					НоваяСтрока = ТаблицаРезультат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
				Иначе
					Для Каждого СтрокаТаблицы из НайденыеСтроки Цикл
						СтрокаТаблицы.SalesVolume = СтрокаТаблицы.SalesVolume +Выборка.SalesVolume; 	
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СписокСтолбцов = Новый Структура("JTIRegionCode, SalesVolume, UM");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				
				Если ИмяКолонки = "SalesVolume" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=2; ЧН=0; ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		текДата = ТекущаяДата();	
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет2_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("ОтчетПродажиПоРегионам", СтруктураРезультат);
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетПродажиПоСкладам(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		СхемаКомпновки = ПолучитьМакет("Отчет3");
		Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
		СтруктураПараметры.Вставить("КонецПериода", КонецПериода);	
		
		Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
		
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		////Соответствие имен полей отборов на форме и в схеме компоновки
		// - Ключ - Имя поля отбора формы
		// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
		//
		СоответствиеПолейОтбора = Новый Структура;
		СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
		СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
		СоответствиеПолейОтбора.Вставить("СкладКомпании");
		СоответствиеПолейОтбора.Вставить("Номенклатура");				
		СоответствиеПолейОтбора.Вставить("Контрагент");
		
		ТаблицаРезультат = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	""W1-888637166"" КАК WHCode,
			|	СУММА(dbo_vRetailSales.SALES_PACKS * 20) КАК SalesVolume,
			|	""1"" КАК UM
			|ИЗ
			|	dbo_vRetailSales КАК dbo_vRetailSales";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
		КонецЕсли;
		
		СписокСтолбцов = Новый Структура("WHCode, SalesVolume, UM");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				
				Если ИмяКолонки = "SalesVolume" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=2; ЧН=0; ЧГ=0");
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		текДата = ТекущаяДата();	
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет3_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("ОтчетПродажиПоСкладам", СтруктураРезультат);
		
	КонецПроцедуры
	
	Процедура СформироватьОтчетДляДистрибьюторов(НачалоПериода, КонецПериода, Параметры, Знач МенеджерВременныхТаблиц)
		
		текДата 				= ТекущаяДата();	
		ИзВнутреннегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнутреннегоИсточника", Ложь);
		ИзВнешнегоИсточника 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИзВнешнегоИсточника", Ложь);
		
		Если Не ИзВнутреннегоИсточника И Не ИзВнешнегоИсточника Тогда 
			Возврат;
		КонецЕсли;
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("DATE_WEEK");
		ТаблицаРезультат.Колонки.Добавить("WEEK");
		ТаблицаРезультат.Колонки.Добавить("WH_NAME");
		ТаблицаРезультат.Колонки.Добавить("ADDRESS_SAP_ID");
		ТаблицаРезультат.Колонки.Добавить("JTI_TT_CODE");
		ТаблицаРезультат.Колонки.Добавить("MATERIAL_ID");
		ТаблицаРезультат.Колонки.Добавить("MATERIAL_NAME");
		ТаблицаРезультат.Колонки.Добавить("Sales", ОбщегоНазначения.ОписаниеТипаЧисло(15, 0));	
		ТаблицаРезультат.Колонки.Добавить("RSP_NAME");
		
		Если ИзВнешнегоИсточника И МенеджерВременныхТаблиц <> Неопределено Тогда 				
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	"""" КАК DATE_WEEK,
			               |	"""" КАК WEEK,
			               |	""W1-888637166"" КАК WH_NAME,
			               |	"""" КАК ADDRESS_SAP_ID,
			               |	dbo_vRetailSales.JTICODE КАК JTI_TT_CODE,
			               |	"""" КАК MATERIAL_ID,
			               |	ДополнительныеСведения.Значение КАК MATERIAL_NAME,
			               |	СУММА(dbo_vRetailSales.SALES_PACKS) КАК Sales,
			               |	"""" КАК RSP_NAME
			               |ИЗ
			               |	dbo_vRetailSales КАК dbo_vRetailSales
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			               |		ПО dbo_vRetailSales.PRODUCTEXTID = ДополнительныеСведения.Объект.Артикул
			               |			И (ДополнительныеСведения.Свойство.Имя = ""BrandCodeJTI"")
			               |			И (ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура)
			               |ГДЕ
			               |	dbo_vRetailSales.JTICODE <> """"
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ДополнительныеСведения.Значение,
			               |	dbo_vRetailSales.JTICODE
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	WH_NAME,
			               |	MATERIAL_NAME";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИзВнутреннегоИсточника Тогда 
			
			СхемаКомпновки = ПолучитьМакет("Отчет4");
			Настройки = СхемаКомпновки.НастройкиПоУмолчанию;
			
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("НачалоПериода", НачалоПериода);
			СтруктураПараметры.Вставить("КонецПериода", КонецПериода);
			
			Отборы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отборы", новый Структура());
			
			////Соответствие имен полей отборов на форме и в схеме компоновки
			// - Ключ - Имя поля отбора формы
			// - Значение - Имя поля отбора	Схемы компоновки (Пустое значение если имена не различаются)
			//
			СоответствиеПолейОтбора = Новый Структура;
			СоответствиеПолейОтбора.Вставить("ПодразделениеКомпании");
			СоответствиеПолейОтбора.Вставить("ТорговаяПлощадка");
			СоответствиеПолейОтбора.Вставить("СкладКомпании");
			СоответствиеПолейОтбора.Вставить("Номенклатура");				
			СоответствиеПолейОтбора.Вставить("Контрагент", "Покупатель");
			
			ТаблицаРезультатВн = СформироватьТаблицуРезультатаСКД(СхемаКомпновки, Настройки, СтруктураПараметры, Отборы, СоответствиеПолейОтбора);		
			
			Для Каждого СтрТЧ Из ТаблицаРезультатВн Цикл 
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
			КонецЦикла;
		КонецЕсли;
		
		DATE_WEEK = Формат(текДата, "ДФ=yyyy")+"-"+ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода);
		WEEK = Формат(НачалоПериода,"ДФ=dd.MM.yyyy");
		
		СписокСтолбцов = Новый Структура("DATE_WEEK,WEEK,WH_NAME,ADDRESS_SAP_ID,JTI_TT_CODE,MATERIAL_ID,MATERIAL_NAME,Sales,RSP_NAME");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		СтрокаЗаголовки = "";
		Для Каждого Колонка Из СписокСтолбцов Цикл 
			СтрокаЗаголовки = СтрокаЗаголовки + Колонка.Ключ + ";";
		КонецЦикла;
		ТекстовыйДокумент.ДобавитьСтроку(СтрокаЗаголовки);
		
		Для Каждого Стр Из ТаблицаРезультат Цикл 
			ТекСтрока = "";
			Для Каждого Колонка Из СписокСтолбцов Цикл 
				ИмяКолонки = Колонка.Ключ;
				
				Если ИмяКолонки = "Sales" Тогда 
					Значение = Формат(Стр[ИмяКолонки], "ЧДЦ=0; ЧГ=0");
				ИначеЕсли ИмяКолонки = "DATE_WEEK" Тогда
					Значение = DATE_WEEK;
				ИначеЕсли ИмяКолонки = "WEEK" Тогда
					Значение = WEEK;
				Иначе
					Значение = СокрЛП(Стр[ИмяКолонки]);
				КонецЕсли;
				
				ТекСтрока = ТекСтрока + Значение + ";";
			КонецЦикла;
			ТекстовыйДокумент.ДобавитьСтроку(ТекСтрока);
		КонецЦикла;
		
		Если КонецПериода - НачалоПериода > 604800 Тогда 
			Период = "m";
		Иначе
			Период = "w";
		КонецЕсли;
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", ТекстовыйДокумент);
		СтруктураРезультат.Вставить("ИмяФайла", Формат(текДата, "ДФ=yyyy")+"_"+Период+"_" + ОбщегоНазначенияТККлиентСервер.НеделяГода_ISO8601(НачалоПериода)+"_Отчет4_"+Формат(текДата, "ДФ=yyyy-MM-dd") + ".csv"); 
		
		Параметры.Результат.Вставить("Отчет1", СтруктураРезультат);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	#Область ПрочиеПроцедурыИФункции
	
	Функция ПодключениеКВнешнемуИсточнику(ТекстСообщения)
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = ПредопределенноеЗначение("СостояниеВнешнегоИсточникаДанных.Подключен") Тогда
			Возврат Истина;
		КонецЕсли;	
		
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
			СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
		ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
			СтрокаПодключения = "DRIVER={SQL Server Native Client 11.0};";
		Иначе
			ТекстСообщения = ТекстСообщения + НСтр("ru='Операционная система "+СистемнаяИнформация.ТипПлатформы +" не поддерживается.';uk='Операційна система "+ СистемнаяИнформация.ТипПлатформы +" не підтримується'")+Символы.ПС;
			
			Возврат Ложь
		КонецЕсли;
		
		ПараметрыПодключенияВИ = ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьОбщиеПараметрыСоединения();
		ПараметрыПодключенияВИ.АутентификацияСтандартная = Истина;
		ПараметрыПодключенияВИ.АутентификацияОС = Ложь;
		ПараметрыПодключенияВИ.ИмяПользователя = "1cuser"; 
		ПараметрыПодключенияВИ.Пароль = "fCG2eSvVd5mtqBpe";
		ПараметрыПодключенияВИ.СтрокаСоединения = СтрокаПодключения +";SERVER=NIELSENBIS;DATABASE=Attika_Tranzit;LANGUAGE=русский";
		
		ПараметрыПодключенияВИ.СУБД = "MSSQLServer";
		
		ВнешниеИсточникиДанных.NIELSENBIS.УстановитьОбщиеПараметрыСоединения(ПараметрыПодключенияВИ);
		
		Попытка
			ВнешниеИсточникиДанных.NIELSENBIS.УстановитьСоединение();
		Исключение
			ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
		КонецПопытки;
		
		Если ВнешниеИсточникиДанных.NIELSENBIS.ПолучитьСостояние() = СостояниеВнешнегоИсточникаДанных.Подключен Тогда
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
		
	КонецФункции
	
	Функция ПолучитьСтруктуруВнешнихТаблиц(СписокОтчетов)
		
		СтруктураВнешТаблиц = Новый Структура;
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоРегионам") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоСкладам") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетПродажиПоТочкам") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
			СтруктураВнешТаблиц.Вставить("dbo_vOUTLETS");
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетТочкиДоставки") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vRetailSales3");
			СтруктураВнешТаблиц.Вставить("dbo_vOUTLETS");
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетПродажи") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vRetailSales");
		КонецЕсли;
		
		Если СписокОтчетов.Свойство("ОтчетОстатки") Тогда 
			СтруктураВнешТаблиц.Вставить("dbo_vSTOCKS");
		КонецЕсли;
		
		
		
		Возврат СтруктураВнешТаблиц;
		
	КонецФункции
	
	Функция ПоискиОтбора(КомпоновщикНастроек,ПолеОтбора)
		
		Отборы = Новый Структура;
		
		Для каждого Отбор Из КомпоновщикНастроек Цикл 
			Если Отбор.Ключ = ПолеОтбора Тогда 
				Для Каждого СтрокаОтбора из Отбор.Значение Цикл
					Если СтрокаОтбора.ИмяПоля = "Номенклатура" Тогда
						Отборы.Вставить("Номенклатура",СтрокаОтбора.ПравоеЗначение);
					ИначеЕсли СтрокаОтбора.ИмяПоля = "Номенклатура.ТоварнаяМарка" Тогда 
						Отборы.Вставить("ТоварнаяМарка",СтрокаОтбора.ПравоеЗначение);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Возврат  Отборы;
		
	КонецФункции
	
	#КонецОбласти
	
	
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
