Процедура ПроверитьДоступУстройства(КодМобильногоКомпьютера)
	
	УзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
	Если УзелОбмена.ДоступЗапрещен Тогда
		ВызватьИсключение(
			НСтр("ru='Устройству запрещена синхронизация с центральной базой.';uk='Пристрою заборонена синхронізація з центральною базою.'")
		);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПраваПользователя(Пользователь = Неопределено)
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	
	//Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава)
	//   И НЕ(РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыПродажи) // Профиль Базовые права.
	//	  И РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыКасса)
	//	  И РольДоступна(Метаданные.Роли.ДобавлениеИзменениеПодсистемыБанк)) Тогда // Профиль Деньги.
	//	
	//	ВызватьИсключение(
	//		НСтр("ru='У пользователя ""';uk='У користувача ""'")
	//	  + Пользователь
	//	  + НСтр("ru='"" нет прав на синхронизацию данных с мобильным приложением Управление небольшой фирмой для Украины. Необходимо включить профили прав доступа Базовые права и Деньги.';uk='"" немає прав на синхронізацію даних з мобільним додатком Управління невеликою фірмою для України. Необхідно увімкнути профілі прав доступу Базові права і Гроші.'")
	//	);
	//	
	//КонецЕсли;
	
КонецПроцедуры






Функция StartExchange(MobileDeviceID, MobileApplicationVersion,НомерОтправленного,НомерПринятого)
	Попытка
		Возврат ОбменМобильноеПриложение.НачалоОбмена(MobileDeviceID, MobileApplicationVersion,НомерОтправленного,НомерПринятого);
	Исключение
		Ош = ОписаниеОшибки();
	КонецПопытки;
КонецФункции


Функция ПринятьПакетОбмена(ДанныеМобильногоПриложения, КодМобильногоКомпьютера, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого)
	
		
	СтруктураОтвета = Новый Структура("ИдентификаторЗадания, НовыйОбмен,ДанныеОбмена", Неопределено, Ложь,Неопределено);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	ПроверитьПраваПользователя(Пользователь);

	ПроверитьДоступУстройства(КодМобильногоКомпьютера);

	
	УстановитьПривилегированныйРежим(Истина);
	
	
		
	СтруктураОтбора = Новый Структура("Наименование", КодМобильногоКомпьютера);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	ЕстьАктивноеЗадание = Ложь;
	Для Каждого ФоновоеЗадание Из МассивЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ЕстьАктивноеЗадание = Истина;
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	КонецЦикла;

	Попытка 
		УзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.ЭтотУзел().ПолучитьОбъект();
	Исключение
		оп = ОписаниеОшибки();
	КонецПопытки;

	Если НЕ ЗначениеЗаполнено(УзелОбмена.Код) Тогда
		
		УзелОбмена.ОбменДанными.Загрузка = Истина;
		УзелОбмена.Код = "001";
		УзелОбмена.Наименование = "Центральный";
		УзелОбмена.Записать();
		
	КонецЕсли;
	
	
	НужнаИнициализацияУзла = Ложь;
	УзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьУзелОбменаМобильногоУстройства(КодМобильногоКомпьютера);
	Если УзелОбмена.Пустая() Тогда
		
			
		НовыйУзел = ПланыОбмена.ОбменМобильноеПриложение.СоздатьУзел();
		НовыйУзел.Код = КодМобильногоКомпьютера;
		НовыйУзел.Наименование = НаименованиеМобильногоКомпьютера;
		НовыйУзел.НомерОтправленного = НомерОтправленного;
		НовыйУзел.НомерПринятого = НомерПринятого;
		НовыйУзел.Записать();
		УзелОбмена = НовыйУзел.Ссылка;
		НужнаИнициализацияУзла = Истина;
		
	Иначе
		
		Если УзелОбмена.ПометкаУдаления ИЛИ
			УзелОбмена.Наименование <> НаименованиеМобильногоКомпьютера Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.ПометкаУдаления = Ложь;
			Узел.Наименование = НаименованиеМобильногоКомпьютера;
			Узел.Записать();
			
		КонецЕсли;
		
			
		Если УзелОбмена.НомерОтправленного = 0
			ИЛИ УзелОбмена.НомерПринятого = 0
			ИЛИ УзелОбмена.НомерОтправленного < НомерПринятого
			ИЛИ УзелОбмена.НомерПринятого <> НомерОтправленного Тогда
			
			Узел = УзелОбмена.ПолучитьОбъект();
			Узел.НомерОтправленного = НомерПринятого;
			Узел.НомерПринятого = НомерОтправленного;
			Узел.Записать();
			
			НужнаИнициализацияУзла = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

		
	ОбменМобильноеПриложение.ОбработатьПринятыйПакетЗагрузки(УзелОбмена, ДанныеМобильногоПриложения,Ложь,Ложь,СтруктураОтвета);
	
	ОбменМобильноеПриложение.ЗапуститьФормированиеОчередиСообщенийОбмена(УзелОбмена, КодМобильногоКомпьютера, НомерПринятого, НужнаИнициализацияУзла, СтруктураОтвета.ИдентификаторЗадания);
	СтруктураОтвета.НовыйОбмен = НужнаИнициализацияУзла;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета, Новый СжатиеДанных(9));

КонецФункции

Функция ПолучитьПакетОбмена(КодМобильногоКомпьютера, НомерСообщенияОбмена, ИдентификаторЗадания)
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		УзелОбмена = ПланыОбмена.ОбменМобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера); 
		
		Если УзелОбмена.Пустая() Тогда
			ВызватьИсключение(НСтр("ru='Неизвестное устройство - ';uk='Невідоме обладнання -'") + КодМобильногоКомпьютера);
		КонецЕсли;
		
		Возврат ОбменМобильноеПриложение.ПолучитьСообщениеОбмена(УзелОбмена, НомерСообщенияОбмена, ИдентификаторЗадания);
		
	Исключение
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен данными с мобильный приложением. Получение пакета обмена.';uk='Обмін даними з мобільний додатком. Отримання пакету обміну.'"),
		УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
		ВызватьИсключение ПредставлениеОшибки;
		
	КонецПопытки;

КонецФункции
