
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// эти документы создаются только автоматически
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		текстСообщения = "Эти документы создаются только автоматически";	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(текстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры


&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	Если Объект.ПометкаУдаления Тогда 
		СостояниеДокумента = 3;
	Иначе
		СостояниеДокумента = 1;
	КонецЕсли;
	
КонецПроцедуры

