
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		// эти документы создаются только автоматически
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		текстСообщения = "Эти документы создаются только автоматически";	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(текстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры


&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

