

Функция СформироватьКорректировку(НаДату,ДнейОтсрочки,Ошибки="")	Экспорт 
	ВсеОК = Истина;
	СрокПоставки = НачалоДня(НаДату)-86400*ДнейОтсрочки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ОбработкаЗаказовПоставщикуОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки КАК СрокПоставки,
	|	ОбработкаЗаказовПоставщикуОстатки.ОбработанОстаток КАК ОбработанОстаток
	|ИЗ
	|	РегистрНакопления.ОбработкаЗаказовПоставщику.Остатки(&НаДату, ) КАК ОбработкаЗаказовПоставщикуОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	|			ИНАЧЕ ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки
	|		КОНЕЦ <= &СрокПоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("СрокПоставки", СрокПоставки);
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	Выборка = Результат.Выбрать();
	
	нпп = 0;
	НуженДок = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЗаказПоставщику") Цикл 
		
		Если НуженДок Тогда
			дОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
			дОбъект.Дата = ТекущаяДата();	
			дОбъект.Ответственный = Пользователи.ТекущийПользователь();
			дОбъект.Комментарий = "Корректировка Обработка заказа поставщику"+Символы.ПС+"Сформирован автоматически "+дОбъект.Дата;
			СтрокаТЧ = дОбъект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя = "ОбработкаЗаказовПоставщику";
			
			Попытка
				дОбъект.Записать();
				НуженДок = Ложь;
				НаборЗаписей=РегистрыНакопления.ОбработкаЗаказовПоставщику.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение=дОбъект.Ссылка;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеОбработкаЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			нпп = нпп + 1;
			Движение=НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,Выборка);
			Движение.Регистратор = дОбъект.Ссылка;
			Движение.Период = дОбъект.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Обработан = -Выборка.ОбработанОстаток;
			Движение.ХозОперация = Справочники.ХозОперации.КорректировкаУчетныхДанных;
		КонецЦикла;
		
		Если нпп > 8888 Тогда
			нпп = 0;
			НуженДок = Истина;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать(Ложь);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоЗакрытиеОбработкаЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
			ВсеОК = Ложь;
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат  ВсеОК;	
КонецФункции
