
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	//Если ХозОперация = Справочники.ХозОперации.НачислениеКоммунальныхУслуг Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Услуги.Счетчик");
	//КонецЕсли;
	//Если ХозОперация = Справочники.ХозОперации.ВводНачальныхПоказанийСчетчиков Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Услуги.КоммунальнаяУслуга");
	//КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.НачислениеКоммунальныхУслуг.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПредыдущиеПоказанияСчетчиков") Тогда 
		Документы.НачислениеКоммунальныхУслуг.ОтразитьПредыдущиеПоказанияСчетчиков(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНачисленияКоммунальныхУслуг") Тогда 
		Документы.НачислениеКоммунальныхУслуг.ОтразитьНачисленияКоммунальныхУслуг(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаЗатратыОбъектов") Тогда 
		Документы.НачислениеКоммунальныхУслуг.ОтразитьЗатратыОбъектов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("НачислениеКоммунальныхУслуг",ВремяНачала,,Строка(Ссылка));
КонецПроцедуры


#КонецОбласти


#Область ИнициализацияИЗаполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор					= Пользователи.ТекущийПользователь();
	ПодразделениеКомпании	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	ОтчетныйМесяц			= НачалоМесяца(ТекущаяДатаСеанса());
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти




#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли

