
Функция ЧтениеЗапроса(Запрос,Результат)
	
	
	ПотокДанных = Запрос.ПолучитьТелоКакПоток();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(ПотокДанных,КодировкаТекста.UTF8);
	Попытка
		МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Результат.ОписаниеОшибки ="Ошибка четения "+ ОписаниеОшибки();
		МассивДанных = Новый Массив;
	КонецПопытки;
	
	Возврат МассивДанных 
	
КонецФункции

#Область s3_amazonaws

Функция ЗаписатьФотоАмазон(ИмяВСсылке,ФотоДВ,ТекстОшибки = "")
	

	ФайлФото = ПолучитьИмяВременногоФайла(".jpg");
	ФотоДВ.Записать(ФайлФото);
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	// Обработка файла…
	ИмяБакета		= "tasksphoto";
	КлючДоступа		= "AKIA5IASEGZYFNOJFZJG";
	СекретныйКлюч	= "uZPLq17LTiyb9KnBgt8xluGwIkBAeb4vYrHj+Oz9";
	ИмяЗаписи		= ИмяВСсылке;
	ПутьКФайлу		= ФайлФото;
	ТипКонтента		= "image/jpg";
	ЗаписьЛога		= " -ErrorVariable err -InformationVariable info -WarningVariable warn; ($err.ErrorRecord, $warn, $info) | Out-File " + ФайлЛога;
	
	ТекстКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"C:\Program Files\PowerShell\7\pwsh.exe -Command ""& {Write-S3Object -BucketName %1 -Region us-east-1 -AccessKey %2 -SecretKey %3 -Key %4 -File %5 -CannedACLName public-read -PublicReadOnly -ContentType %6%7}""", 
	ИмяБакета,
	КлючДоступа,
	СекретныйКлюч,
	ИмяЗаписи,
	ПутьКФайлу,
	ТипКонтента,
	ЗаписьЛога);
	
	КодВозврата = Неопределено;
	
	Попытка
		ЗапуститьПриложение(ТекстКоманды,,Истина,КодВозврата);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	// Хорошим тоном будет удалить временный файл
	УдалитьФайлы(ФайлФото);
	
	ТекстДок = Новый ТекстовыйДокумент;
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ТекстДок.Прочитать(ФайлЛога,КодировкаТекста.UTF8);
		ТекстОшибки = ТекстДок.ПолучитьТекст();
		УдалитьФайлы(ФайлЛога);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ответ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"https://%1.s3.amazonaws.com/%2",
	ИмяБакета,
	ИмяЗаписи);
	
	Возврат Ответ;
	
	
	
КонецФункции


#КонецОбласти

#Область Печать

Функция ТабличныйДокументЦенники(ТорговаяПлощадкаСсылка,Массивданных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкладКомпании = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадкаСсылка);

	
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Выбран");
	ТаблицаТоваров.Колонки.Добавить("Артикул");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Наименование2");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("ШтрихКод");
	ТаблицаТоваров.Колонки.Добавить("СкладКомпании");
	ТаблицаТоваров.Колонки.Добавить("СтараяЦена");
	ТаблицаТоваров.Колонки.Добавить("НачалоДействия");
	ТаблицаТоваров.Колонки.Добавить("КонецДействия");
	
	Для Каждого СтрокаМассив Из МассивДанных.Товары Цикл
			РезультатЗапроса = ДанныеТовара(СтрокаМассив.Артикул,"Артикул");
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			
			Если Выборка.ИспМРЦ Тогда
				
				Если  ЗначениеЗаполнено(СтрокаМассив.МРЦ) Тогда
					Попытка 
						МРЦЧисло = Число(СтрокаМассив.МРЦ);
					Исключение
						МРЦЧисло  = 0;
					КонецПопытки;
					МРЦСсылка = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура, МРЦЧисло);
				Иначе
					
					МРЦСсылка = МакисальноеМРЦ_НаОстатке(СкладКомпании,Выборка.Номенклатура)
				КонецЕсли;
				
			Иначе
				МРЦСсылка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			
			
			
			Цена = 0;
			СпецЦена = "";
			ЭтоАкция = 0;
			НачалоДействия = ТекущаяДатаСеанса();
			КонецДействия = ТекущаяДатаСеанса();
			СтараяЦена = 0;

			ТекущиеЦены(ТорговаяПлощадкаСсылка,Новый Структура("Номенклатура,Характеристика,ВидНоменклатуры,Коэффициент",Выборка.Номенклатура,МРЦСсылка,Выборка.ВидНоменклатуры,Выборка.Коэффициент),Цена,СпецЦена,ЭтоАкция,НачалоДействия,КонецДействия,СтараяЦена);
			
			СтрТов = ТаблицаТоваров.Добавить();
			СтрТов.Выбран = Истина;
			СтрТов.Артикул = СтрокаМассив.Артикул;
			СтрТов.Номенклатура = Выборка.Номенклатура;
			СтрТов.Наименование2 = Выборка.Наименование2;
			СтрТов.ХарактеристикаНоменклатуры = МРЦСсылка;
			СтрТов.Цена = Цена;
			СтрТов.Количество = 1;
			СтрТов.ШтрихКод = Выборка.ШтрихКод;
			СтрТов.НачалоДействия = НачалоДействия;
			СтрТов.КонецДействия = КонецДействия;
			СтрТов.СтараяЦена = СтараяЦена;
			СтрТов.СкладКомпании = СкладКомпании;
			
		КонецЦикла;
		
		ЭтоАттика = ОбменФронтПовтИсп.ЭтоПодразделениеАттика(ТорговаяПлощадкаСсылка.ПодразделениеКомпании);
		ЭтоБаффет = ОбменФронтПовтИсп.ЭтоПодрзаделениеБафит(ТорговаяПлощадкаСсылка.ПодразделениеКомпании);
		Если Массивданных.Свойство("ИД_Переоценки") Тогда
			КодЦенника = Массивданных.ИД_Переоценки;
		Иначе
			КодЦенника = Строка(СпецЦена);
		КонецЕсли;
		
		
		//ПФ_MXL_МакетЦенникаАкция96*76КБПМ   --  больше меньше
		Если КодЦенника = "1001" Тогда  // больше меньше
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76КБПМ");
		ИначеЕсли КодЦенника = "28" Тогда // Первая цена
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76ПЦ");
		ИначеЕсли КодЦенника = "27" Тогда // Товар недели
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76ТТ");
		ИначеЕсли КодЦенника = "29" Тогда 	//Распродажа
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76Р");
		ИначеЕсли КодЦенника = "26" И  ЭтоАттика Тогда  //оранжевый
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76ШЦ");
		ИначеЕсли КодЦенника = "21" И  ЭтоАттика Тогда 	 //Белый
			Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38АкцияАттика(ТаблицаТоваров);
		ИначеЕсли КодЦенника = "21" И НЕ ЭтоАттика Тогда 	 
	        Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76А");
		//ИначеЕсли ТипЗнч(СпецЦена) = Тип("Число") Тогда      //Акция
		//	Если ЭтоАттика Тогда
		//		Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38АкцияАттика(ТаблицаТоваров);
		//	Иначе
		//		Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник120х76QRАкция(ТаблицаТоваров,"ПФ_MXL_МакетЦенникаАкция96*76А");
		//	КонецЕсли;
		Иначе  ///Обычный ценник  //Svat 14.05.2024 по заявке Фиалтова
			//Если ЭтоАттика Тогда
			//	Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник50х38QR(ТаблицаТоваров);
			//ИначеЕсли ЭтоБаффет Тогда 	
				Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QRБаффет(ТаблицаТоваров);
			//Иначе
			//	Табдок = Обработки.ТК_ПечатьЭтикетокИЦенников.СформироватьЦенник60х38QR(ТаблицаТоваров);
			//КонецЕсли;
		КонецЕсли;
		
		Возврат Табдок;
		
	
КонецФункции




Процедура НапечататьФайл(ИмяВрФайла,Копий,ИмяПринтера,Ошибка)  Экспорт
	
	Если ПустаяСтрока(ИмяПринтера) Тогда
		Ошибка = "Не указан принтер для печати"+Символы.ПС+"Сообщите в СПП тел. 5555";
		Возврат;
	КонецЕсли;
	
	
	
	Попытка 
		
		objPrinter =  Новый COMОбъект ("WScript.Network");
		
		Попытка
			objPrinter.AddWindowsPrinterConnection(ИмяПринтера); 
			
			objPrinter.SetDefaultPrinter (ИмяПринтера);
			
		Исключение
			Ошибка = "Не удалось установить принтер"""+ИмяПринтера+""""+Символы.ПС+"Сообщите в СПП тел. 5555";
			Возврат;
		КонецПопытки;
		
		ФайлПечати = Новый Файл(ИмяВрФайла);
		
		Shell = Новый COMОбъект("Shell.Application");
		Folder = Shell.Namespace(ФайлПечати.Путь); 	
		Item = Folder.ParseName(ФайлПечати.Имя);	
		
		Для Й = 1 По Копий Цикл 
			Item.InvokeVerbEx("Print");
		КонецЦикла;
		
		ТекущееВремя = ТекущаяДата();
		
		Пока ТекущаяДата() < ТекущееВремя + 10 Цикл 	
			
		КонецЦикла;
		
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

Функция ПоставитьВОчередьНаПечать(UUID,ТипДокумента,КоличествоКопий=2,Запрос)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		
		ДВ = Запрос.ПолучитьТелоКакДвоичныеДанные();
		Поток = ДВ.ОткрытьПотокДляЧтения();
		Табдок = Новый ТабличныйДокумент;
		Табдок.Прочитать(Поток);
		Поток.Закрыть();
		
		Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
		
		
		Менеджрер = РегистрыСведений.ТК_ОчередьПечатиТСД.СоздатьМенеджерЗаписи();
		Менеджрер.Дата = ТекущаяДата();
		Менеджрер.ТорговаяПлощадка = ПодразделениеСсылка;
		Менеджрер.Макет = ТипДокумента;
		Менеджрер.Хранилище   = Хранилище;
		Менеджрер.Копий = КоличествоКопий;
		Менеджрер.Записать();
		
		
		Результат.Ответ =  "Поставлен в очередь на печать!";
		Результат.Результат = Истина;
	Исключение
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;

	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьДанныеДляПечати(ТипДокумента,ГуидДокумента)Экспорт
	
	Результат =  СтруктураВозврата();
	
	УстановитьПривилегированныйРежим(Истина);
	ДокСсылка = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
	

	Результат.Ответ =  СтруктураПечатиАктаПоставки(ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураПечатиАктаПоставки(ДокСсылка)
	
	 	
	Рез = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Контрагент КАК Контрагент,
		|	ПоступлениеТоваров.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	ПоступлениеТоваров.ДоговорВзаиморасчетов.Организация КАК Организация,
		|	ПоступлениеТоваров.ДоговорВзаиморасчетов.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ПоступлениеТоваров.ТорговаяПлощадка КАК ПодразделениеКомпании,
		|	ПоступлениеТоваров.ВхДокНомер КАК ВхДокНомер,
		|	ПоступлениеТоваров.ВхДокДата КАК ВхДокДата,
		|	ПоступлениеТоваров.РегламентированныйУчет КАК РегламентированныйУчет
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
		|	ПоступлениеТоваровТовары.Номенклатура.Наименование2 КАК НаименованиеТовара2,
		|	ПоступлениеТоваровТовары.КоличествоПоставщика КАК КоличествоПоставщика,
		|	ПоступлениеТоваровТовары.КоличествоБазовое КАК КоличествоВведено,
		|	ПоступлениеТоваровТовары.РасхождениеКоличество КАК Расхождение,
		|	ПоступлениеТоваровТовары.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницы,
		|	ПоступлениеТоваровТовары.СтавкаНДС.Представление КАК СтавкаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		|ГДЕ
		|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
		|	И ПоступлениеТоваровТовары.КоличествоПоставщика <> ПоступлениеТоваровТовары.КоличествоБазовое";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	МассивРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = МассивРезультатЗапроса[0].Выбрать();
	ВыборкаШапка.Следующий();
	
	
	
	ТекстЗаголовка = "АКТ розбіжностей до видаткової (товарно-транспортної) накладної  № "+ВыборкаШапка.ВхДокНомер+" вiд "+Формат(Дата(ВыборкаШапка.ВхДокДата), ?(ВыборкаШапка.РегламентированныйУчет, "Л=ru;ДЛФ=ДД", "ДФ=dd.MM.yyyy"));
	Рез.Вставить("Заголовок",ТекстЗаголовка);
	
	ПредставлениеПоставщика = Строка(ВыборкаШапка.КонтрагентНаименованиеПолное);
	Рез.Вставить("Поставщик",ПредставлениеПоставщика);
	
	ПредставлениеПокупателя = Строка(ВыборкаШапка.ОрганизацияНаименованиеПолное);
	Рез.Вставить("Покупатель",ПредставлениеПокупателя);
	
	ПредставлениеСоставления = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.ПодразделениеКомпании, УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ФактическийАдресОбъекта"),ТекущаяДата());

	Рез.Вставить("МестоДоставки",ПредставлениеСоставления);
	
	
	СтрокаВозврата = "Артикул,Наименование,ЕдИзм,СтавкаНДС,ПоНакладной,Факт,Причина";
	МассивТоваров = Новый Массив;
	
	ВыборкаТовары = МассивРезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл 
		
		СтрокаТовараАкт = Новый Структура(СтрокаВозврата);
		СтрокаТовараАкт.Артикул = ВыборкаТовары.Артикул;
		СтрокаТовараАкт.ПоНакладной = ВыборкаТовары.КоличествоПоставщика;
		СтрокаТовараАкт.Факт = ВыборкаТовары.КоличествоВведено;
		СтрокаТовараАкт.Причина = "";//СтрокаТовар.ПричинаРасхожденияСтрока;

		СтрокаТовараАкт.Наименование =  СокрЛП(ВыборкаТовары.НаименованиеТовара2);
		СтрокаТовараАкт.ЕдИзм =  СокрЛП(ВыборкаТовары.НаименованиеЕдиницы);
		СтрокаТовараАкт.СтавкаНДС =  Строка(ВыборкаТовары.СтавкаНДС);
		
		МассивТоваров.Добавить(СтрокаТовараАкт);

	КонецЦикла;
	
	Рез.Вставить("Товары", МассивТоваров);
	
	
	Возврат Рез	
	
КонецФункции

Функция ЗаписатьТоварыДляЦенниковОбъекта(UUID,Запрос)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	
	//ПотокДанных = Запрос.ПолучитьТелоКакПоток();
	//ЧтениеJSON = Новый ЧтениеJSON;
	//ЧтениеJSON.ОткрытьПоток(ПотокДанных,КодировкаТекста.UTF8);
	//Попытка
	//	МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	//Исключение
	//	Результат.ОписаниеОшибки ="Ошибка четения "+ ОписаниеОшибки();
	//	Возврат Результат;
	//КонецПопытки;
	МассивДанных =  ЧтениеЗапроса(Запрос,Результат);
	
	Если МассивДанных.Количество()=0 Тогда
		Возврат Результат;
	КонецЕсли;
	Попытка
		Табдок = ТабличныйДокументЦенники(ТорговаяПлощадкаСсылка,МассивДанных);
	Исключение
		Результат.Ответ =ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;

	
	Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
	
	
	
	СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
	СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
	СтруктураЗаписи.Макет = "Цен";
	СтруктураЗаписи.Хранилище = Хранилище;
	
	РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
	
	
	
	
	Результат.Результат = Истина;
	Результат.Ответ ="Отправлено на печать!";
	Возврат Результат;	

	
КонецФункции

Функция ВернутьПечатнуюФорму(UUID,Запрос)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Попытка 
	ПотокДанных = Запрос.ПолучитьТелоКакПоток();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(ПотокДанных,КодировкаТекста.UTF8);
	Попытка
		МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Результат.ОписаниеОшибки ="Ошибка четения "+ ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	
	Если МассивДанных.ТипДокумента = "PrintVP" Тогда
		Табдок = ПечатнаяФормаВозвратПоставщику(МассивДанных.ДокументUUID);
	ИначеЕсли  МассивДанных.ТипДокумента = "ПечатьЦенниковТСД" Тогда
		Табдок = ТабличныйДокументЦенники(ТорговаяПлощадкаСсылка,МассивДанных);
	ИначеЕсли МассивДанных.ТипДокумента = "PrintPR" Тогда	
		Табдок = ПечатнаяФормаПеремещение(МассивДанных.ДокументUUID);
	ИначеЕсли МассивДанных.ТипДокумента = "PrintPT" Тогда
		Табдок = ПечатнаяФормаПоступлениеТоваров(ТорговаяПлощадкаСсылка,МассивДанных.ДокументUUID);
	ИначеЕсли МассивДанных.ТипДокумента = "PrintPTA" Тогда
		Табдок = ПечатнаяФормаАктНедопоставки(МассивДанных.ДокументUUID);
	ИначеЕсли МассивДанных.ТипДокумента = "PrintIN" Тогда
		Табдок = ПечатнаяФормаИнвентаризация(МассивДанных.ДокументUUID);

	Иначе
		Результат.ОписаниеОшибки ="Неизвестный формат документа";
		Возврат Результат;

	КонецЕсли;
	
	//Попытка
		Поток = Новый ПотокВПамяти();

		Табдок.Записать(Поток,ТипФайлаТабличногоДокумента.PDF);
		ДВ = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		Результат.Ответ = ДВ;
		Результат.Результат = Истина;
		
	Исключение
		
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	

	Возврат Результат;
	
	
КонецФункции


#КонецОбласти

Функция ЗаписатьРезультатВJSON(СтруктураРезультат)Экспорт
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку(); 
		ЗаписатьJSON(ЗаписьJSON, СтруктураРезультат); 
		
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	Исключение
		СтрокаДляОтвета = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция ЗаписатьРезультатВJSONФорматДатыISO(СтруктураРезультат)Экспорт
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON; 
		ЗаписьJSON.УстановитьСтроку(); 
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		
		ЗаписатьJSON(ЗаписьJSON, СтруктураРезультат,НастройкиСериализации);	
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();	
		
	Исключение
		СтрокаДляОтвета = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция СтруктураВозврата()
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	
	Возврат Результат;
	
	
КонецФункции

Функция ЗаменитьСимволы(ИсходнаяСтрока)
	Результат = ИсходнаяСтрока;
	Результат = СтрЗаменить(СокрЛП(Результат),"""","");
	Результат = СтрЗаменить(СокрЛП(Результат),"(","");
	Результат = СтрЗаменить(СокрЛП(Результат),")","");
	
	Результат = СтрЗаменить(СокрЛП(Результат),"/","");
	Результат = СтрЗаменить(СокрЛП(Результат),"\","");
	Результат = СтрЗаменить(СокрЛП(Результат),"'","");

	Результат = СтрЗаменить(СокрЛП(Результат),"№","");
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСтруктуруТовара(Параметры)
	СтруктураВозврат = Новый Структура("Артикул,НаименованиеТовара,НаименованиеЕдиницы,Количество");
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры, "|", Истина, Истина);
	
	Для Индекс = 0 По Массив.ВГраница() Цикл 
		СтруктураВозврат.Вставить(Массив[Индекс]);
	КонецЦикла;
	
	
	Возврат СтруктураВозврат;
	
	
КонецФункции

Функция ПодразделениеКорректно(UUID,Результат) Экспорт
	
	ТорговаяПлощадкаСсылка =  ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьТорговуюПлощадку(UUID);
	ОбъектТорговаяПлощадка = ТорговаяПлощадкаСсылка.ПолучитьОбъект();
	Если ОбъектТорговаяПлощадка = Неопределено Тогда
		
		Результат.ОписаниеОшибки = "Невідоме місце, робота не можлива!";
		Результат.Результат = Ложь;
		
		Возврат Неопределено

	КонецЕсли;
	
	Возврат ТорговаяПлощадкаСсылка;	

КонецФункции

Функция СкладКорректно(ГуидСклад,Результат)
	
	СкладСсылка =  ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(ГуидСклад);
	ОбъектСклад = СкладСсылка.ПолучитьОбъект();
	Если ОбъектСклад = Неопределено Тогда
		
		Результат.ОписаниеОшибки = "Что-то пошло не так, не известный склад!";
		Результат.Результат = Ложь;
		
		Возврат Неопределено

	КонецЕсли;
	
	Возврат СкладСсылка;	

КонецФункции


Функция ПолучитьСтурктуруСкладовТорговойПлощадки(UUID)
	
	Результат = СтруктураВозврата();

	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

		
	МассивОтвет = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьМассивСкладовТорговойПлощадки(ТорговаяПлощадкаСсылка);
	
	Результат.Результат = Истина;
	Результат.Ответ     =  МассивОтвет;
	
	Возврат Результат;	
	
	
КонецФункции

Функция ПолучитьСтурктуруТорговыхПлощадок(UUID)
	
	Результат = СтруктураВозврата();

	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	
	МассивОтвет = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьМассивТорговыхПлощадокПоРодителю(ТорговаяПлощадкаСсылка);
	
	Результат.Результат = Истина;
	Результат.Ответ     =  МассивОтвет;
	
	Возврат Результат;	
	
КонецФункции

Процедура ЗаполнитьСтруктуруПозадачам(ТорговаяПлощадкаСсылка,Параметр,СтруктураОтвета)
	
	СтрукураЗадач	= Новый Структура;
	СтрукураЗадач.Вставить("ВсегоЗадач",0);
	СтрукураЗадач.Вставить("Инвентаризация",0);
	СтрукураЗадач.Вставить("Верификация",0);
	СтрукураЗадач.Вставить("ТБД",0);
	СтрукураЗадач.Вставить("ТНП",0);

	УстановитьПривилегированныйРежим(Истина);
	
	
	Если Параметр = "1" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.Инвентаризация)
		|			ТОГДА ""Инвентаризация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций)
		|			ТОГДА ""Инвентаризация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ВерификацияЦенников)
		|			ТОГДА ""Верификация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ТБД)
		|			ТОГДА ""ТБД""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ГрафикТНП)
		|			ТОГДА ""ТНП""
		|		ИНАЧЕ ""ВсегоЗадач""
		|	КОНЕЦ КАК ТипЗадачи,
		|	СУММА(1) КАК КоличествоЗадач
		|ИЗ
		|	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		|			&Торг,
		|			Выполнена = ЛОЖЬ
		|				И ПометкаУдаления = ЛОЖЬ) КАК ЗадачиПользователяЗадачиПоИсполнителю
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.Инвентаризация)
		|			ТОГДА ""Инвентаризация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций)
		|			ТОГДА ""Инвентаризация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ВерификацияЦенников)
		|			ТОГДА ""Верификация""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ТБД)
		|			ТОГДА ""ТБД""
		|		КОГДА ЗадачиПользователяЗадачиПоИсполнителю.ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ГрафикТНП)
		|			ТОГДА ""ТНП""
		|		ИНАЧЕ ""ВсегоЗадач""
		|	КОНЕЦ";
		
		Запрос.УстановитьПараметр("Торг", ТорговаяПлощадкаСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВсегоЗадач = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 	
			СтрукураЗадач.Вставить(ВыборкаДетальныеЗаписи.ТипЗадачи,ВыборкаДетальныеЗаписи.КоличествоЗадач);
			ВсегоЗадач = ВсегоЗадач + ВыборкаДетальныеЗаписи.КоличествоЗадач;
		КонецЦикла;
		СтрукураЗадач.ВсегоЗадач = ВсегоЗадач;
	КонецЕсли;
	
	СтруктураОтвета.Результат = Истина;
	СтруктураОтвета.Ответ = СтрукураЗадач	
	
КонецПроцедуры

Функция ПолучитьКоличествоАнкетСотрудника(Сотрудник)
	
	КоличествоАнкет = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Анкета.Реализатор КАК Реализатор,
	|	СУММА(1) КАК КоличествоАнкет
	|ИЗ
	|	Документ.Анкета КАК Анкета
	|ГДЕ
	|	Анкета.Реализатор = &Реализатор
	|	И Анкета.Проведен
	|	И Анкета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Анкета.Реализатор";
	
	Запрос.УстановитьПараметр("Реализатор", Сотрудник);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат КоличествоАнкет;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоАнкет =  ВыборкаДетальныеЗаписи.КоличествоАнкет;
	
	Возврат  КоличествоАнкет
	
КонецФункции

Функция ПолучитьАМ(ТорговаяПлощадка,Номенклатура)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(
	|			,
	|			ТорговаяПлощадка = &ТорговаяПлощадка
	|				И Номенклатура = &Номенклатура) КАК ОграничениеАссортиментаСрезПоследних
	|ГДЕ
	|	ОграничениеАссортиментаСрезПоследних.Состояние = 1";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		АМ = 0;
	Иначе
		АМ = 1;
	КонецЕсли;
	
	Возврат АМ;
	
КонецФункции


Функция ОбработатьСтрокуПоискаТовара(СтрокаПоиска)
	
	тСтрокаПоиска = СокрЛП(СтрокаПоиска);
	Если СтрДлина(тСтрокаПоиска) <= 6 Тогда // Это артикул товара
		Результат = ДанныеТовара(тСтрокаПоиска,"Артикул");
	Иначе
		
		Попытка
			ПрефиксШтрихКода = Число(Лев(тСтрокаПоиска,2));
		Исключение
			ПрефиксШтрихКода = 0;
		КонецПопытки;
		
		ПрефиксВесовогоШК = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьПрефиксВесовогоШК();

		Если ПрефиксШтрихКода=ПрефиксВесовогоШК  Тогда
			Результат = ДанныеТовараПоМаске(тСтрокаПоиска);
		Иначе
			Результат = ДанныеТовара(тСтрокаПоиска);
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции


Функция ПолучитьСтруктуруСотрудника(Знач ИНН) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = СтруктураВозврата();
	
	СтруктураВозврата = Новый Структура("UUID,Name");
	флАкнеты = Ложь;
	Если СтрНайти(ИНН,"|") > 0 Тогда
		флАкнеты = Истина;
		МассивШК =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИНН, "|", Истина, Истина);
		
		КодСотрудника =  МассивШК[0];
		UUID          =  МассивШК[2];
	
		ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
		Если ТорговаяПлощадкаСсылка = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		КодОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадкаСсылка,"Код");
		
		Попытка 
			КодПодразделенияЗУП = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадкаСсылка,"ID_Подразделения");
		Исключение
			КодПодразделенияЗУП = "";
		КонецПопытки;
	
		Если НЕ ПустаяСтрока(КодПодразделенияЗУП) Тогда
			КодОбъекта  = КодПодразделенияЗУП;
		КонецЕсли;
		
		ЭтоБазаСтартСтоп = РегистрироватьСтартСтоп(ТорговаяПлощадкаСсылка);	
			
		МассивЗуп = ПолучитьМассивСотрудникаЗуп(КодСотрудника,КодОбъекта,ЭтоБазаСтартСтоп);

		СтруктураВозврата.Вставить("zup", МассивЗуп);
		
		Если ЭтоБазаСтартСтоп Тогда
			 МассивАттика = ПолучитьДанныеПриходаУходаАттика(КодСотрудника,КодОбъекта);
			 СтруктураВозврата.Вставить("zupPrihod", МассивАттика);

		КонецЕсли;
		
	Иначе
		КодСотрудника   = ИНН;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|	И ФизическиеЛица.Код = &ИНН";
	
	
	Запрос.УстановитьПараметр("ИНН", КодСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "["+КодСотрудника+"] "+"сотрудник не найден"; 
		Результат.Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Результат = Истина;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	СотрудникСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	СотрудникСтрока = Строка(ВыборкаДетальныеЗаписи.Ссылка);
	
	Если флАкнеты Тогда
		СтруктураВозврата.Вставить("КоличествоАнкет",ПолучитьКоличествоАнкетСотрудника(СотрудникСсылка));
	КонецЕсли;


	СтруктураВозврата.Вставить("UUID",Строка(СотрудникСсылка.УникальныйИдентификатор()));
	СтруктураВозврата.Вставить("Name",СотрудникСтрока);
	
	Результат.Ответ = СтруктураВозврата;
	
	Возврат Результат;
	
КонецФункции


//Приход уход
Функция РегистрироватьСтартСтоп(ТорговаяПлощадка)
	
	ЭтоСтартСтоп = Истина;
	
	ПодразделениеКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадка,"ПодразделениеКомпании");
	Попытка 
		БазаЗУП = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадка,"РегистрацияЗУП");
	Исключение
		БазаЗУП = "";
	КонецПопытки;
	Если БазаЗУП = "zuUU" Тогда
		ЭтоСтартСтоп = Ложь;
	ИначеЕсли Справочники.ПодразделенияКомпании.ЭтоФабрикаСыра(ПодразделениеКомпании) Тогда	
		ЭтоСтартСтоп = Истина;
	ИначеЕсли  Справочники.ПодразделенияКомпании.ЭтоАттика(ПодразделениеКомпании) Тогда
		ЭтоСтартСтоп = Истина;
	ИначеЕсли Справочники.ПодразделенияКомпании.ЭтоБаффит(ПодразделениеКомпании) Тогда
		ЭтоСтартСтоп = Ложь;
	КонецЕсли;
	
	
	Возврат ЭтоСтартСтоп;
	
КонецФункции


Функция ПолучитьМассивСотрудникаЗуп(ШтрихКод,КодОбъекта,ЭтоАттика = Ложь)
	
	
	zuBD = "zuUU";
	Если ЭтоАттика Тогда
		zuBD ="work_UU_Zarplata_Attika";
	КонецЕсли;
	
	//Определение = Новый WSОпределения("https://orders.digma.ua/zuUU/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	//WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/"+zuBD+"/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пароль ="bynthghbpf";
	WS.Пользователь="ObmenSSL";
	
	
	Рез = WS.ReturnЕmployee(ШтрихКод,КодОбъекта);
	
	Массив = Новый Массив();
	сСтруктура = "EmployeeUUID,EmployeeNeme,PositionUUID,Position,info,Status";
	Для Каждого СтрДолжность Из  Рез.ЕmployeeInfo Цикл 
		
		СтруктураСотрудника= Новый Структура(сСтруктура);
		СтруктураСотрудника.Вставить("info","");
		СтруктураСотрудника.Вставить("Status",Ложь);

		ЗаполнитьЗначенияСвойств(СтруктураСотрудника,СтрДолжность);
		Если ЭтоАттика Тогда
			 СтруктураСотрудника.EmployeeUUID = ШтрихКод;
		КонецЕсли;
		
		
		Массив.Добавить(СтруктураСотрудника);
		
	КонецЦикла;
	
	Возврат  Массив;
КонецФункции

Функция ПолучитьДанныеПриходаУходаАттика(ШтрихКод,КодОбъекта)
	
	Массив = Новый Массив();
	
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	
	Попытка 
		Рез = WS.ReturnЕmployee(ШтрихКод,КодОбъекта);
		Массив.Добавить(Новый Структура("Time,Status",Рез.Time,Рез.Status));
	Исключение
		ош = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат  Массив;
	
КонецФункции

Процедура ЗаписатьДанныеПриходУход(ОбъектСсылка,МассивДанных,СтруктураОтвета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	БазаСтартСтоп =  РегистрироватьСтартСтоп(ОбъектСсылка);
	КодОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка,"Код");
	Попытка
		КодПодразделенияЗУП = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ОбъектСсылка,"ID_Подразделения");
	Исключение
		КодПодразделенияЗУП = "";
	КонецПопытки;
	Если НЕ ПустаяСтрока(КодПодразделенияЗУП) Тогда
		КодОбъекта  = КодПодразделенияЗУП;
	КонецЕсли;
	
	Попытка 

	Если  БазаСтартСтоп Тогда
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		
	Иначе
		//Определение = Новый WSОпределения("https://orders.digma.ua/zuUU/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		//WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пароль ="bynthghbpf";
		WS.Пользователь="ObmenSSL";
		
	КонецЕсли;
	
			Рез = WS.GetWork(МассивДанных.СотрудникUUID,КодОбъекта,?(МассивДанных.ТипЗаписи =1,Истина,Ложь),МассивДанных.ДолжностьUUID);
	Исключение
		ош = ОписаниеОшибки();
		СтруктураОтвета.ОписаниеОшибки = ош;
		Рез = Ложь;
	КонецПопытки;
	
	СтруктураОтвета.Результат = Рез;
	
КонецПроцедуры


Процедура ЗаписатьДанныеПосетителей(ОбъектСсылка,МассивДанных,СтруктураОтвета)
	
	УстановитьПривилегированныйРежим(Истина);
	КодПоДРФО  =  МассивДанных.КодПоДРФО;
	ПриходУход =  МассивДанных.Приход;

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Код = &КодПоДРФО
		|	И ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Посетители.Ссылка
		|ИЗ
		|	Справочник.Посетители КАК Посетители
		|ГДЕ
		|	Посетители.Код = &КодПоДРФО
		|	И Посетители.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("КодПоДРФО", СтрЗаменить(КодПоДРФО,"ext",""));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	ДатаОтметки = ТекущаяДатаСеанса();
	НаборЗаписей = РегистрыСведений.ТК_ПосетителиТорговыхТочек.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОтметкаВремени.Установить(ДатаОтметки);
	НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ОбъектСсылка);
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	НаборЗаписей.Отбор.ПриходУход.Установить(ПриходУход);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОтметкаВремени  = ДатаОтметки;
	НоваяЗапись.ТорговаяПлощадка  = ОбъектСсылка;
	НоваяЗапись.ФизическоеЛицо  = ВыборкаДетальныеЗаписи.Ссылка;
	НоваяЗапись.ПриходУход  = ПриходУход;
	
	НаборЗаписей.Записать();
	
	СтруктураОтвета.Результат = Истина;
	
КонецПроцедуры


Функция ПоулчитьСтруктуруДокументаНачисления(ОбъектСсылка,ШтрихКод)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	
	БазаСтартСтоп =  РегистрироватьСтартСтоп(ОбъектСсылка);
	
	Если БазаСтартСтоп Тогда
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Рез = WS.nchEmployee(ШтрихКод);
		
		Массив = Новый Массив;
		Для Каждого сСотрудник Из Рез.DRFO_List Цикл 
			
			ТаблицаНачислений = Новый Массив;
			ТаблицаУдержаний  = Новый Массив;
			СуммаУдержания = 0;
			СуммаНачисления = 0;
			Для Каждого сНачисление Из сСотрудник.Nachisleniya_List Цикл 
				
				Если ЗначениеЗаполнено(сНачисление.Nachisleniye) Тогда
					СтруктураСтроки = Новый Структура("Подразделение,Статья,Сумма",сНачисление.IDTT,сНачисление.Nachisleniye,сНачисление.Summ);
					ТаблицаНачислений.Добавить(СтруктураСтроки);
					 СуммаНачисления = СуммаНачисления + сНачисление.Summ; 
				Иначе
					СтруктураСтроки = Новый Структура("Подразделение,Статья,Сумма",сНачисление.IDTT,сНачисление.Udezhraniye,сНачисление.Summ);
					ТаблицаНачислений.Добавить(СтруктураСтроки);
					 СуммаУдержания = СуммаУдержания + сНачисление.Summ; 
				КонецЕсли;
			КонецЦикла;
			СтруктураНачислений = Новый Структура("DRFO,ТаблицаНачислений,ТаблицаУдержаний,СуммаНачисления,СуммаУдержания",сСотрудник.DRFO,ТаблицаНачислений,ТаблицаУдержаний,СуммаНачисления,СуммаУдержания);
	        
			Массив.Добавить(СтруктураНачислений);
		КонецЦикла;
		Результат.Результат = Истина;
		Результат.Ответ = Массив;
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоулчитьСтруктуруДокументаВыплат(ОбъектСсылка,ШтрихКод)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	
	
	БазаСтартСтоп =  РегистрироватьСтартСтоп(ОбъектСсылка);

	Если БазаСтартСтоп Тогда
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Рез = WS.vypEmployee(ОбъектСсылка.Код);
		
		Массив = Новый Массив;
		Для Каждого сСотрудник Из Рез.DRFO_List Цикл 
			
			ТаблицаВыплат = Новый Массив;
			СуммаВыплат = 0;
			Для Каждого сНачисление Из сСотрудник.Nachisleniya_List Цикл 
				
				СтруктураСтроки = Новый Структура("Сотрудник,Сумма",сНачисление.IDTT,сНачисление.Summ);
				ТаблицаВыплат.Добавить(СтруктураСтроки);
				СуммаВыплат = СуммаВыплат + сНачисление.Summ; 
			КонецЦикла;
			СтруктураВыплат = Новый Структура("DRFO,ТаблицаВыплат,СуммаВыплат",сСотрудник.DRFO,ТаблицаВыплат,СуммаВыплат);
			
			Массив.Добавить(СтруктураВыплат);
		КонецЦикла;
		Результат.Результат = Истина;
		Результат.Ответ = Массив;
		
		
	КонецЕсли;
	
	
	
	Возврат Результат;
	
КонецФункции

Функция ПоулчитьСтруктуруДокументаПроверки(ОбъектСсылка,ШтрихКод)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|	И ФизическиеЛица.Код = &ИНН";
	
	
	Запрос.УстановитьПараметр("ИНН", ШтрихКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "["+ШтрихКод+"] "+"сотрудник не найден"; 
		Результат.Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	СотрудникСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокАнкета.Ссылка КАК АнкетПользователя,
		|	ДокАнкета.ПроцентВыполнения КАК ПроцентВыполнения,
		|	ДокАнкета.ПроцентВыполнения >= &ПроцентПрохождения КАК Успешно,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.Формулировка КАК Формулировка,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.Родитель.ВидРасчетаИтогов КАК ВидРасчетаИтога,
		|	ВЫБОР
		|		КОГДА ОтветыНаВопросыАнкет.ЭлементарныйВопрос.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Булево)
		|			ТОГДА ОтветыНаВопросыАнкет.Ответ
		|		ИНАЧЕ ВЫРАЗИТЬ(ОтветыНаВопросыАнкет.Ответ КАК ЧИСЛО(1, 0))
		|	КОНЕЦ КАК Оценка,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Булево) КАК ВопросБулево,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.Число) КАК ВопросЧисло,
		|	ВЫБОР
		|		КОГДА НЕ ПарамВопросПодр.Коэффициент ЕСТЬ NULL
		|			ТОГДА ПарамВопросПодр.Коэффициент
		|		КОГДА НЕ ПарамВопросОбщ.Коэффициент ЕСТЬ NULL
		|			ТОГДА ПарамВопросОбщ.Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентВопроса,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.Родитель.Коэффициент / 100 КАК ПроцентГруппы,
		|	ДокАнкета.Дата КАК Дата,
		|	ДокАнкета.Номер КАК Номер,
		|	ДокАнкета.Респондент КАК Респондент
		|ИЗ
		|	Документ.Анкета КАК ДокАнкета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПараметрыВопросовАнкет КАК ПарамВопросОбщ
		|			ПО ОтветыНаВопросыАнкет.ЭлементарныйВопрос = ПарамВопросОбщ.ЭлементарныйВопрос
		|				И (ПарамВопросОбщ.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПараметрыВопросовАнкет КАК ПарамВопросПодр
		|			ПО ОтветыНаВопросыАнкет.ЭлементарныйВопрос = ПарамВопросПодр.ЭлементарныйВопрос
		|				И ОтветыНаВопросыАнкет.Регистратор.ПодразделениеКомпании = ПарамВопросПодр.ПодразделениеКомпании
		|		ПО ДокАнкета.Ссылка = ОтветыНаВопросыАнкет.Регистратор
		|			И (ОтветыНаВопросыАнкет.НомерЯчейки = 0)
		|ГДЕ
		|	ДокАнкета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДокАнкета.Проведен
		|	И ДокАнкета.Реализатор = &Реализатор
		|
		|УПОРЯДОЧИТЬ ПО
		|	АнкетПользователя";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПроцентПрохождения", 80);
	Запрос.УстановитьПараметр("Реализатор", СотрудникСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивРезультат = Новый Массив;
		
	
	Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("АнкетПользователя") Цикл
		
		СтруктураРезультатАнкеты = Новый Структура;
		СтруктураРезультатАнкеты.Вставить("Успешно",ВыборкаДетальныеЗаписи.Успешно);
		СтруктураРезультатАнкеты.Вставить("ПроцентВыполнения",ВыборкаДетальныеЗаписи.ПроцентВыполнения);
		СтруктураРезультатАнкеты.Вставить("Дата",Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=yyyyMMdd")); 
		СтруктураРезультатАнкеты.Вставить("Номер",ВыборкаДетальныеЗаписи.Номер);
		СтруктураРезультатАнкеты.Вставить("Респондент",Строка(ВыборкаДетальныеЗаписи.Респондент));

		ОценкаСумм = 0;
		МассивВопросы = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			рОценкаСумм = ВыборкаДетальныеЗаписи.Оценка * ВыборкаДетальныеЗаписи.КоэффициентВопроса;
			ОценкаСумм = ОценкаСумм + рОценкаСумм;
			СтруктураСтрока = Новый Структура("Формулировка,Оценка",ВыборкаДетальныеЗаписи.Формулировка,ВыборкаДетальныеЗаписи.Оценка);
			МассивВопросы.Добавить(СтруктураСтрока)
		КонецЦикла;
		СтруктураРезультатАнкеты.Вставить("ИтогОценка",ОценкаСумм);
		СтруктураРезультатАнкеты.Вставить("Вопросы",МассивВопросы);
		
		МассивРезультат.Добавить(СтруктураРезультатАнкеты);
	КонецЦикла;
	
	
	Результат.Результат = Истина;
	
	Результат.Ответ = МассивРезультат;
	
	Возврат Результат;
	
КонецФункции


//Доверенные лица
Функция ПолучитьСтатусДоверенногоЛица(ИД)Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат",Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки","");
	СтруктураВозврата.Вставить("Ответ");

	Попытка 
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Рез = WS.StatusCheck(ИД);
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Рез);
		РезОтвет = ПрочитатьJSON(Чтение,,"ДатаОбновления",ФорматДатыJSON.ISO);
		СтруктураВозврата.Результат = Истина;
		СтруктураВозврата.Ответ = РезОтвет;
		
	Исключение
		ош = ОписаниеОшибки();
		СтруктураВозврата.ОписаниеОшибки = ош; 
	КонецПопытки;
	
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураВозврата,НастройкиСериализации);	
	СтрокаВозврата = ЗаписьJSON.Закрыть();	


	Возврат СтрокаВозврата;
	
	
КонецФункции





Процедура ТекущиеЦены(ТорговаяПлощадка,ДанныеПоТовару,Цена,СпецЦена,ЭтоАкция=0,НачалоДействия ='00010101',КонецДействия='00010101',СтараяЦена = 0)
	
	НужнаяНоменклатура = ДанныеПоТовару.Номенклатура;
	Если ДанныеПоТовару.Свойство("Характеристика") Тогда
		Характеристика = ДанныеПоТовару.Характеристика;
	Иначе
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	СкладПродажи = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадка);
	
	
	Результат=ЦенообразованиеСервер.ЗапросСкидок(НужнаяНоменклатура,Справочники.ТК_ТипыСкидок.СпециальнаяЦена,ТорговаяПлощадка);

	Если Результат.Количество()=0 Тогда
		Результат=ЦенообразованиеСервер.ЗапросСкидок(НужнаяНоменклатура,Справочники.ТК_ТипыСкидок.СкидкаНаТовар,ТорговаяПлощадка);
	КонецЕсли;
	
	Если Результат.Количество()=0 Тогда
		Результат = ЦенообразованиеСервер.ЗапросСкидок(НужнаяНоменклатура,Справочники.ТК_ТипыСкидок.СкидкаНаКоличествоТовара,ТорговаяПлощадка);
		Результат.Следующий();
	КонецЕсли;
	
	Если Результат.Количество()=0 Тогда
		Результат = ЦенообразованиеСервер.ЗапросСкидок(НужнаяНоменклатура,Справочники.ТК_ТипыСкидок.СкидкаНаНабор,ТорговаяПлощадка);
		Результат.Следующий();
		Доп="НАБОР";
	КонецЕсли;


	Если Не Результат.Количество()=0 Тогда
		
		Результат.Следующий();

		ЭтоАкция = 1;
		Цена = Результат.ЗначениеСкидки*ДанныеПоТовару.Коэффициент;

		Если Доп="НАБОР" Тогда
			СпецЦена = 1001;
		Иначе
			СпецЦена = Результат.КлассификаторПродаж.Код;//"Акция";
		КонецЕсли;
		НачалоДействия = Результат.НачалоДействия;
		КонецДействия  = Результат.КонецДействия;
		СтараяЦена   = ЦенообразованиеСервер.ПолучитьЦенуТорговойПлощадки(НужнаяНоменклатура,Характеристика,СкладПродажи);
	Иначе
		Цена   = ЦенообразованиеСервер.ПолучитьЦенуТорговойПлощадки(НужнаяНоменклатура,Характеристика,СкладПродажи);
		
		//Если НЕ РезКоличество.Количество()=0 Тогда
		//    СпецЦена = "Опт";
		//Иначе
		СпецЦена = "Розница";
		// КонецЕсли;

		  
	КонецЕсли;
	
		
КонецПроцедуры




Процедура СформироватьДанныеМенеджерТЗ(ТорговаяПлощадкаСсылка,ШтрихКод,СтруктураОтвета)
	УстановитьПривилегированныйРежим(Истина);
	
	Если Найти(ШтрихКод,"|") > 0 Тогда
		МассивШК = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШтрихКод, "|", Истина, Истина);

		Результат = ОбработатьСтрокуПоискаТовараV2(МассивШК[0]);
	Иначе
		Результат = ОбработатьСтрокуПоискаТовараV2(ШтрихКод);
	КонецЕсли;
	
	Если Результат.Пустой() Тогда
		СтруктураОтвета.ОписаниеОшибки ="Товар не найден по штрих коду "+ ШтрихКод;
		СтруктураОтвета.Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	
	СкладТЗ = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадкаСсылка);
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	НоменклатураСсылка =  Выборка.Номенклатура;

	
	//
	СписокСвойст = "Артикул,НаименованиеТовара,Коэффициент,ШтрихКод";
	СтрукураТовара  = Новый Структура(СписокСвойст);
	ЗаполнитьЗначенияСвойств(СтрукураТовара,Выборка,СписокСвойст);	
	
	
	СтрукураТовара.Вставить("АМ",ПолучитьАМ(ТорговаяПлощадкаСсылка,НоменклатураСсылка));
	
	резСтрок = РегистрыСведений.СрокиВозвратаТовара.ПолучитьСрокиВозврата(ТорговаяПлощадкаСсылка.ПодразделениеКомпании,НоменклатураСсылка);
	СтрукураТовара.Вставить("СрокВозврата", резСтрок);

	
	
	//Ид_Склада =  Строка(СкладТЗ.УникальныйИдентификатор());//ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьГуидСкладаТорговыйЗал(ПодразделениеСсылка);
	Продажа = 0;
	//Если Ид_Склада = Неопределено Тогда
	//	Продажа = 0;
	//КонецЕсли;
	
	//!!!!! добавить
	//Продажа = ОС_Сервер.ПолучитьКоличествоПродажПоОтбору(СтрукураТовара.Артикул,Ид_Склада);
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КолВоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("СкладКомпании", СкладТЗ);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		СтрукураТовара.Вставить("Остаток","0");	
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		СтрукураТовара.Вставить("Остаток",Формат(Выб.КолВоОстаток-Продажа,"ЧЦ=15; ЧДЦ=3; ЧРГ=.; ЧН=; ЧГ="));
	КонецЕсли;
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровТовары.Ссылка.Дата КАК Дата,
	|	ПоступлениеТоваровТовары.Ссылка.Контрагент КАК Поставщик
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка.ТорговаяПлощадка = &ТорговаяПлощадка
	|	И ПоступлениеТоваровТовары.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		СтрукураТовара.Вставить("Поставщик","Н/А");	
	
	Иначе
		Выб = Рез.Выбрать();
		Выб.Следующий();
		СтрукураТовара.Вставить("Поставщик",Строка(Выб.Поставщик));
		СтрукураТовара.Вставить("ДатаПоставки",Формат(Выб.Дата,"ДФ=yyyyMMdd"));
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.Продажа7) КАК Продажа7,
		|	СУММА(ВложенныйЗапрос.Продажа14) КАК Продажа14,
		|	СУММА(ВложенныйЗапрос.Продажа28) КАК Продажа28
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) КАК Продажа7,
		|		0 КАК Продажа14,
		|		0 КАК Продажа28
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(
		|				&НачалоПериода7,
		|				&КонецПериода,
		|				,
		|				ТорговаяПлощадка = &ТорговаяПлощадка
		|					И Номенклатура = &Номенклатура) КАК ПродажиОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		ПродажиОбороты.КоличествоОборот,
		|		0
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(
		|				&НачалоПериода14,
		|				&КонецПериода,
		|				,
		|				ТорговаяПлощадка = &ТорговаяПлощадка
		|					И Номенклатура = &Номенклатура) КАК ПродажиОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		0,
		|		ПродажиОбороты.КоличествоОборот
		|	ИЗ
		|		РегистрНакопления.Продажи.Обороты(
		|				&НачалоПериода28,
		|				&КонецПериода,
		|				,
		|				ТорговаяПлощадка = &ТорговаяПлощадка
		|					И Номенклатура = &Номенклатура) КАК ПродажиОбороты) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоПериода7", НачалоДня(ТекущаяДата())-60*60*24*7);
	Запрос.УстановитьПараметр("НачалоПериода14", НачалоДня(ТекущаяДата())-60*60*24*14);
	Запрос.УстановитьПараметр("НачалоПериода28", НачалоДня(ТекущаяДата())-60*60*24*28);
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);
	Запрос.УстановитьПараметр("СкладКомпании", СкладТЗ);

	
	Рез = Запрос.Выполнить();
	Продажа7  = "0";
	Продажа14 = "0";
	Продажа28 = "0";
	Продажа28Оборач = 0;
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.Продажа7) Тогда
			Продажа7 = Формат(Выборка.Продажа7+Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
		Иначе
			Продажа7 = Формат(Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Продажа14) Тогда
			Продажа14 = Формат(Выборка.Продажа14+Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
		Иначе
			Продажа14 = Формат(Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Продажа28) Тогда
			Продажа28 = Формат(Выборка.Продажа28+Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
			Продажа28Оборач = Выборка.Продажа28+Продажа;
		Иначе
			Продажа28 = Формат(Продажа,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=");
		КонецЕсли;
		
	КонецЕсли;
	
	тПродажа = Продажа7+" - "+Продажа14+" - "+Продажа28;
	
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	Продажи.Период КАК Период
	                |ИЗ
	                |	РегистрНакопления.Продажи КАК Продажи
	                |ГДЕ
	                |	Продажи.ТорговаяПлощадка = &ТорговаяПлощадка
	                |	И Продажи.Номенклатура = &Номенклатура
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ";
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		тПродажа = тПродажа +" - Н/Н";
	Иначе
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		
		тПродажа = тПродажа +" - дн. "  +(НачалоДня(ТекущаяДата()) - НачалоДня(Выборка.Период)) / (60 * 60 * 24);
	КонецЕсли;
	
	
		 
		 
	СтрукураТовара.Вставить("Продажа7",тПродажа);
		 
	
	//Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	//                |	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК Заказано
	//                |ИЗ
	//                |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	//                |			,
	//                |			Номенклатура = &Номенклатура
	//                |				И ТорговаяПлощадка = &ТорговаяПлощадка) КАК ЗаказыПоставщикамОстатки";
	//
	//Рез = Запрос.Выполнить();
	ТоварВПути = "0.000";

	//Если НЕ Рез.Пустой() Тогда
	//	Выборка = Рез.Выбрать();
	//	Выборка.Следующий();
	//	
	//	ТоварВПути =  Формат(Выборка.Заказано,"ЧЦ=15; ЧДЦ=3; ЧРГ=.; ЧН=; ЧГ=");
	//КонецЕсли;
	
	СтрукураТовара.Вставить("ТоварВПути",ТоварВПути);
	
	Оборач	= "";

	Если Продажа28Оборач = 0 Тогда
		Оборач	= "н/а";
	Иначе
		
		
		
		Запрос.Текст = 	"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстаткиИОбороты.Период КАК Период,
		|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток,
		|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход,
		|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход,
		|	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(
		|			&НачалоПериода28,
		|			&КонецПериода,
		|			День,
		|			,
		|			Номенклатура = &Номенклатура
		|				И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(КоличествоКонечныйОстаток)
		|ПО
		|	Период ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода28, &КонецПериода)";
		
		
		Рез = Запрос.Выполнить();
		
		СуммаОстатки = 0;
		Если НЕ Рез.Пустой() Тогда
			
			
			ВыборкаПериод = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","Все");
			Пока ВыборкаПериод.Следующий() Цикл 
				СуммаОстатки = СуммаОстатки + ВыборкаПериод.КоличествоКонечныйОстаток;
			КонецЦикла;
			
		КонецЕсли;
		Оборач = Формат( СуммаОстатки /Продажа28Оборач, "ЧЦ=10");
	КонецЕсли;
	
	
	СтрукураТовара.Вставить("Оборач",Оборач);
	
	Планограмма = "0 / 0 / 0";
	
	СтрукураТовара.Вставить("Планограмма",Планограмма);
	
		
	Запрос.Текст =   "ВЫБРАТЬ
	|	арт_ОптимальноеКоличествоНоменклатурыСрезПоследних.МинимальныйОстаток
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			,
	|			ТорговаяПлощадка = &ТорговаяПлощадка
	|				И Номенклатура = &Номенклатура) КАК арт_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	 
	
	Рез = Запрос.Выполнить();
	
	МО = "0";
	
	Если НЕ Рез.Пустой() Тогда
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		
		МО =  Формат(Выборка.МинимальныйОстаток,"ЧЦ=5; ЧН=0; ЧГ=");
	КонецЕсли;

	
	СтрукураТовара.Вставить("МО",МО);
	
	
	ДМП = "0";
	
	СтрукураТовара.Вставить("ДМП",ДМП);

	
	
	Запрос.Текст =   "ВЫБРАТЬ
	                 |	СУММА(ОстаткиТоваровКомпании.Количество) КАК Списано
	                 |ИЗ
	                 |	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	                 |ГДЕ
	                 |	ОстаткиТоваровКомпании.СкладКомпании = &СкладКомпании
	                 |	И ОстаткиТоваровКомпании.Номенклатура = &Номенклатура
	                 |	И ОстаткиТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                 |	И ОстаткиТоваровКомпании.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеТоваров)
	                 |	И ОстаткиТоваровКомпании.Период МЕЖДУ &НачалоПериода7 И &КонецПериода";
	
	Рез = Запрос.Выполнить();	
	Списано = "0";
	
	Если НЕ Рез.Пустой() Тогда
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.Списано) Тогда
			Списано =  Формат(Выборка.Списано,"ЧЦ=15; ЧДЦ=3; ЧРГ=.; ЧН=; ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
	
	СтрукураТовара.Вставить("Списано",Списано);
	
	Цена = 0;
	СпецЦена          = "";
	
	ТекущиеЦены(ТорговаяПлощадкаСсылка,Новый Структура("Номенклатура,Коэффициент",НоменклатураСсылка,1),Цена,СпецЦена);

	СтрукураТовара.Вставить("Цена",Формат(Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=")+" "+СпецЦена);
	     	
	
	СтруктураОтвета.Результат = Истина;

	СтруктураОтвета.Ответ = СтрукураТовара	
	
КонецПроцедуры


Процедура ИнициализироватьДанныеТовара(ТорговаяПлощадкаСсылка,СтруктураОтвета,ШтрихКод,ИД_Задачи)
	
	ДанныеТовара = Новый Структура;
	
	БезЦенника  = Ложь;
	ЕстьСверка  = Ложь;
	ЦенаЦенник  = 0;
	ЦенникЗа100 = Ложь;
	ЦенаПроверена = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Строка с разделителями
	//1 штрих код/ артикул 
	//2 цена на ценнике
	//3 признак ценника за 100г.
	
	Если Найти(ШтрихКод,"|") > 0 Тогда
		МассивШК = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШтрихКод, "|", Истина, Истина);

		КолПараметров =  МассивШК.Количество();
		
		ЕстьСверка = Истина;
		Попытка
			ЦенаЦенник = Число(МассивШК[1]);
		Исключение
		КонецПопытки;
	
		Если КолПараметров >= 3 Тогда
			ЦенникЗа100 = ?(МассивШК[2]="1",Истина,Ложь);
		КонецЕсли;
	
		Результат = ОбработатьСтрокуПоискаТовара(МассивШК[0]);
		
	Иначе
		БезЦенника = Истина;
		Результат = ОбработатьСтрокуПоискаТовара(ШтрихКод);
		
	КонецЕсли;
	
	
	Если Результат.Пустой() Тогда
		СтруктураОтвета.ОписаниеОшибки ="Товар не найден по штрих коду "+ ШтрихКод;
		СтруктураОтвета.Результат = Ложь;
		Возврат;
	КонецЕсли;

	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СписокСвойст = "Номенклатура,ВидНоменклатуры,Коэффициент,ИспМРЦ";
	СтрукураТовара  = Новый Структура(СписокСвойст);
	ЗаполнитьЗначенияСвойств(СтрукураТовара,Выборка,СписокСвойст);	
	
	
	ДанныеТовара.Вставить("Артикул",Выборка.Артикул);
	ДанныеТовара.Вставить("НаименованиеТовара",Выборка.НаименованиеТовара);
	ДанныеТовара.Вставить("НаименованиеЕденицы",Выборка.НаименованиеЕденицы);
	ДанныеТовара.Вставить("Коэффициент",Выборка.Коэффициент);
	ДанныеТовара.Вставить("ШтрихКод",Выборка.ШтрихКод);
	ДанныеТовара.Вставить("БезЦенника",БезЦенника);
	ДанныеТовара.Вставить("ЦенаЦенник",ЦенаЦенник);
	ДанныеТовара.Вставить("ЕстьСверка",ЕстьСверка);
	ДанныеТовара.Вставить("ЦенникЗа100",ЦенникЗа100);

	
	СкладКомпании = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадкаСсылка);	
	Подразделение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТорговаяПлощадкаСсылка,"ПодразделениеКомпании");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	""Остаток"" КАК ВидСклада
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			СкладКомпании = &СкладКомпании
	|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток,
	|	""ОстатокТНП""
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			СкладКомпании = &СкладКомпанииТНП
	|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("СкладКомпанииТНП", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТНП(ТорговаяПлощадкаСсылка));

	Запрос.УстановитьПараметр("Номенклатура", СтрукураТовара.Номенклатура);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Остаток = 0;
	ОстатокСклад = 0;
	ОстатокТНП = 0;
	Характреристика  = МакисальноеМРЦ_НаОстатке(СкладКомпании,СтрукураТовара.Номенклатура);
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.СледующийПоЗначениюПоля("ВидСклада") Цикл 
			Остаток = 0;
			Пока Выборка.Следующий() Цикл 
				Остаток =  Остаток + Выборка.КоличествоОстаток;
			КонецЦикла;
			Если Выборка.ВидСклада = "Остаток" Тогда
				ОстатокСклад =  Остаток;
				//Характреристика =  Выборка.ХарактеристикаНоменклатуры;
				
			Иначе
				ОстатокТНП=Остаток;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
	Попытка 
		Продажа = ОбменФронт.ПолучитьКоличествоПродажПоОтбору(ПодразделениеПродажи,ДанныеТовара.Артикул,Строка(СкладКомпании.УникальныйИдентификатор()), "");
		Если Продажа = Неопределено Тогда
			Продажа = 0;
		КонецЕсли;
		
	Исключение
		Продажа = 0;
	КонецПопытки;

	
	ДанныеТовара.Вставить("АМ",ПолучитьАМ(ТорговаяПлощадкаСсылка,СтрукураТовара.Номенклатура));


	СтрукураТовара.Вставить("Характеристика",Характреристика);
	ДанныеТовара.Вставить("Остаток",ОстатокСклад-Продажа);
	ДанныеТовара.Вставить("ОстатокТНП",ОстатокТНП);
	резСтрок = РегистрыСведений.СрокиВозвратаТовара.ПолучитьСрокиВозврата(ТорговаяПлощадкаСсылка.ПодразделениеКомпании,СтрукураТовара.Номенклатура);
	ДанныеТовара.Вставить("СрокВозврата", резСтрок);
	
	
	Остаток = 0;
	Цена = 0;
	СпецЦена = "";
	
	ТекущиеЦены(ТорговаяПлощадкаСсылка,СтрукураТовара,Цена,СпецЦена);
	
	Если ЦенникЗа100 Тогда
		Цена =  Окр(Цена * 0.1,2);
	КонецЕсли;
	
	Если ЕстьСверка Тогда
		ЦенаПроверена = (Цена = ЦенаЦенник); 		
	КонецЕсли;
	ДанныеТовара.Вставить("ЦенаПроверена",ЦенаПроверена);
	ДанныеТовара.Вставить("Цена",Цена);
	ДанныеТовара.Вставить("СпецЦена",СпецЦена);
	
	
	СтруктураОтвета.Результат = Истина;
	СтруктураОтвета.Ответ = ДанныеТовара;
	
КонецПроцедуры

Функция ДанныеТовара(СтрокаПоиска,ТипПоиска = "ШтрихКод",Кратко = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1";
	
	Если ТипПоиска = "ШтрихКод" Тогда
		
		Если Кратко Тогда
			Текст =  Текст + "
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура";
		Иначе
			Текст =  Текст + "
			|	ШтрихкодыНоменклатуры.Номенклатура.Артикул КАК Артикул,
			|	ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатуры.Упаковка КАК Еденица,
			|	ШтрихкодыНоменклатуры.Упаковка.Коэффициент КАК Коэффициент,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ШтрихкодыНоменклатуры.Номенклатура) КАК НаименованиеТовара,
			|	ШтрихкодыНоменклатуры.Номенклатура.Наименование2 КАК Наименование2,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ШтрихкодыНоменклатуры.Упаковка) КАК НаименованиеЕденицы,
			|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Количество,
		//	|	ШтрихкодыНоменклатуры.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ,
			|	ВЫБОР
			|		КОГДА ШтрихкодыНоменклатуры.Номенклатура.ИспользованиеХарактеристик
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспМРЦ,
			|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод";
			
		КонецЕсли;	
		Текст =  Текст + "
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &СтрокаПоиска";

	ИначеЕсли ТипПоиска = "Артикул" Тогда
		
		Если Кратко Тогда
			Текст =  Текст + "
			|	спрНоменклатура.Ссылка КАК Номенклатура";
		Иначе
			
			Текст =  Текст + "
			|	спрНоменклатура.Артикул КАК Артикул,
			|	спрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	спрНоменклатура.Ссылка КАК Номенклатура,
			|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК Еденица,
			|	спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.Ссылка) КАК НаименованиеТовара,
			|	спрНоменклатура.Ссылка.Наименование2 КАК Наименование2,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.ОсновнаяЕдиницаИзмерения) КАК НаименованиеЕденицы,
			|	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Количество, 
			|	ВЫБОР
			|		КОГДА спрНоменклатура.ИспользованиеХарактеристик
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспМРЦ,
			//|	спрНоменклатура.ИспользованиеХарактеристик КАК ИспМРЦ,
			|	спрНоменклатура.ОсновнойШтрихКод КАК ШтрихКод";

		КонецЕсли;
		
		Текст =  Текст + "
		|ИЗ
		|	Справочник.Номенклатура КАК спрНоменклатура
		|ГДЕ
		|	спрНоменклатура.Артикул = &СтрокаПоиска
		|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		
	КонецЕсли;
	
	
	Запрос.Текст = Текст;

	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТовараV2(СтрокаПоиска,ТипПоиска = "ШтрихКод")
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Если ТипПоиска = "ШтрихКод" Тогда
		
		Запрос.Текст =  "ВЫБРАТЬ
		                |	ШтрихкодыНоменклатуры.Номенклатура.Артикул КАК Артикул,
		                |	ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		                |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		                |	ШтрихкодыНоменклатуры.Упаковка КАК Единица,
		                |	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Коэффициент,
		                |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ШтрихкодыНоменклатуры.Номенклатура) КАК НаименованиеТовара,
		                |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ШтрихкодыНоменклатуры.Упаковка) КАК НаименованиеЕдиницы,
		                |	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Количество,
		                |	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихКод,
		                |	ШтрихкодыНоменклатуры.Номенклатура.Наименование2 КАК НаименованиеТовара2,
						|	ШтрихкодыНоменклатуры.Номенклатура.СтавкаНДС КАК СтавкаНДС,
						|	ВЫБОР
						|		КОГДА ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.тара)
						|			ТОГДА 1
						|		ИНАЧЕ 0
						|	КОНЕЦ КАК Тара,
						|	ВЫБОР
						|		КОГДА ШтрихкодыНоменклатуры.Номенклатура.ИспользованиеХарактеристик
						|			ТОГДА 1
						|		ИНАЧЕ 0
						|	КОНЕЦ КАК ИспМРЦ
					//	|	ШтрихкодыНоменклатуры.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ
		                |ИЗ
		                |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		                |ГДЕ
		                |	ШтрихкодыНоменклатуры.Штрихкод = &СтрокаПоиска";
		
		
	ИначеЕсли ТипПоиска = "Артикул" Тогда
		
		Запрос.Текст =	"ВЫБРАТЬ ПЕРВЫЕ 1
		              	|	спрНоменклатура.Артикул КАК Артикул,
		              	|	спрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		              	|	спрНоменклатура.Ссылка КАК Номенклатура,
		              	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК Единица,
		              	|	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		              	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.Ссылка) КАК НаименованиеТовара,
		              	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.ОсновнаяЕдиницаИзмерения) КАК НаименованиеЕдиницы,
		              	|	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Количество,
						|	спрНоменклатура.ОсновнойШтрихКод КАК ШтрихКод,
						|	спрНоменклатура.Наименование2 КАК НаименованиеТовара2,
						|	спрНоменклатура.СтавкаНДС.Ставка КАК СтавкаНДС,
						|	ВЫБОР
						|		КОГДА спрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.тара)
						|			ТОГДА 1
						|		ИНАЧЕ 0
						|	КОНЕЦ КАК Тара,
						|	ВЫБОР
						|		КОГДА спрНоменклатура.ИспользованиеХарактеристик
						|			ТОГДА 1
						|		ИНАЧЕ 0
						|	КОНЕЦ КАК ИспМРЦ
				//		|	спрНоменклатура.ИспользованиеХарактеристик КАК ИспМРЦ
		              	|ИЗ
		              	|	Справочник.Номенклатура КАК спрНоменклатура
		              	|ГДЕ
		              	|	спрНоменклатура.Артикул = &СтрокаПоиска
		              	|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеТовараПоМаске(ШтрихКод)
	ПозРазделителя = 8;
	Вес = Сред(ШтрихКод, ПозРазделителя+1, СтрДлина(ШтрихКод)-(ПозРазделителя+1));
	Вес = ?(ПустаяСтрока(Вес), 0,Число(Вес)/1000);
	//если товар весовой, то ищем по первым семи символам
	ШК = Формат(Лев(ШтрихКод, ПозРазделителя), "ЧГ=0");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	спрНоменклатура.Артикул,
	|	спрНоменклатура.ВидНоменклатуры,
	|	спрНоменклатура.Ссылка КАК Номенклатура,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК Еденица,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.Ссылка) КАК НаименованиеТовара,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.ОсновнаяЕдиницаИзмерения) КАК НаименованиеЕденицы,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.ТипНоменклатуры.ШтучноВесовой
	|			ТОГДА &Вес * 1000
	|		ИНАЧЕ &Вес
	|	КОНЕЦ КАК Количество,
	|	&ШтрихКод
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|ГДЕ
	|	спрНоменклатура.Артикул = &СтрокаПоиска
	|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";

	Запрос.УстановитьПараметр("СтрокаПоиска", Формат(Число(Сред(ШК, 3, ПозРазделителя)),"ЧЦ=6; ЧГ=0"));
	Запрос.УстановитьПараметр("Вес", Вес);
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);


	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
	
КонецФункции

Функция ДанныеТовараПоМаскеV3(СтруктураШтрихКода,СтруктураМаски)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", СтруктураШтрихКода.Артикул);
	Запрос.УстановитьПараметр("Вес", СтруктураШтрихКода.Вес);
	Запрос.УстановитьПараметр("ШтрихКод", СтруктураШтрихКода.ШтрихКод);
	Запрос.УстановитьПараметр("Маска", СтруктураМаски.Маска);

	Если Число(СтруктураМаски.Преф) = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьПрефиксВесовогоШК() Тогда
		
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	спрНоменклатура.Артикул КАК Артикул,
		               |	спрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		               |	спрНоменклатура.Ссылка КАК Номенклатура,
		               |	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК Единица,
		               |	ЕСТЬNULL(спрНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.Ссылка) КАК НаименованиеТовара,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(спрНоменклатура.ОсновнаяЕдиницаИзмерения) КАК НаименованиеЕдиницы,
		               |	ВЫБОР
		               |		КОГДА НЕ спрНоменклатура.ТипНоменклатуры.Весовой
		               |			ТОГДА &Вес * 1000
		               |		ИНАЧЕ &Вес
		               |	КОНЕЦ КАК Количество,
		               |	&ШтрихКод КАК ШтрихКод,
		               |	ВЫБОР
		               |		КОГДА спрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.тара)
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Тара,
		               |	ВЫБОР
		               |		КОГДА спрНоменклатура.ИспользованиеХарактеристик
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ИспМРЦ
		               |ИЗ
		               |	Справочник.Номенклатура КАК спрНоменклатура
		               |ГДЕ
		               |	спрНоменклатура.Артикул = &СтрокаПоиска
		               |	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ";
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	НоменклатураПоставщиков.Номенклатура.Артикул КАК Артикул,
		               |	НоменклатураПоставщиков.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		               |	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
		               |	НоменклатураПоставщиков.ЕдиницаИзмерения КАК Единица,
		               |	НоменклатураПоставщиков.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(НоменклатураПоставщиков.Ссылка) КАК НаименованиеТовара,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(НоменклатураПоставщиков.ЕдиницаИзмерения) КАК НаименованиеЕдиницы,
		               |	ВЫБОР
		               |		КОГДА НЕ НоменклатураПоставщиков.Номенклатура.ТипНоменклатуры.Весовой
		               |			ТОГДА &Вес * 1000
		               |		ИНАЧЕ &Вес
		               |	КОНЕЦ КАК Количество,
		               |	&ШтрихКод КАК ШтрихКод,
		               |	ВЫБОР
		               |		КОГДА НоменклатураПоставщиков.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.тара)
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Тара,
		               |	ВЫБОР
		               |		КОГДА НоменклатураПоставщиков.Номенклатура.ИспользованиеХарактеристик
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ИспМРЦ
		               |ИЗ
		               |	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		               |ГДЕ
		               |	НоменклатураПоставщиков.Артикул = &СтрокаПоиска
		               |	И НоменклатураПоставщиков.ЭтоГруппа = ЛОЖЬ
		               |	И НоменклатураПоставщиков.МаскаШтрихКода = &Маска"
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
	
КонецФункции


Функция ОпределитьПоискПоМаскеШК(ПрефиксШтрихКода)
	СтруктураМаски = Неопределено;
	МассивМасокШК = ТК_ТСД_РаботаHTTP_СервисПовтИсп.МассивМасокШК();
	Попытка
		ПрефиксШтрихКодаЧисло  = Число(ПрефиксШтрихКода);
		Если МассивМасокШК.Количество()>= ПрефиксШтрихКодаЧисло Тогда
			СтруктураМаски = МассивМасокШК[ПрефиксШтрихКодаЧисло];
		КонецЕсли;	
		
	Исключение
		
		Возврат СтруктураМаски;
	КонецПопытки;
	
	Возврат СтруктураМаски;
	
КонецФункции

Функция ПолучитьСтруктуруШтрихКодаПоМаске(ШтрихКод,СтруктураМаски)
	
	Попытка
		Артикул = 	Сред(ШтрихКод,СтрДлина(СтруктураМаски.Преф)+1,СтруктураМаски.Артикул);
		
		Артикул = Формат(Число(Артикул), "ЧЦ=6; ЧГ=");
		Вес = Сред(ШтрихКод, СтруктураМаски.Артикул+3, СтруктураМаски.Вес);
		Вес = ?(ПустаяСтрока(Вес), 0,Число(Вес)/1000);
	Исключение
		
		Возврат Неопределено;	
		
	КонецПопытки;
	
	Возврат Новый Структура("ШтрихКод,Артикул,Вес",ШтрихКод,Артикул,Вес);
	
КонецФункции


Функция ЦеныОстаткиПоТовару(Знач ТорговаяПлощадка,ДанныеПоТовару)
	
	ОтветРезультат  = Новый Структура("Артикул,ШтрихКод,Номенклатура,Еденица,Цена,СпецЦена,Остаток,ЕстьСверка,ЦенаПроверена,ЦенаЦенник,ТоварБезЦенника");

	
	ЦенникЗа100 = Неопределено;
	ДанныеПоТовару.Свойство("ЦенникЗа100",ЦенникЗа100);
	Если ЦенникЗа100  = Неопределено Тогда
		ЦенникЗа100 = Ложь;
	КонецЕсли;
	
	
	
	ОтветРезультат.Артикул      = Строка(ДанныеПоТовару.Артикул);
	ОтветРезультат.Номенклатура = Строка(ДанныеПоТовару.Номенклатура);
	ОтветРезультат.Еденица      = Строка(ДанныеПоТовару.Еденица);
	ОтветРезультат.ЕстьСверка   = ДанныеПоТовару.ЕстьСверка;
	ОтветРезультат.ШтрихКод   = ДанныеПоТовару.ШтрихКод;	
	ОтветРезультат.ТоварБезЦенника   = ДанныеПоТовару.ТоварБезЦенника;	

	Остаток = 0;
	Цена = 0;
	СпецЦена = "";
	
	 ТекущиеЦены(ТорговаяПлощадка,ДанныеПоТовару,Цена,СпецЦена);
	
	Если ЦенникЗа100 Тогда
		Цена =  Окр(Цена * 0.1,2);
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			,
		|			СкладКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
		|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Номенклатура", ДанныеПоТовару.Номенклатура);

	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Остаток = Выборка.КоличествоОстаток;
	КонецЕсли;
	
	ЦенаЦенник = 0;
	Если ДанныеПоТовару.ЕстьСверка Тогда
		
		Попытка 
			ЦенаЦенник = Число(ДанныеПоТовару.ЦенаЦенник);
			
			ОтветРезультат.ЦенаЦенник = ЦенаЦенник;
			
			Если Цена <> ЦенаЦенник Тогда
				ОтветРезультат.ЦенаПроверена = Ложь;
			Иначе
				ОтветРезультат.ЦенаПроверена = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	
	ОтветРезультат.Цена = Цена;
	ОтветРезультат.СпецЦена = СпецЦена;
	ОтветРезультат.Остаток = Остаток;
	ОтветРезультат.ЦенаЦенник = ЦенаЦенник;
	
	Возврат ОтветРезультат;
	
КонецФункции

Функция ОбработатьШтрихКод(ШтрихКод,Свернуто)
	
	Если Свернуто Тогда
		ДанныеПоТовару = Новый Структура("Артикул,НаименованиеТовара,НаименованиеЕденицы,Коэффициент,Количество,ШтрихКод,ТоварБезЦенника");
	Иначе
		ДанныеПоТовару = Новый Структура("Артикул,ВидНоменклатуры,Номенклатура,Еденица,Коэффициент,ЕстьСверка,ЦенаЦенник,ШтрихКод,ТоварБезЦенника");
		ДанныеПоТовару.Вставить("ЦенаЦенник",0);
		ДанныеПоТовару.Вставить("ЕстьСверка",Ложь);
	КонецЕсли;


	
	шкВозврат = "";
	ТоварБезЦенника = Ложь;
	
	Если  Найти(ШтрихКод,"|") > 0 Тогда
		МассивШК = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШтрихКод, "|", Истина, Истина);

		КолПараметров =  МассивШК.Количество();

		ДанныеПоТовару.Вставить("ЦенаЦенник",МассивШК[1]);
		ДанныеПоТовару.Вставить("ЕстьСверка",Истина);

		Если КолПараметров >= 3 Тогда
			ЗначПар = МассивШК[2];
			ДанныеПоТовару.Вставить("ЦенникЗа100",?(ЗначПар="1",Истина,Ложь));
		КонецЕсли;
		
			
		
		Поиск = Истина;
		//1 ищем по ШК
		Результат = ДанныеТовара(МассивШК[0]);
		шкВозврат = МассивШК[0];
		Поиск = Результат.Пустой(); 
		
		Если Поиск Тогда
			//2 ищем по Артикулу
			Результат = ДанныеТовара(МассивШК[0],"Артикул");
			Поиск = Результат.Пустой(); 
		Иначе
			ДанныеПоТовару.ШтрихКод = МассивШК[0]; 
		КонецЕсли;

		Если Поиск Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		Если СтрДлина(ШтрихКод) <= 6 Тогда
			
			Результат = ДанныеТовара(ШтрихКод,"Артикул");
		Иначе
			ТоварБезЦенника = Истина;
			шкВозврат = ШтрихКод;
			Попытка
				ПрефиксШтрихКода = Число(Лев(ШтрихКод,2));
			Исключение
				ПрефиксШтрихКода = 0;
			КонецПопытки;
			ПрефиксВесовогоШК = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьПрефиксВесовогоШК();
			
			Если ПрефиксШтрихКода=ПрефиксВесовогоШК  Тогда
				Результат = ДанныеТовараПоМаске(ШтрихКод);
			Иначе
				Результат = ДанныеТовара(ШтрихКод);
			КонецЕсли;
		КонецЕсли;
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеПоТовару,Выборка);
	ДанныеПоТовару.Вставить("ТоварБезЦенника",ТоварБезЦенника);

	Возврат ДанныеПоТовару;
	
	
КонецФункции

Функция ОбработатьСтрокуПоискаТовараV2(СтрокаПоиска)
	
	тСтрокаПоиска = СокрЛП(СтрокаПоиска);
	Если СтрДлина(тСтрокаПоиска) <= 6 Тогда // Это артикул товара
		Результат = ДанныеТовараV2(тСтрокаПоиска,"Артикул");
	Иначе
		
		Если СтрДлина(тСтрокаПоиска) = 16 Тогда
			Преф = Лев(тСтрокаПоиска,1);
		Иначе
			Преф = Лев(тСтрокаПоиска,2);
		КонецЕсли;
		
		
		Попытка
			ПрефиксШтрихКода = Число(Преф);
		Исключение
			ПрефиксШтрихКода = 0;
		КонецПопытки;
		
		СтруктураМаски = ОпределитьПоискПоМаскеШК(ПрефиксШтрихКода);
		
		Если НЕ СтруктураМаски = Неопределено тогда
			
			СтруктураШтрихКода = ПолучитьСтруктуруШтрихКодаПоМаске(тСтрокаПоиска,СтруктураМаски);
			
			Результат = ДанныеТовараПоМаскеV3(СтруктураШтрихКода,СтруктураМаски);	
		Иначе
			Результат = ДанныеТовараV2(тСтрокаПоиска);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Процедура ЗаполнитьСтруктуруТовара(ТорговаяПлощадкаСсылка,СкладСсылка,Результат,ШтрихКод,Параметры)
	
	ДанныеНоменклатуры = ПолучитьСтруктуруТовара(Параметры);
	
	ИнициализироватьТовар(ТорговаяПлощадкаСсылка,СкладСсылка,Результат,ДанныеНоменклатуры,ШтрихКод);	
	
КонецПроцедуры

Процедура ИнициализироватьТовар(ТорговаяПлощадкаСсылка,СкладСсылка,СтруктураОтвета,ДанныеНоменклатуры,ШтрихКод)
	
	БезЦенника  = Ложь;
	ЕстьСверка  = Ложь;
	ЦенаЦенник  = 0;
	ЦенникЗа100 = Ложь;
	ЦенаПроверена = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтрНайти(ШтрихКод,"|") > 0 Тогда

		МассивШК =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШтрихКод, "|", Истина, Истина);

		КолПараметров =  МассивШК.Количество();
		
		ЕстьСверка = Истина;
		Попытка
			ЦенаЦенник = Число(МассивШК[1]);
		Исключение
		КонецПопытки;
	
		Если КолПараметров >= 3 Тогда
			ЦенникЗа100 = ?(МассивШК[2]="1",Истина,Ложь);
		КонецЕсли;
	
		Результат = ОбработатьСтрокуПоискаТовараV2(МассивШК[0]);
		
	Иначе
		БезЦенника = Истина;
		Результат = ОбработатьСтрокуПоискаТовараV2(ШтрихКод);
		
	КонецЕсли;
	
	
	Если Результат.Пустой() Тогда
		СтруктураОтвета.ОписаниеОшибки ="Товар не найден по штрих коду "+ ШтрихКод;
		СтруктураОтвета.Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СписокСвойст = "Номенклатура,ВидНоменклатуры,Коэффициент";
	СтрукураТовара  = Новый Структура(СписокСвойст);
	ЗаполнитьЗначенияСвойств(СтрукураТовара,Выборка,СписокСвойст);	

	Для Каждого Колонка Из Результат.Колонки Цикл 
		
		Если ДанныеНоменклатуры.Свойство(Колонка.Имя)Тогда
			Если ТипЗнч(Выборка[Колонка.Имя]) = Тип("Число") Тогда
				ДанныеНоменклатуры[Колонка.Имя] = Выборка[Колонка.Имя];
			Иначе
				ДанныеНоменклатуры[Колонка.Имя] = СокрП(Выборка[Колонка.Имя]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеНоменклатуры.Свойство("ИспМРЦ") Тогда
		
		Если НЕ СкладСсылка = Неопределено Тогда
			//ИспМРЦ = ТК_ТСД_РаботаHTTP_СервисПовтИсп.СкладИспользуетМРЦ(СкладСсылка);
			  ИспМРЦ_Склад = НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(СкладСсылка,КонецДня(ТекущаяДата()+60*60*24));
			Если НЕ ИспМРЦ_Склад и ДанныеНоменклатуры.ИспМРЦ = 1 Тогда
				ДанныеНоменклатуры.Вставить("ИспМРЦ",0);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//
	
	Если ДанныеНоменклатуры.Свойство("Остаток")Тогда
		
		
		Запрос = Новый Запрос;
		тЗапрос = "ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			, ";
		Если СкладСсылка = Неопределено Тогда
			тЗапрос = тЗапрос +"
			|			СкладКомпании.ТорговаяПлощадка = &ТорговаяПлощадка";
			Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);
		Иначе
			тЗапрос = тЗапрос +"
			|			СкладКомпании = &СкладСсылка";
			Запрос.УстановитьПараметр("СкладСсылка", СкладСсылка);
		КонецЕсли;

		
		тЗапрос = тЗапрос +"
		|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки";
		
		
		Запрос.Текст = тЗапрос;
			
		Запрос.УстановитьПараметр("Номенклатура", СтрукураТовара.Номенклатура);
		
		
		
		РезультатЗапроса = Запрос.Выполнить();
		Остаток = 0;
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Остаток = Выборка.КоличествоОстаток;
		КонецЕсли;
		
		ДанныеНоменклатуры.Вставить("Остаток",Остаток);
		
	КонецЕсли;
	
	
	Если ДанныеНоменклатуры.Свойство("Цена") Тогда
		
		ЦенаПодразделения = 0;
		СпецЦена = "";
		
		ТекущиеЦены(ТорговаяПлощадкаСсылка,СтрукураТовара,ЦенаПодразделения,СпецЦена);
		
		Если ЦенникЗа100 Тогда
			ЦенаПодразделения =  Окр(ЦенаПодразделения * 0.1,2);
		КонецЕсли;
		
		Если ЕстьСверка Тогда
			ЦенаПроверена = (ЦенаПодразделения = ЦенаЦенник); 		
		КонецЕсли;
		ДанныеНоменклатуры.Вставить("Цена",ЦенаПодразделения);
		
	КонецЕсли;
	
	
	Если ДанныеНоменклатуры.Свойство("АМ") Тогда
		
		ДанныеНоменклатуры.Вставить("АМ",ПолучитьАМ(ТорговаяПлощадкаСсылка,СтрукураТовара.Номенклатура));
		
		//Запрос = Новый Запрос;
		//Запрос.Текст ="ВЫБРАТЬ
		//|	ОграничениеАссортиментаСрезПоследних.Состояние
		//|ИЗ
		//|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(
		//|			,
		//|			ТорговаяПлощадка = &ТорговаяПлощадка
		//|				И Номенклатура = &Номенклатура) КАК ОграничениеАссортиментаСрезПоследних
		//|ГДЕ
		//|	ОграничениеАссортиментаСрезПоследних.Состояние = 1";
		//
		//Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадкаСсылка);
		//Запрос.УстановитьПараметр("Номенклатура",СтрукураТовара.Номенклатура);
		//
		//
		//Рез = Запрос.Выполнить();
		//Если Рез.Пустой() Тогда
		//	ДанныеНоменклатуры.Вставить("АМ",0);	
		//Иначе
		//	ДанныеНоменклатуры.Вставить("АМ",1);	
		//КонецЕсли;
		
	КонецЕсли;
	
	
	Если ДанныеНоменклатуры.Свойство("TBD") Тогда
		ДанныеНоменклатуры.Вставить("ЦенаПроверена",Число(ЦенаПроверена));	
		ДанныеНоменклатуры.Вставить("БезЦенника",  Число(БезЦенника));
		ДанныеНоменклатуры.Вставить("ЕстьСверка",  Число(ЕстьСверка));
		ДанныеНоменклатуры.Вставить("ЦенаЦенник", ЦенаЦенник);
		ДанныеНоменклатуры.Вставить("СпецЦена", СпецЦена);
	ИначеЕсли ДанныеНоменклатуры.Свойство("ТНП") Тогда
		 резСтрок = РегистрыСведений.СрокиВозвратаТовара.ПолучитьСрокиВозврата(ТорговаяПлощадкаСсылка.ПодразделениеКомпании,СтрукураТовара.Номенклатура);
		 ДанныеНоменклатуры.Вставить("СрокВозврата", резСтрок);
	КонецЕсли;
	
	Если ДанныеНоменклатуры.Свойство("Продажи") И  СкладСсылка <> Неопределено и СкладСсылка.ВидСклада <> Справочники.ВидыСкладов.ТНП Тогда
		
		Если ЗначениеЗаполнено(СкладСсылка) Тогда
			Ид_Склада = Строка(СкладСсылка.УникальныйИдентификатор());	
		Иначе
			Ид_Склада =  ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьГуидСкладаТорговыйЗал(ТорговаяПлощадкаСсылка);
		КонецЕсли;
		Если Ид_Склада = Неопределено Тогда
			Продажа = 0;
		КонецЕсли;
		
		ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
		
		Попытка 
			Продажа = ОбменФронт.ПолучитьКоличествоПродажПоОтбору(ПодразделениеПродажи,ДанныеНоменклатуры.Артикул,Ид_Склада, "");
		Исключение
			Продажа = 0;
		КонецПопытки;
		//!!!!!!!! Добавить
		//Продажа = ОС_Сервер.ПолучитьКоличествоПродажПоОтбору(ДанныеНоменклатуры.Артикул,Ид_Склада);
		
		
		ДанныеНоменклатуры.Продажи = Продажа;
		
		
	КонецЕсли;
	
	Если ДанныеНоменклатуры.Свойство("Контрагент") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СогласованиеЦенСрезПоследних.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СогласованиеЦен.СрезПоследних(
		|			,
		|			ДоговорВзаиморасчетов.Подразделение = &Подразделение
		|				И Номенклатура = &Номенклатура) КАК СогласованиеЦенСрезПоследних";
		
		Запрос.УстановитьПараметр("Номенклатура", СтрукураТовара.Номенклатура);
		Запрос.УстановитьПараметр("Подразделение", ТорговаяПлощадкаСсылка.ПодразделениеКомпании);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивИд = Новый Массив;
		МассивНаименование = Новый Массив;

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивИд.Добавить(Строка(ВыборкаДетальныеЗаписи.Контрагент.УникальныйИдентификатор()));
			МассивНаименование.Добавить(Строка(ВыборкаДетальныеЗаписи.Контрагент));
		КонецЦикла;
		ДанныеНоменклатуры.Контрагент = Новый Структура("UUID,Name",МассивИд,МассивНаименование);
		
	КонецЕсли;
	
	
	
	СтруктураОтвета.Результат = Истина;
	СтруктураОтвета.Ответ  =  ДанныеНоменклатуры;
	
КонецПроцедуры

Процедура ПолучитьОстатокТовара(ТорговаяПлощадкаСсылка,СкладСсылка,СтруктураОтвета,Артикул,МРЦ)
	УстановитьПривилегированныйРежим(Истина);
	ДанныеНоменклатуры  = Новый Структура("Остаток",0);
	РезультатЗапроса = ДанныеТовара(Артикул,"Артикул",Истина);
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураОтвета.Ответ  =  ДанныеНоменклатуры;

		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СсылкаНоменклатура = Выборка.Номенклатура;
	
	Если ЗначениеЗаполнено(МРЦ) Тогда
		Попытка 
			МРЦЧисло = Число(МРЦ);
		Исключение
			МРЦЧисло  = 0;
		КонецПопытки;
	Иначе
		МРЦЧисло = 0; 
	
	КонецЕсли;
	
	
	МРЦСсылка = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(СсылкаНоменклатура, МРЦЧисло);
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	 |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	 |			,
	 |			Номенклатура = &Номенклатура
	 |				И СкладКомпании = &СкладКомпании
	 |				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура",СсылкаНоменклатура);
	Запрос.УстановитьПараметр("СкладКомпании",СкладСсылка);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",МРЦСсылка);
	
	
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		ДанныеНоменклатуры.Вставить("Остаток", Выборка.КоличествоОстаток);
		
	КонецЕсли;

	                      
	
	
	Попытка 
		
		ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);

		
		Продажа = ОбменФронт.ПолучитьКоличествоПродажПоОтбору(ПодразделениеПродажи,Артикул,Строка(СкладСсылка.УникальныйИдентификатор()),Строка(МРЦСсылка.УникальныйИдентификатор()));
		Если Продажа = Неопределено Тогда
			Продажа = 0;
		КонецЕсли;
		
	Исключение
		опОшибка = ОписаниеОшибки();
		Продажа = 0;
	КонецПопытки;
	
	ДанныеНоменклатуры.Вставить("Продажа", Продажа);
	
	
	
	СтруктураОтвета.Результат = Истина;
	СтруктураОтвета.Ответ  =  ДанныеНоменклатуры;

	
	
КонецПроцедуры

Функция ПроверитьМРЦ(Артикул,МРЦ)Экспорт
	СтруктураОтвета = СтруктураВозврата();
	СтруктураОтвета.Результат = Истина;
	
	РезультатЗапроса = ДанныеТовара(Артикул,"Артикул",Истина);
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураОтвета.Ответ  =  Ложь;
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СсылкаНоменклатура = Выборка.Номенклатура;
	
	Если ЗначениеЗаполнено(МРЦ) Тогда
		Попытка 
			МРЦЧисло = Число(МРЦ);
		Исключение
			МРЦЧисло  = 0;
		КонецПопытки;
	Иначе
		МРЦЧисло = 0; 
		
	КонецЕсли;
	
	Если МРЦЧисло = 0 Тогда
		СтруктураОтвета.Ответ  =  Ложь;
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	
	МРЦСсылка = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(СсылкаНоменклатура, МРЦЧисло);
	
	Если МРЦСсылка.Пустая() Тогда
		СтруктураОтвета.Ответ  =  Ложь;
	Иначе
		СтруктураОтвета.Ответ  =  Истина;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция МакисальноеМРЦ_НаОстатке(СкладКомпании,Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			,
	|			СкладКомпании = &СкладКомпании
	|				И Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ УБЫВ";
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ХарактеристикаНоменклатуры;
	
КонецФункции



#Область СканировкаТабакФМ_БАТ

Функция ПолучитьСтруктуруРасходнойНакладной(UUID)Экспорт
	
	СтруктураОтвета = СтруктураВозврата();
	
	
	Попытка 
		УнИнд = Новый УникальныйИдентификатор(UUID);	
	Исключение
		СтруктураОтвета.ОписаниеОшибки =  "Отсканируйте QR накладной";
		Возврат СтруктураОтвета;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеализацияСсылка = Документы.РеализацияТоваров.ПолучитьСсылку(УнИнд);
	
	ОбъектРеализация = РеализацияСсылка.ПолучитьОбъект();
	
	Если ОбъектРеализация = Неопределено Тогда
		
		СтруктураОтвета.ОписаниеОшибки =  "Накладная не найдена по ID "+ UUID;
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ТК_ТСД_ДанныеДляОтправкиТабак КАК ТК_ТСД_ДанныеДляОтправкиТабак
		|ГДЕ
		|	ТК_ТСД_ДанныеДляОтправкиТабак.ДокументСсылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", РеализацияСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
		СтруктураОтвета.ОписаниеОшибки =  "Накладная уже отсканирована";
		
		Возврат СтруктураОтвета;
	
	КонецЕсли;
	
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
		|	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки КАК ЕдиницаИзмеренияУпаковки,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков КАК ЕдиницаИзмеренияЯщиков,
		|	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент КАК ЕдиницаИзмеренияЯщиковКоэффициент
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровТовары.Номенклатура.Производитель = &ПроизводительФМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
		|	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки КАК ЕдиницаИзмеренияУпаковки,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков КАК ЕдиницаИзмеренияЯщиков,
		|	РеализацияТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОсновнаяЕдиницаИзмеренияКоэффициент,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент КАК ЕдиницаИзмеренияУпаковкиКоэффициент,
		|	РеализацияТоваровТовары.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент КАК ЕдиницаИзмеренияЯщиковКоэффициент
		|ИЗ
		|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|ГДЕ
		|	РеализацияТоваровТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровТовары.Номенклатура.Производитель = &ПроизводительБАТ";
		
		Запрос.УстановитьПараметр("ПроизводительБАТ", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительБАТ());
		Запрос.УстановитьПараметр("ПроизводительФМ", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительФМ());
		Запрос.УстановитьПараметр("Ссылка", РеализацияСсылка);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаФМ = РезультатЗапроса[0].Выбрать();
		
		
		СтруктураИтоговМестФМ = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
		Пока ВыборкаФМ.Следующий() Цикл
			
			КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
			ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
			ВыборкаФМ.Номенклатура,
			ВыборкаФМ.КоличествоБазовое,
			ВыборкаФМ.ОсновнаяЕдиницаИзмерения,
			ВыборкаФМ.ЕдиницаИзмеренияЯщиков,
			ВыборкаФМ.ЕдиницаИзмеренияУпаковки,
			ВыборкаФМ.ОсновнаяЕдиницаИзмеренияКоэффициент,
			ВыборкаФМ.ЕдиницаИзмеренияЯщиковКоэффициент,
			ВыборкаФМ.ЕдиницаИзмеренияУпаковкиКоэффициент),
			СтруктураИтоговМестФМ);
			
		КонецЦикла;
		
		ВыборкаБАТ = РезультатЗапроса[1].Выбрать();
		
		СтруктураИтоговМестБАТ = ТК_УправлениеПечатью.ПолучитьСтруктуруИтоговМест();
		Пока ВыборкаБАТ.Следующий() Цикл
			
			КоличествоМестПредставление = ТК_УправлениеПечатью.ПредставлениеКоличестваМест(
			ТК_УправлениеПечатью.ПолучитьСтруктуруМест(
			ВыборкаБАТ.Номенклатура,
			ВыборкаБАТ.КоличествоБазовое,
			ВыборкаБАТ.ОсновнаяЕдиницаИзмерения,
			ВыборкаБАТ.ЕдиницаИзмеренияЯщиков,
			ВыборкаБАТ.ЕдиницаИзмеренияУпаковки,
			ВыборкаБАТ.ОсновнаяЕдиницаИзмеренияКоэффициент,
			ВыборкаБАТ.ЕдиницаИзмеренияЯщиковКоэффициент,
			ВыборкаБАТ.ЕдиницаИзмеренияУпаковкиКоэффициент),
			СтруктураИтоговМестБАТ);
			
		КонецЦикла;
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("НомерДокумента",СокрЛП(РеализацияСсылка.Номер));
		СтруктураДокумента.Вставить("ДатаДокумента",РеализацияСсылка.Дата);
		СтруктураДокумента.Вставить("Контрагент",Строка(РеализацияСсылка.Контрагент));
		СтруктураДокумента.Вставить("АдресДоставки",Строка(РеализацияСсылка.ТочкаДоставки));
		СтруктураДокумента.Вставить("СканированиеФМ",СтруктураИтоговМестФМ);
		СтруктураДокумента.Вставить("СканированиеБАТ",СтруктураИтоговМестБАТ);
		
		
		СтруктураОтвета.Ответ = СтруктураДокумента;
		СтруктураОтвета.Результат = Истина;
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СтруктураОтвета;

	
КонецФункции

Функция ЗаписатьОтсканированнуюНакладную(UUID)Экспорт
	
	СтруктураОтвета = СтруктураВозврата();
	
	
	Попытка 
		УнИнд = Новый УникальныйИдентификатор(UUID);	
	Исключение
		СтруктураОтвета.ОписаниеОшибки =  "ID накладной не корректен";
		Возврат СтруктураОтвета;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеализацияСсылка = Документы.РеализацияТоваров.ПолучитьСсылку(УнИнд);
	
	ОбъектРеализация = РеализацияСсылка.ПолучитьОбъект();
	
	Если ОбъектРеализация = Неопределено Тогда
		
		СтруктураОтвета.ОписаниеОшибки =  "Накладная не найдена по ID "+ UUID;
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Попытка
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ТСД_СканированиеТабак.Производитель КАК Производитель,
		|	ТК_ТСД_СканированиеТабак.ДанныеСканировки КАК ДанныеСканировки
		|ИЗ
		|	РегистрСведений.ТК_ТСД_СканированиеТабак КАК ТК_ТСД_СканированиеТабак
		|ГДЕ
		|	ТК_ТСД_СканированиеТабак.ДокументСканирования = &ДокументСканирования
		|
		|УПОРЯДОЧИТЬ ПО
		|	Производитель";
		
		Запрос.УстановитьПараметр("ДокументСканирования", РеализацияСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СтруктураДокумента = Новый Структура;
		
		Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("Производитель") Цикл
			
			МассивШК = Новый Массив;
			стПроизводитель ="ФМ";
			Если ВыборкаДетальныеЗаписи.Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительБАТ() Тогда
				Производитель = "БАТ";
			КонецЕсли;
			
			сч = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				МассивШК.Добавить(ВыборкаДетальныеЗаписи.ДанныеСканировки);
				сч = сч +1
			КонецЦикла;
			
			Запись = Новый ЗаписьJSON;
			Запись.УстановитьСтроку();
			ЗаписатьJSON(Запись, МассивШК);
			
			СтрокаJSON = Запись.Закрыть();
			
			Набор = РегистрыСведений.ТК_ТСД_ДанныеДляОтправкиТабак.СоздатьНаборЗаписей();
			Набор.Отбор.ДокументСсылка.Установить(РеализацияСсылка);
			Набор.Отбор.Производитель.Установить(ВыборкаДетальныеЗаписи.Производитель);
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Статус = Перечисления.СтатусыОтправкиФМ.Новый;
			НоваяЗапись.ДатаСканирования = ТекущаяДатаСеанса();
			НоваяЗапись.ДокументСсылка = РеализацияСсылка;
			НоваяЗапись.Производитель =  ВыборкаДетальныеЗаписи.Производитель;
			НоваяЗапись.Пользователь = Пользователи.ТекущийПользователь();  
			НоваяЗапись.ДанныеСканирования = Новый ХранилищеЗначения(СтрокаJSON,Новый СжатиеДанных(9));
			
			Набор.Записать();
			
			СтруктураДокумента.Вставить(стПроизводитель,сч);
			
		КонецЦикла;

		
		СтруктураОтвета.Ответ = СтруктураДокумента;
		СтруктураОтвета.Результат = Истина;
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат СтруктураОтвета;

	
КонецФункции

Функция ОтменаСканировкиТабак(UUID)Экспорт
	
	СтруктураОтвета = СтруктураВозврата();
	
	
	Попытка 
		УнИнд = Новый УникальныйИдентификатор(UUID);	
	Исключение
		СтруктураОтвета.ОписаниеОшибки =  "ID накладной не корректен";
		Возврат СтруктураОтвета;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеализацияСсылка = Документы.РеализацияТоваров.ПолучитьСсылку(УнИнд);
	
	ОбъектРеализация = РеализацияСсылка.ПолучитьОбъект();
	
	Если ОбъектРеализация = Неопределено Тогда
		
		СтруктураОтвета.ОписаниеОшибки =  "Накладная не найдена по ID "+ UUID;
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	Попытка
		
		Набор = РегистрыСведений.ТК_ТСД_СканированиеТабак.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументСканирования.Установить(РеализацияСсылка);
		
		Набор.Записать();
		
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	СтруктураОтвета.Результат = Истина;
	Возврат СтруктураОтвета;

	
КонецФункции

Функция ОбработатьТабачныйШтрихКод(UUID,Запрос,Парам)Экспорт
	

	СтруктураОтвета = СтруктураВозврата();
	
	ПотокДанных = Запрос.ПолучитьТелоКакПоток();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(ПотокДанных,КодировкаТекста.UTF8);
	Попытка
		СтруктураШК = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат СтруктураОтвета;
		
	КонецПопытки;

	СтрокаПоиска = Неопределено;
	СтруктураШК.Свойство("ДанныеQR",СтрокаПоиска);
	Если СтрокаПоиска = Неопределено Тогда
		СтруктураОтвета.ОписаниеОшибки = "Штрих код не определен"; 
		Возврат СтруктураОтвета;
	КонецЕсли;
	СтрокаПоиска = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаПоиска);
	
	СтруктураШтрихКода = Новый Структура;
	СтруктураШтрихКода.Вставить("ШтриКодОтсканирован",Ложь);
	СтруктураШтрихКода.Вставить("СоставнойШтрихКод",Ложь);

	
		
		 
	 
	
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка 
		
		
		
		
		ДокСсылка = Документы.РеализацияТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID));
		
		ЭтоШККороба 	= СтрДлина(СтрокаПоиска) > 60 И Лев(СтрокаПоиска, 3) = "010";
		ЭтоШКБлока 		= Не ЭтоШККороба И  (СтрДлина(СтрокаПоиска) > 16 И Лев(СтрокаПоиска, 3) = "010");
		Если ЭтоШКБлока ИЛИ ЭтоШККороба Тогда
			Рез = РегистрыСведений.ТК_ОтсканированныеQRкоды.ПроверитьУникальностьШтрихКода(СтрокаПоиска,ДокСсылка.ТорговаяПлощадка);
			СтруктураШтрихКода.Вставить("ШтриКодОтсканирован",Не Рез);
			текШтрихКод = Сред(СтрокаПоиска, 4, 13);
			СтруктураШтрихКода.Вставить("СоставнойШтрихКод",Истина);

		Иначе
			текШтрихКод = СтрокаПоиска;
		КонецЕсли;
		
		Если СтруктураШтрихКода.ШтриКодОтсканирован Тогда
			
			СтруктураОтвета.Ответ = СтруктураШтрихКода;
			СтруктураОтвета.ОписаниеОшибки = "Штрих код уже отсканирован";
			
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		
		ТолькоЦифрыШК = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(текШтрихКод);
		Номенклатура = Неопределено;
		Если ТолькоЦифрыШК Тогда
			Номенклатура = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиТоварПоШтрихКоду(текШтрихКод);
		КонецЕсли;
		стрПроизводитель ="БАТ";
		Если Номенклатура <> Неопределено Тогда 
			Если Номенклатура.Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительБАТ() Тогда
				Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительБАТ();
			ИначеЕсли  Номенклатура.Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительФМ() Тогда
				Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительФМ();

				стрПроизводитель = "ФМ";	
			Иначе
				СтруктураОтвета.Ответ = СтруктураШтрихКода;
				СтруктураОтвета.ОписаниеОшибки = "Неизвествный производитель товара";
				
			Возврат СтруктураОтвета;

			КонецЕсли;
			
		Иначе
			Производитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПроизовдительФМ();
			стрПроизводитель = "ФМ";
		КонецЕсли;
		
		Если (ЭтоШККороба ИЛИ ЭтоШКБлока ИЛИ НЕ ТолькоЦифрыШК) И Парам ="insert" Тогда
			
			Наборзаписи = РегистрыСведений.ТК_ТСД_СканированиеТабак.СоздатьНаборЗаписей();
			Наборзаписи.Отбор.ДокументСканирования.Установить(ДокСсылка);
			Наборзаписи.Отбор.Производитель.Установить(Производитель);
			Наборзаписи.Отбор.ДанныеСканировки.Установить(СтрокаПоиска);
			
			НоваяЗапись = Наборзаписи.Добавить();
			НоваяЗапись.ДокументСканирования = ДокСсылка;
			НоваяЗапись.Производитель = Производитель;
			НоваяЗапись.ДанныеСканировки = СтрокаПоиска;
			НоваяЗапись.Номенклатура = Номенклатура;
			НоваяЗапись.ДатаСканирования = ТекущаяДатаСеанса();
			
			Наборзаписи.Записать();
			
			
			//Наборзаписи = РегистрыСведений.ТК_ОтсканированныеQRкоды.СоздатьНаборЗаписей();
			//НаборЗаписи.Отбор.ДанныеСканирования.Установить(СтрокаПоиска);
			//НаборЗаписи.Отбор.ТорговаяПлощадка.Установить(ДокСсылка.ТорговаяПлощадка);
			//
			//НоваяЗапись = Наборзаписи.Добавить();
			//НоваяЗапись.ДанныеСканирования = СтрокаПоиска;
			//НоваяЗапись.ТорговаяПлощадка = ДокСсылка.ТорговаяПлощадка;
			//НоваяЗапись.Дата = ТекущаяДатаСеанса();
			//НоваяЗапись.НомерРезерва = ДокСсылка.Номер;
			//
			//Наборзаписи.Записать();
			
		КонецЕсли;
		
		СтруктураШтрихКода.Вставить("ЭтоШКБлока",ЭтоШКБлока);
		СтруктураШтрихКода.Вставить("ЭтоШККороба",ЭтоШККороба); 
		СтруктураШтрихКода.Вставить("ТолькоЦифрыШК",ТолькоЦифрыШК); 
		СтруктураШтрихКода.Вставить("Производитель",стрПроизводитель);
	Исключение 
		СтруктураОтвета.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	СтруктураОтвета.Ответ = СтруктураШтрихКода;
	СтруктураОтвета.Результат = Истина;
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

Функция ПолучитьДанныеПоЗадачам(ГуидПодразделения,Параметры)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(ГуидПодразделения,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
		
		
	ЗаполнитьСтруктуруПозадачам(ТорговаяПлощадкаСсылка,Параметры,Результат);
	
	Возврат Результат;	

	
КонецФункции


Функция ПолучитьДанныеПоПереоценкам(ГуидПодразделения,ПериодПереоценки)Экспорт
	
	ДатаПереоценки = Дата(ПериодПереоценки);

	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(ГуидПодразделения,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
		
	СформироватьДанныеПоПереоценкам(ТорговаяПлощадкаСсылка,ДатаПереоценки,Результат);
	
	Возврат Результат;	
	
КонецФункции


Процедура СформироватьДанныеПоПереоценкам(ТорговаяПлощадкаСсылка,ДатаПереоценки,СтруктураОтвета) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Скидки.Номенклатура КАК Номенклатура,
		|	Скидки.НачалоДействия КАК НачалоДействия,
		|	Скидки.КонецДействия КАК КонецДействия
		|ПОМЕСТИТЬ ВТ_ТекАкции
		|ИЗ
		|	(ВЫБРАТЬ
		|		СкидкиВнутр.Объект КАК Номенклатура,
		|		СкидкиВнутр.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|		СкидкиВнутр.Порядок КАК Порядок,
		|		СкидкиВнутр.НачалоДействия КАК НачалоДействия,
		|		СкидкиВнутр.КонецДействия КАК КонецДействия,
		|		СУММА(ВЫБОР
		|				КОГДА СкидкиВнутр.Действует
		|					ТОГДА 1
		|				ИНАЧЕ -1
		|			КОНЕЦ) КАК Действует
		|	ИЗ
		|		РегистрСведений.ТК_Скидки КАК СкидкиВнутр
		|	ГДЕ
		|		СкидкиВнутр.ТорговаяПлощадка = &ТорговаяПлощадка
		|		И &НачалоДня МЕЖДУ СкидкиВнутр.НачалоДействия И СкидкиВнутр.КонецДействия
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СкидкиВнутр.НачалоДействия,
		|		СкидкиВнутр.Порядок,
		|		СкидкиВнутр.Объект,
		|		СкидкиВнутр.ТорговаяПлощадка,
		|		СкидкиВнутр.КонецДействия
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(ВЫБОР
		|				КОГДА СкидкиВнутр.Действует
		|					ТОГДА 1
		|				ИНАЧЕ -1
		|			КОНЕЦ) > 0) КАК Скидки
		|ГДЕ
		|	&НачалоДня МЕЖДУ Скидки.НачалоДействия И Скидки.КонецДействия
		|	И Скидки.Порядок В
		|			(ВЫБРАТЬ
		|				МАКСИМУМ(СкидкиВнутр.Порядок)
		|			ИЗ
		|				РегистрСведений.ТК_Скидки КАК СкидкиВнутр
		|			ГДЕ
		|				&НачалоДня МЕЖДУ СкидкиВнутр.НачалоДействия И СкидкиВнутр.КонецДействия
		|				И СкидкиВнутр.ТорговаяПлощадка = Скидки.ТорговаяПлощадка
		|				И СкидкиВнутр.Объект = Скидки.Номенклатура
		|			СГРУППИРОВАТЬ ПО
		|				СкидкиВнутр.ТорговаяПлощадка,
		|				СкидкиВнутр.Объект
		|			ИМЕЮЩИЕ
		|				СУММА(ВЫБОР
		|						КОГДА СкидкиВнутр.Действует
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ) > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Скидки.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	Скидки.Объект КАК Номенклатура,
		|	Скидки.ЗначениеСкидки КАК Цена,
		|	Скидки.Действует КАК Действует,
		|	НАЧАЛОПЕРИОДА(Скидки.НачалоДействия, ДЕНЬ) КАК НачалоДействия,
		|	КОНЕЦПЕРИОДА(Скидки.КонецДействия, ДЕНЬ) КАК КонецДействия,
		|	Скидки.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА Скидки.Действует
		|				И НАЧАЛОПЕРИОДА(Скидки.НачалоДействия, ДЕНЬ) = &НачалоДня
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Вкл,
		|	Скидки.КлассификаторПродаж.Код КАК КодСкидки
		|ПОМЕСТИТЬ ВТ_Скидки
		|ИЗ
		|	РегистрСведений.ТК_Скидки КАК Скидки
		|ГДЕ
		|	(Скидки.НачалоДействия МЕЖДУ &НачалоДня И &КонецДня
		|			ИЛИ Скидки.КонецДействия МЕЖДУ &НачалоДня И &КонецДня)
		|	И Скидки.ТорговаяПлощадка = &ТорговаяПлощадка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныСрезПоследних.Цена КАК Цена,
		|	1 КАК Порядок,
		|	1 КАК Вкл,
		|	""Розница"" КАК ЦветЦенника
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&КонецДня, ТипЦен = &ТипЦенРеализации) КАК ЦеныСрезПоследних
		|ГДЕ
		|	ЦеныСрезПоследних.Период МЕЖДУ &НачалоДня И &КонецДня
		|	И НЕ ЦеныСрезПоследних.Номенклатура В
		|				(ВЫБРАТЬ
		|					ВТ_ТекАкции.Номенклатура
		|				ИЗ
		|					ВТ_ТекАкции КАК ВТ_ТекАкции)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.ТипЦен,
		|	ЦеныСрезПоследних.Номенклатура,
		|	ЦеныСрезПоследних.Характеристика,
		|	ЦеныСрезПоследних.Цена,
		|	2,
		|	1,
		|	""Розница""
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&КонецДня, ТипЦен = &БазовыйТипЦен) КАК ЦеныСрезПоследних
		|ГДЕ
		|	ЦеныСрезПоследних.Период МЕЖДУ &НачалоДня И &КонецДня
		|	И НЕ ЦеныСрезПоследних.Номенклатура В
		|				(ВЫБРАТЬ
		|					ВТ_ТекАкции.Номенклатура
		|				ИЗ
		|					ВТ_ТекАкции КАК ВТ_ТекАкции
		|		
		|				ОБЪЕДИНИТЬ
		|		
		|				ВЫБРАТЬ
		|					ЦеныСрезПоследних.Номенклатура
		|				ИЗ
		|					РегистрСведений.Цены.СрезПоследних(&КонецДня, ТипЦен = &ТипЦенРеализации) КАК ЦеныСрезПоследних
		|				ГДЕ
		|					ЦеныСрезПоследних.Цена <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Скидки.ТорговаяПлощадка,
		|	ВТ_Скидки.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ВТ_Скидки.Цена,
		|	0,
		|	1,
		|	ВТ_Скидки.КодСкидки
		|ИЗ
		|	ВТ_Скидки КАК ВТ_Скидки
		|ГДЕ
		|	ВТ_Скидки.Вкл
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Скидки.ТорговаяПлощадка,
		|	ВТ_Скидки.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ВТ_Скидки.Цена,
		|	0,
		|	0,
		|	""Розница""
		|ИЗ
		|	ВТ_Скидки КАК ВТ_Скидки
		|ГДЕ
		|	ВТ_Скидки.Вкл = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Цены.Номенклатура КАК Номенклатура,
		|	ВТ_Цены.Характеристика КАК Характеристика,
		|	ВТ_Цены.ЦветЦенника КАК ЦветЦенника
		|ПОМЕСТИТЬ Ассортимент
		|ИЗ
		|	ВТ_Цены КАК ВТ_Цены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ассортимент.Номенклатура КАК Номенклатура,
		|	Ассортимент.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ВТ_ЦеныАкцияНачало.Цена, 0) КАК АкцияНачало,
		|	ЕСТЬNULL(ВТ_ЦеныАкцияКонец.Цена, 0) КАК АкцияКонец,
		|	ЕСТЬNULL(ЦеныСрезПоследнихРозница.Цена, 0) КАК ЦенаРозница,
		|	ЕСТЬNULL(ЦеныСрезПоследнихДоп.Цена, 0) КАК ЦенаДоп,
		|	Ассортимент.ЦветЦенника КАК ЦветЦенника
		|ПОМЕСТИТЬ Цены
		|ИЗ
		|	Ассортимент КАК Ассортимент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_ЦеныАкцияНачало
		|		ПО Ассортимент.Номенклатура = ВТ_ЦеныАкцияНачало.Характеристика
		|			И Ассортимент.Характеристика = ВТ_ЦеныАкцияНачало.Характеристика
		|			И (ВТ_ЦеныАкцияНачало.Вкл = 1)
		|			И (ВТ_ЦеныАкцияНачало.Порядок = 0)
		|			И Ассортимент.ЦветЦенника = ВТ_ЦеныАкцияНачало.ЦветЦенника
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_ЦеныАкцияКонец
		|		ПО Ассортимент.Номенклатура = ВТ_ЦеныАкцияКонец.Номенклатура
		|			И Ассортимент.Характеристика = ВТ_ЦеныАкцияКонец.Характеристика
		|			И (ВТ_ЦеныАкцияКонец.Вкл = 0)
		|			И (ВТ_ЦеныАкцияКонец.Порядок = 0)
		|			И Ассортимент.ЦветЦенника = ВТ_ЦеныАкцияКонец.ЦветЦенника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		|				&КонецДня,
		|				ТипЦен = &БазовыйТипЦен
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							Ассортимент.Номенклатура
		|						ИЗ
		|							Ассортимент КАК Ассортимент)) КАК ЦеныСрезПоследнихРозница
		|		ПО Ассортимент.Номенклатура = ЦеныСрезПоследнихРозница.Номенклатура
		|			И Ассортимент.Характеристика = ЦеныСрезПоследнихРозница.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		|				&КонецДня,
		|				ТипЦен = &ТипЦенРеализации
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							Ассортимент.Номенклатура
		|						ИЗ
		|							Ассортимент КАК Ассортимент)) КАК ЦеныСрезПоследнихДоп
		|		ПО Ассортимент.Номенклатура = ЦеныСрезПоследнихДоп.Номенклатура
		|			И Ассортимент.Характеристика = ЦеныСрезПоследнихДоп.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Номенклатура ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура КАК Справочник.Номенклатура).Наименование
		|	КОНЕЦ КАК Номенклатура,
		|	ЕСТЬNULL(ВложенныйЗапрос.Характеристика.Наименование, """") КАК Характеристика,
		|	ВложенныйЗапрос.Цена КАК Цена,
		|	ВложенныйЗапрос.Акция КАК Акция,
		|	ВложенныйЗапрос.ФорматЦенника КАК НазваниеЦенника,
		|	ВложенныйЗапрос.ЦветЦенника КАК КодЦенника,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Номенклатура ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура КАК Справочник.Номенклатура).Артикул
		|	КОНЕЦ КАК Артикул,
		|	ЕСТЬNULL(ВложенныйЗапрос.Характеристика.Код, """") КАК КодХар,
		|	ЕСТЬNULL(ВложенныйЗапрос.Характеристика.ЗначениеМРЦ, """") КАК МРЦ,
		|	ВложенныйЗапрос.ФорматЦенника КАК ФорматЦенника
		|ИЗ
		|	(ВЫБРАТЬ
		|		Цены.Номенклатура КАК Номенклатура,
		|		Цены.Характеристика КАК Характеристика,
		|		ВЫБОР
		|			КОГДА Цены.АкцияНачало <> 0
		|				ТОГДА Цены.АкцияНачало
		|			КОГДА Цены.ЦенаДоп <> 0
		|				ТОГДА Цены.ЦенаДоп
		|			ИНАЧЕ Цены.ЦенаРозница
		|		КОНЕЦ КАК Цена,
		|		ВЫБОР
		|			КОГДА Цены.АкцияНачало <> 0
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Акция,
		|		ВЫБОР
		|			КОГДА Цены.АкцияНачало <> 0
		|				ТОГДА ""Акция""
		|			ИНАЧЕ ""Розница""
		|		КОНЕЦ КАК ФорматЦенника,
		|		Цены.ЦветЦенника КАК ЦветЦенника
		|	ИЗ
		|		Цены КАК Цены
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
		|			ПО Цены.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		|				И Цены.Характеристика = ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
		|ИТОГИ ПО
		|	КодЦенника";
	
	
	
	
	СкладКомпании  =   ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадкаСсылка);
	
	СтруктураЦенСклада = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьТипыЦенСклада(СкладКомпании);
	
	
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаПереоценки));
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаПереоценки));
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);

	Запрос.УстановитьПараметр("БазовыйТипЦен", СтруктураЦенСклада.БазовыйТипЦен);
	Запрос.УстановитьПараметр("ТипЦенРеализации", СтруктураЦенСклада.ТипЦенРеализации);
	
//	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
//	Исключение
//		Ошибка = ОписаниеОшибки();
//	КонецПопытки;

	Если РезультатЗапроса.Пустой() Тогда
	
	   СтруктураОтвета.ОписаниеОшибки = "Нет переоценок на сегодня";
	   Возврат;
   КонецЕсли;
   
	   
	ВыборкаФорматЦенника = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	МассивВозврата = Новый Массив;
	
	СтрокаСтруктураСтроки ="Номенклатура,Артикул,Характеристика,МРЦ,КодХар,Цена";

	Пока ВыборкаФорматЦенника.Следующий() Цикл

	    	МассивТоваровЦенник = Новый Массив;

		ВыборкаДетальныеЗаписи = ВыборкаФорматЦенника.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			СтруктураСтроки = Новый Структура(СтрокаСтруктураСтроки);
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,ВыборкаДетальныеЗаписи,СтрокаСтруктураСтроки);
			МассивТоваровЦенник.Добавить(СтруктураСтроки);
		КонецЦикла;
		Если ТипЗнч(ВыборкаФорматЦенника.КодЦенника) = Тип("Число") Тогда
			НазваниеЦенника = Строка( Справочники.КлассификаторПродаж.НайтиПоКоду(ВыборкаФорматЦенника.КодЦенника));
		Иначе
			НазваниеЦенника ="Розница";
		КонецЕсли;
	
		ДанныеПоЦеннику = Новый Структура("НазваниеЦенника,КодЦенника,ДанныеПоТоварам",НазваниеЦенника,ВыборкаФорматЦенника.КодЦенника,МассивТоваровЦенник);

	//	ДанныеПоЦеннику = Новый Структура("НазваниеЦенника,КодЦенника,ДанныеПоТоварам",?(ЗначениеЗаполнено(ВыборкаФорматЦенника.ФорматЦенника),Строка(ВыборкаФорматЦенника.ФорматЦенника),"Шаблон не определен"), ?(ЗначениеЗаполнено(ВыборкаФорматЦенника.КодЦенника),ВыборкаФорматЦенника.КодЦенника,"DG000261"),МассивТоваровЦенник);
		МассивВозврата.Добавить(ДанныеПоЦеннику);
		
		
	КонецЦикла;

	СтруктураОтвета.Результат = Истина;
	СтруктураОтвета.Ответ = МассивВозврата;

	
КонецПроцедуры


Функция СформироватьМассивВозврата(Парам)Экспорт
	
	Результат =  СтруктураВозврата();
	
	Если Парам = "StVoz" Тогда
		Результат.Результат = Истина;
		Результат.Ответ = Справочники.СтатьиВозврата.ВернутьМассивСтатьиВозврата();

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруТорговойПолощадки(Знач стрПрефикс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтрНайти(стрПрефикс,"|") > 0 Тогда
		
		МассивШК =  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрПрефикс, "|", Истина, Истина);
		
		Префикс =  МассивШК[0];
		UUID    =  МассивШК[1];
		ТогрПлощадка = Справочники.ТорговыеПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID));
		
	Иначе
		ТогрПлощадка = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду(стрПрефикс);
	КонецЕсли;
	
	Если ТогрПлощадка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТогрПлощадка,"ПодразделениеКомпании");
	
	ЭтоАттика = Справочники.ПодразделенияКомпании.ЭтоАттика(Подразделение);
	
	
	СтруктураВозврата = Новый Структура("UUID,Name,ATT");
	
	СтруктураВозврата.Вставить("UUID",Строка(ТогрПлощадка.УникальныйИдентификатор()));
	СтруктураВозврата.Вставить("Name",СокрЛП(ТогрПлощадка.Наименование));
	
	СтруктураВозврата.Вставить("ATT",?(ЭтоАттика,1,0));
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтруктуруКонтрагента(Знач КодЕДРПО) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Контрагенты.Ссылка) КАК КонтрагентПредставление
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодПоЕДРПОУ = &КодПоЕДРПОУ";
	
	Запрос.УстановитьПараметр("КодПоЕДРПОУ", КодЕДРПО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "Контрагента не найден"; 
		Возврат Результат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("UUID,Name");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтруктураВозврата.Вставить("UUID",Строка(ВыборкаДетальныеЗаписи.Контрагент.УникальныйИдентификатор()));
	СтруктураВозврата.Вставить("Name",СокрЛП(ВыборкаДетальныеЗаписи.КонтрагентПредставление));
	Результат.Результат = Истина;
	Результат.Ответ = СтруктураВозврата;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСкладов(СтрокаПараметров)Экспорт
	
	
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметров, "|", Истина, Истина);

	Если МассивПодстрок.Количество()=1 Тогда
		ДанныеВозврата = ПолучитьСтурктуруСкладовТорговойПлощадки(МассивПодстрок[0]);	
	Иначе
		ДанныеВозврата = ПолучитьСтурктуруТорговыхПлощадок(МассивПодстрок[0]);
	КонецЕсли;
	
	
	Возврат ДанныеВозврата;
	
	
КонецФункции


Функция ПолучитьТоварТорговойПлощадки(UUID,ШтрихКод,Свернуто) Экспорт
	
	Результат =    СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	
	
	ДанныеПоТовару =  ОбработатьШтрихКод(ШтрихКод,Свернуто);
	Если ДанныеПоТовару = Неопределено Тогда
		Результат.ОписаниеОшибки ="Товар не найден по штрих коду "+ ШтрихКод;
		Результат.Результат = Ложь;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Результат = Истина;
	Если Свернуто Тогда
		Результат.Ответ = ДанныеПоТовару;
	Иначе
		РезОтвет =  ЦеныОстаткиПоТовару(ТорговаяПлощадкаСсылка,ДанныеПоТовару);
		Результат.Ответ = РезОтвет;	
		
	КонецЕсли;
	
	Возврат Результат;	
	
	
КонецФункции

Функция ПолучитьДанныеТовара(UUID,ГуидСклад="",ШтрихКод,Параметры)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(ГуидСклад) Тогда
		 СкладСсылка = СкладКорректно(ГуидСклад,Результат);
		 Если СкладСсылка = Неопределено Тогда
			 Возврат Результат;
		 КонецЕсли;
	 Иначе
		 СкладСсылка = Неопределено;
	КонецЕсли;
	
		
	ЗаполнитьСтруктуруТовара(ТорговаяПлощадкаСсылка,СкладСсылка,Результат,ШтрихКод,Параметры);
	
	Возврат Результат;	

	
КонецФункции

Функция ПолучитьДанныеТовараВозврат(UUID,ГуидСклад="",ШтрихКод,ГуидПоставщик)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(ГуидСклад) Тогда
		 СкладСсылка = СкладКорректно(ГуидСклад,Результат);
		 Если СкладСсылка = Неопределено Тогда
			 Возврат Результат;
		 КонецЕсли;
	 Иначе
		 СкладСсылка = Неопределено;
	КонецЕсли;
	
	ПараметрыТовара = "Остаток|ШтрихКод|ИспМРЦ|Коэффициент|Контрагент";
	
	ЗаполнитьСтруктуруТовара(ТорговаяПлощадкаСсылка,СкладСсылка,Результат,ШтрихКод,ПараметрыТовара);
	
	Если Результат.Результат Тогда
		мИдКонтрагента =Результат.Ответ.Контрагент.UUID;
		Если мИдКонтрагента.Количество() = 0 Тогда
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = "Не найден поставщик для возварата по товару"+Символы.ПС+Результат.Ответ.НаименованиеТовара;
		ИначеЕсли ГуидПоставщик<>"null" И мИдКонтрагента.Найти(ГуидПоставщик) = Неопределено  Тогда
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = "Товар "+Результат.Ответ.НаименованиеТовара+" не пренадлежит контрагенту возврата";

		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	Возврат Результат;	

	
КонецФункции


Функция ПолучитьДанныеОстаткаТовара(UUIDТорговаяПлощадка,UUIDСклад,Артикул,МРЦ)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUIDТорговаяПлощадка,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(UUIDСклад) Тогда
		 СкладСсылка = СкладКорректно(UUIDСклад,Результат);
		 Если СкладСсылка = Неопределено Тогда
			 Возврат Результат;
		 КонецЕсли;
	 Иначе
		 СкладСсылка = Неопределено;
	КонецЕсли;
	
		
	ПолучитьОстатокТовара(ТорговаяПлощадкаСсылка,СкладСсылка,Результат,Артикул,МРЦ);
	
	Возврат Результат;	

	
КонецФункции


///Менеджер ТЗ
Функция ПолучитьДанныеМенеджерТЗ(UUID,ШтрихКод)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
		
	СформироватьДанныеМенеджерТЗ(ПодразделениеСсылка,ШтрихКод,Результат);
	
	Возврат Результат;	

	
КонецФункции



//Верефикация цен

Функция ВерефицироватьЦенник(UUID,ДанныеЦенника,ИД_Задачи = Неопределено) Экспорт
	
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	
	ИнициализироватьДанныеТовара(ПодразделениеСсылка,Результат,ДанныеЦенника,ИД_Задачи);
	
	Возврат Результат;	
	
	
КонецФункции


Функция ПолучитьСписокДокументов(ПериодДокументов,ТипДокумента,UUID,ГуидКонтрагент) Экспорт
	ДатаДок = Дата(ПериодДокументов);

	Результат =  СтруктураВозврата();

	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	 	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	
		
	Если ТипДокумента = "Инвентаризация" Тогда
		Возврат ПолучитьМассивДокументовИнвентаризация(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "PRIX" Тогда
		Возврат ПолучитьМассивДокументовПредварительноеПоступление(ДатаДок,ПодразделениеСсылка,ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьКонтрагента(ГуидКонтрагент));
	ИначеЕсли ТипДокумента = "ZAK" тогда
		Возврат ПолучитьМассивДокументовЗаказПоставщику(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "РеестрПриходов" Тогда
		Возврат ПолучитьМассивДокументовПоступлениеТоваровДляПечати(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "Задание" Тогда
		Возврат ПолучитьМассивДокументовЗаданий(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли  ТипДокумента = "ЗаданиеИН" Тогда
		Возврат ПолучитьМассивДокументовЗаданийНаИнвентаризацию(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли  ТипДокумента = "ЗаданиеВФ" Тогда
		Возврат ПолучитьМассивДокументовЗаданийНаВерификацию(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли  ТипДокумента = "ЗаданиеТБД" Тогда
		Возврат ПолучитьМассивДокументовЗаданийНаТБД(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли  ТипДокумента = "ЗаданиеТНП" Тогда
		Возврат ПолучитьМассивДокументовЗаданийНаТНП(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента ="PrintVP" Тогда
		Возврат ПолучитьМассивДокументовВозвратПоставщикуДляПечати(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "PrintPR" Тогда
		Возврат ПолучитьМассивДокументовПеремещениеДляПечати(ДатаДок,ПодразделениеСсылка,Ложь);
	ИначеЕсли ТипДокумента = "PrintPRP" Тогда
		Возврат ПолучитьМассивДокументовПеремещениеДляПечати(ДатаДок,ПодразделениеСсылка,Истина);
	
	ИначеЕсли ТипДокумента = "PrintSP" Тогда
		Возврат ПолучитьМассивДокументовСписанияДляПечати(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "PrintIN" Тогда
		Возврат ПолучитьМассивДокументовИнвентаризацияДляПечати(ДатаДок,ПодразделениеСсылка);
	ИначеЕсли ТипДокумента = "RECLAM" Тогда
		Возврат ПолучитьМассивДокументовРекламация(ДатаДок,ПодразделениеСсылка);
	
	Иначе
		//Результат = СтруктураПараметровВозрата();
		Результат.Результат = Истина;
		Результат.Ответ = Новый Массив;
		
		Возврат Результат;
		
	КонецЕсли;
	
	
КонецФункции






Процедура СформироватьДанныеАкта(ПодразделениеСсылка,МассивДанных,Результат,ТипДок="ЗаказПоставщику")
	
	Ответ = Новый Структура;
	ОписаниеОшибки ="";
	
	Если НЕ МассивДанных.Свойство("ОснованиеUUID") Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Что-то не так! "+ Символы.ПС+"Нет документа основания";
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокСсылка = Документы[ТипДок].ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.ОснованиеUUID));
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Контрагент.НаименованиеПолное КАК ПредставлениеПоставщика,
		|	Док.ДоговорВзаиморасчетов.Организация.НаименованиеПолное КАК ПредставлениеПокупателя,
		|	Док.РегламентированныйУчет КАК Регл

		|ИЗ
		|	Документ."+ТипДок+" КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	
	ТекстЗаголовка = "АКТ розбіжностей до видаткової (товарно-транспортної) накладної  № "+МассивДанных.ПНомер+" вiд "+Формат(Дата(МассивДанных.ПДата), ?(ВыборкаДетальныеЗаписи.Регл, "Л=ru;ДЛФ=ДД", "ДФ=dd.MM.yyyy"));
	Ответ.Вставить("Заголовок",ТекстЗаголовка);
	
	ПредставлениеПоставщика = Строка(ВыборкаДетальныеЗаписи.ПредставлениеПоставщика);
	Ответ.Вставить("Поставщик",ПредставлениеПоставщика);
	
	ПредставлениеПокупателя = Строка(ВыборкаДетальныеЗаписи.ПредставлениеПокупателя);
	Ответ.Вставить("Покупатель",ПредставлениеПокупателя);
	
	ПредставлениеСоставления = СокрЛП(ПодразделениеСсылка.Наименование);
	Ответ.Вставить("МестоДоставки",ПредставлениеСоставления);
	
	
	СтрокаВозврата = "Артикул,Наименование,ЕдИзм,СтавкаНДС,ПоНакладной,Факт,Причина";
	МассивТоваров = Новый Массив;
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		
		СтрокаТовараАкт = Новый Структура(СтрокаВозврата);
		СтрокаТовараАкт.Артикул = СтрокаТовар.Артикул;
		СтрокаТовараАкт.ПоНакладной = СтрокаТовар.КоличествоПоставщика;
		СтрокаТовараАкт.Факт = СтрокаТовар.КоличествоВведено;
		СтрокаТовараАкт.Причина = СтрокаТовар.ПричинаРасхожденияСтрока;

		Рез =   ДанныеТовараV2(СтрокаТовар.Артикул,"Артикул");
		Если Рез.Пустой() Тогда
			
			СтрокаТовараАкт.Наименование = "Товар не найден";
			СтрокаТовараАкт.ЕдИзм = "";
			СтрокаТовараАкт.СтавкаНДС = "";
			МассивТоваров.Добавить(СтрокаТовараАкт);
			
			Продолжить;
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		
		СтрокаТовараАкт.Наименование =  СокрЛП(Выборка.НаименованиеТовара2);
		СтрокаТовараАкт.ЕдИзм =  СокрЛП(Выборка.НаименованиеЕдиницы);
		СтрокаТовараАкт.СтавкаНДС =  Строка(Выборка.СтавкаНДС);
		
		МассивТоваров.Добавить(СтрокаТовараАкт);

	КонецЦикла;
	Ответ.Вставить("Товары", МассивТоваров);
	
	Результат.Результат = Истина;
	Результат.Ответ = Ответ;
	
КонецПроцедуры


///Работа с документами

Функция ПолучитьМассивДокументовИнвентаризация(ДатаДок,ПодразделениеСсылка)
	
	Результат = СтруктураВозврата();
	
	УстановитьПривилегированныйРежим(Истина);
	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	Инвентаризация.Ссылка КАК ДокументСсылка,
		 |	Инвентаризация.Дата КАК Дата,
		 |	Инвентаризация.Номер КАК НомерДокумента,
		 |	Инвентаризация.Комментарий КАК Комментарий,
		 |	Инвентаризация.СкладКомпании КАК СкладСсылка
		 |ИЗ
		 |	Документ.Инвентаризация КАК Инвентаризация
		 |ГДЕ
		 |	Инвентаризация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |	И Инвентаризация.ТорговаяПлощадка = &ПодразделениеКомпании
		 |	И НЕ Инвентаризация.Проведен";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ДатаДок));
	Запрос.Параметры.Вставить("КонецПериода", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,SkladUUID,Info",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.ДокументСсылка.УникальныйИдентификатор()),
		Строка(Выборка.СкладСсылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.Комментарий)));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовПредварительноеПоступление(ДатаДок,ПодразделениеСсылка,Контрагент)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрихДокумент.Ссылка КАК ПрихДокументСсылка,
	|	ПрихДокумент.ВхДокДата КАК ДатаДокумента,
	|	ПрихДокумент.ВхДокНомер КАК НомерДокумента,
	|	ПрихДокумент.Контрагент КАК Контрагент,
	|	ПрихДокумент.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ПрихДокумент.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПрихДокумент
	|ГДЕ
	|	ПрихДокумент.ТорговаяПлощадка = &ПодразделениеКомпании
	|	И ПрихДокумент.ПометкаУдаления = ЛОЖЬ
	|	И ПрихДокумент.ВхДокДата МЕЖДУ &НачДата И &КонДата
	|	И ПрихДокумент.Проведен = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Контрагент = ПрихДокумент.Ссылка.Контрагент
	|		КОНЕЦ
	|	И ПрихДокумент.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПрихДокумент.Контрагент.Наименование";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	Запрос.Параметры.Вставить("НачДата", ДатаДок);
	Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,ClientUUID,Sum",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.ПрихДокументСсылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.КонтрагентНаименование),
		Строка(Выборка.Контрагент.УникальныйИдентификатор()),
		Выборка.СуммаДокумента));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовЗаказПоставщику(ДатаДок,ТорговаяПлощадка)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК ЗаказСсылка,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ЗаказПоставщику.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПоставщику.Номер КАК НомерДокумента,
	|	ЗаказПоставщику.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.ТорговаяПлощадка = &ТорговаяПлощадка
	|	И НЕ ЗаказПоставщику.Проведен
	|	И ЗаказПоставщику.Дата МЕЖДУ &НачДата И &КонДата
	|	И ЗаказПоставщику.СтатусЗаказаВеб = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовВеб.НеОтправлен)
	|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ
	|	И ЗаказПоставщику.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказПоставщикуТСД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику.Контрагент.Наименование";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.Параметры.Вставить("НачДата", ДатаДок);
	Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,ClientUUID,Sum",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.ЗаказСсылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.КонтрагентНаименование),
		Строка(Выборка.Контрагент.УникальныйИдентификатор()),
		Выборка.СуммаДокумента));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовРекламация(ДатаДок,ТорговаяПлощадка)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров) КАК СсылкаНаобъект,
	|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Номер КАК НомерДокумента,
	|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Дата КАК ДатаДокумента
	|ИЗ
	|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
	|ГДЕ
	|	ТК_СостояниеДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСборкиРезервов.Рекламация)
	|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель = &ТорговаяПлощадка
	|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ПометкаУдаления = ЛОЖЬ
	|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.Хозоперации.ПеремещениеТоваровВФилиал)";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,ClientUUID,Sum",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.СсылкаНаобъект.УникальныйИдентификатор()),
		СокрЛП(Выборка.ТорговаяПлощадка),
		"",
		"",));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции




Функция ПолучитьМассивДокументовПоступлениеТоваровДляПечати(ДатаДок,ПодразделениеСсылка)
	
	
	Результат = СтруктураВозврата();
	
	УстановитьПривилегированныйРежим(Истина);
	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	ПоступлениеТоваров.Ссылка КАК ДокументСсылка,
		 |	ПоступлениеТоваров.Контрагент КАК Контрагент,
		 |	ПоступлениеТоваров.ВхДокДата КАК Дата,
		 |	ПоступлениеТоваров.ВхДокНомер КАК НомерДокумента,
		 |	ПоступлениеТоваров.РегламентированныйУчет КАК Регл,
		 |	ПоступлениеТоваров.Проведен КАК Проведен,
		 |	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоПринято,
		 |	ВложенныйЗапрос.КоличествоПоставщика КАК КоличествоПоставщика,
		 |	ВложенныйЗапрос.Позиций КАК Позиций,
		 |	ВЫРАЗИТЬ(ПоступлениеТоваров.Комментарий КАК СТРОКА(50)) КАК Комментарий
		 |ИЗ
		 |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		 |			ПоступлениеТоваровТовары.Ссылка КАК Ссылка,
		 |			СУММА(ПоступлениеТоваровТовары.КоличествоБазовое) КАК КоличествоБазовое,
		 |			СУММА(ПоступлениеТоваровТовары.КоличествоПоставщика) КАК КоличествоПоставщика,
		 |			КОЛИЧЕСТВО(ПоступлениеТоваровТовары.Номенклатура) КАК Позиций
		 |		ИЗ
		 |			Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		 |		ГДЕ
		 |			ПоступлениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |			И ПоступлениеТоваровТовары.Ссылка.ТорговаяПлощадка = &ПодразделениеКомпании
		 |			И ПоступлениеТоваровТовары.Ссылка.Проведен
		 |		
		 |		СГРУППИРОВАТЬ ПО
		 |			ПоступлениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
		 |		ПО ПоступлениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
		 |ГДЕ
		 |	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |	И ПоступлениеТоваров.ТорговаяПлощадка = &ПодразделениеКомпании
		 |	И ПоступлениеТоваров.Проведен
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	Контрагент";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ДатаДок));
	Запрос.Параметры.Вставить("КонецПериода", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Если СтрНайти(Выборка.Комментарий,"АКТ")>0 Тогда
			ЕстьАкт = 1;
		Иначе
			ЕстьАкт = 2;
		КонецЕсли;
		
		
		МассивДокументов.Добавить(Новый Структура("Дата,НомерДокумента,Контрагент,Регл,Проведен,Акт,DocUUID,КоличествоПринято,КоличествоПоставщика,Позиций",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.Контрагент),
		?(Выборка.Регл,1,0),
		?(Выборка.Проведен,1,0),
		ЕстьАкт,
		Строка(Выборка.ДокументСсылка.УникальныйИдентификатор()),
		Выборка.КоличествоПринято,
		Выборка.КоличествоПоставщика,
		Выборка.Позиций));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовВозвратПоставщикуДляПечати(ДатаДок,ПодразделениеСсылка)
	
		Результат = СтруктураВозврата();
	  УстановитьПривилегированныйРежим(Истина);
	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	Док.Ссылка КАК ДокументСсылка,
		 |	Док.Контрагент КАК Контрагент,
		 |	Док.Дата КАК Дата,
		 |	Док.Номер КАК НомерДокумента,
		 |	Док.РегламентированныйУчет КАК Регл,
		 |	Док.Проведен КАК Проведен,
		 |	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоБазовое,
		 |	ВложенныйЗапрос.Позиций КАК Позиций,
		 |	ВЫРАЗИТЬ(Док.Комментарий КАК СТРОКА(50)) КАК Комментарий,
		 |	Док.СуммаДокумента КАК СуммаДокумента
		 |ИЗ
		 |	Документ.ВозвратПоставщику КАК Док
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		 |			ДокТовары.Ссылка КАК Ссылка,
		 |			СУММА(ДокТовары.КоличествоБазовое) КАК КоличествоБазовое,
		 |			КОЛИЧЕСТВО(ДокТовары.Номенклатура) КАК Позиций
		 |		ИЗ
		 |			Документ.ВозвратПоставщику.Товары КАК ДокТовары
		 |		ГДЕ
		 |			ДокТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |			И ДокТовары.Ссылка.ТорговаяПлощадка = &ПодразделениеКомпании
		 |			И ДокТовары.Ссылка.Проведен
		 |		
		 |		СГРУППИРОВАТЬ ПО
		 |			ДокТовары.Ссылка) КАК ВложенныйЗапрос
		 |		ПО Док.Ссылка = ВложенныйЗапрос.Ссылка
		 |ГДЕ
		 |	Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |	И Док.ТорговаяПлощадка = &ПодразделениеКомпании
		 |	И Док.Проведен
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	Контрагент";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ДатаДок));
	Запрос.Параметры.Вставить("КонецПериода", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,Sum,Poz,kol",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.ДокументСсылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.Контрагент),
		Выборка.СуммаДокумента,
		Выборка.Позиций,
		Выборка.КоличествоБазовое));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовПеремещениеДляПечати(ДатаДок,ПодразделениеСсылка,ИзФилиала=Ложь)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИзФилиала Тогда
		ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала;
	Иначе
		ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХозОперация",ХозОперация);
	Запрос.УстановитьПараметр("Расход",ИзФилиала);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА &Расход
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадкаПолучатель)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.ТорговаяПлощадка)
	|	КОНЕЦ КАК Получатель,
	|	ПеремещениеТоваров.Дата КАК ДатаДокумента,
	|	ПеремещениеТоваров.Номер КАК НомерДокумента,
	|	ВложенныйЗапрос.КоличествоБазовое КАК КоличествоБазовое
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
	|			СУММА(ПеремещениеТоваровТовары.КоличествоБазовое) КАК КоличествоБазовое
	|		ИЗ
	|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ГДЕ
	|			ПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
	|			И ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления = Ложь
	|			И ПеремещениеТоваровТовары.Ссылка.ХозОперация = &ХозОперация
	|			И ПеремещениеТоваровТовары.Ссылка.ТорговаяПлощадка = &ТорговаяПлощадка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ПеремещениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.ТорговаяПлощадка = &ТорговаяПлощадка
	|	И ПеремещениеТоваров.Дата МЕЖДУ &НачДата И &КонДата
	|	И ПеремещениеТоваров.ХозОперация = &ХозОперация
	|	И ПеремещениеТоваров.ПометкаУдаления = ЛОЖЬ";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачДата", ДатаДок);
	Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,Sum,kol",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.Получатель),
		Выборка.СуммаДокумента,
		Выборка.КоличествоБазовое));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	

	
КонецФункции

Функция ПолучитьМассивДокументовСписанияДляПечати(ДатаДок,ПодразделениеСсылка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	СписаниеТоваров.Ссылка КАК Ссылка,
		 |	СписаниеТоваров.Дата КАК ДатаДокумента,
		 |	СписаниеТоваров.Номер КАК НомерДокумента,
		 |	ПРЕДСТАВЛЕНИЕССЫЛКИ(СписаниеТоваров.СтатьяСписанияТМЦ) КАК Client
		 |ИЗ
		 |	Документ.СписаниеТоваров КАК СписаниеТоваров
		 |ГДЕ
		 |	СписаниеТоваров.ТорговаяПлощадка = &ПодразделениеКомпании
		 |	И СписаниеТоваров.Дата МЕЖДУ &НачДата И &КонДата
		 |	И СписаниеТоваров.Проведен";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачДата", ДатаДок);
	Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,ClientUUID,Sum",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.Client),
		Строка(""),
		0));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	

	
КонецФункции

Функция ПолучитьМассивДокументовИнвентаризацияДляПечати(ДатаДок,ПодразделениеСсылка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Инвентаризация.Ссылка КАК Ссылка,
	|	Инвентаризация.Дата КАК ДатаДокумента,
	|	Инвентаризация.Номер КАК НомерДокумента,
	|	ВЫРАЗИТЬ(Инвентаризация.Комментарий КАК СТРОКА(50)) КАК Client,
	|	Инвентаризация.ТипЦенИтогов КАК ТипЦенИтогов
	|ИЗ
	|	Документ.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.ТорговаяПлощадка = &ПодразделениеКомпании
	|	И Инвентаризация.Дата МЕЖДУ &НачДата И &КонДата
	|	И Инвентаризация.Проведен";
	Запрос.Параметры.Вставить("ПодразделениеКомпании", ПодразделениеСсылка);
	Запрос.Параметры.Вставить("НачДата", ДатаДок);
	Запрос.Параметры.Вставить("КонДата", КонецДня(ДатаДок));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		СуммаДокумента = Документы.Инвентаризация.ПолучитьИтогПоИнвентаризации(Выборка.Ссылка,Выборка.ТипЦенИтогов);
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,Client,ClientUUID,Sum",
		Формат(Выборка.ДатаДокумента,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.НомерДокумента),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		СокрЛП(Выборка.Client),
		"",
		СуммаДокумента));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	

	
КонецФункции

Функция ПолучитьМассивДокументовЗаданий(ДатаДок,ПодразделениеСсылка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Ссылка КАК Ссылка,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Наименование КАК Наименование,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Дата КАК Дата,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения,
	                |	ВЫБОР
	                |		КОГДА ТК_ЗадачаТСДЗадачиПоИсполнителю.Предмет ССЫЛКА Документ.ТК_ЗаявкаНаВозвратПоставщику
	                |			ТОГДА ВЫРАЗИТЬ(ТК_ЗадачаТСДЗадачиПоИсполнителю.Предмет КАК Документ.ТК_ЗаявкаНаВозвратПоставщику).Контрагент
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК Контрагент
	                |ИЗ
	                |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
	                |			&ТорговаяПлощадка,
	                |			Выполнена = ЛОЖЬ
	                |				И ПометкаУдаления = ЛОЖЬ
	                |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ВернутьПоставщику)) КАК ТК_ЗадачаТСДЗадачиПоИсполнителю
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Ссылка,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Наименование,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Дата,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.СрокИсполнения,
	                |	ВЫБОР
	                |		КОГДА ТК_ЗадачаТСДЗадачиПоИсполнителю.Предмет ССЫЛКА Документ.ТК_ЗаявкаНаПеремещение
	                |			ТОГДА ВЫРАЗИТЬ(ТК_ЗадачаТСДЗадачиПоИсполнителю.Предмет КАК Документ.ТК_ЗаявкаНаПеремещение).ТорговаяПлощадкаПолучатель
	                |		ИНАЧЕ """"
	                |	КОНЕЦ
	                |ИЗ
	                |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
	                |			&ТорговаяПлощадка,
	                |			Выполнена = ЛОЖЬ
	                |				И ПометкаУдаления = ЛОЖЬ
	                |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.Перемещение)) КАК ТК_ЗадачаТСДЗадачиПоИсполнителю
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Ссылка,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Наименование,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Дата,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.СрокИсполнения,
	                |	""zadyv""
	                |ИЗ
	                |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
	                |			&ТорговаяПлощадка,
	                |			Выполнена = ЛОЖЬ
	                |				И ПометкаУдаления = ЛОЖЬ
	                |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.Уведомление)) КАК ТК_ЗадачаТСДЗадачиПоИсполнителю
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Ссылка,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Наименование,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.Дата,
	                |	ТК_ЗадачаТСДЗадачиПоИсполнителю.СрокИсполнения,
	                |	""zadel""
	                |ИЗ
	                |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
	                |			&ТорговаяПлощадка,
	                |			Выполнена = ЛОЖЬ
	                |				И ПометкаУдаления = ЛОЖЬ
	                |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков)) КАК ТК_ЗадачаТСДЗадачиПоИсполнителю";
	
	
	
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ПодразделениеСсылка);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Data",Формат(Выборка.Дата,"ДФ=yyyyMMdd"));
		СтруктураДокумента.Вставить("NomDoc", СокрЛП(Выборка.Наименование));
		СтруктураДокумента.Вставить("DocUUID", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("DataF", Формат(Выборка.СрокИсполнения,"ДФ=yyyyMMdd"));
		стрКонтрагент = Строка(Выборка.Контрагент);
		Если стрКонтрагент = "zadel" Тогда
			СтруктураДокумента.Вставить("TipDoc", стрКонтрагент);
		ИначеЕсли  стрКонтрагент = "zadyv" Тогда
			СтруктураДокумента.Вставить("TipDoc", стрКонтрагент);
		Иначе
			СтруктураДокумента.Вставить("Kontr", стрКонтрагент);
		КонецЕсли;
		
		
		МассивДокументов.Добавить(СтруктураДокумента);
			
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовЗаданийНаИнвентаризацию(ДатаДок,ТорговаяПлощадка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Ссылка КАК Ссылка,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Наименование КАК Наименование,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Дата КАК Дата,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения
		 |ИЗ
		 |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		 |			&ТорговаяПлощадка,
		 |			Выполнена = ЛОЖЬ
		 |				И ПометкаУдаления = ЛОЖЬ
		 |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.Инвентаризация)) КАК ЗадачиПользователяЗадачиПоИсполнителю
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Ссылка,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Наименование,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Дата,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.СрокИсполнения
		 |ИЗ
		 |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		 |			&ТорговаяПлощадка,
		 |			Выполнена = ЛОЖЬ
		 |				И ПометкаУдаления = ЛОЖЬ
		 |				И ВидЗадачи = ЗНАЧЕНИЕ(Перечисление.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций)) КАК ЗадачиПользователяЗадачиПоИсполнителю
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	СрокИсполнения";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,DataF",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.Наименование),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		Формат(Выборка.СрокИсполнения,"ДФ=yyyyMMdd")));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовЗаданийНаВерификацию(ДатаДок,ПодразделениеСсылка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Ссылка,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Наименование,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Дата КАК Дата,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения
		 |ИЗ
		 |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		 |			&ТорговаяПлощадка,
		 |			Выполнена = ЛОЖЬ
		 |				И ПометкаУдаления = ЛОЖЬ И ВидЗадачи = Значение(Перечисление.ТК_ВидыЗадачТСД.ВерификацияЦенников)
		 |				) КАК ЗадачиПользователяЗадачиПоИсполнителю
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	СрокИсполнения";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ПодразделениеСсылка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,DataF",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.Наименование),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		Формат(Выборка.СрокИсполнения,"ДФ=yyyyMMdd")));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовЗаданийНаТБД(ДатаДок,ТорговаяПлощадка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Ссылка,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Наименование,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Дата КАК Дата,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения
		 |ИЗ
		 |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		 |			&ТорговаяПлощадка,
		 |			Выполнена = ЛОЖЬ
		 |				И ПометкаУдаления = ЛОЖЬ И ВидЗадачи = Значение(Перечисление.ТК_ВидыЗадачТСД.ТБД)
		 |				) КАК ЗадачиПользователяЗадачиПоИсполнителю
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	СрокИсполнения";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,DataF",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.Наименование),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		Формат(Выборка.СрокИсполнения,"ДФ=yyyyMMdd")));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьМассивДокументовЗаданийНаТНП(ДатаДок,ТорговаяПлощадка)
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	  Запрос = Новый Запрос;
		Запрос.Текст =
		 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Ссылка,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Наименование,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.Дата КАК Дата,
		 |	ЗадачиПользователяЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения
		 |ИЗ
		 |	Задача.ТК_ЗадачаТСД.ЗадачиПоИсполнителю(
		 |			&ТорговаяПлощадка,
		 |			Выполнена = ЛОЖЬ
		 |				И ПометкаУдаления = ЛОЖЬ И ВидЗадачи = Значение(Перечисление.ТК_ВидыЗадачТСД.ГрафикТНП)
		 |				) КАК ЗадачиПользователяЗадачиПоИсполнителю
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	СрокИсполнения";
	Запрос.Параметры.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет документов";
		Возврат Результат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		МассивДокументов.Добавить(Новый Структура("Data,NomDoc,DocUUID,DataF",
		Формат(Выборка.Дата,"ДФ=yyyyMMdd"),
		СокрЛП(Выборка.Наименование),
		Строка(Выборка.Ссылка.УникальныйИдентификатор()),
		Формат(Выборка.СрокИсполнения,"ДФ=yyyyMMdd")));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивДокументов;
	
	Возврат Результат;
	
	
КонецФункции





Функция ПолучитьСтруктуруДокументаПеремещениеТоваров(СсылкаТорговаяПлощадка, ГуидДокумента)
	
		
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);
	ДокументПоНомеру =  СтрДлина(ГуидДокумента)<= 10;
	Если ДокументПоНомеру Тогда //Поиск по номеру OS
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументОтгрузки,
		|	ТоварыКПоступлениюОстатки.ДокументПоступления.СкладКомпании КАК СкладОтгрузки,
		|	ТоварыКПоступлениюОстатки.ДокументПоступления.НомерRB КАК НомерДокумента
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки(, ДокументПоступления.СтатусRB = ЗНАЧЕНИЕ(перечисление.СтатусыВыгрузкиRB.ВыгрузкаНеТребуется)) КАК ТоварыКПоступлениюОстатки
		|ГДЕ
		|	ТоварыКПоступлениюОстатки.ДокументПоступления.НомерRB ПОДОБНО &НомерOS";
		
		Запрос.УстановитьПараметр("НомерOS", "%"+СокрЛП(ГуидДокумента));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Результат.Вставить("ОписаниеОшибки","Не найден документ по номеру "+ГуидДокумента);
			Возврат Результат;
		КонецЕсли;
		
		
		МассивДокументов = Новый Массив;
		//"ОснованиеUUID,СкладОтгрузки,НомерДокумента"
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("ОснованиеUUID",Строка(ВыборкаДетальныеЗаписи.ДокументОтгрузки.УникальныйИдентификатор()));	
			СтруктураСтроки.Вставить("СкладОтгрузки",Строка(ВыборкаДетальныеЗаписи.СкладОтгрузки));
			СтруктураСтроки.Вставить("НомерДокумента",СокрЛП(ВыборкаДетальныеЗаписи.НомерДокумента));	

			МассивДокументов.Добавить(СтруктураСтроки);
		КонецЦикла;
		Результат.Вставить("Результат", Истина);
		Результат.Вставить("Ответ", МассивДокументов);
		Возврат Результат;
		
		
	ИначеЕсли Лев(ГуидДокумента,2) ="OS" Тогда
		
		ДокументПоНомеру = Истина;
		Попытка
			ДокументСсылка =  Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрЗаменить(ГуидДокумента,"OS-","")));
		Исключение
			Результат.Вставить("ОписаниеОшибки","Отсканирован не корректный штриход");
			Возврат Результат;
			
		КонецПопытки;

	Иначе
		
		Попытка
			ДокументСсылка =  Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		Исключение
			Результат.Вставить("ОписаниеОшибки","Отсканирован не корректный штриход");
			Возврат Результат;
			
		КонецПопытки;
	КонецЕсли;
	

	Если НЕ ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Результат.Вставить("ОписаниеОшибки", "Документ не найден!");
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДокументСсылка.ХозОперация <> Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда 
		
		Результат.Вставить("ОписаниеОшибки", "Документ перемещения не является документом ""Перемещение товаров в Филиал""");
		Возврат Результат;

	КонецЕсли;
	
	Если ДокументПоНомеру = Ложь И  ДокументСсылка.ТорговаяПлощадкаПолучатель <>  СсылкаТорговаяПлощадка Тогда
		
		Результат.Вставить("ОписаниеОшибки", "Документ адресован подразделению <" + ДокументСсылка.ТорговаяПлощадкаПолучатель + ">. Вы не можете принять перемещение адресованное на другое подразделение!");
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПеремещениеТоваров.Ссылка КАК Ссылка,
	                      |	ПеремещениеТоваров.Проведен КАК Проведен
	                      |ИЗ
	                      |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                      |ГДЕ
	                      |	НЕ ПеремещениеТоваров.ПометкаУдаления
	                      |	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	                      |	И ПеремещениеТоваров.ДокументОтгрузки = &ДокументОтгрузки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПеремещениеТоваров.МоментВремени УБЫВ");
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументСсылка);
	РезЗапроса = Запрос.Выполнить();
	
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.Проведен Тогда
			
			Результат.Вставить("ОписаниеОшибки", "Данное перемещение уже проведено!");
			Возврат Результат;
			
		Иначе
			ПеремещениеПриход = Выборка.Ссылка;
		КонецЕсли;
		
	Иначе
		
		ПеремещениеОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ПеремещениеОбъект.Дата = ТекущаяДатаСеанса();
		ПеремещениеОбъект.ДокументОтгрузки = ДокументСсылка;
		ПеремещениеОбъект.Заполнить(ДокументСсылка); 
		ПеремещениеОбъект.ТорговаяПлощадкаПолучатель = СсылкаТорговаяПлощадка;
		
		//СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(СсылкаТорговаяПлощадка,"ОсновнойСкладПеремещения");
		//Если ЗначениеЗаполнено(СкладПолучатель) Тогда
		//	ПеремещениеОбъект.СкладКомпанииПолучатель  = СкладПолучатель
		//Иначе	
			ПеремещениеОбъект.СкладКомпанииПолучатель  = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(СсылкаТорговаяПлощадка);
		//КонецЕсли;

		ПеремещениеОбъект.Записать();
		
		ПеремещениеПриход = ПеремещениеОбъект.Ссылка;
		
	КонецЕсли;
	
	//Если ПолучитьФункциональнуюОпцию("КонтролерНеПроводитПеремещение") Тогда
	//	текСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокументСсылка);
	//	тОписаниеСтатуса ="";
	//	Если Не ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.Доставляется,тОписаниеСтатуса) Тогда
	//		Результат.Вставить("ОписаниеОшибки", тОписаниеСтатуса);
	//		Возврат Результат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	
	
	СтруктураДокумента = Новый Структура;
	МассивТоваров = Новый Массив;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Номенклатура) КАК Tovar,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Art,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
		|	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Kof,
		|	ПеремещениеТоваровТовары.КоличествоБазовое КАК Kol,
		|	ПеремещениеТоваровТовары.КоличествоБазовое КАК KolvoOsn,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		|	КОНЕЦ КАК МРЦ
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	
	кСтруктура = "Art,Tovar,EdIzm,Kof,Kol,KolvoOsn,МРЦ";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовары = Новый Структура(кСтруктура);
		ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
		МассивТоваров.Добавить(СтрокаТовары);						
		
	КонецЦикла;
	
	
	Если ДокументПоНомеру Тогда
		СтруктураДокумента.Вставить("ОснованиеUUID", Строка(ДокументСсылка.УникальныйИдентификатор()));
	КонецЕсли;
	
	
	СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(СсылкаТорговаяПлощадка,"ОсновнойСкладПеремещения");
	Если НЕ ЗначениеЗаполнено(СкладПолучатель) Тогда
		СкладПолучатель  = ПеремещениеПриход.СкладКомпанииПолучатель;
	КонецЕсли;


	СтруктураДокумента.Вставить("DocUUID",Строка(ПеремещениеПриход.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("Tovary", МассивТоваров);
	
	СтруктураДокумента.Вставить("Sklad", Строка(СкладПолучатель));
	СтруктураДокумента.Вставить("SkladUUID", Строка(СкладПолучатель.УникальныйИдентификатор()));
	
	СтруктураДокумента.Вставить("SkladSender", Строка(ДокументСсылка.СкладКомпании));
	СтруктураДокумента.Вставить("SkladSenderUUID", Строка(ДокументСсылка.СкладКомпании.УникальныйИдентификатор()));			
	
	
	Результат.Вставить("Результат", Истина);
	Результат.Вставить("Ответ", СтруктураДокумента);

	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаПеремещениеТоваровРекламация(СсылкаТорговаяПлощадка, ГуидДокумента)
	
		
	
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ДокументСсылка =  Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
	Исключение
		Результат.Вставить("ОписаниеОшибки","Отсканирован не корректный штриход");
		Возврат Результат;
		
	КонецПопытки;

	

	Если НЕ ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Результат.Вставить("ОписаниеОшибки", "Документ не найден!");
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДокументСсылка.ХозОперация <> Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда 
		
		Результат.Вставить("ОписаниеОшибки", "Документ перемещения не является документом ""Перемещение товаров в Филиал""");
		Возврат Результат;

	КонецЕсли;
	
	Если ДокументСсылка.ТорговаяПлощадкаПолучатель <>  СсылкаТорговаяПлощадка Тогда
		
		Результат.Вставить("ОписаниеОшибки", "Документ адресован подразделению <" + ДокументСсылка.ТорговаяПлощадкаПолучатель + ">. Вы не можете принять перемещение адресованное на другое подразделение!");
		Возврат Результат;
		
	КонецЕсли;
	
	текСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокументСсылка);
	//	тОписаниеСтатуса ="";
	//	Если Не ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.Доставляется,тОписаниеСтатуса) Тогда
	//		Результат.Вставить("ОписаниеОшибки", тОписаниеСтатуса);
	//		Возврат Результат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ОтправительРекламации",Строка(ДокументСсылка.ТорговаяПлощадка));
	МассивТоваров = Новый Массив;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Номенклатура) КАК Tovar,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Art,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
		|	ПеремещениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Kof,
		|	ПеремещениеТоваровТовары.КоличествоБазовое КАК Kol,
		|	ПеремещениеТоваровТовары.КоличествоБазовое КАК KolvoOsn,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		|	КОНЕЦ КАК МРЦ
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	
	кСтруктура = "Art,Tovar,EdIzm,Kof,Kol,KolvoOsn,МРЦ";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовары = Новый Структура(кСтруктура);
		ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
		МассивТоваров.Добавить(СтрокаТовары);						
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Tovary", МассивТоваров);

	Результат.Вставить("Результат", Истина);
	Результат.Вставить("Ответ", СтруктураДокумента);

	
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСтруктуруДокументаИнвентаризация(Подразделение,ГуидДокумента)
		
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	
	Попытка
		ДокументСсылка =  Документы.Инвентаризация.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИнвентаризацияТовары.Номенклатура) КАК НоменклатураПредставление,
		|	ИнвентаризацияТовары.Номенклатура.Артикул КАК Артикул,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИнвентаризацияТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ИнвентаризацияТовары.Коэффициент КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ИнвентаризацияТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		|	КОНЕЦ КАК МРЦ,
		|	ИнвентаризацияТовары.КоличествоФакт КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
		|		ПО ИнвентаризацияТовары.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		|			И ИнвентаризацияТовары.ХарактеристикаНоменклатуры = ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
		|ГДЕ
		|	ИнвентаризацияТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		Запрос.УстановитьПараметр("СкладКомпании",ДокументСсылка.СкладКомпании);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СтруктураДокумента = Новый Структура;
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			
			СтрокаТовары = Новый Структура("Art,Tovar,EdIzm,Kof,Kol,МРЦ,Остаток"
			,СокрЛП(ВыборкаДетальныеЗаписи.Артикул),ВыборкаДетальныеЗаписи.НоменклатураПредставление,ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияПредставление,ВыборкаДетальныеЗаписи.Коэффициент,ВыборкаДетальныеЗаписи.Количество,ВыборкаДетальныеЗаписи.МРЦ,ВыборкаДетальныеЗаписи.Остаток);
			МассивТоваров.Добавить(СтрокаТовары);
			
			
		КонецЦикла;
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаЗаказПоставщику(Подразделение,ГуидДокумента)
		
	Результат = СтруктураВозврата();
	УстановитьПривилегированныйРежим(Истина);

	
	Попытка
		ДокументСсылка =  Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказПоставщикуТовары.Номенклатура) КАК НоменклатураПредставление,
		|	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказПоставщикуТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЗаказПоставщикуТовары.Коэффициент КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		|	КОНЕЦ КАК МРЦ,
		|	ЗаказПоставщикуТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СтруктураДокумента = Новый Структура;
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			
			СтрокаТовары = Новый Структура("Art,Tovar,EdIzm,Kof,Kol,МРЦ",СокрЛП(ВыборкаДетальныеЗаписи.Артикул),ВыборкаДетальныеЗаписи.НоменклатураПредставление,ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияПредставление,ВыборкаДетальныеЗаписи.Коэффициент,ВыборкаДетальныеЗаписи.Количество,ВыборкаДетальныеЗаписи.МРЦ);
			МассивТоваров.Добавить(СтрокаТовары);
			
			
		КонецЦикла;
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции



Функция НайтиЗаказыДляПриема(UUID,СтрокаПоиска,Запрос)Экспорт
	
	
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивОтвет = Новый Массив;
	Результат.Результат	= Истина;

	Рез = ОбработатьПоискЗаказа(ПодразделениеСсылка,СтрокаПоиска,"ШтрихКод",МассивОтвет);
	Если НЕ Рез Тогда
		Рез = ОбработатьПоискЗаказа(ПодразделениеСсылка,СтрокаПоиска,"Артикул",МассивОтвет);
	КонецЕсли;
	
	Если НЕ Рез Тогда
		Рез = ОбработатьПоискЗаказа(ПодразделениеСсылка,СтрокаПоиска,"",МассивОтвет);
	КонецЕсли;
	
	
	Если МассивОтвет.Количество() = 0 Тогда
		Результат.Результат	= Ложь;
		Результат.ОписаниеОшибки = "Нет заказов по поиску "+СтрокаПоиска;		
	КонецЕсли;
	
	Результат.Ответ = МассивОтвет;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиПриходыДляПриема(UUID,СтрокаПоиска,Запрос)Экспорт
	
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивОтвет = Новый Массив;
	Результат.Результат	= Истина;

	Рез = ОбработатьПоискПрихода(ТорговаяПлощадкаСсылка,СтрокаПоиска,"ШтрихКод",МассивОтвет);
	Если НЕ Рез Тогда
		Рез = ОбработатьПоискПрихода(ТорговаяПлощадкаСсылка,СтрокаПоиска,"Артикул",МассивОтвет);
	КонецЕсли;
	
	Если НЕ Рез Тогда
		Рез = ОбработатьПоискПрихода(ТорговаяПлощадкаСсылка,СтрокаПоиска,"",МассивОтвет);
	КонецЕсли;
	
	
	Если МассивОтвет.Количество() = 0 Тогда
		Результат.Результат	= Ложь;
		Результат.ОписаниеОшибки = "Нет приходов по поиску "+СтрокаПоиска;		
	КонецЕсли;
	
	Результат.Ответ = МассивОтвет;
	
	Возврат Результат;
	
КонецФункции


Функция ОбработатьПоискЗаказа(ТорговаяПлощадкаСсылка,СтрокаПоиска,ТипПоиска,МассивОтвет)
	ВсеОк = Ложь;
	
	Если ТипПоиска = "ШтрихКод" Тогда
		Результат = ОбработатьСтрокуПоискаТовараV2(СтрокаПоиска);
		Если НЕ Результат.Пустой() Тогда
			ВсеОк = Истина;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПолучитьМассивЗаказовПоТовару(ТорговаяПлощадкаСсылка,Выборка.Номенклатура,МассивОтвет)
		КонецЕсли;
	ИначеЕсли ТипПоиска = "Артикул" Тогда

		Результат = ДанныеТовара(СтрокаПоиска,"Артикул",Истина);
		Если НЕ Результат.Пустой() Тогда
			ВсеОк = Истина;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПолучитьМассивЗаказовПоТовару(ТорговаяПлощадкаСсылка,Выборка.Номенклатура,МассивОтвет)
		КонецЕсли;
	Иначе
		
		ПолучитьМассивЗаказовПоНомеру(ТорговаяПлощадкаСсылка,СтрокаПоиска,МассивОтвет)

	КонецЕсли;

	
	Возврат ВсеОк;
	
КонецФункции

Функция ОбработатьПоискПрихода(ТорговаяПлощадкаСсылка,СтрокаПоиска,ТипПоиска,МассивОтвет)
	ВсеОк = Ложь;
	
	Если ТипПоиска = "ШтрихКод" Тогда
		Результат = ОбработатьСтрокуПоискаТовараV2(СтрокаПоиска);
		Если НЕ Результат.Пустой() Тогда
			ВсеОк = Истина;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПолучитьМассивПриходовПоТовару(ТорговаяПлощадкаСсылка,Выборка.Номенклатура,МассивОтвет)
		КонецЕсли;
	ИначеЕсли ТипПоиска = "Артикул" Тогда

		Результат = ДанныеТовара(СтрокаПоиска,"Артикул",Истина);
		Если НЕ Результат.Пустой() Тогда
			ВсеОк = Истина;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПолучитьМассивПриходовПоТовару(ТорговаяПлощадкаСсылка,Выборка.Номенклатура,МассивОтвет)
		КонецЕсли;
	КонецЕсли;

	
	Возврат ВсеОк;
	
КонецФункции


Процедура ПолучитьМассивЗаказовПоТовару(ТорговаяПлощадкаСсылка,Номенклатура,МассивОтвет)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Док
	     |ПОМЕСТИТЬ Заказы
	     |ИЗ
	     |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	     |			,
	     |			Номенклатура = &Номенклатура
	     |				И ТорговаяПлощадка = &ТорговаяПлощадка) КАК ЗаказыПоставщикамОстатки
	     |ГДЕ
	     |	ЗаказыПоставщикамОстатки.ЗаказаноОстаток > 0
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |ВЫБРАТЬ
	     |	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	     |	СУММА(ЗаказПоставщикуТовары.Сумма) КАК Сумма
	     |ПОМЕСТИТЬ СуммаЗаказа
	     |ИЗ
	     |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	     |ГДЕ
	     |	ЗаказПоставщикуТовары.Ссылка В
	     |			(ВЫБРАТЬ
	     |				Заказы.Док КАК Док
	     |			ИЗ
	     |				Заказы КАК Заказы)
	     |	И ЗаказПоставщикуТовары.СкладКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
	     |
	     |СГРУППИРОВАТЬ ПО
	     |	ЗаказПоставщикуТовары.Ссылка
	     |;
	     |
	     |////////////////////////////////////////////////////////////////////////////////
	     |ВЫБРАТЬ
	     |	Заказы.Док КАК Док,
	     |	Заказы.Док.Контрагент КАК Поставщик,
	     |	Заказы.Док.Номер КАК Номер,
	     |	Заказы.Док.СрокПоставки КАК ДатаПоставки,
	     |	ЕСТЬNULL(СуммаЗаказа.Сумма, 0) КАК Сумма
	     |ИЗ
	     |	Заказы КАК Заказы
	     |		ЛЕВОЕ СОЕДИНЕНИЕ СуммаЗаказа КАК СуммаЗаказа
	     |		ПО Заказы.Док = СуммаЗаказа.Ссылка" ;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадкаСсылка);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтруктураДокумент = Новый Структура("Поставщик,Док_ID,Номер,ДатаПоставки,Сумма"
		,Строка(Выборка.Поставщик),Строка(Выборка.Док.УникальныйИдентификатор()),Выборка.Номер,Выборка.ДатаПоставки,Выборка.Сумма);
		МассивОтвет.Добавить(СтруктураДокумент);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьМассивЗаказовПоНомеру(ПодразделениеСсылка,НомерЗаказа,МассивОтвет)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	ЗаказыПоставщикамОстатки.Контрагент КАК Поставщик,
	     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК Док,
	     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Номер КАК Номер,
	     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.СрокПоставки КАК ДатаПоставки,
	     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.СуммаДокумента КАК Сумма
	     |ИЗ
	     |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	     |			,
	     |			ЗаказПоставщику.Номер = &Номер
	     |				И ТорговаяПлощадка = &Подразделение) КАК ЗаказыПоставщикамОстатки" ;
	Запрос.УстановитьПараметр("Номер",НомерЗаказа);
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеСсылка);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтруктураДокумент = Новый Структура("Поставщик,Док_ID,Номер,ДатаПоставки,Сумма"
		,Строка(Выборка.Поставщик),Строка(Выборка.Док.УникальныйИдентификатор()),Выборка.Номер,Выборка.ДатаПоставки,Выборка.Сумма);
		МассивОтвет.Добавить(СтруктураДокумент);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьМассивПриходовПоТовару(ТорговаяПлощадкаСсылка,Номенклатура,МассивОтвет)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	ПоступлениеТоваровТовары.Ссылка КАК Док,
	     |	ПоступлениеТоваровТовары.Ссылка.Контрагент КАК Поставщик,
	     |	ПоступлениеТоваровТовары.Ссылка.ВхДокНомер КАК Номер,
	     |	ПоступлениеТоваровТовары.Ссылка.ВхДокДата КАК ДатаПоставки,
	     |	ПоступлениеТоваровТовары.Ссылка.СуммаДокумента КАК Сумма
	     |ИЗ
	     |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	     |ГДЕ
	     |	ПоступлениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	     |	И ПоступлениеТоваровТовары.Ссылка.Проведен = ЛОЖЬ
	     |	И ПоступлениеТоваровТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	     |	И ПоступлениеТоваровТовары.Номенклатура = &Номенклатура
	     |	И ПоступлениеТоваровТовары.Ссылка.ТорговаяПлощадка = &ТорговаяПлощадка" ;
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДатаСеанса())-60*60*24*7);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадкаСсылка);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтруктураДокумент = Новый Структура("Поставщик,Док_ID,Номер,ДатаПоставки,Сумма"
		,Строка(Выборка.Поставщик),Строка(Выборка.Док.УникальныйИдентификатор()),Выборка.Номер,Выборка.ДатаПоставки,Выборка.Сумма);
		МассивОтвет.Добавить(СтруктураДокумент);
	КонецЦикла;
	
КонецПроцедуры



Функция ПолучитьДокумент(UUID,ТипДокумента,ГуидДокумента) Экспорт
		
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	

	Если ТипДокумента = "ZAK" Тогда
		Возврат ПолучитьСтруктуруДокументаЗаказПоставщику(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "IN" ИЛИ ТипДокумента = "Инвентаризация" Тогда
		Возврат ПолучитьСтруктуруДокументаИнвентаризация(ПодразделениеСсылка,ГуидДокумента);
//	ИначеЕсли ТипДокумента = "PRIX" Тогда	
	//	Возврат ПолучитьСтруктуруДокументаПредварительногоПоступления(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
		Возврат ПолучитьСтруктуруДокументаПеремещениеТоваров(ПодразделениеСсылка, ГуидДокумента);
	ИначеЕсли ТипДокумента = "Заказ" Тогда
		Возврат ПолучитьСтруктуруДокументаПриемПоЗаказПоставщику(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "PRIX" ИЛИ ТипДокумента = "Поступление" Тогда
		Возврат ПолучитьСтруктуруДокументаПриемПоступлениеТоваров(ГуидДокумента);
	
	ИначеЕсли ТипДокумента = "Задание" ИЛИ ТипДокумента = "ЗаданиеИН" Тогда
		Возврат ПолучитьСтруктуруДокументаЗадание(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "ЗаданиеТБД" Тогда 
		Возврат ПолучитьСтруктуруДокументаЗаданиеТБД(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли Лев(ТипДокумента,3) = "ТБД" Тогда
		Возврат ПоулчитьСтруктуруДокументаТБД(ПодразделениеСсылка,ТипДокумента);
	ИначеЕсли ТипДокумента = "ЗаданиеТНП" Тогда 
		Возврат ПолучитьСтруктуруДокументаЗаданиеТНП(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "REZ" Тогда
		Возврат ПоулчитьСтруктуруДокументаРезервТовара(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "nchEmployee" Тогда
		Возврат ПоулчитьСтруктуруДокументаНачисления(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "vypEmployee" Тогда
		Возврат ПоулчитьСтруктуруДокументаВыплат(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "Proverki" Тогда
		Возврат ПоулчитьСтруктуруДокументаПроверки(ПодразделениеСсылка,ГуидДокумента);

	ИначеЕсли ТипДокумента = "ЗаданиеВФ" Тогда
		Возврат ПолучитьСтруктуруДокументаЗаданиеВФ(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "MAR" Тогда	
		Возврат ПолучитьСтруктуруДокументаМаршрутныйЛист(ПодразделениеСсылка,ГуидДокумента);
	ИначеЕсли ТипДокумента = "RECLAM" Тогда	
		Возврат ПолучитьСтруктуруДокументаПеремещениеТоваровРекламация(ПодразделениеСсылка,ГуидДокумента);
	Иначе
		Возврат Результат;		
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьСтруктуруДокументаПриемПоЗаказПоставщику(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат =  СтруктураВозврата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Попытка
		ДокументСсылка =  Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Sklad",Строка(ДокументСсылка.СкладКомпании));
		СтруктураДокумента.Вставить("SkladUUID",Строка(ДокументСсылка.СкладКомпании.УникальныйИдентификатор()));
		SkladOn = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадкаСсылка,"ВыбиратьСкладПриемТоваров",Ложь);
		СтруктураДокумента.Вставить("SkladOn",SkladOn);

	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПредварительноеПоступлениеТоваров.Ссылка КАК Ссылка,
		|	ПредварительноеПоступлениеТоваров.ВхДокНомер КАК ВхДокНомер,
		|	ПредварительноеПоступлениеТоваров.ВхДокДата КАК ВхДокДата,
		|	ПредварительноеПоступлениеТоваров.Проведен КАК Проведен,
		|	ПредварительноеПоступлениеТоваров.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПредварительноеПоступлениеТоваров
		|ГДЕ
		|	ПредварительноеПоступлениеТоваров.ДокументОснование = &ЗаказСсылка
		|	И ПредварительноеПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
		|	И ПредварительноеПоступлениеТоваров.ТорговаяПлощадка = &ТорговаяПлощадкаСсылка";
		
		Запрос.УстановитьПараметр("ЗаказСсылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ТорговаяПлощадкаСсылка", ТорговаяПлощадкаСсылка);
	
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			ДокументПоступления = ВыборкаДетальныеЗаписи.Ссылка;
			
			Если ВыборкаДетальныеЗаписи.Проведен Тогда
				Результат.ОписаниеОшибки = "По выбранному заказу уже проведен документ поступление!"+Символы.ПС+"Прием не возможен."; 
				Возврат Результат;
			Иначе
				СтруктураДокумента.Вставить("ВхДокНомер", ВыборкаДетальныеЗаписи.ВхДокНомер);
				СтруктураДокумента.Вставить("ВхДокДата",Формат(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВхДокДата),ВыборкаДетальныеЗаписи.ВхДокДата,ТекущаяДата()),"ДФ=yyyyMMdd"));
				СтруктураДокумента.Вставить("ПриходUUID",Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
				СтруктураДокумента.Вставить("Sklad",Строка(ВыборкаДетальныеЗаписи.СкладКомпании));
				СтруктураДокумента.Вставить("SkladUUID",Строка(ВыборкаДетальныеЗаписи.СкладКомпании.УникальныйИдентификатор()));
				СтруктураДокумента.Вставить("ИспХар",НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ВыборкаДетальныеЗаписи.СкладКомпании));
				

			КонецЕсли;
		Иначе
			ДокументПоступления = Документы.ПоступлениеТоваров.ПустаяСсылка();
			
		КонецЕсли;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
		               	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.Номенклатура) КАК НаименованиеТовара,
		               	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК НаименованиеЕдиницы,
		               	|	ЕСТЬNULL(ВложенныйЗапрос.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		               	|	ВложенныйЗапрос.Количество КАК Количество,
		               	|	ВложенныйЗапрос.КоличествоПоставщика КАК КоличествоПоставщика,
		               	|	ВложенныйЗапрос.КоличествоПоставщика КАК КоличествоПодтверждено,
		               	|	ВложенныйЗапрос.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ
		               	|ИЗ
		               	|	(ВЫБРАТЬ
		               	|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		               	|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		               	|		СУММА(ВложенныйЗапрос.КоличествоПоставщика) КАК КоличествоПоставщика
		               	|	ИЗ
		               	|		(ВЫБРАТЬ
		               	|			ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		               	|			ЗаказПоставщикуТовары.КоличествоБазовое КАК Количество,
		               	|			0 КАК КоличествоПоставщика
		               	|		ИЗ
		               	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		               	|		ГДЕ
		               	|			ЗаказПоставщикуТовары.Ссылка = &ЗаказСсылка
		               	|			И НЕ ЗаказПоставщикуТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               	|			И ЗаказПоставщикуТовары.СкладКомпании В(&мСкладКомпании)
		               	|		
		               	|		СГРУППИРОВАТЬ ПО
		               	|			ЗаказПоставщикуТовары.КоличествоБазовое,
		               	|			ЗаказПоставщикуТовары.Номенклатура
		               	|		
		               	|		ОБЪЕДИНИТЬ ВСЕ
		               	|		
		               	|		ВЫБРАТЬ
		               	|			ПредварительноеПоступлениеТоваровТовары.Номенклатура,
		               	|			0,
		               	|			ПредварительноеПоступлениеТоваровТовары.КоличествоБазовое
		               	|		ИЗ
		               	|			Документ.ПоступлениеТоваров.Товары КАК ПредварительноеПоступлениеТоваровТовары
		               	|		ГДЕ
		               	|			НЕ ПредварительноеПоступлениеТоваровТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               	|			И ПредварительноеПоступлениеТоваровТовары.Ссылка = &ДокументПоступления) КАК ВложенныйЗапрос
		               	|	
		               	|	СГРУППИРОВАТЬ ПО
		               	|		ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос";	
		
		Запрос.УстановитьПараметр("ЗаказСсылка",ДокументСсылка);
		Запрос.УстановитьПараметр("ДокументПоступления",ДокументПоступления);
		Запрос.УстановитьПараметр("мСкладКомпании",Справочники.СкладыКомпании.МассивСкладовТорговойПлощадки(ТорговаяПлощадкаСсылка));


		РезультатЗапроса = Запрос.Выполнить();
		СтруктураСтрока = "Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоПоставщика,КоличествоПодтверждено,ИспМРЦ";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		
		МассивТоваров = Новый Массив;

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ИспМРЦ Тогда
				
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","В документе используется МРЦ"+Символы.ПС+"Используйте ""ПРИЕМ ПО ПРИХОДУ""" );
				Возврат Результат;
			КонецЕсли;
			
			
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		
		
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

 Функция ПолучитьСтруктуруДокументаПриемПоступлениеТоваров(ГуидДокумента)
		
	Результат =  СтруктураВозврата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	Попытка
		ДокументСсылка =  Документы.ПоступлениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		Если ДокументСсылка.Проведен Тогда
			Результат.ОписаниеОшибки = "Выбранный приход уже проведен!"+Символы.ПС+"Прием не возможен."; 
			Возврат Результат;
			
		ИначеЕсли ДокументСсылка.ПометкаУдаления Тогда
			Результат.ОписаниеОшибки = "Выбранный приход помечен на удаление!"+Символы.ПС+"Прием не возможен."; 
			Возврат Результат;
			
		КонецЕсли;
		
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Sklad",Строка(ДокументСсылка.СкладКомпании));
		СтруктураДокумента.Вставить("SkladUUID",Строка(ДокументСсылка.СкладКомпании.УникальныйИдентификатор()));
		Если ЗначениеЗаполнено(ДокументСсылка.ВхДокНомер) Тогда
			СтруктураДокумента.Вставить("ВхДокНомер", ДокументСсылка.ВхДокНомер);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументСсылка.ВхДокДата) Тогда
			СтруктураДокумента.Вставить("ВхДокДата",Формат(ДокументСсылка.ВхДокДата,"ДФ=yyyyMMdd"));
		КонецЕсли;
		СтруктураДокумента.Вставить("ПриходUUID",ГуидДокумента);
		СтруктураДокумента.Вставить("ИспХар",НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокументСсылка.СкладКомпании));
			
		Запрос = Новый Запрос;
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	ПоступлениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
		               	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваровТовары.Номенклатура) КАК НаименованиеТовара,
		               	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваровТовары.ЕдиницаИзмерения) КАК НаименованиеЕдиницы,
		               	|	ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		               	|	ПоступлениеТоваровТовары.КоличествоБазовое КАК Количество,
		               	|	ПоступлениеТоваровТовары.КоличествоБазовое КАК КоличествоПоставщика,
		               	|	0 КАК КоличествоПодтверждено,
		               	|	ВЫБОР
		               	|		КОГДА ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		               	|			ТОГДА """"
		               	|		ИНАЧЕ ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		               	|	КОНЕЦ КАК МРЦ,
		               	|	ПоступлениеТоваровТовары.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ
		               	|ИЗ
		               	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		               	|ГДЕ
		               	|	ПоступлениеТоваровТовары.Ссылка = &ДокументПоступления";	
		
		Запрос.УстановитьПараметр("ДокументПоступления",ДокументСсылка);

		РезультатЗапроса = Запрос.Выполнить();
		СтруктураСтрока = "Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоПоставщика,КоличествоПодтверждено,МРЦ,ИспМРЦ";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		
		МассивТоваров = Новый Массив;

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		
		
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаЗадание(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Задача =  Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		Если Задача.Выполнена Тогда 
			Результат.Вставить("ОписаниеОшибки","Задача уже выполнена");
			Возврат Результат;
		КонецЕсли;
		
		Если  Задача.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ПоказанияЭлектроСчетчиков Тогда
			СформироватьДанныеПосчетчикам(Задача.ТорговаяПлощадка,Результат);
			Возврат Результат;
		КонецЕсли;
		
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("СкладUUID",Строка(Задача.Склад.УникальныйИдентификатор()));
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("СкладКомпании",Задача.Склад);

		
		
		Если Задача.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.Инвентаризация
			ИЛИ Задача.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций Тогда
		
			
			ТекстЗапроса = "ВЫБРАТЬ
			|	спрНоменклатура.Ссылка КАК Номенклатура
			|ПОМЕСТИТЬ ВТ_товары
			|ИЗ
			|	Справочник.Номенклатура КАК спрНоменклатура
			|ГДЕ
			|	спрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппаТоваров)
			|	И спрНоменклатура.ЭтоГруппа = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_товары.Номенклатура КАК Номенклатура,
			|	ВТ_товары.Номенклатура.Артикул КАК Art,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_товары.Номенклатура) КАК Tovar,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_товары.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
			|	1 КАК Kof,
			|	0 КАК Kol,
			|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВЫБОР
			|		КОГДА ВТ_товары.Номенклатура.ИспользованиеХарактеристик
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспМРЦ,
			|	ВЫБОР
			|		КОГДА ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА """"
			|		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ
			|	КОНЕЦ КАК МРЦ,
			|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Остаток
			|ИЗ
			|	ВТ_товары КАК ВТ_товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
			|		ПО ВТ_товары.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			
			Если ЗначениеЗаполнено(Задача.ГруппаНоменклатуры) Тогда
				Запрос.УстановитьПараметр("ГруппаТоваров", Задача.ГруппаНоменклатуры);
			Иначе
				Если Задача.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций Тогда
					МассивТоваров = Задачи.ТК_ЗадачаТСД.ПолучитьТоварыПоЗадаче(Задача);
				Иначе
					МассивТоваров = Справочники.ТК_ГрафикиТСД.ПолучитьМассивТоваров(Задача.Основание);
				КонецЕсли;
				Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"спрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппаТоваров)","спрНоменклатура.Ссылка В(&МассивТоваров)");

			КонецЕсли;

			Запрос.Текст = ТекстЗапроса;
		//ИначеЕсли Задача.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ГрафикИнвентаризаций Тогда
		//	//Графики инвентаризаций		
		//	//Настройки = РеквизитыОбъекта.ХранилищеОтборов.Получить();
		//	//
		//	//СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");
		//	//
		//	//
		//	
			
			
		Иначе
			
			Заявка = Задача.Основание;
			ТипДокЗаявки = ТипЗнч(Заявка);
			Запрос.УстановитьПараметр("Ссылка", Задача);
			ТипДок = Заявка.Метаданные().Имя;
			Запрос.УстановитьПараметр("Заявка",Задача.Основание);
			
			Запрос.Текст =	"ВЫБРАТЬ
			|	тчТовары.Номенклатура,
			|	тчТовары.Номенклатура.Артикул КАК Art,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(тчТовары.Номенклатура) КАК Tovar,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(тчТовары.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
			|	1 КАК Kof,
			|	тчТовары.Количество * тчТовары.Коэффициент КАК Kol,
			|	ВЫБОР
			|		КОГДА тчТовары.Номенклатура.ИспользованиеХарактеристик
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспМРЦ,
			|	ВЫБОР
			|		КОГДА тчТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА """"
			|		ИНАЧЕ тчТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
			|	КОНЕЦ КАК МРЦ,
			|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Остаток
			|ИЗ
			|	Документ."+ТипДок+".Товары КАК тчТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
			|		ПО тчТовары.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
			|			И тчТовары.ХарактеристикаНоменклатуры = ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
			|ГДЕ
			|	тчТовары.Ссылка =&Заявка ";
			
			
		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить();
		СтруктураСтрока = "Art,Tovar,EdIzm,Kof,Kol,МРЦ,ИспМРЦ,Остаток";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		//Если МассивТоваров.Количество() = 0 Тогда
		//	
		//	Результат.Вставить("ОписаниеОшибки","Таблица товаров пустая!");

		//Иначе
			СтруктураДокумента.Вставить("Tovary",МассивТоваров);
			Результат.Вставить("Результат",Истина);
			Результат.Вставить("Ответ",СтруктураДокумента);
		//КонецЕсли;
		
		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаЗаданиеТБД(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Задача =  Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача,"Выполнена,Склад,Основание");
		
		Если РеквизитыЗадачи.Выполнена Тогда 
			Результат.Вставить("ОписаниеОшибки","Задача уже выполнена");
			Возврат Результат;
		КонецЕсли;
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("UUID_Склад",Строка(РеквизитыЗадачи.Склад.УникальныйИдентификатор()));
		ДатаТБД = РегистрыСведений.ТК_ТБД_Периоды.ПериодТБД(ТорговаяПлощадкаСсылка);
		МассивТоваров = Справочники.ТК_ГрафикиТСД.ПолучитьМассивТоваров(РеквизитыЗадачи.Основание);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадкаСсылка);
		Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
		Запрос.УстановитьПараметр("ДатаТБД", ДатаТБД);
		Запрос.УстановитьПараметр("СкладКомпании", РеквизитыЗадачи.Склад);
		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТК_ТБД.Номенклатура КАК Номенклатура,
		               |	ТК_ТБД.Количество КАК Количество
		               |ПОМЕСТИТЬ ТБД_Объекта
		               |ИЗ
		               |	РегистрСведений.ТК_ТБД КАК ТК_ТБД
		               |ГДЕ
		               |	ТК_ТБД.Дата = &ДатаТБД
		               |	И ТК_ТБД.ТорговаяПлощадка = &ТорговаяПлощадка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТБД_Объекта.Номенклатура.Артикул КАК Art,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТБД_Объекта.Номенклатура) КАК Tovar,
		               |	ТБД_Объекта.Количество КАК Kol,
		               |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Остаток,
		               |	1 КАК Kof,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТБД_Объекта.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
		               |	ТБД_Объекта.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ,
		               |	ВЫБОР
		               |		КОГДА ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		               |			ТОГДА """"
		               |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ
		               |	КОНЕЦ КАК МРЦ
		               |ИЗ
		               |	ТБД_Объекта КАК ТБД_Объекта
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
		               |		ПО ТБД_Объекта.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		               |ГДЕ
		               |	ТБД_Объекта.Номенклатура В(&МассивТоваров)";
		
		РезультатЗапроса = Запрос.Выполнить();
		СтруктураСтрока = "Art,Tovar,EdIzm,Kof,Kol,Остаток,МРЦ,ИспМРЦ";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		//Если МассивТоваров.Количество() = 0 Тогда
		//	
		//	Результат.Вставить("ОписаниеОшибки","Таблица товаров пустая!");
		
		//Иначе
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		//КонецЕсли;
		
		//		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаЗаданиеТНП(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Задача =  Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача,"Выполнена,Склад,Основание,ГруппаНоменклатуры");
		
		Если РеквизитыЗадачи.Выполнена Тогда 
			Результат.Вставить("ОписаниеОшибки","Задача уже выполнена");
			Возврат Результат;
		КонецЕсли;
		СкладТНП = Справочники.СкладыКомпании.ТНПСкладТорговойПлощадки(ТорговаяПлощадкаСсылка);
		Если СкладТНП.Пустая() Тогда
			Результат.Вставить("ОписаниеОшибки","Нет склада ТНП");
			Возврат Результат;
		КонецЕсли;
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("UUID_СкладОтправитель",Строка(РеквизитыЗадачи.Склад.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("UUID_Склад",Строка(СкладТНП.УникальныйИдентификатор()));

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СкладКомпании",РеквизитыЗадачи.Склад);
		Запрос.УстановитьПараметр("Задание", Задача);
		Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);

		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТК_ТНП_ИтогиСканирования.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ втНоменклатура
		               |ИЗ
		               |	РегистрСведений.ТК_ТНП_ИтогиСканирования КАК ТК_ТНП_ИтогиСканирования
		               |ГДЕ
		               |	ТК_ТНП_ИтогиСканирования.Задание = &Задание
		               |	И ТК_ТНП_ИтогиСканирования.ТорговаяПлощадка = &ТорговаяПлощадка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		               |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ВТ_Остаток
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		               |			,
		               |			СкладКомпании = &СкладКомпании
		               |				И Номенклатура В
		               |					(ВЫБРАТЬ
		               |						втНоменклатура.Номенклатура КАК Номенклатура
		               |					ИЗ
		               |						втНоменклатура КАК втНоменклатура)) КАК ОстаткиТоваровКомпанииОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втНоменклатура.Номенклатура.Артикул КАК Art,
		               |	втНоменклатура.Номенклатура КАК Номенклатура,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(втНоменклатура.Номенклатура) КАК Tovar,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(втНоменклатура.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
		               |	1 КАК Kof,
		               |	0 КАК Kol,
		               |	ЕСТЬNULL(ВТ_Остаток.КоличествоОстаток, 0) КАК Остаток
		               |ИЗ
		               |	втНоменклатура КАК втНоменклатура
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остаток КАК ВТ_Остаток
		               |		ПО втНоменклатура.Номенклатура = ВТ_Остаток.Номенклатура";
		//
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			ЗадачаОбъект.Выполнена = Истина;
			ЗадачаОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
			ЗадачаОбъект.Записать();
			
			Результат.Вставить("ОписаниеОшибки","Нет товаров на остатке, задача закрыта");

			Возврат Результат;	
		КонецЕсли;
		
		СтруктураСтрока = "Art,Tovar,EdIzm,Kof,Kol,Остаток";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		
		
		
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
		//		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаЗаданиеВФ(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Задача =  Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		
		РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача,"Выполнена,Склад,Основание,ГруппаНоменклатуры");
		
		Если РеквизитыЗадачи.Выполнена Тогда 
			Результат.Вставить("ОписаниеОшибки","Задача уже выполнена");
			Возврат Результат;
		КонецЕсли;
	
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("UUID_Склад",Строка(РеквизитыЗадачи.Склад.УникальныйИдентификатор()));

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СкладКомпании",РеквизитыЗадачи.Склад);
		Запрос.УстановитьПараметр("НоменклатураГруппа", РеквизитыЗадачи.ГруппаНоменклатуры);
		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	спрНоменклатура.Ссылка КАК Номенклатура
		               |ПОМЕСТИТЬ втНоменклатура
		               |ИЗ
		               |	Справочник.Номенклатура КАК спрНоменклатура
		               |ГДЕ
		               |	спрНоменклатура.Ссылка В ИЕРАРХИИ(&НоменклатураГруппа)
		               |	И НЕ спрНоменклатура.ЭтоГруппа
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		               |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ПОМЕСТИТЬ ВТ_Остаток
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		               |			,
		               |			СкладКомпании = &СкладКомпании
		               |				И Номенклатура В
		               |					(ВЫБРАТЬ
		               |						втНоменклатура.Номенклатура КАК Номенклатура
		               |					ИЗ
		               |						втНоменклатура КАК втНоменклатура)) КАК ОстаткиТоваровКомпанииОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втНоменклатура.Номенклатура.Артикул КАК Art,
		               |	втНоменклатура.Номенклатура КАК Номенклатура,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(втНоменклатура.Номенклатура) КАК Tovar,
		               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(втНоменклатура.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
		               |	1 КАК Kof,
		               |	0 КАК Kol,
		               |	ЕСТЬNULL(ВТ_Остаток.КоличествоОстаток, 0) КАК Остаток
		               |ИЗ
		               |	втНоменклатура КАК втНоменклатура
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остаток КАК ВТ_Остаток
		               |		ПО втНоменклатура.Номенклатура = ВТ_Остаток.Номенклатура";
		//
		РезультатЗапроса = Запрос.Выполнить();
		СтруктураСтрока = "Art,Tovar,EdIzm,Kof,Kol,Остаток";
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		МассивТоваров = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТовары = Новый Структура(СтруктураСтрока);
			ЗаполнитьЗначенияСвойств(СтрокаТовары,ВыборкаДетальныеЗаписи);
			МассивТоваров.Добавить(СтрокаТовары);
			
		КонецЦикла;
		СтруктураДокумента.Вставить("Tovary",МассивТоваров);
		Результат.Вставить("Результат",Истина);
		Результат.Вставить("Ответ",СтруктураДокумента);
		
		//		
	Исключение
		Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруДокументаМаршрутныйЛист(ТорговаяПлощадкаСсылка,ГуидДокумента)
		
	Результат =  СтруктураВозврата();

 	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ДокументСсылка =  Документы.ТК_ТТН.ПолучитьСсылку(Новый УникальныйИдентификатор(ГуидДокумента));
		Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
			ВызватьИсключение "Документ не знайдено";
		КонецЕсли;
	Исключение
		Результат.Вставить("Результат",Ложь);
		Результат.Вставить("ОписаниеОшибки","Документ не знайдено");
		Возврат Результат;

	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ТТН.Номер КАК Номер,
		|	ТК_ТТН.Дата КАК Дата,
		|	ТК_ТТН.Автомобиль КАК Автомобиль,
		|	ТК_ТТН.Водитель КАК Водитель,
		|	ТК_ТТН.Источники.(
		|		НомерСтроки КАК НомерСтроки,
		|		Документ КАК Документ,
		|		Отгрузка КАК Отгрузка
		|	) КАК Источники
		|ИЗ
		|	Документ.ТК_ТТН КАК ТК_ТТН
		|ГДЕ
		|	ТК_ТТН.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("doc","№"+ВыборкаДетальныеЗаписи.Номер+" від "+Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=yyyy-MM-dd"));
	СтруктураДокумента.Вставить("avto",Строка(ВыборкаДетальныеЗаписи.Автомобиль));
	СтруктураДокумента.Вставить("vod",Строка(ВыборкаДетальныеЗаписи.Водитель));
	

	ВыборкаДокументы = ВыборкаДетальныеЗаписи.Источники.Выбрать();
	МассивДокументы = Новый Массив;
	   
	Пока ВыборкаДокументы.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДокументы.Отгрузка) Тогда
			ДокОтгрузки = ВыборкаДокументы.Отгрузка;
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДокументы.Документ) Тогда
			ДокОтгрузки = ВыборкаДокументы.Документ;
		Иначе
			Продолжить;
		КонецЕсли;
		ХозОперация = ДокОтгрузки.ХозОперация;
		СтрокаПолучатель="";
		Если ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ВидДок = "pr";
			
			Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
				СтрокаПолучатель = Строка(ДокОтгрузки.ТорговаяПлощадкаПолучатель);
				
			ИначеЕсли ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
				СтрокаПолучатель = Строка(ДокОтгрузки.СкладКомпанииПолучатель);	
			Иначе 
				Продолжить;	
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			ВидДок = "rt";
			СтрокаПолучатель = Строка(ДокОтгрузки.ТочкаДоставки);
		ИначеЕсли ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
			ВидДок = "vpr";
			СтрокаПолучатель = Строка(ДокОтгрузки.ТочкаДоставки);
		ИначеЕсли ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
				ВидДок = "vp";
				СтрокаПолучатель = Строка(ДокОтгрузки.Контрагент);
		ИначеЕсли ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
			 ВидДок = "rzp";
			 	СтрокаПолучатель = Строка(ДокОтгрузки.ТочкаДоставки);
		ИначеЕсли ТипЗнч(ДокОтгрузки) = Тип("ДокументСсылка.ТК_НалоговаяНакладная") Тогда
			 ВидДок = "nn";
			 СтрокаПолучатель = Строка(ДокОтгрузки.ТочкаДоставки);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ДокИД = ВидДок+"_"+Строка(ДокОтгрузки.УникальныйИдентификатор());
		СтруктураСтрока = Новый Структура("docid,doc,adr",ДокИД,Строка(ДокОтгрузки),СтрокаПолучатель);
		МассивДокументы.Добавить(СтруктураСтрока);
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("docsID",МассивДокументы);
	
	Результат.Вставить("Результат",Истина);
	Результат.Вставить("Ответ",СтруктураДокумента);
	
	Возврат Результат;
	

КонецФункции


Процедура СформироватьДанныеДляЗаявки(ТорговаяПлощадкаСсылка,Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУслуг = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугиСервисДеск.Родитель.Наименование КАК РодительНаименование,
	|	УслугиСервисДеск.Родитель.Код КАК РодительКод,
	|	УслугиСервисДеск.Наименование КАК Наименование,
	|	УслугиСервисДеск.Код КАК Код
	|ИЗ
	|	Справочник.УслугиСервисДеск КАК УслугиСервисДеск
	|ГДЕ
	|	УслугиСервисДеск.ДоступнаРеализатору
	|	И УслугиСервисДеск.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РодительНаименование,
	|	Наименование";
	
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "Немає послуг!";
		Возврат;
	КонецЕсли;
	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	Пока Выборка.СледующийПоЗначениюПоля("РодительНаименование") Цикл
		ГруппаУслуга = Новый Структура();
		ГруппаУслуга.Вставить("Код",Выборка.РодительКод);
		ГруппаУслуга.Вставить("Наименование",Выборка.РодительНаименование);
		МассивУслуга = Новый Массив;
		Пока Выборка.Следующий() Цикл 
			МассивУслуга.Добавить(Новый Структура("Код,Наименование",Строка(Выборка.Код),Строка(Выборка.Наименование)));
		КонецЦикла;
		ГруппаУслуга.Вставить("Услуги",МассивУслуга);
		МассивУслуг.Добавить(ГруппаУслуга);
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивУслуг;
	
КонецПроцедуры

Процедура СформироватьДанныеПосчетчикам(ТорговаяПлощадкаСсылка,Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПоказаний = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|	ЕСТЬNULL(ТекущиеПоказанияСчетчиковСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	|	ЕСТЬNULL(ТекущиеПоказанияСчетчиковСрезПоследних.Показания, 0) КАК Показание
	|ИЗ
	|	РегистрСведений.ПривязкаСчетчиков.СрезПоследних(&НаДату, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ПривязкаСчетчиковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеПоказанияСчетчиков.СрезПоследних(, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ТекущиеПоказанияСчетчиковСрезПоследних
	|		ПО ПривязкаСчетчиковСрезПоследних.Счетчик = ТекущиеПоказанияСчетчиковСрезПоследних.Счетчик
	|ГДЕ
	|	ПривязкаСчетчиковСрезПоследних.Счетчик.ВидКоммунальнойУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыКоммунальныхУслуг.Электроснабжение)";
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "Нет счетчиков!";
		Возврат;
	КонецЕсли;
	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивПоказаний.Добавить(Новый Структура("Счетчик,СчетчикИД,Дата,Показание",Строка(Выборка.Счетчик),Строка(Выборка.Счетчик.УникальныйИдентификатор()),Выборка.Дата,Выборка.Показание));
		
	КонецЦикла;
	
	Результат.Результат = Истина;
	Результат.Ответ = МассивПоказаний;
	
КонецПроцедуры


Функция ПоулчитьСтруктуруДокументаТБД(ТорговаяПлощадка,ТипДокумента)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ТБД_ПериодыСрезПоследних.Период КАК ПериодТБД
		|ИЗ
		|	РегистрСведений.ТК_ТБД_Периоды.СрезПоследних(, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ТК_ТБД_ПериодыСрезПоследних";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.ОписаниеОшибки = "Таблица ТБД пустая";
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 	
	ПериодТБД = ВыборкаДетальныеЗаписи.ПериодТБД;
	
	Склад = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(ТорговаяПлощадка);
	ИспользованиеХарактеристик = ?(ТипДокумента="ТБД_Табак",Истина,Ложь);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",ПериодТБД);
	Запрос.УстановитьПараметр("НачалоПериодаИН",НачалоМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонецПериодаИН",ТекущаяДатаСеанса());
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадка);
	Запрос.УстановитьПараметр("СкладКомпании",Склад);
	Запрос.УстановитьПараметр("ИспользованиеХарактеристик",ИспользованиеХарактеристик);
	
	Запрос.Текст = "ВЫБРАТЬ
	                 |	ТК_ТБД.ТорговаяПлощадка КАК ТорговаяПлощадка,
	                 |	ТК_ТБД.Номенклатура КАК Номенклатура,
	                 |	ТК_ТБД.Количество КАК Количество
	                 |ПОМЕСТИТЬ вт_тбд
	                 |ИЗ
	                 |	РегистрСведений.ТК_ТБД КАК ТК_ТБД
	                 |ГДЕ
	                 |	ТК_ТБД.Дата = &НачалоПериода
	                 |	И ТК_ТБД.ТорговаяПлощадка = &ТорговаяПлощадка
	                 |	И ТК_ТБД.Номенклатура.ИспользованиеХарактеристик = &ИспользованиеХарактеристик
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	вт_тбд.ТорговаяПлощадка КАК ТорговаяПлощадка,
	                 |	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	                 |	вт_тбд.Номенклатура КАК Номенклатура,
	                 |	ВЫБОР
	                 |		КОГДА ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                 |			ТОГДА """"
	                 |		ИНАЧЕ ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры.ЗначениеМРЦ
	                 |	КОНЕЦ КАК МРЦ,
	                 |	ПРЕДСТАВЛЕНИЕССЫЛКИ(вт_тбд.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
	                 |	вт_тбд.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ,
	                 |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Kol,
	                 |	1 КАК Kof,
	                 |	вт_тбд.Номенклатура.Артикул КАК Art
	                 |ПОМЕСТИТЬ вт_Остатки
	                 |ИЗ
	                 |	вт_тбд КАК вт_тбд
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
	                 |		ПО вт_тбд.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ИнвентаризацияТовары.Номенклатура КАК Номенклатура
	                 |ПОМЕСТИТЬ ИН_ТБД
	                 |ИЗ
	                 |	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	                 |ГДЕ
	                 |	ИнвентаризацияТовары.Ссылка.Дата МЕЖДУ &НачалоПериодаИН И &КонецПериодаИН
	                 |	И ИнвентаризацияТовары.Ссылка.Проведен
	                 |	И ИнвентаризацияТовары.Ссылка.ТипИнвентаризации = ЗНАЧЕНИЕ(Перечисление.ТК_ТипыИнвентаризаций.ТБД)
	                 |	И ИнвентаризацияТовары.Ссылка.СкладКомпании = &СкладКомпании
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	вт_Остатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	                 |	вт_Остатки.СкладКомпании КАК СкладКомпании,
	                 |	вт_Остатки.Номенклатура КАК Номенклатура,
					 |  ПРЕДСТАВЛЕНИЕССЫЛКИ(вт_Остатки.Номенклатура) КАК Tovar,
	                 |	вт_Остатки.МРЦ КАК МРЦ,
	                 |	вт_Остатки.EdIzm КАК EdIzm,
	                 |	вт_Остатки.ИспМРЦ КАК ИспМРЦ,
	                 |	вт_Остатки.Kol КАК Kol,
	                 |	вт_Остатки.Kof КАК Kof,
	                 |	вт_Остатки.Art КАК Art
	                 |ИЗ
	                 |	вт_Остатки КАК вт_Остатки
	                 |ГДЕ
	                 |	НЕ вт_Остатки.Номенклатура В
	                 |				(ВЫБРАТЬ
	                 |					ИН_ТБД.Номенклатура КАК Номенклатура
	                 |				ИЗ
	                 |					ИН_ТБД КАК ИН_ТБД)
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	вт_Остатки.Номенклатура.ТоварнаяМарка,
	                 |	вт_Остатки.Номенклатура.Наименование";
	
	//
	//Запрос.Текст =    "ВЫБРАТЬ
	//                  |	ВЫБОР
	//                  |		КОГДА ПродажиОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//                  |			ТОГДА ПродажиОбороты.Номенклатура
	//                  |		ИНАЧЕ ПродажиОбороты.Номенклатура.ОсновнойАртикул
	//                  |	КОНЕЦ КАК Номенклатура,
	//                  |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
	//                  |ПОМЕСТИТЬ вт_продажи
	//                  |ИЗ
	//                  |	РегистрНакопления.Продажи.Обороты(
	//                  |			&НачалоПериода,
	//                  |			,
	//                  |			Период,
	//                  |			ПодразделениеКомпании = &ПодразделениеКомпании
	//                  |				И СкладКомпании = &СкладКомпании) КАК ПродажиОбороты
	//                  |
	//                  |СГРУППИРОВАТЬ ПО
	//                  |	ВЫБОР
	//                  |		КОГДА ПродажиОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//                  |			ТОГДА ПродажиОбороты.Номенклатура
	//                  |		ИНАЧЕ ПродажиОбороты.Номенклатура.ОсновнойАртикул
	//                  |	КОНЕЦ
	//                  |;
	//                  |
	//                  |////////////////////////////////////////////////////////////////////////////////
	//                  |ВЫБРАТЬ
	//                  |	ВЫБОР
	//                  |		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//                  |			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура
	//                  |		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул
	//                  |	КОНЕЦ КАК ГруппировкаПоНоменклатуре,
	//                  |	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	//                  |	ОстаткиТоваровКомпанииОстаткиИОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//                  |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток КАК НачальныйОстаток,
	//                  |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток КАК Остаток
	//                  |ПОМЕСТИТЬ ВТ_Остатки
	//                  |ИЗ
	//                  |	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&НачалоПериода, , Период, , СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	//                  |;
	//                  |
	//                  |////////////////////////////////////////////////////////////////////////////////
	//                  |ВЫБРАТЬ
	//                  |	Ост.Номенклатура КАК Номенклатура,
	//                  |	Ост.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//                  |	Ост.НачальныйОстаток КАК НачальныйОстаток,
	//                  |	Ост.Остаток КАК Остаток,
	//                  |	ЕСТЬNULL(Прод.КоличествоОборот, 0) КАК Продажи
	//                  |ПОМЕСТИТЬ вт_ОстПрод
	//                  |ИЗ
	//                  |	ВТ_Остатки КАК Ост
	//                  |		ЛЕВОЕ СОЕДИНЕНИЕ вт_продажи КАК Прод
	//                  |		ПО Ост.ГруппировкаПоНоменклатуре = Прод.Номенклатура
	//                  |;
	//                  |
	//                  |////////////////////////////////////////////////////////////////////////////////
	//                  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//                  |	ИнвентаризацияТовары.Номенклатура КАК Номенклатура
	//                  |ПОМЕСТИТЬ ТоварыИН
	//                  |ИЗ
	//                  |	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	//                  |ГДЕ
	//                  |	ИнвентаризацияТовары.Ссылка.Дата МЕЖДУ &НачалоПериодаИН И &КонецПериодаИН
	//                  |	И ИнвентаризацияТовары.Ссылка.Проведен
	//                  |	И ИнвентаризацияТовары.Ссылка.ТипИнвентаризации = ЗНАЧЕНИЕ(Перечисление.ТК_ТипыИнвентаризаций.ТБД)
	//                  |	И ИнвентаризацияТовары.Ссылка.СкладКомпании = &СкладКомпании
	//                  |
	//                  |ОБЪЕДИНИТЬ ВСЕ
	//                  |
	//                  |ВЫБРАТЬ
	//                  |	ПроизводствоОбороты.Ингредиент
	//                  |ИЗ
	//                  |	РегистрНакопления.Производство.Обороты(&НачалоПериода, , Период, СкладКомпании = &СкладКомпании) КАК ПроизводствоОбороты
	//                  |
	//                  |СГРУППИРОВАТЬ ПО
	//                  |	ПроизводствоОбороты.Ингредиент
	//                  |;
	//                  |
	//                  |////////////////////////////////////////////////////////////////////////////////
	//                  |ВЫБРАТЬ
	//                  |	ПРЕДСТАВЛЕНИЕССЫЛКИ(вт_ОстПрод.Номенклатура) КАК Tovar,
	//                  |	ВЫБОР
	//                  |		КОГДА вт_ОстПрод.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//                  |			ТОГДА """"
	//                  |		ИНАЧЕ вт_ОстПрод.ХарактеристикаНоменклатуры.ЗначениеМРЦ
	//                  |	КОНЕЦ КАК МРЦ,
	//                  |	вт_ОстПрод.Остаток КАК Kol,
	//                  |	вт_ОстПрод.Продажи КАК Продажи,
	//                  |	вт_ОстПрод.Номенклатура.Артикул КАК Art,
	//                  |	ПРЕДСТАВЛЕНИЕССЫЛКИ(вт_ОстПрод.Номенклатура.ОсновнаяЕдиницаИзмерения) КАК EdIzm,
	//                  |	ЕСТЬNULL(вт_ОстПрод.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Kof,
	//                  |	вт_ОстПрод.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ
	//                  |ИЗ
	//                  |	вт_ОстПрод КАК вт_ОстПрод
	//                  |ГДЕ
	//                  |	вт_ОстПрод.Продажи = 0
	//                  |	И НЕ вт_ОстПрод.Номенклатура В
	//                  |				(ВЫБРАТЬ
	//                  |					ТоварыИН.Номенклатура КАК Номенклатура
	//                  |				ИЗ
	//                  |					ТоварыИН КАК ТоварыИН)
	//                  |	И вт_ОстПрод.НачальныйОстаток <> 0
	//                  |	И вт_ОстПрод.Остаток <> 0
	//                  |
	//                  |УПОРЯДОЧИТЬ ПО
	//                  |	вт_ОстПрод.Номенклатура.Родитель.Родитель.Родитель,
	//                  |	вт_ОстПрод.Номенклатура.Родитель.Родитель,
	//                  |	вт_ОстПрод.Номенклатура.Родитель,
	//                  |	вт_ОстПрод.Номенклатура.ТоварнаяМарка,
	//                  |	вт_ОстПрод.Номенклатура.Наименование";
		 
	
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	МассивТоваров = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаТовары = Новый Структура("Art,Tovar,EdIzm,Kof,Остаток,МРЦ,ИспМРЦ",СокрЛП(Выборка.Art),ЗаменитьСимволы(Выборка.Tovar),ЗаменитьСимволы(Выборка.EdIzm),Выборка.Kof,Выборка.Kol,Выборка.МРЦ,Выборка.ИспМРЦ);
		МассивТоваров.Добавить(СтрокаТовары);
		
	КонецЦикла;
		 
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Склад",ЗаменитьСимволы(Строка(Склад)));
	СтруктураДокумента.Вставить("СкладUUID",Строка(Склад.УникальныйИдентификатор()));

	
	СтруктураДокумента.Вставить("Tovary",МассивТоваров);
	
	Если МассивТоваров.Количество() = 0 Тогда
		Результат.Вставить("ОписаниеОшибки","Нет товаров ТБД");
	Иначе
		Результат.Вставить("Результат",Истина);
	КонецЕсли;

	Результат.Вставить("Ответ",СтруктураДокумента);

	Возврат Результат;

КонецФункции

Функция ПоулчитьСтруктуруДокументаРезервТовара(ТорговаяПлощадка, ГуидДокумента)
	
	УстановитьПривилегированныйРежим(Истина);

	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ");
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(ГуидДокумента);
	Исключение
		Результат.ОписаниеОшибки =  "Необходимо отсканировать QR документа";
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументСсылка =  Документы.РезервированиеЗаказовПокупателя.ПолучитьСсылку(ИД_Документа);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда 
		Результат.ОписаниеОшибки = "Документ не нейден.";  
		Возврат Результат;
		
	КонецЕсли;
	
	
	Если ДокументСсылка.ПометкаУдаления Тогда
		Результат.ОписаниеОшибки = "Выбранный документ помечен на удаление!"+Символы.ПС+"Контроль не возможен.";  
		Возврат Результат;
		
	КонецЕсли;
		
//	Если ДокументСсылка.РаспределениеОтгрузки.Количество() = 1 Тогда
	Если НЕ ДокументСсылка.РаспределениеОтгрузки.Количество() = 0 Тогда
		ДокЗаказ = ДокументСсылка.РаспределениеОтгрузки[0].ЗаказПокупателя;
	ИначеЕсли  ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
		ДокЗаказ = ДокументСсылка.ДокументОснование;
	Иначе	
		Результат.ОписаниеОшибки = "Без документа заказа контроль не возможен";  
		Возврат Результат;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&ДокЗаказ) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |	И СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&ДокЗаказ) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокЗаказ", ДокЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда	
		Результат.ОписаниеОшибки = "Документ уже отгружен";  
		Возврат Результат;
		
	КонецЕсли;

	//Если ПолучитьФункциональнуюОпцию("КонтролерНеПроводитПеремещение") Тогда
	текСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокументСсылка);
	Если текСостояние = Перечисления.СтатусыСборкиРезервов.Просрочен Тогда
		Результат.ОписаниеОшибки = "Состояние документа - Просрочен"+Символы.ПС+"Контроль не возможен.";  
		Возврат Результат;
	КонецЕсли;	
	//	
	//	ОписаниеСтатуса = "";
	//	Если НЕ ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.НеНачат,ОписаниеСтатуса)
	//		и НЕ ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.ГотовКСборке,ОписаниеСтатуса) Тогда
	//		Результат.ОписаниеОшибки = ОписаниеСтатуса;  
	//		Возврат Результат;
	//	КонецЕсли;
	//КонецЕсли;
	
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Sklad",Строка(ДокументСсылка.СкладКомпании));
	СтруктураДокумента.Вставить("SkladUUID",Строка(ДокументСсылка.СкладКомпании.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("Заголовок","Документ №"+ДокументСсылка.Номер+" от "+Формат(ДокументСсылка.Дата,"ДФ=dd.MM.yyyy"));
	//СтруктураДокумента.Вставить("ИспХар",НЕ Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокументСсылка.СкладКомпании));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РезервированиеЗаказовПокупателяТовары.Номенклатура) КАК НоменклатураПредставление,
	|	РезервированиеЗаказовПокупателяТовары.Номенклатура.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РезервированиеЗаказовПокупателяТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	РезервированиеЗаказовПокупателяТовары.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА РезервированиеЗаказовПокупателяТовары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ РезервированиеЗаказовПокупателяТовары.ХарактеристикаНоменклатуры.ЗначениеМРЦ
	|	КОНЕЦ КАК МРЦ,
	|	РезервированиеЗаказовПокупателяТовары.Количество КАК Количество,
	|	РезервированиеЗаказовПокупателяТовары.Номенклатура.ТипНоменклатуры.Весовой
	|		ИЛИ РезервированиеЗаказовПокупателяТовары.Номенклатура.ТипНоменклатуры.ШтучноВесовой КАК Весовой,
	|	РезервированиеЗаказовПокупателяТовары.Номенклатура.ИспользованиеХарактеристик КАК ИспМРЦ
	|ИЗ
	|	Документ.РезервированиеЗаказовПокупателя.Товары КАК РезервированиеЗаказовПокупателяТовары
	|ГДЕ
	|	РезервированиеЗаказовПокупателяТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивТоваров = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовары = Новый Структура("Art,Tovar,EdIzm,Kof,Kol,МРЦ,ИспМРЦ,Ves",СокрЛП(ВыборкаДетальныеЗаписи.Артикул),ВыборкаДетальныеЗаписи.НоменклатураПредставление,ВыборкаДетальныеЗаписи.ЕдиницаИзмеренияПредставление,ВыборкаДетальныеЗаписи.Коэффициент,ВыборкаДетальныеЗаписи.Количество,ВыборкаДетальныеЗаписи.МРЦ,ВыборкаДетальныеЗаписи.ИспМРЦ,ВыборкаДетальныеЗаписи.Весовой);
		МассивТоваров.Добавить(СтрокаТовары);
		
	КонецЦикла;
	СтруктураДокумента.Вставить("Tovary",МассивТоваров);
	Результат.Результат = Истина;
	Результат.Вставить("Ответ",СтруктураДокумента);
	
	Возврат Результат;
	
КонецФункции

Функция ПоставироВОчередьПечатиДокументПеремещение(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	УстановитьПривилегированныйРежим(Истина);
	
	Табдок = ПечатнаяФормаПеремещение(МассивДанных.ДокументUUID);
	Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
	
	СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
	СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
	СтруктураЗаписи.Макет = "ПерРН";
	СтруктураЗаписи.Хранилище = Хранилище;
	
	РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
	
	Результат.Результат = Истина;
	
КонецФункции

Функция ПоставироВОчередьПечатиДокументПоступлениеТоваров(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	УстановитьПривилегированныйРежим(Истина);
	
	Табдок = ПечатнаяФормаПоступлениеТоваров(ТорговаяПлощадкаСсылка,МассивДанных.ДокументUUID);
	Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
	
	СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
	СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
	СтруктураЗаписи.Макет = "ПерПТ";
	СтруктураЗаписи.Хранилище = Хранилище;
	
	РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
	
	Результат.Результат = Истина;
	
КонецФункции

Функция ПечатнаяФормаВозвратПоставщику(ДокументUUID)
	
	МассиПечати = ПолучитьМассивПечати("ВозвратПоставщику",ДокументUUID);

	Табдок = Документы.ВозвратПоставщику.ПечатьВозвратПоставщикуСПартиямиДвойная(МассиПечати,Новый СписокЗначений);
	Табдок.КоличествоЭкземпляров = 2;

	Возврат Табдок;
	
КонецФункции

Функция ПечатнаяФормаПеремещение(ДокументUUID)
	
	ДокументСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ДокументUUID));
	МассиПечати = Новый Массив;
	МассиПечати.Добавить(ДокументСсылка);
	
	Если ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ДокументСсылка.ТорговаяПлощадка,"ПечатнаяФормаДвойнаяПеремещениеТоваров",Ложь) Тогда
		Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваровДвойная(МассиПечати,Новый СписокЗначений,Новый Структура);
		Табдок.КоличествоЭкземпляров = 1;
	Иначе
		Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваров(МассиПечати,Новый СписокЗначений,Новый Структура);
		Табдок.КоличествоЭкземпляров = 2;
	КонецЕсли;

	Возврат Табдок;
	
КонецФункции

Функция ПечатнаяФормаПоступлениеТоваров(ТорговаяПлощадкаСсылка,ДокументUUID)
	
	ЭтоАттика = ОбменФронтПовтИсп.ЭтоПодразделениеАттика(ТорговаяПлощадкаСсылка.ПодразделениеКомпании);
 
	МассиПечати = ПолучитьМассивПечати("ПоступлениеТоваров",ДокументUUID);
	Если ЭтоАттика Тогда
		Табдок = Документы.ПоступлениеТоваров.ПечатьАктНедопоставки(МассиПечати,Новый СписокЗначений);
	Иначе
		
		Табдок = Документы.ПоступлениеТоваров.ПечатьПриходнаяНакладная(МассиПечати,Новый СписокЗначений);
	КонецЕсли;
	Табдок.КоличествоЭкземпляров = 1;
	
	Возврат Табдок;
	
КонецФункции

Функция ПечатнаяФормаАктНедопоставки(ДокументUUID)
 
	МассиПечати = ПолучитьМассивПечати("ПоступлениеТоваров",ДокументUUID);
	Табдок = Документы.ПоступлениеТоваров.ПечатьАктНедопоставки(МассиПечати,Новый СписокЗначений);
	
	Табдок.КоличествоЭкземпляров = 1;
	
	Возврат Табдок;
	
КонецФункции

Функция ПечатнаяФормаИнвентаризация(ДокументUUID)
 
	МассиПечати = ПолучитьМассивПечати("Инвентаризация",ДокументUUID);
	Табдок = Документы.Инвентаризация.ПечатьАктИнвентаризацииРозничный(МассиПечати,Новый СписокЗначений);
	
	Табдок.КоличествоЭкземпляров = 1;
	
	Возврат Табдок;
	
КонецФункции


Функция ПолучитьМассивПечати(ТипДокумента,ДокументUUID)
	
	ДокументСсылка = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ДокументUUID));
	МассиПечати = Новый Массив;
	МассиПечати.Добавить(ДокументСсылка);
	
	Возврат МассиПечати;
	
КонецФункции


Функция ПоставироВОчередьПечатиДокументВозвратПоставщику(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	УстановитьПривилегированныйРежим(Истина);
	
	Табдок = ПечатнаяФормаВозвратПоставщику(МассивДанных.ДокументUUID);
	
	Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
	
	СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
	СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
	СтруктураЗаписи.Макет = "ПерВП";
	СтруктураЗаписи.Хранилище = Хранилище;
	
	РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
	
	Результат.Результат = Истина;
	
КонецФункции


Функция ЗагрузитьДокумент(ТипДокумента,UUID,Запрос)Экспорт
	
	
	Результат =  СтруктураВозврата();
	
	ПодразделениеСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ПодразделениеСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИД_Запроса =  Запрос.Заголовки.Получить("X-1C-Request-UID");
	
	ПотокДанных = Запрос.ПолучитьТелоКакПоток();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(ПотокДанных,КодировкаТекста.UTF8);
	Попытка
		МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Результат.ОписаниеОшибки ="Ошибка четения списка товаров "+ ОписаниеОшибки();
		Результат.Результат = Ложь;
		Возврат Результат;
	КонецПопытки;

	
	Если МассивДанных.Свойство("ДоументСервер") Тогда
		ДоументСервер = МассивДанных.ДоументСервер;	
	Иначе
		ДоументСервер = Ложь;
	КонецЕсли;
	
	Если ДоументСервер Тогда
		Если ТипДокумента ="Zak" Тогда
			ЗаполнитьЗаказПоставщику(ПодразделениеСсылка,МассивДанных,Результат);
		//ИначеЕсли ТипДокумента = "PRIX" Тогда
		//	СформироватьОбновитьПредварительноеПоступление(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="PrintPR" Тогда
			ПоставироВОчередьПечатиДокументПеремещение(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="PrintPT" Тогда
			ПоставироВОчередьПечатиДокументПоступлениеТоваров(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="PrintVP" Тогда
			ПоставироВОчередьПечатиДокументВозвратПоставщику(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="Контролер" Тогда
			СформироватьОтгрузкуКонтролер(ПодразделениеСсылка,МассивДанных,Результат);

	
			//ИначеЕсли ТипДокумента ="PrintIN" Тогда
		//	ПоставироВОчередьПечатиДокументИнвентаризация(ПодразделениеСсылка,МассивДанных,Результат);
		КонецЕсли;
		
		
	Иначе	
		Если ТипДокумента = "Списание" Тогда
		//	СформироватьДокументСписания(ПодразделениеСсылка,МассивДанных,Результат);
		//ИначеЕсли ТипДокумента = "ПриемТовара" Тогда
		//	СформироватьПредварительноеПоступление(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "IN" Тогда
			ЗаписатьТоварыИнвентаризации(ПодразделениеСсылка,МассивДанных,Результат);
		//ИначеЕсли ТипДокумента = "PRN" Тогда
		//	ЗаписатьПеремещениеТоваров(ПодразделениеСсылка,МассивДанных,Результат);
		//ИначеЕсли ТипДокумента = "VOZ" Тогда
		//	СформироватьДокументВозвратТоваров(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "Инвентаризация" Тогда
			СформироватьДокументИнвентаризация(ПодразделениеСсылка,МассивДанных,Перечисления.ТК_ТипыИнвентаризаций.Точечная,Результат);
		ИначеЕсли ТипДокумента = "ЛокальнаяИнвентаризация" Тогда
			СформироватьДокументИнвентаризация(ПодразделениеСсылка,МассивДанных,Перечисления.ТК_ТипыИнвентаризаций.Локальная,Результат);
		ИначеЕсли ТипДокумента = "ИнвентаризацияТБД" Тогда
			СформироватьДокументИнвентаризация(ПодразделениеСсылка,МассивДанных,Перечисления.ТК_ТипыИнвентаризаций.ТБД,Результат);
	
		ИначеЕсли ТипДокумента = "ЗаданиеИН" Тогда
			СформироватьДокументИнвентаризация(ПодразделениеСсылка,МассивДанных,Перечисления.ТК_ТипыИнвентаризаций.ПоГрафику,Результат);
		ИначеЕсли ТипДокумента = "ЗаданиеТБД" Тогда
			ЗаписатьДанныеСканированияТБД(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "ЗаданиеТБДV2" Тогда
			ЗаписатьДанныеСканированияТБД_V2(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "ЗаданиеТНП" Тогда
			ЗаписатьДанныеСканированияТНП(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "Списание2" Тогда 
			СформироватьДокументСписанияВерсия2(ПодразделениеСсылка, МассивДанных, Результат);
		ИначеЕсли ТипДокумента = "ВозвратТоваров"Тогда
			//СформироватьДокументВозвратТоваровРазбивка(ПодразделениеСсылка,МассивДанных,Результат);
			///Новый вариант возврата
			СформироватьДокументВозвратТоваровПоставщику(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "Уценка"Тогда
		//	СформироватьПересортицаТоваров(ПодразделениеСсылка,МассивДанных,Результат);	
		ИначеЕсли ТипДокумента = "ПеремещениеТоваров" Тогда 
			СформироватьПеремещениеТоваров(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "ПриемПоЗаказу" Тогда
			СформироватьОбновитьПоступлениеНаОснованииЗаказа(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "ПриемПоПриходу" Тогда
			ЗаполнитьОбновитьПоступлениеТоваров(ПодразделениеСсылка,МассивДанных,Результат);
	
		ИначеЕсли ТипДокумента	= "АктПриемаЗаказ" Тогда
			СформироватьДанныеАкта(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента	= "АктПриемаПриход" Тогда
			 СформироватьДанныеАкта(ПодразделениеСсылка,МассивДанных,Результат,"ПоступлениеТоваров");

		ИначеЕсли ТипДокумента = "ПриходУход" Тогда
		      ЗаписатьДанныеПриходУход(ПодразделениеСсылка,МассивДанных,Результат);
		
		ИначеЕсли ТипДокумента ="Задание" Тогда
			СформироватьДокументПоЗаданию(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="ЗаданиеВФ" Тогда
			//ЗакрытьЗадачуВерификации(ПодразделениеСсылка,МассивДанных,Результат);
			ЗаписатьДанныеСканированияВФ(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента ="Посетители" Тогда
			ЗаписатьДанныеПосетителей(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "Фото" Тогда
			ЗаписатьФото(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "ФотоСчетчика" Тогда
			ЗаписатьФотоСчетчика(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "Уведомление" Тогда
			ЗаписатьВыполнениеПоЗаданиюУведомление(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "МаршрутныйЛист" Тогда
	        ЗаписатьДанныеМаршрутныйЛист(ПодразделениеСсылка,МассивДанных,Результат)
		ИначеЕсли ТипДокумента = "ВозвратПеремещение" Тогда	
			 ОбновитьСтатусДокументаПеремещение(ПодразделениеСсылка,МассивДанных,Результат);
		ИначеЕсли ТипДокумента = "БезакцептныйПрием" Тогда	
			 ОбновитьСтатусДокументаПеремещение(ПодразделениеСсылка,МассивДанных,Результат);
		 ИначеЕсли ТипДокумента = "Заявка" Тогда
			 ЗаписатьДанныеЗаявки(ПодразделениеСсылка,МассивДанных,Результат);
		 ИначеЕсли ТипДокумента = "Рекламация" Тогда
			 ЗаписатьДанныеРекламации(ПодразделениеСсылка,МассивДанных,Результат);
	 
		КонецЕсли; 
	КонецЕсли;

	
	Возврат Результат;
	
КонецФункции

Функция ВернутьДанныеТорговойПлощадки(ТипДокумента,UUID)Экспорт
	
	Результат =  СтруктураВозврата();
	
	ТорговаяПлощадкаСсылка = ПодразделениеКорректно(UUID,Результат);
	
	Если ТорговаяПлощадкаСсылка = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Если ТипДокумента = "ФотоСчетчика" Тогда
		СформироватьДанныеПосчетчикам(ТорговаяПлощадкаСсылка,Результат);
	ИначеЕсли ТипДокумента = "ZAYVKA" Тогда 	
		СформироватьДанныеДляЗаявки(ТорговаяПлощадкаСсылка,Результат);
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции


//Документы
Процедура ЗаписатьФото(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	//Ответ = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	
	ПутьСохранения = УправлениеСвойствами.ЗначениеСвойства(ТорговаяПлощадкаСсылка.ПодразделениеКомпании,"ПутьФотоотчеты");
	
	Если ПутьСохранения = Неопределено Или ПустаяСтрока(ПутьСохранения) Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Не указан каталог для сохранения фотографий, обратитесь в службу поддержки пользователей, тел.5555!";
		Возврат;
		
	КонецЕсли;
	//
	КаталогФайлов = Новый Файл(ПутьСохранения);
	
	Если Не КаталогФайлов.Существует() Тогда
		
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Каталог для сохранения файла не доступен, обратитесь в службу поддержки пользователей, тел.5555!";
		Возврат;
		
	КонецЕсли;
	КаталогТП = Формат(ТорговаяПлощадкаСсылка.Global_ID,  "ЧГ=")+"_"+ЗаменитьСимволы(СокрЛП(ТорговаяПлощадкаСсылка.Наименование)); 
	
	КаталогФайлов = Новый Файл(ПутьСохранения+"\"+КаталогТП);
	
	Попытка
		Если Не КаталогФайлов.Существует() Тогда
			СоздатьКаталог(ПутьСохранения+"\"+КаталогТП);
		КонецЕсли;
		
		
		ФотоДВ = Base64Значение(МассивДанных.Фото);
		
		ФотоДВ.Записать(ПутьСохранения+"\"+КаталогТП+"\"+Формат(ТекущаяДатаСеанса(),"ДФ=ddMMyyyyЧЧммсс")+"_фото_ТСД.jpg");
		Результат.Результат = Истина;
		
	Исключение
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки() + Символы.ПС+"Обратитесь в службу поддержки пользователей, тел.5555!";
		Возврат;
		
	КонецПопытки;

  
	  
КонецПроцедуры

Процедура ЗаписатьФотоСчетчика(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	

	УстановитьПривилегированныйРежим(Истина);
	
	Сотрудник = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	
	ФайлЛога = "C:\Users\g1Csrv$\AppData\Local\Temp\LogFile_S3.txt";
	
	Для Каждого стрСчетчик Из МассивДанных.Счетчики Цикл 
		СчетчикСсылка = Справочники.Счетчики.ПолучитьСсылку(Новый УникальныйИдентификатор(стрСчетчик.СчетчикИД));
		ФотоДВ = Base64Значение(стрСчетчик.Фото);
		ФайлФото = ПолучитьИмяВременногоФайла(".jpg");
		ФотоДВ.Записать(ФайлФото);
		
		
		
		
		
		// Обработка файла…
		ИмяБакета		= "metersreading";
		КлючДоступа		= "AKIA5IASEGZYFNOJFZJG";
		СекретныйКлюч	= "uZPLq17LTiyb9KnBgt8xluGwIkBAeb4vYrHj+Oz9";
		ИмяЗаписи		= СокрЛП(СчетчикСсылка.Код) +Формат(ТекущаяДатаСеанса(),"ДФ=ddMMyyyyЧЧммсс");
		ПутьКФайлу		= ФайлФото;
		ТипКонтента		= "image/jpg";
		ЗаписьЛога		= " -ErrorVariable err -InformationVariable info -WarningVariable warn; ($err.ErrorRecord, $warn, $info) | Out-File " + ФайлЛога;
		
		ТекстКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"C:\Program Files\PowerShell\7\pwsh.exe -Command ""& {Write-S3Object -BucketName %1 -Region us-east-1 -AccessKey %2 -SecretKey %3 -Key %4 -File %5 -CannedACLName public-read -PublicReadOnly -ContentType %6%7}""", 
		ИмяБакета,
		КлючДоступа,
		СекретныйКлюч,
		ИмяЗаписи,
		ПутьКФайлу,
		ТипКонтента,
		ЗаписьЛога);
		
		КодВозврата = Неопределено;
		
		Попытка
			ЗапуститьПриложение(ТекстКоманды,,Истина,КодВозврата);
		Исключение
			ош = ОписаниеОшибки();
		КонецПопытки;
		
		// Хорошим тоном будет удалить временный файл
		УдалитьФайлы(ФайлФото);
		
		ТекстДок = Новый ТекстовыйДокумент;
		Файл = Новый Файл(ФайлЛога);
		Если Файл.Существует() Тогда
			ТекстДок.Прочитать(ФайлЛога,КодировкаТекста.UTF8);
			ТекстЛога = ТекстДок.ПолучитьТекст();
			УдалитьФайлы(ФайлЛога);
		Иначе
			ТекстЛога = "";
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстЛога) Тогда
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = ТекстЛога;
			Возврат;
		КонецЕсли;
		
		Ответ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"https://%1.s3.amazonaws.com/%2",
		ИмяБакета,
		ИмяЗаписи);
		//Ответ ="тест!";
		
		МенеджерЗаписей = РегистрыСведений.ТекущиеПоказанияСчетчиков.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Автор = Сотрудник;
		МенеджерЗаписей.Период = ТекущаяДатаСеанса();
		МенеджерЗаписей.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		МенеджерЗаписей.Счетчик = СчетчикСсылка;
		МенеджерЗаписей.Фото = Ответ;
		Если стрСчетчик.Свойство("Показание") Тогда
			МенеджерЗаписей.Показания =	  стрСчетчик.Показание;
		КонецЕсли;
		
		МенеджерЗаписей.Записать(Истина);

	КонецЦикла;
	
	


	Если МассивДанных.Свойство("ДокументUUID") Тогда
		ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.ДокументUUID));
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		ДокЗаданиеОбъект.Записать();
	КонецЕсли;
	
     Результат.Результат = Истина;
	  
КонецПроцедуры


Процедура ЗаполнитьОбновитьПоступлениеТоваров(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	ОписаниеОшибки ="";
	УстановитьПривилегированныйРежим(Истина);
	
	Если МассивДанных.Свойство("UUID_Документ") Тогда
		Ответ.Вставить("UUID_Документ",МассивДанных.UUID_Документ);
		
		ДокСсылка = Документы.ПоступлениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
		Док = ДокСсылка.ПолучитьОбъект();
		Док.Дата = ТекущаяДатаСеанса();
		
		Если Док = Неопределено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
			Возврат;
			
		ИначеЕсли Док.Проведен Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(ДокСсылка);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
		Возврат;
		
	КонецЕсли;
	
	
			
		
		Ком ="";
		ОписаниеОшибкитовары ="";
		ТоварыДокумента = Док.Товары.Выгрузить();
		ТоварыДокумента.ЗаполнитьЗначения(0,"Количество,КоличествоБазовое");
		ТоварыДокумента.Колонки.Добавить("ХарактеристикиИспользуются");

		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
					
			Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул",Истина);
			Если Рез.Пустой() Тогда
				ОписаниеОшибкитовары = ОписаниеОшибкитовары+"Критическая ошибка, не найден товар по артикулу: "+СтрокаТовар.Артикул+Символы.ПС;
				Продолжить;
			КонецЕсли;
			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			
			Если ЗначениеЗаполнено(СтрокаТовар.МРЦ) Тогда
				Попытка 
					МРЦЧисло = Число(СтрокаТовар.МРЦ);
				Исключение
					
					ОписаниеОшибкитовары = ОписаниеОшибкитовары+"Критическая ошибка, поиск МРЦ товара, артикул: "+СтрокаТовар.Артикул+", МРЦ"+СтрокаТовар.МРЦ+ Символы.ПС;
					Продолжить;


				КонецПопытки;
			Иначе
				МРЦЧисло = 0; 
				
			КонецЕсли;
			
			ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура, МРЦЧисло);
			
			мнСтр  = ТоварыДокумента.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Выборка.Номенклатура,ХарактеристикаНоменклатуры));
			
			Если мнСтр.Количество() = 0 Тогда
				ОписаниеОшибкитовары = ОписаниеОшибкитовары+"Критическая ошибка, не найдена строка товара в документе : "+Строка(Выборка.Номенклатура)+Символы.ПС;
				Продолжить;
				
			КонецЕсли;
			стч  = мнСтр[0];
			стч.Количество = СтрокаТовар.КоличествоВведено;
			стч.КоличествоБазовое = СтрокаТовар.КоличествоВведено;
			стч.КоличествоПоставщика =  СтрокаТовар.КоличествоПоставщика;
			
			Если ПустаяСтрока(СтрокаТовар.ПричинаРасхожденияПорядок) ИЛИ СтрокаТовар.ПричинаРасхожденияПорядок = "0" Тогда
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.ПустаяСсылка();
			ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="1" Тогда
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.Недовоз;
			ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="2" Тогда
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.НетВЗаказе;
			ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="3" Тогда
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.Пересорт;
			ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="4" Тогда
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.Брак;
			Иначе
				ПричинаНедовоза = Перечисления.ТК_ПричиныНедовоза.ПустаяСсылка();

			КонецЕсли;	
			
			стч.ПричинаРасхождения =  ПричинаНедовоза;
			
			Если НЕ ПустаяСтрока(СтрокаТовар.ПричинаРасхожденияСтрока) Тогда
				Ком ="АКТ";
			КонецЕсли;
			
		КонецЦикла;
		
		Если не ПустаяСтрока(ОписаниеОшибкитовары) Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  ОписаниеОшибкитовары;
			Возврат;
			
		КонецЕсли;
		
		
		
			
		Док.Комментарий = Ком;
		
		Если МассивДанных.ЗакрыватьЗаказ Тогда
			Док.ЗакрытиеЗаказовПоставщикам = 1;	
		Иначе
			Док.ЗакрытиеЗаказовПоставщикам = 2;	
		КонецЕсли;
		
		
		
				
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
		МассивПолейРасхождений = Новый Массив;
		МассивПолейРасхождений.Добавить(Новый Структура("Уменьшаемое, Вычетаемое, Разница",	"Количество" ,	"КоличествоПоставщика" ,	"РасхождениеКоличество"));
		МассивПолейРасхождений.Добавить(Новый Структура("Уменьшаемое, Вычетаемое, Разница",	"Цена" 		 ,	"ЦенаПоставщика" 	   ,	"РасхождениеЦена"));
		СтруктураДействий.Вставить("ПересчитатьРазность", МассивПолейРасхождений);	

		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыДокумента,СтруктураДействий,Неопределено);
		
		Док.Товары.Загрузить(ТоварыДокумента);

		НачатьТранзакцию();	
		
	
		Попытка
			
			Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			
			Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
			
			Результат.Результат = Истина;
			
			ЗафиксироватьТранзакцию();
			
			Если МассивДанных.Свойство("ФотоДокумента") Тогда
				
				
				сч = 1;
				Для Каждого тФото Из  МассивДанных.ФотоДокумента Цикл 
					
			
					ИмяФайла = "ПТ_"+Формат(Док.Дата,"ДФ=yyyyMMdd")+"_"+ЗаменитьСимволы(Строка(Док.Контрагент))+"_"+ЗаменитьСимволы(Док.ВхДокНомер)+"_"+Формат(Док.ВхДокДата,"ДФ=yyyyMMdd")+"_"+Строка(сч)+".jpg";
					
					ФотоДВ = Base64Значение(тФото.Фото);
					
					НаборЗаписей = РегистрыСведений.ФотоТСД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Док.Ссылка);
					НаборЗаписей.Отбор.ИмяФото.Установить(ИмяФайла);
					НоваяЗаписНабора = НаборЗаписей.Добавить();
					НоваяЗаписНабора.Документ = Док.Ссылка;
					НоваяЗаписНабора.ИмяФото  = ИмяФайла;
					НоваяЗаписНабора.Хранилище = Новый ХранилищеЗначения(ФотоДВ);
					НаборЗаписей.Записать();
								
					сч = сч + 1;
				КонецЦикла;
			КонецЕсли;
			
			
		Исключение
			ОтменитьТранзакцию();
			Результат.Результат = Ложь;
			СтрОшибка = "";
			
			СтрОшибка =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			
			
			
			Результат.ОписаниеОшибки = СтрОшибка;
					
			Результат.Ответ = Ответ;
			Возврат ;
		КонецПопытки;
		
	Результат.Ответ = Ответ;
	
КонецПроцедуры

Процедура ЗаполнитьЗаказПоставщику(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	ОписаниеОшибки ="";
	УстановитьПривилегированныйРежим(Истина);
	
	ДокСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));

	Если ДокСсылка.Проведен Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(ДокСсылка);
		
	ИначеЕсли ДокСсылка.СтатусЗаказаВеб <> Перечисления.СтатусыЗаказовВеб.НеОтправлен Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Документ уже обработан, статус: "+Символы.ПС+Строка(ДокСсылка.СтатусЗаказаВеб);

	КонецЕсли;
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	ДокОбъект.Товары.Очистить();
	ДокСтруктура = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,МассивДанных,ДокОбъект);
	
	ДокОбъект.Заполнить(ДокСтруктура);
	
	Попытка
		НачатьТранзакцию();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		Документы.ЗаказПоставщику.ОтправитьПоEDI(ДокОбъект.Ссылка);
		
		ЗафиксироватьТранзакцию();
		Результат.Результат = Истина;
		
	
	Исключение
		ОтменитьТранзакцию();
		
		СтрОшибка =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.ОписаниеОшибки = СтрОшибка;

		Результат.Результат = Ложь;

	КонецПопытки;
	

	Результат.Ответ = Ответ;

	
КонецПроцедуры



Функция ПолучитьСтруктуруДокумента(ТорговаяПлощадка,МассивДанных,ДокументОбъект)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Дата",ТекущаяДатаСеанса());
	СтруктураДокумента.Вставить("ВалютаДокумента",ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	СтруктураДокумента.Вставить("КурсДокумента",1);
	СтруктураДокумента.Вставить("Организация", Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадка,ТекущаяДатаСеанса()));
	СтруктураДокумента.Вставить("ТорговаяПлощадка",ТорговаяПлощадка);
	СтруктураДокумента.Вставить("ПодразделениеКомпании",ТорговаяПлощадка.ПодразделениеКомпании);
	СтруктураДокумента.Вставить("СкладКомпании",Справочники.СкладыКомпании.ПустаяСсылка());
	СтруктураДокумента.Вставить("Менеджер", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник));
	
	ПечатьНаСервере = Истина;
	Если МассивДанных.Свойство("ПечатьТСД") И МассивДанных.ПечатьТСД = 1 Тогда
		ПечатьНаСервере = Ложь;
	КонецЕсли;
	СтруктураДокумента.Вставить("ПечатьНаСервере",ПечатьНаСервере);
	
	
	ТипДокумента = ТипЗнч(ДокументОбъект);
	

	СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	//СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	
	
	ДобавитьПродажиИнвентаризация = Ложь;
	ТЧ_Инвентаризация = Ложь;
	ФормироватьТаблицуВозврата = Ложь;
	ПродажиОС = Ложь;
	Если ТипДокумента = Тип("ДокументОбъект.СписаниеТоваров") Тогда
		
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		
		СтруктураДокумента.Вставить("ХозОперация",Справочники.ХозОперации.СписаниеТоваров);
		СтруктураДокумента.Вставить("СкладКомпании",ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад));
		СтруктураДокумента.Вставить("СтатьяСписанияТМЦ", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСтатьюДДС(МассивДанных.Статья));
		СтруктураДокумента.Вставить("ТорговаяПлощадкаСписания",ТорговаяПлощадка);
		СтруктураДокумента.Вставить("ТипЦен",СтруктураДокумента.СкладКомпании.ТипЦенСебестоимости);
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.Инвентаризация") Тогда
		ТЧ_Инвентаризация = Истина;
		СтруктураДокумента.Вставить("ХозОперация",Справочники.ХозОперации.ИнвентаризацияТоваров);
		СтруктураДокумента.Вставить("СкладКомпании",ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад));
		СтруктураДокумента.Вставить("ТипЦенИтогов",СтруктураДокумента.СкладКомпании.ТипЦенРозничнойТорговли);
		Если МассивДанных.Свойство("ПродажиОС") И МассивДанных.ПродажиОС = Истина Тогда
			ПродажиОС = Истина;
		ИначеЕсли Справочники.СкладыКомпании.ЭтоСкладТНП(СтруктураДокумента.СкладКомпании) Тогда
			ДобавитьПродажиИнвентаризация = Ложь;
		Иначе
			ДобавитьПродажиИнвентаризация = Истина;
		КонецЕсли;
		
		СтруктураПараметровОстатков = Новый Структура;
		СтруктураПараметровОстатков.Вставить("Дата", Новый МоментВремени(СтруктураДокумента.Дата, ДокументОбъект.Ссылка));
		СтруктураПараметровОстатков.Вставить("СкладКомпании", СтруктураДокумента.СкладКомпании);	
		СтруктураПараметровОстатков.Вставить("ИмяПоляОстатка", "КоличествоКнижн");
		
		СтруктураДействий.Вставить("ЗаполнитьОстаток", СтруктураПараметровОстатков);

		МассивПолейРасхождений = Новый Массив;
		
		СтруктураПолейРасхождений = Новый Структура;
		СтруктураПолейРасхождений.Вставить("Уменьшаемое", 	"КоличествоФакт");
		СтруктураПолейРасхождений.Вставить("Вычетаемое", 	"КоличествоКнижн");
		СтруктураПолейРасхождений.Вставить("Разница", 		"Количество");
		
		МассивПолейРасхождений.Добавить(СтруктураПолейРасхождений);		
		
		СтруктураДействий.Вставить("ПересчитатьРазность", МассивПолейРасхождений);	
		СтруктураДокумента.Вставить("ТипЦен",СтруктураДокумента.СкладКомпании.ТипЦенСебестоимости);
	ИначеЕсли 	ТипДокумента = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		ХозОперация =   Справочники.ХозОперации[МассивДанных.ХозОперация];
		СтруктураДокумента.Вставить("ХозОперация", ХозОперация);
		
		Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
			СкладКомпании = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_СкладОтправитель);
			СкладКомпанииПолучатель =   ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад);
			Если  МассивДанных.Свойство("UUID_Причина") И ЗначениеЗаполнено(МассивДанных.UUID_Причина) Тогда
				СтруктураДокумента.Вставить("СтатьяВозврата",Справочники.СтатьиВозврата.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Причина))); 
			КонецЕсли;
			
			СтруктураДокумента.Вставить("СкладКомпании",СкладКомпании);
			СтруктураДокумента.Вставить("СкладКомпанииПолучатель",СкладКомпанииПолучатель);
			СтруктураДокумента.Вставить("ТорговаяПлощадкаПолучатель",СкладКомпанииПолучатель.ТорговаяПлощадка);
		ИначеЕсли ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			СкладКомпании = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_СкладОтправитель);
			СтруктураДокумента.Вставить("СкладКомпании",СкладКомпании);
			ТоргПлощадкаПолучатель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьТорговуюПлощадку(МассивДанных.UUID_Склад);
			СтруктураДокумента.Вставить("ТорговаяПлощадкаПолучатель",ТоргПлощадкаПолучатель);
			СтруктураДокумента.Вставить("СкладКомпанииПолучатель",ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТоргПлощадкаПолучатель));
		ИначеЕсли ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
			ФормироватьТаблицуВозврата = Истина;
			СкладКомпанииОтправитель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_СкладОтправитель);
			
			Если МассивДанных.Свойство("UUID_Склад") И ЗначениеЗаполнено(МассивДанных.UUID_Склад)Тогда
				СкладКомпанииПолучатель = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад);
			Иначе
				СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадка,"ОсновнойСкладПеремещения");
				Если ЗначениеЗаполнено(СкладПолучатель) Тогда
					СкладКомпанииПолучатель  = СкладПолучатель
				Иначе	
					СкладКомпанииПолучатель  = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(ТорговаяПлощадка);
				КонецЕсли;
			КонецЕсли;

			
			
			СтруктураДокумента.Вставить("СкладКомпании",СкладКомпанииОтправитель);
			СтруктураДокумента.Вставить("ТорговаяПлощадка",СкладКомпанииОтправитель.ТорговаяПлощадка);
			СтруктураДокумента.Вставить("ТорговаяПлощадкаПолучатель",ТорговаяПлощадка);
			СтруктураДокумента.Вставить("СкладКомпанииПолучатель",СкладКомпанииПолучатель);
			
		КонецЕсли;
		ТипЦенДокумента = Справочники.СкладыКомпании.ТипЦенРозничный(СтруктураДокумента.СкладКомпанииПолучатель);
		Если Не ЗначениеЗаполнено(ТипЦенДокумента) Тогда
			ТипЦенДокумента = Справочники.СкладыКомпании.ТипЦенРозничный(СтруктураДокумента.СкладКомпании);
		КонецЕсли;
		
		СтруктураДокумента.Вставить("ТипЦен",ТипЦенДокумента);

		//СтруктураДокумента.Вставить("ТипЦен",СтруктураДокумента.СкладКомпании.ТипЦенСебестоимости);
		ЦеныБезХарактеристики = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(СтруктураДокумента.СкладКомпании,ТекущаяДатаСеанса());
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена",Новый Структура("Дата,ГраницаИсклюая,ТипЦен",ТекущаяДатаСеанса(),Ложь,СтруктураДокумента.ТипЦен));
		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		Если ЦеныБезХарактеристики Тогда 
			СтруктураДействий.Вставить("ЦеныБезХарактеристики", Истина);
		КонецЕсли;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		
		Если ДокументОбъект.СкладыКомпании.Количество() = 1 Тогда
			СтруктураДокумента.Вставить("СкладКомпании",ДокументОбъект.СкладыКомпании[0].СкладКомпании);
		Иначе
			СтруктураДокумента.Вставить("СкладКомпании",ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСкладТорговыйЗал(ТорговаяПлощадка));
	 	КонецЕсли;	
		СтруктураДокумента.Вставить("ТипЦен",СтруктураДокумента.СкладКомпании.ТипЦенСебестоимости);
		//ЦеныБезХарактеристики = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(СтруктураДокумента.СкладКомпании,ТекущаяДатаСеанса());
		СтруктураДокумента.Вставить("Комментарий","ТСД");
		СтруктураДействий = Новый Структура;	
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
		СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);		
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;	
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокументОбъект, "СогласованиеЦен"));
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");

	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ВозвратПоставщику") Тогда	
		СтруктураДокумента.Вставить("Комментарий","ТСД");
		СтруктураДокумента.Вставить("ХозОперация",Справочники.ХозОперации.ВозвратТоваровПоставщику);
		СтруктураДокумента.Вставить("Контрагент", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьКонтрагента(МассивДанных.UUID_Контрагент));
		Если МассивДанных.Свойство("Регл") Тогда
			СтруктураДокумента.Вставить("РегламентированныйУчет", МассивДанных.Регл);
		Иначе
			СтруктураДокумента.Вставить("РегламентированныйУчет", Истина);
		КонецЕсли;
		СтруктураДокумента.Вставить("СкладКомпании", ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад));
		СтруктураДокумента.Вставить("ТипЦен",СтруктураДокумента.СкладКомпании.ТипЦенСебестоимости);

		СписокВидовДоговора = Новый СписокЗначений;
		СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));
		СписокВидовДоговора.Добавить(ПредопределенноеЗначение("Справочник.ВидыДоговоров.ПоставкаПереводДолга"));
		
		СтруктураДокумента.Вставить("ДоговорВзаиморасчетов", Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(СтруктураДокумента.Контрагент, СтруктураДокумента.Организация, СтруктураДокумента.ПодразделениеКомпании, СписокВидовДоговора, ,ТекущаяДатаСеанса()));
		
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена",Новый Структура("Дата,ГраницаИсклюая,ТипЦен,Контрагент,ИмяРегистра",ТекущаяДатаСеанса(),Ложь,СтруктураДокумента.ТипЦен,СтруктураДокумента.Контрагент,"ЦеныКонтрагентов"));
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",СтруктураДокумента.Контрагент,СтруктураДокумента.Организация,СтруктураДокумента.ТорговаяПлощадка,"Закупка"));	
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ЗаполнитьДоговор",Новый Структура("Дата,Контрагент,ДоговорКонтрагента,Подразделение",ТекущаяДатаСеанса(),СтруктураДокумента.Контрагент,СтруктураДокумента.ДоговорВзаиморасчетов,СтруктураДокумента.ПодразделениеКомпании));

		
	КонецЕсли;
	
	
	Если МассивДанных.Свойство("Товары") Тогда
			
		ТоварыДокумента = ДокументОбъект.Товары.Выгрузить();
		ТоварыДокумента.Очистить();
		Если ТипДокумента = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
			ТоварыДокумента.Колонки.Добавить("ДоговорКонтрагента");
		КонецЕсли;
		
		
		Если ФормироватьТаблицуВозврата Тогда
			ТоварыДокументаВозврат = ТоварыДокумента.Скопировать();
		КонецЕсли;
		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
			стч = ТоварыДокумента.Добавить();
			
			Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул");
			Если Рез.Пустой() Тогда
				стч.Количество = СтрокаТовар.Количество * СтрокаТовар.Коэффициент;
				стч.КоличествоБазовое = стч.Количество;
				Продолжить;
			КонецЕсли;
			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			стч.Номенклатура     =  Выборка.Номенклатура;
			стч.ЕдиницаИзмерения = Выборка.Еденица;	
			стч.Коэффициент      = Выборка.Коэффициент;
			
			Если ЗначениеЗаполнено(СтрокаТовар.МРЦ) Тогда
				Попытка 
					МРЦЧисло = Число(СтрокаТовар.МРЦ);
				Исключение
					МРЦЧисло  = 0;
				КонецПопытки;
			Иначе
				МРЦЧисло = 0; 
				
			КонецЕсли;
			
			стч.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура, МРЦЧисло);
			
			Если ТЧ_Инвентаризация  Тогда
				Если ПродажиОС Тогда
					Попытка 
						Продажа = ОбменФронт.ПолучитьКоличествоПродажПоОтбору(МассивДанных.ПодразделениеПродажиОС,СтрокаТовар.Артикул,МассивДанных.UUID_Склад,Строка(стч.ХарактеристикаНоменклатуры.УникальныйИдентификатор()));
						стч.КоличествоФакт  = СтрокаТовар.Количество + Продажа;
					Исключение
						стч.КоличествоФакт  = СтрокаТовар.Количество 
					КонецПопытки;
				ИначеЕсли ДобавитьПродажиИнвентаризация Тогда
					стч.КоличествоФакт =  СтрокаТовар.Количество +  СтрокаТовар.Продажи;
				Иначе
					стч.КоличествоФакт =  СтрокаТовар.Количество;
				КонецЕсли;
			ИначеЕсли ФормироватьТаблицуВозврата Тогда
				тКоличествоПоставщика =0;
				тКоличество =0;

				Если СтрокаТовар.Коэффициент <> 0 И  стч.Коэффициент <> СтрокаТовар.Коэффициент Тогда
					тКоличество = СтрокаТовар.Количество * СтрокаТовар.Коэффициент;
					тКоличествоПоставщика = СтрокаТовар.КоличествоПоставщика * СтрокаТовар.Коэффициент;

				Иначе
					тКоличество = СтрокаТовар.Количество;
					тКоличествоПоставщика = СтрокаТовар.КоличествоПоставщика;
				КонецЕсли;

				
				КоличествоВозрат =   тКоличествоПоставщика - тКоличество;
				
				Если КоличествоВозрат >0 Тогда
					стчВозврат = ТоварыДокументаВозврат.Добавить();
					ЗаполнитьЗначенияСвойств(стчВозврат,стч);
					стчВозврат.Количество  = КоличествоВозрат;
					стчВозврат.КоличествоБазовое = КоличествоВозрат;
				КонецЕсли;
				стч.Количество  = тКоличествоПоставщика;
				стч.КоличествоБазовое = тКоличествоПоставщика;
				
			Иначе
				тКоличество =0;
		
				Если СтрокаТовар.Коэффициент <> 0 И  стч.Коэффициент <> СтрокаТовар.Коэффициент Тогда
					тКоличество = СтрокаТовар.Количество * СтрокаТовар.Коэффициент;
				Иначе
					тКоличество = СтрокаТовар.Количество;
				КонецЕсли;
				
				
				стч.Количество  = тКоличество;
				стч.КоличествоБазовое = тКоличество;
			КонецЕсли;
		КонецЦикла;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыДокумента,СтруктураДействий,Неопределено);
		
		Если ТипДокумента = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
			ТоварыДокумента.ЗаполнитьЗначения(СтруктураДокумента.СкладКомпании,"СкладКомпании");
		КонецЕсли;
		
		
		Если ТипДокумента = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
			
			МассивТовары = Новый Массив;

			времТаблицаДоговор = ТоварыДокумента.Скопировать(,"ДоговорКонтрагента");
			времТаблицаДоговор.Свернуть("ДоговорКонтрагента");
			Если времТаблицаДоговор.Количество() = 1 Тогда
				МассивТовары.Добавить(Новый Структура("ДоговорВзаиморасчетов,ТоварыДокумента",времТаблицаДоговор[0].ДоговорКонтрагента,ТоварыДокумента));
			Иначе
				Для Каждого тДоговор Из времТаблицаДоговор Цикл 
					ТоварыДоговора = ТоварыДокумента.Скопировать(ТоварыДокумента.НайтиСтроки(Новый Структура("ДоговорКонтрагента",тДоговор.ДоговорКонтрагента)));
					МассивТовары.Добавить(Новый Структура("ДоговорВзаиморасчетов,ТоварыДокумента",тДоговор.ДоговорКонтрагента,ТоварыДоговора));
				КонецЦикла;
			КонецЕсли;
		
			СтруктураДокумента.Вставить("МассивТовары",МассивТовары);
		Иначе
			СтруктураДокумента.Вставить("Товары",ТоварыДокумента);
		КонецЕсли;
		
		// структура перемещения на возврат
		Если ФормироватьТаблицуВозврата   И ТоварыДокументаВозврат.Количество()> 0 Тогда
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыДокументаВозврат,СтруктураДействий,Неопределено);
			
			СтруктураВозврат = Новый Структура;
			СтруктураВозврат.Вставить("Организация", СтруктураДокумента.Организация);
			СтруктураВозврат.Вставить("ПодразделениеКомпании",СтруктураДокумента.СкладКомпанииПолучатель.Подразделение);

			СтруктураВозврат.Вставить("Дата",ТекущаяДатаСеанса());
			СтруктураВозврат.Вставить("Менеджер",СтруктураДокумента.Менеджер);
			СтруктураВозврат.Вставить("ТипЦен",СтруктураДокумента.ТипЦен);
			СтруктураВозврат.Вставить("ХозОперация", Справочники.ХозОперации.ПеремещениеТоваровВФилиал);
			СтруктураВозврат.Вставить("СкладКомпании",СтруктураДокумента.СкладКомпанииПолучатель);
			СтруктураВозврат.Вставить("ТорговаяПлощадка",ТорговаяПлощадка);
			СтруктураВозврат.Вставить("ТорговаяПлощадкаПолучатель",СтруктураДокумента.ТорговаяПлощадка);
			СтруктураВозврат.Вставить("СкладКомпанииПолучатель",СтруктураДокумента.СкладКомпании);

			
			СтруктураВозврат.Вставить("Товары",ТоварыДокументаВозврат);
			СтруктураДокумента.Вставить("ТоварыВозврат",СтруктураВозврат);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДокумента;
	
КонецФункции

Процедура СформироватьОбновитьПоступлениеНаОснованииЗаказа(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	ОписаниеОшибки ="";
	УстановитьПривилегированныйРежим(Истина);
	
	Если МассивДанных.Свойство("UUID_Документ") Тогда
		Ответ.Вставить("UUID_Документ",МассивДанных.UUID_Документ);
		
		ДокСсылка = Документы.ПоступлениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
		Док = ДокСсылка.ПолучитьОбъект();
		
		Если Док = Неопределено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
			Возврат;
			
		ИначеЕсли Док.Проведен Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(ДокСсылка);
			Возврат;
			
		КонецЕсли;
		
		Док.Товары.Очистить();
		Док.РаспределениеПоставки.Очистить();
		
	Иначе
		Док  = Документы.ПоступлениеТоваров.СоздатьДокумент();
		Док.ИспользоватьЦеныИзПротоколов = ЗначениеНастроекПовтИсп.ПолучитьНастройкуПодразделения(ТорговаяПлощадкаСсылка.ПодразделениеКомпании);
		
	КонецЕсли;
	
	ЗаказПоставщику = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.ОснованиеUUID));
	
	Док.Дата = ТекущаяДата();
	Док.РегламентированныйУчет = ЗаказПоставщику.РегламентированныйУчет;
	Док.ПодразделениеКомпании  = ТорговаяПлощадкаСсылка.ПодразделениеКомпании;
	Док.ТорговаяПлощадка       = ТорговаяПлощадкаСсылка;
	Док.Автор                  = Пользователи.ТекущийПользователь();
	Док.ВалютаДокумента        = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Док.ВалютаДокумента);
	Док.КурсДокумента          = 1;
	Док.Организация            = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадкаСсылка,Док.Дата);
	Док.Контрагент             = ЗаказПоставщику.Контрагент;
	Док.ДоговорВзаиморасчетов  = ЗаказПоставщику.ДоговорВзаиморасчетов;
	Док.Менеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	//Док.ИспользоватьЦеныИзПротоколов = ЗначениеНастроекПовтИсп.ПолучитьНастройкуПодразделения(Док.ПодразделениеКомпании);
	
	Если ЗначениеЗаполнено(Док.Организация) И ЗначениеЗаполнено(Док.ДоговорВзаиморасчетов) Тогда
		Если Док.Организация = Док.ДоговорВзаиморасчетов.Организация Тогда
			Док.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
		Иначе
			Док.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровТранзиты;
		КонецЕсли;
	Иначе
		Док.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	КонецЕсли;
	
	
	Если Док.ЭтоНовый() Тогда
		Док.УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадкаСсылка,"ВыбиратьСкладПриемТоваров",Ложь)
		И МассивДанных.Свойство("UUID_Склад") И ЗначениеЗаполнено(МассивДанных.UUID_Склад) Тогда
		Док.СкладКомпании = Справочники.СкладыКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Склад));
	Иначе
		Док.СкладКомпании = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(ТорговаяПлощадкаСсылка);
	КонецЕсли;
	
	Док.ТипЦен = Док.СкладКомпании.ТипЦенСебестоимости;
	
	Док.ВхДокНомер = МассивДанных.ПНомер;
	Док.ВхДокДата  = Дата(МассивДанных.ПДата);
	
	
	
	Ком ="";
	
	ТоварыДокумента = Док.Товары.Выгрузить();
	ТоварыДокумента.Очистить();
	ТоварыДокумента.Колонки.Добавить("ХарактеристикиИспользуются");
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		
		Если СтрокаТовар.КоличествоВведено = 0 И  СтрокаТовар.КоличествоПоставщика = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул",Истина);
		Если Рез.Пустой() Тогда
			стч = ТоварыДокумента.Добавить();
			стч.Количество = СтрокаТовар.Количество;
			Продолжить;
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		стч = ТоварыДокумента.Добавить();
		стч.Номенклатура =  Выборка.Номенклатура;
		стч.Количество = СтрокаТовар.КоличествоВведено;
		стч.КоличествоПоставщика =  СтрокаТовар.КоличествоПоставщика;
		
		
		
		Если СтрокаТовар.ПричинаРасхожденияПорядок ="1" Тогда
			стч.ПричинаРасхождения = Перечисления.ТК_ПричиныНедовоза.Недовоз;
		ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="2" Тогда
			стч.ПричинаРасхождения = Перечисления.ТК_ПричиныНедовоза.НетВЗаказе;
		ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="3" Тогда
			стч.ПричинаРасхождения = Перечисления.ТК_ПричиныНедовоза.Пересорт;
		ИначеЕсли СтрокаТовар.ПричинаРасхожденияПорядок ="4" Тогда
			стч.ПричинаРасхождения = Перечисления.ТК_ПричиныНедовоза.Брак;
		КонецЕсли;	
		
		Если НЕ ПустаяСтрока(СтрокаТовар.ПричинаРасхожденияСтрока) Тогда
			Ком ="АКТ";
		КонецЕсли;
		
	КонецЦикла;
	
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",Док.Контрагент,Док.Организация,Док.ТорговаяПлощадка,"Закупка"));
	СтруктураДействий.Вставить("ЗаполнитьЦены", Новый Структура("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Док, "СогласованиеЦен",Док.Дата)));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	МассивПолейРасхождений = Новый Массив;
	МассивПолейРасхождений.Добавить(Новый Структура("Уменьшаемое, Вычетаемое, Разница",	"Количество" ,	"КоличествоПоставщика" ,	"РасхождениеКоличество"));
	МассивПолейРасхождений.Добавить(Новый Структура("Уменьшаемое, Вычетаемое, Разница",	"Цена" 		 ,	"ЦенаПоставщика" 	   ,	"РасхождениеЦена"));
	СтруктураДействий.Вставить("ПересчитатьРазность", МассивПолейРасхождений);	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыДокумента,СтруктураДействий,Неопределено);
	
	Док.Товары.Загрузить(ТоварыДокумента);
	
	Док.Комментарий = Ком;
	
	СтрРаспр = Док.РаспределениеПоставки.Добавить();
	СтрРаспр.ЗаказПоставщику = ЗаказПоставщику;
	Док.ДокументОснование    = ЗаказПоставщику;
	Если МассивДанных.ЗакрыватьЗаказ Тогда
		Док.ЗакрытиеЗаказовПоставщикам = 1;	
	Иначе
		Док.ЗакрытиеЗаказовПоставщикам = 2;	
	КонецЕсли;
	
	Док.Дата = ТекущаяДатаСеанса();
	
	НачатьТранзакцию();	
	
	Попытка
		
		Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		
		Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
		
		Результат.Результат = Истина;
		
		ЗафиксироватьТранзакцию();
		
		Если МассивДанных.Свойство("ФотоДокумента") Тогда
			
			сч = 1;
			Для Каждого тФото Из  МассивДанных.ФотоДокумента Цикл 
				
				ИмяФайла = "ПТ_"+Формат(Док.Дата,"ДФ=yyyyMMdd")+"_"+ЗаменитьСимволы(Строка(Док.Контрагент))+"_"+ЗаменитьСимволы(Док.ВхДокНомер)+"_"+Формат(Док.ВхДокДата,"ДФ=yyyyMMdd")+"_"+Строка(сч)+".jpg";
				
				ФотоДВ = Base64Значение(тФото.Фото);
				
				НаборЗаписей = РегистрыСведений.ФотоТСД.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Док.Ссылка);
				НаборЗаписей.Отбор.ИмяФото.Установить(ИмяФайла);
				НоваяЗаписНабора = НаборЗаписей.Добавить();
				НоваяЗаписНабора.Документ = Док.Ссылка;
				НоваяЗаписНабора.ИмяФото  = ИмяФайла;
				НоваяЗаписНабора.Хранилище = Новый ХранилищеЗначения(ФотоДВ);
				НаборЗаписей.Записать();
				
				сч = сч + 1;
			КонецЦикла;
		КонецЕсли;
		
		
	Исключение
		ОтменитьТранзакцию();
		Результат.Результат = Ложь;
		//СтрОшибка = "";
		
		СтрОшибка =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		
		Результат.ОписаниеОшибки = СтрОшибка;
		//Попытка
		//	Док.Записать();
		//	Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
		//Исключение
		//КонецПопытки;
		
		Результат.Ответ = Ответ;
		Возврат ;
	КонецПопытки;
	
	//Исключение
	//	Результат.Результат = Ложь;
	//	Результат.ОписаниеОшибки =  ОписаниеОшибки();
	//	Возврат ;
	//	
	//КонецПопытки;
	
	
	Результат.Ответ = Ответ;
	
КонецПроцедуры

Процедура СформироватьДокументВозвратТоваровРазбивка(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкладКомпании   = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад);
	СотрудникСсылка = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	ОрганизацияСсылка = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());

	
	времПереданныеДанные = Новый ТаблицаЗначений;
	времПереданныеДанные.Колонки.Добавить("Артикул");
	времПереданныеДанные.Колонки.Добавить("Количество");	
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		нс = времПереданныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(нс,СтрокаТовар,"Артикул,Количество");
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	спрНоменклатура.Артикул,
	|	спрНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|ГДЕ
	|	спрНоменклатура.Артикул В(&мАртикул)";
	
	Запрос.УстановитьПараметр("мАртикул", времПереданныеДанные.ВыгрузитьКолонку("Артикул"));
	
	тзНоменклатура = Запрос.Выполнить().Выгрузить();
	тзНоменклатура.Индексы.Добавить("Артикул");
	
	
	тзТоварыДокумента = Новый ТаблицаЗначений;
	тзТоварыДокумента.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзТоварыДокумента.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Любой)));
	
	Для Каждого СтрВрем Из времПереданныеДанные Цикл 
		нСтрока = тзНоменклатура.Найти(СтрВрем.Артикул,"Артикул");
		
		Если нСтрока = Неопределено Тогда
		Иначе
			нтзТД = тзТоварыДокумента.Добавить();
			нтзТД.Номенклатура = нСтрока.Номенклатура;
			нтзТД.Количество = СтрВрем.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
	тзТоварыДокумента.Свернуть("Номенклатура","Количество");
	тзТоварыДокумента.Индексы.Добавить("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("втТовары",тзТоварыДокумента);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.Текст ="ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	втТовары.Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&втТовары КАК втТовары";
	Запрос.Выполнить();
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВТ_Товары.Номенклатура КАК Номенклатура,
	              |	ВТ_Товары.Количество КАК Количество,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов.Организация
	              |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	              |	КОНЕЦ КАК Организация,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
	              |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	              |	КОНЕЦ КАК Контрагент,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов
	              |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	              |	КОНЕЦ КАК ДоговорВзаиморасчетов,
	              |	ПартииТоваровКомпанииОстатки.Партия КАК Партия,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Дата
	              |		ИНАЧЕ ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	              |	КОНЕЦ КАК ДатаПрихода,
	              |	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Остаток,
	              |	ВЫБОР
	              |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
	              |			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет
	              |		ИНАЧЕ ЛОЖЬ
	              |	КОНЕЦ КАК Регл,
	              |	ПартииТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	              |	ПартииТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент,
	              |	ПартииТоваровКомпанииОстатки.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	              |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	              |ИЗ
	              |	ВТ_Товары КАК ВТ_Товары
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(
	              |				,
	              |				СкладКомпании = &СкладКомпании
	              |					И Номенклатура В
	              |						(ВЫБРАТЬ
	              |							ВТ_Товары.Номенклатура
	              |						ИЗ
	              |							ВТ_Товары КАК ВТ_Товары)) КАК ПартииТоваровКомпанииОстатки
	              |		ПО ВТ_Товары.Номенклатура = ПартииТоваровКомпанииОстатки.Номенклатура
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ДатаПрихода
	              |ИТОГИ
	              |	МАКСИМУМ(Количество),
	              |	СУММА(Остаток)
	              |ПО
	              |	Регл,
	              |	Организация,
	              |	Контрагент,
	              |	ДоговорВзаиморасчетов,
	              |	Номенклатура";	
	
	
	Рез = Запрос.Выполнить();
	
	НачатьТранзакцию();
	Попытка
		
		ВыборкаРелгл =  Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРелгл.Следующий() Цикл 
			
			ВыборкаОрганизация = ВыборкаРелгл.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОрганизация.Следующий() Цикл 
				
				ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКонтрагент.Следующий() Цикл 
					
					ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаДоговор.Следующий() Цикл 
						
						
						//Попытка
						Док = Документы.ВозвратПоставщику.СоздатьДокумент();
						Док.Дата = ТекущаяДата();
						Док.Организация = ОрганизацияСсылка;
						Док.ТорговаяПлощадка       = ТорговаяПлощадкаСсылка;
						Док.ПодразделениеКомпании  = ТорговаяПлощадкаСсылка.ПодразделениеКомпании;
						Док.СкладКомпании          = СкладКомпании;
						Док.Автор                  = Пользователи.ТекущийПользователь();
						Док.ВалютаДокумента        = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Док.ВалютаДокумента);
						Док.КурсДокумента          = 1;
						Док.Менеджер = СотрудникСсылка;
						Док.УстановитьНовыйНомер();
						Док.ТипЦен = Док.СкладКомпании.ТипЦенСебестоимости;

						Если ЗначениеЗаполнено(ВыборкаОрганизация.Организация) Тогда
							Если ВыборкаОрганизация.Организация<>Док.Организация Тогда
								Док.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщикуТранзиты;
							Иначе
								Док.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;
							КонецЕсли;
						Иначе
							Док.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;
						КонецЕсли;
						
						Док.РегламентированныйУчет = ВыборкаРелгл.Регл;
						Док.Контрагент			   = ВыборкаКонтрагент.Контрагент;
						Док.ДоговорВзаиморасчетов  =  ВыборкаДоговор.ДоговорВзаиморасчетов;
						
						
						ВыборкаНоменклатура = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаНоменклатура.Следующий() Цикл 
							
							нСтрТовара = тзТоварыДокумента.Найти(ВыборкаНоменклатура.Номенклатура);
							Если нСтрТовара = Неопределено Тогда
								ОсталосьСписать = 0;
							Иначе
								ОсталосьСписать = нСтрТовара.Количество;
							КонецЕсли;
							
							Если ОсталосьСписать  = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							
							ВыборкаПартия = ВыборкаНоменклатура.Выбрать();
							
							Пока ВыборкаПартия.Следующий()  И ОсталосьСписать > 0 Цикл 
								
								Если ВыборкаПартия.Остаток <= 0 Тогда
									Продолжить;
								КонецЕсли;
								
								КоличествоОстаток = ВыборкаПартия.Остаток;
								
								СтрТовары = Док.Товары.Добавить();
								СтрТовары.Номенклатура      			  = ВыборкаПартия.Номенклатура;
								СтрТовары.ХарактеристикаНоменклатуры      = ВыборкаПартия.ХарактеристикаНоменклатуры;
								СтрТовары.ЕдиницаИзмерения			      = ВыборкаПартия.ЕдиницаИзмерения;
								СтрТовары.Коэффициент    				  = ВыборкаПартия.ЕдиницаИзмеренияКоэффициент;
								СтрТовары.СтавкаНДС       				  = ВыборкаПартия.СтавкаНДС;
							
								СтрТовары.Количество        = Мин(ОсталосьСписать, КоличествоОстаток);
								СтрТовары.КоличествоБазовое = СтрТовары.Количество;
								СтрТовары.Партия 			= ВыборкаПартия.Партия;
								
								ОсталосьСписать = ОсталосьСписать - СтрТовары.Количество;
							КонецЦикла;
							
							нСтрТовара.Количество =  ОсталосьСписать;
							
						КонецЦикла;
						
						Документы.ВозвратПоставщику.ЗаполнитьПартииВТЧТовары(Док);

						
						
						Если Док.Товары.Количество() > 0 Тогда
							Док.Записать();
						КонецЕсли;
						
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;		
		
		Если тзТоварыДокумента.Итог("Количество")> 0 Тогда
			
			
			
			Док = Документы.ВозвратПоставщику.СоздатьДокумент();
			Док.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;

			Док.Дата = ТекущаяДата();
			Док.Организация = ОрганизацияСсылка;
			Док.ТорговаяПлощадка       = ТорговаяПлощадкаСсылка;
			Док.ПодразделениеКомпании  = ТорговаяПлощадкаСсылка.ПодразделениеКомпании;
			Док.Автор                  = Пользователи.ТекущийПользователь();
			Док.ВалютаДокумента        = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Док.ВалютаДокумента);
			Док.КурсДокумента          = 1;
			Док.Менеджер = СотрудникСсылка;
			Док.УстановитьНовыйНомер();
			Док.ТипЦен = Док.СкладКомпании.ТипЦенСебестоимости;
			Док.РегламентированныйУчет = Ложь;
			Док.СкладКомпании          = СкладКомпании;
			
			Для Каждого стртзТовары Из тзТоварыДокумента Цикл 
				Если стртзТовары.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрТовары = Док.Товары.Добавить();
				СтрТовары.Номенклатура = стртзТовары.Номенклатура;
				СтрТовары.Количество = стртзТовары.Количество;
				СтрТовары.КоличествоБазовое = стртзТовары.Количество;

				
			КонецЦикла;
			
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",Док.Контрагент,Док.Организация,Док.ТорговаяПлощадка,"Закупка"));
				ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Док.Товары,СтруктураДействий);	

			Док.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();	
		Результат.Результат = Истина;
		
	Исключение
		ОтменитьТранзакцию();
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Ошибка записи документа "+Символы.ПС+ОписаниеОшибки();
		
	КонецПопытки;

	
		
		
КонецПроцедуры

Процедура СформироватьДокументВозвратТоваровПоставщику(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	
	Ответ = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	Док = Документы.ВозвратПоставщику.СоздатьДокумент();

	ДокСтруктура = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,МассивДанных,Док);
	
	
	НачатьТранзакцию();	
	
	мДок = 1;
	Для Каждого РазбивкаДоговор Из ДокСтруктура.МассивТовары Цикл 
		
		Док = Документы.ВозвратПоставщику.СоздатьДокумент();

		Док.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);//Результаты ошибок
		
		
		Док.Заполнить(ДокСтруктура);
		Док.ДоговорВзаиморасчетов = ?(ЗначениеЗаполнено(РазбивкаДоговор.ДоговорВзаиморасчетов),РазбивкаДоговор.ДоговорВзаиморасчетов,ДокСтруктура.ДоговорВзаиморасчетов);
		Док.Товары.Загрузить(РазбивкаДоговор.ТоварыДокумента);
		Документы.ВозвратПоставщику.ЗаполнитьПартииВТЧТовары(Док);
		
		Если Док.Товары.Количество() = 0 Тогда
			
			ОтменитьТранзакцию();
			
			Результат.ОписаниеОшибки = "Таблица товаров пустая, нечего возвращать!";
			Результат.Результат = Ложь;
			Возврат;
			
		КонецЕсли;
		
		Если НЕ	Док.ПроверитьЗаполнение() Тогда
			
			
			Если Док.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				
				Результат.ОписаниеОшибки =  Док.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
			Иначе
				Результат.ОписаниеОшибки = "Ошибка проверки заполнения документа";
			КонецЕсли;
			
			ОтменитьТранзакцию();
			
			Результат.Результат = Ложь;
			Возврат;
			
		КонецЕсли;
		
		
		Попытка
			
			Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			
			Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
			
			Если ДокСтруктура.ПечатьНаСервере Тогда
				
				МассивПечати = Новый Массив;
				МассивПечати.Добавить(Док.Ссылка);
				
				Табдок = Документы.ВозвратПоставщику.ПечатьВозвратПоставщикуСПартиями(МассивПечати,Новый СписокЗначений);
				//Табдок.КоличествоЭкземпляров = 2;
				
				
				ТабличныйДокумент = Новый ТабличныйДокумент;
				ТабличныйДокумент.АвтоМасштаб = Истина;
				
				ТабличныйДокумент.ПолеСверху = 0;
				ТабличныйДокумент.ПолеСлева  = 0;
				ТабличныйДокумент.ПолеСнизу  = 0;
				ТабличныйДокумент.ПолеСправа = 0;
				ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
				
				ТабличныйДокумент.Вывести(Табдок);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(Табдок);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(Табдок);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(Табдок);
				
				
				Хранилище = Новый ХранилищеЗначения(ТабличныйДокумент,Новый СжатиеДанных(9));
				
				СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
				СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
				СтруктураЗаписи.Макет = "ВП"+Строка(мДок);
				СтруктураЗаписи.Хранилище = Хранилище;
				
				РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
			КонецЕсли;
			
			мДок = мДок + 1;
			
			Результат.Результат = Истина;
			
		Исключение
			ОтменитьТранзакцию();
			Результат.Результат = Ложь;
			
			Если Док.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				Результат.ОписаниеОшибки =  Док.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
			Иначе
				Результат.ОписаниеОшибки =  "Ошибка записи документа: "+ОписаниеОшибки();
			КонецЕсли;
			Возврат;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

	Результат.Ответ = Ответ;
		
	
КонецПроцедуры

Процедура СформироватьДокументСписанияВерсия2(ТорговаяПлощадкаСсылка, МассивДанных, Результат)
	
	Ответ = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	
	Если МассивДанных.Свойство("UUID_Документ") Тогда
		Ответ.Вставить("UUID_Документ",МассивДанных.UUID_Документ);

		ДокСсылка = Документы.СписаниеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
		Док = ДокСсылка.ПолучитьОбъект();
		
		Если Док = Неопределено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
			Возврат;
		
		ИначеЕсли Док.Проведен Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(ДокСсылка);
			Возврат;
			
		КонецЕсли;
		
		Док.Товары.Очистить();	
		
	Иначе
		
		Док  = Документы.СписаниеТоваров.СоздатьДокумент();
		
	КонецЕсли;
	
	ДокСтруктура = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,МассивДанных,Док);
	Док.Заполнить(ДокСтруктура);
	//	
	//	

	Попытка
		Если НЕ	Док.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Ошибка проверки корректности документа";
		КонецЕсли;
		
	Исключение
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Ошибка проверки заполнения документа";
		Возврат;
		
	КонецПопытки;	
	НачатьТранзакцию();	
	Попытка
		
		Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		
		Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
		
		
		Результат.Результат = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Ошибка записи документа: "+ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	Результат.Ответ = Ответ;
	
	
	
КонецПроцедуры

Процедура ЗаписатьТоварыИнвентаризации(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	КонтрагентТСДКод =  ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьКонтрагента(МассивДанных.UUID_Контрагента).Код;
	СкладТСД = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСклад(МассивДанных.UUID_Склад);
	        
	Попытка
		НаборЗаписей = РегистрыСведений.ТК_ДанныеИнвентаризацийТСД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкладКомпании.Установить(СкладТСД);
		НаборЗаписей.Отбор.НомерДокумента.Установить(КонтрагентТСДКод);
		
		ДатаЗагрузки = ТекущаяДата();
		
		тзДанные = НаборЗаписей.ВыгрузитьКолонки();
		
		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
			Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул");
			Если Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если ЗначениеЗаполнено(СтрокаТовар.МРЦ) Тогда
				Попытка 
					МРЦЧисло = Число(СтрокаТовар.МРЦ);
				Исключение
					МРЦЧисло  = 0;
				КонецПопытки;
			Иначе
				МРЦЧисло = 0; 
				
			КонецЕсли;

			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			
			НоваяЗапись = тзДанные.Добавить();
			НоваяЗапись.СкладКомпании  = СкладТСД;
			НоваяЗапись.НомерДокумента = КонтрагентТСДКод;
			НоваяЗапись.Номенклатура   = Выборка.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ( Выборка.Номенклатура, МРЦЧисло);
			НоваяЗапись.Количество     = СтрокаТовар.Количество * СтрокаТовар.Коэффициент;
			НоваяЗапись.ДатаЗагрузки   = ДатаЗагрузки;

			
		КонецЦикла;
		
		
		тзДанные.Свернуть("СкладКомпании,НомерДокумента,Номенклатура,ХарактеристикаНоменклатуры,ДатаЗагрузки","Количество");
		НаборЗаписей.Загрузить(тзДанные);
		НаборЗаписей.Записать();
		Результат.Результат = Истина;
	Исключение
		Результат.ОписаниеОшибки =  "Ошибка записи документа "+ОписаниеОшибки();
	КонецПопытки;

		
КонецПроцедуры

Процедура СформироватьДокументИнвентаризация(ТорговаяПлощадкаСсылка,МассивДанных,ТипИнвентаризации,Результат)
	
	Ответ = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипИнвентаризации = Перечисления.ТК_ТипыИнвентаризаций.ПоГрафику Тогда
		
		Ответ.Вставить("UUID_Документ",МассивДанных.UUID_Документ);
		
		ДокЗадача = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
		ОбъектЗадача = ДокЗадача.ПолучитьОбъект();
		
		Если ОбъектЗадача = Неопределено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
			Возврат;
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ОбъектЗадача.Предмет) И ТипЗнч(ОбъектЗадача.Предмет) = Тип("ДокументСсылка.Инвентаризация") Тогда
			
			Док  =   ОбъектЗадача.Предмет.ПолучитьОбъект();
			
			Если Док = Неопределено Тогда
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
				Возврат;
				
			ИначеЕсли Док.Проведен Тогда
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(Док.Ссылка);
				Возврат;
				
			КонецЕсли;
			Док.Товары.Очистить();
		Иначе
			Док  = Документы.Инвентаризация.СоздатьДокумент();
		КонецЕсли;
		
		Если ТипЗнч(ДокЗадача.Основание) = Тип("ДокументСсылка.ТК_ГрафикИнвентаризаций") Тогда
			Док.РевизионнаяИнвентаризация = Истина;
		Иначе
			Док.РевизионнаяИнвентаризация = Ложь;
		КонецЕсли;
		
		
		
	Иначе	
		Если МассивДанных.Свойство("UUID_Документ") Тогда
			Ответ.Вставить("UUID_Документ",МассивДанных.UUID_Документ);
			ДокСсылка = Документы.Инвентаризация.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
			Док = ДокСсылка.ПолучитьОбъект();
			
			
			Если Док = Неопределено Тогда
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки =  "Что то пошло не так, документа нет в базе!";
				Возврат;
				
			ИначеЕсли Док.Проведен Тогда
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки =  "Документ уже проведен"+Символы.ПС+Строка(ДокСсылка);
				Возврат;
				
			КонецЕсли;
			
			Док.Товары.Очистить();
			
			
		Иначе
			Док  = Документы.Инвентаризация.СоздатьДокумент();
		КонецЕсли;
		
		
		Док.ТипИнвентаризации = ТипИнвентаризации;
	КонецЕсли;
	
	ДокСтруктура =  ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,МассивДанных,Док);
	Док.Заполнить(ДокСтруктура);
	Док.ТипИнвентаризации = ТипИнвентаризации;
	
	
	Попытка
		Док.Записать();
		Если ТипИнвентаризации <> Перечисления.ТК_ТипыИнвентаризаций.ПоГрафику Тогда
			Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;
	Исключение
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки =  "Ошибка записи документа: "+ОписаниеОшибки();
		Возврат;
	КонецПопытки;

	Попытка
	
		Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		
		Если ТипИнвентаризации = Перечисления.ТК_ТипыИнвентаризаций.ПоГрафику Тогда
			ОбъектЗадача.Предмет = Док.Ссылка;
			ОбъектЗадача.ДатаИсполнения = ТекущаяДатаСеанса();
			ОбъектЗадача.Выполнена = Истина;
			ОбъектЗадача.Записать();
		КонецЕсли;
		Результат.Результат = Истина;
	Исключение
		Результат.Результат = Ложь;
		Ответ.Вставить("UUID_Документ",Строка(Док.Ссылка.УникальныйИдентификатор()));

		Если Док.ДополнительныеСвойства.Свойство("ОшибкиЗаписи") Тогда
			Результат.ОписаниеОшибки =  "Документ записан но не проведен: "+Строка(док.Ссылка)+Символы.ПС+ Док.ДополнительныеСвойства.ОшибкиЗаписи;

		Иначе
			Результат.ОписаниеОшибки =  "Ошибка записи документа "+Символы.ПС+"документ записан но не проведен: "+Строка(док.Ссылка)+Символы.ПС+ОписаниеОшибки();
		КонецЕсли;
	КонецПопытки;
	
	Результат.Ответ = Ответ;

	
КонецПроцедуры

Процедура СформироватьПеремещениеТоваров(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	ОписаниеОшибки ="";
	УстановитьПривилегированныйРежим(Истина);
	
	UUID_Документ 	= Неопределено;
	UUID_Основание  = Неопределено;
	Если МассивДанных.Свойство("UUID_Документ", UUID_Документ) И ЗначениеЗаполнено(UUID_Документ) Тогда

		ТекущееПеремещение = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID_Документ));
		Если ОбщегоНазначения.СсылкаСуществует(ТекущееПеремещение) Тогда
			
			ДокументОбъект = ТекущееПеремещение.ПолучитьОбъект();
			ДокументОбъект.Товары.Очистить();

		Иначе
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Не найден документ """+МассивДанных.ХозОперация+""" с GUID: <" + UUID_Документ + ">";
			Возврат;
		КонецЕсли;
		
		///прием Перемещение из филиала
	ИначеЕсли МассивДанных.Свойство("UUID_Основание", UUID_Основание) И ЗначениеЗаполнено(UUID_Основание) Тогда	
		ПеремещениеРасход = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID_Основание));
		Если НЕ ОбщегоНазначения.СсылкаСуществует(ПеремещениеРасход) Тогда
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки =  "Не найден документ основание с GUID: <" + UUID_Документ + ">";
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	ПеремещениеТоваров.Проведен КАК Проведен
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	НЕ ПеремещениеТоваров.ПометкаУдаления
		|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		|	И ПеремещениеТоваров.ДокументОтгрузки = &ДокументОтгрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеТоваров.МоментВремени УБЫВ");
		
		Запрос.УстановитьПараметр("ДокументОтгрузки", ПеремещениеРасход);
		РезЗапроса = Запрос.Выполнить();
		
		
		Если НЕ РезЗапроса.Пустой() Тогда
			Выборка = РезЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.Проведен Тогда
				Результат.Результат = Ложь;
				Результат.Вставить("ОписаниеОшибки", "Данное перемещение уже проведено!");
				Возврат;
				
			Иначе
				ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
		Иначе
			
			ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			ДокументОбъект.ДокументОтгрузки = ПеремещениеРасход;
			ДокументОбъект.Заполнить(ПеремещениеРасход);
			
			СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ДокументОбъект.ТорговаяПлощадкаПолучатель,"ОсновнойСкладПеремещения");
			Если ЗначениеЗаполнено(СкладПолучатель) Тогда
				ДокументОбъект.СкладКомпанииПолучатель = СкладПолучатель;
			КонецЕсли;
			
			ДокументОбъект.Записать();
			
		КонецЕсли;
		
	Иначе
		ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
	КонецЕсли;
	
	
	СтруктураДокумента = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,МассивДанных,ДокументОбъект);
	ДокументОбъект.Заполнить(СтруктураДокумента);
	Если ПолучитьФункциональнуюОпцию("КонтролерНеПроводитПеремещение") Тогда
		режЗаписи = РежимЗаписиДокумента.Запись;
		режПроведения = РежимПроведенияДокумента.Неоперативный;
	Иначе
		режЗаписи = РежимЗаписиДокумента.Проведение;
		режПроведения = РежимПроведенияДокумента.Оперативный;
	КонецЕсли;

	НачатьТранзакцию();	
	Попытка
		Если ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.ДокументОтгрузки) Тогда
				СсылкаДокументРасход = ДокументОбъект.ДокументОтгрузки;
			ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда
				СсылкаДокументРасход = ДокументОбъект.ДокументОснование;
			Иначе
				ВызватьИсключение "Не указан документ отгрузки!";
			КонецЕсли;
			
			Если НЕ СсылкаДокументРасход.Проведен Тогда
				ДокументОтгрузкиОбъект = СсылкаДокументРасход.ПолучитьОбъект();
				ДокументОтгрузкиОбъект.Дата = ТекущаяДатаСеанса();
				ДокументОтгрузкиОбъект.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);//Результаты ошибок
				ДокументОтгрузкиОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки");
				Если НЕ	ДокументОтгрузкиОбъект.ПроверитьЗаполнение() Тогда
					Если ДокументОтгрузкиОбъект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
						ВызватьИсключение ДокументОтгрузкиОбъект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
					КонецЕсли;	
				КонецЕсли;
				
				Попытка
					ДокументОтгрузкиОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				Исключение
					опОшибка = ОписаниеОшибки();
					опОшибка = опОшибка + ДокументОтгрузкиОбъект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
					ВызватьИсключение опОшибка;
				КонецПопытки;
			КонецЕсли;
			
			СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
				Перечисления.СтатусыСборкиРезервов.Проведен,ТекущаяДатаСеанса(),СтруктураДокумента.Менеджер,ТорговаяПлощадкаСсылка);
				
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(СсылкаДокументРасход,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(СсылкаДокументРасход,СтруктураСостояние);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);

			
			Если ЗначениеЗаполнено(СсылкаДокументРасход.ДокументОснование) И ТипЗнч(СсылкаДокументРасход.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(СсылкаДокументРасход.ДокументОснование,СтруктураСостояние);
		//		РегистрыСведений.ТК_СостояниеДокументов.ЗаписатьИзмененияПоОснованию(СсылкаДокументРасход,СсылкаДокументРасход.ДокументОснование,Перечисления.СтатусыСборкиРезервов.Проведен,СтруктураДокумента.Менеджер,ТорговаяПлощадкаСсылка);
			КонецЕсли;
		//
		ИначеЕсли ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			
			ДокументОбъект.Записать(режЗаписи,режПроведения);
			СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
			Перечисления.СтатусыСборкиРезервов.Отгружен,ТекущаяДатаСеанса(),СтруктураДокумента.Менеджер,ТорговаяПлощадкаСсылка);
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);
			 
			////сразу документ приход не проводя!!
			ДокументОбъектПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокументОбъектПриход.Заполнить(ДокументОбъект.Ссылка);
			ДокументОбъектПриход.Дата = ТекущаяДатаСеанса();
			
			СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ДокументОбъектПриход.ТорговаяПлощадкаПолучатель,"ОсновнойСкладПеремещения");
			Если ЗначениеЗаполнено(СкладПолучатель) Тогда
				ДокументОбъектПриход.СкладКомпанииПолучатель = СкладПолучатель;
			КонецЕсли;
			

			ДокументОбъектПриход.Записать();
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъектПриход.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъектПриход.Ссылка,СтруктураСостояние);

		ИначеЕсли ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
			Перечисления.СтатусыСборкиРезервов.Проведен,ТекущаяДатаСеанса(),СтруктураДокумента.Менеджер,ТорговаяПлощадкаСсылка);
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);
			
		КонецЕсли;


		
		Ответ.Вставить("UUID_Документ",Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));
		Результат.Результат = Истина;
		ДвойнаяПечатнаяФорма = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадкаСсылка,"ПечатнаяФормаДвойнаяПеремещениеТоваров",Ложь);

		ЕстьВозрват = Ложь;
		Если СтруктураДокумента.Свойство("ТоварыВозврат") Тогда
			ЕстьВозрват = Истина;
			ДокументВозврат = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокументВозврат.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);//Результаты ошибок
			ДокументВозврат.ДополнительныеСвойства.Вставить("НеКонтролироватьОстатки");

			ДокументВозврат.Заполнить(СтруктураДокумента.ТоварыВозврат);
			ДокументВозврат.Дата = ТекущаяДатаСеанса();
			ДокументВозврат.ДокументОснование = ДокументОбъект.Ссылка;
			ДокументВозврат.Комментарий = "АКТ";			
			ДокументВозврат.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			Ответ.Вставить("UUID_ДокументВозврат",Строка(ДокументВозврат.Ссылка.УникальныйИдентификатор()));
	
			СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
				Перечисления.СтатусыСборкиРезервов.Рекламация,ТекущаяДатаСеанса(),СтруктураДокумента.Менеджер,ТорговаяПлощадкаСсылка);
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументВозврат.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументВозврат.Ссылка,СтруктураСостояние);

			
			////сразу документ приход не проводя!!
			ДокВозвратПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокВозвратПриход.Заполнить(ДокументВозврат.Ссылка);
			ДокВозвратПриход.Дата = ТекущаяДатаСеанса();
			ДокВозвратПриход.Менеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
			ДокВозвратПриход.Комментарий = "АКТ";
			
			СкладПолучатель = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ДокВозвратПриход.ТорговаяПлощадкаПолучатель,"ОсновнойСкладПеремещения");
			Если ЗначениеЗаполнено(СкладПолучатель) Тогда
				ДокВозвратПриход.СкладКомпанииПолучатель = СкладПолучатель;
			КонецЕсли;

			ДокВозвратПриход.Записать();
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокВозвратПриход.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокВозвратПриход.Ссылка,СтруктураСостояние);
			
			Если СтруктураДокумента.ПечатьНаСервере Тогда
				МассиПечати = Новый Массив;
				МассиПечати.Добавить(ДокументВозврат.Ссылка);
				Если ДвойнаяПечатнаяФорма Тогда
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваровДвойная(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 1;
				Иначе
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваров(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 2;
				КонецЕсли;
				Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
				
				СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
				СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
				СтруктураЗаписи.Макет = "ПерВЗ";
				СтруктураЗаписи.Хранилище = Хранилище;
				
				РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
			КонецЕсли;
		КонецЕсли;
		Если ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			
			Если СтруктураДокумента.ПечатьНаСервере Тогда
				
				МассиПечати = Новый Массив;
				МассиПечати.Добавить(ДокументОбъект.Ссылка);
				Если ДвойнаяПечатнаяФорма Тогда
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваровДвойная(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 1;
				Иначе
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваров(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 2;
				КонецЕсли;
				Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
				
				СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
				СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
				СтруктураЗаписи.Макет = "ПерВЗ";
				СтруктураЗаписи.Хранилище = Хранилище;
				
				РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
				
			КонецЕсли;
		КонецЕсли;
		
		
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Ош = ОписаниеОшибки();
		Результат.Результат = Ложь;
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
			Результат.ОписаниеОшибки =  ДокументОбъект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		Иначе
			Результат.ОписаниеОшибки =  "Ошибка записи документа: "+Ош;
		КонецЕсли;
		Если ЕстьВозрват Тогда
			Результат.ОписаниеОшибки = Результат.ОписаниеОшибки +Символы.ПС+ ДокументВозврат.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		КонецЕсли;
		
		Если ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			Результат.ОписаниеОшибки = Ош;
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	Результат.Ответ = Ответ;

	
	
КонецПроцедуры

Процедура СформироватьДокументПоЗаданию(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	
	УстановитьПривилегированныйРежим(Истина);

	ПечатьНаСервере = Истина;
	Если МассивДанных.Свойство("ПечатьТСД") И МассивДанных.ПечатьТСД = 1 Тогда
		ПечатьНаСервере = Ложь;
	КонецЕсли;

	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
	ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
	типЗнОбъекта = ТипЗнч(ДокЗадание.Основание);
	Если типЗнОбъекта = Тип("ДокументСсылка.ТК_ЗаявкаНаВозвратПоставщику") Тогда
		ДокументОбъект = Документы.ВозвратПоставщику.СоздатьДокумент();
	Иначе
		ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	КонецЕсли;
	ДокументОбъект.Заполнить(ДокЗадание.Основание);
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Менеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	ДокументОбъект.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);//Результаты ошибок

	
	
	тзТоварыДокумента = ДокументОбъект.Товары.Выгрузить();
	тзТоварыДокумента.Очистить();
	тзТоварыДокумента.Колонки.Добавить("ХарактеристикиИспользуются");
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		
		Рез =   ДанныеТовараV2(СтрокаТовар.Артикул,"Артикул");
		Если Рез.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтрокаТовар.МРЦ) Тогда
			Попытка 
				МРЦЧисло = Число(СтрокаТовар.МРЦ);
			Исключение
				МРЦЧисло  = 0;
			КонецПопытки;
		Иначе
			МРЦЧисло = 0; 
			
		КонецЕсли;
	
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		нСтрокаТовары = тзТоварыДокумента.Добавить();
		нСтрокаТовары.Номенклатура     = Выборка.Номенклатура;
		нСтрокаТовары.ЕдиницаИзмерения = Выборка.Единица;
		нСтрокаТовары.Коэффициент      = Выборка.Коэффициент;
		нСтрокаТовары.Количество       = СтрокаТовар.КоличествоВведено;
		нСтрокаТовары.КоличествоБазовое= СтрокаТовар.КоличествоВведено;
		нСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура, МРЦЧисло);
		нСтрокаТовары.СтавкаНДС        = нСтрокаТовары.Номенклатура.СтавкаНДС;

	КонецЦикла;
	
	ДокументОбъект.Товары.Загрузить(тзТоварыДокумента);
	
	Если ПолучитьФункциональнуюОпцию("КонтролерНеПроводитПеремещение") Тогда
		режЗаписи = РежимЗаписиДокумента.Запись;
		режПроведения = РежимПроведенияДокумента.Неоперативный;
	Иначе
		режЗаписи = РежимЗаписиДокумента.Проведение;
		режПроведения = РежимПроведенияДокумента.Оперативный;
	КонецЕсли;

	
	//тРежимЗаписиДокумента = РежимЗаписиДокумента.Запись;
	Если типЗнОбъекта = Тип("ДокументСсылка.ТК_ЗаявкаНаВозвратПоставщику") Тогда
		Документы.ВозвратПоставщику.ЗаполнитьПартииВТЧТовары(ДокументОбъект);
		
		Если ДокументОбъект.Товары.Количество() = 0 Тогда
			
			Результат.ОписаниеОшибки = "Таблица товаров пустая, нечего возвращать!";
			Результат.Результат = Ложь;
			Возврат;
		Иначе
			текОшибка = "";
			Для Каждого стрТовар Из ДокументОбъект.Товары Цикл 
				Если стрТовар.Цена = 0 Тогда
					текОшибка = текОшибка + "порожня ціна "+Строка(стрТовар.Номенклатура)+Символы.ПС;
				КонецЕсли;
			КонецЦикла;
			Если Не ПустаяСтрока(текОшибка) Тогда
				Результат.ОписаниеОшибки = текОшибка;
				Результат.Результат = Ложь;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		Если Не ПечатьНаСервере Тогда
			Ответ.Вставить("ТипДокумента","PrintVP");
		КонецЕсли;
		
		//
		//Если  Справочники.ПодразделенияКомпании.ЭтоАттика(ДокументОбъект.ПодразделениеКомпании) Тогда
		//	
		
		
		Если НЕ	ДокументОбъект.ПроверитьЗаполнение() Тогда
			
			
			Если ДокументОбъект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				
				Результат.ОписаниеОшибки =  ДокументОбъект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
			Иначе
				Результат.ОписаниеОшибки = "Ошибка проверки заполнения документа";
			КонецЕсли;
			Результат.Результат = Ложь;
			Возврат;
		КонецЕсли;
		
		//		КонецЕсли;
		
		режЗаписи = РежимЗаписиДокумента.Проведение;
		режПроведения = РежимПроведенияДокумента.Оперативный;

	ИначеЕсли  типЗнОбъекта = Тип("ДокументСсылка.ТК_ЗаявкаНаПеремещение") Тогда
		
		
		ЦеныБезХарактеристики = Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокументОбъект.СкладКомпании,ТекущаяДатаСеанса());
		СтруктураДействий = Новый Структура;
		СтруктураПолейДляЗаполненияЦен = Новый Структура;		
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена",Новый Структура("Дата,ГраницаИсклюая,ТипЦен",ТекущаяДатаСеанса(),Ложь,ДокументОбъект.ТипЦен));
		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
		Если ЦеныБезХарактеристики Тогда 
			СтруктураДействий.Вставить("ЦеныБезХарактеристики", Истина);
		КонецЕсли;
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");

		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументОбъект.Товары,СтруктураДействий,Неопределено);
		
		//тРежимЗаписиДокумента  = РежимЗаписиДокумента.Проведение;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		
		
		ДокументОбъект.Записать(режЗаписи,режПроведения);
		
		Если  типЗнОбъекта = Тип("ДокументСсылка.ТК_ЗаявкаНаПеремещение") Тогда
			
			
			СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
				Перечисления.СтатусыСборкиРезервов.Отгружен,ТекущаяДатаСеанса(),ДокументОбъект.Менеджер,ТорговаяПлощадкаСсылка);
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъект.Ссылка,СтруктураСостояние);

				////сразу документ приход не проводя!!
			ДокВозвратПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();
			ДокВозвратПриход.Заполнить(ДокументОбъект.Ссылка);
			ДокВозвратПриход.Дата = ТекущаяДатаСеанса();
			ДокВозвратПриход.Менеджер = ДокументОбъект.Менеджер;
			ДокВозвратПриход.СкладКомпанииПолучатель = ДокументОбъект.СкладКомпанииПолучатель;
			
			ДокВозвратПриход.Записать();
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокВозвратПриход.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокВозвратПриход.Ссылка,СтруктураСостояние);
			
		КонецЕсли;
		
		
		ОбъектЗаявка = ДокЗаданиеОбъект.Основание.ПолучитьОбъект();
		ОбъектЗаявка.ОбменДанными.Загрузка = Истина;
		ОбъектЗаявка.ДокументОтгрузки = ДокументОбъект.Ссылка;
		ОбъектЗаявка.Выполнено = Истина;
		ОбъектЗаявка.Записать();
		
		
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		ДокЗаданиеОбъект.Предмет = ДокументОбъект.Ссылка;
		
		ДокЗаданиеОбъект.Записать();
		ЗафиксироватьТранзакцию();
	
		
		Если ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал И ПечатьНаСервере Тогда
			
			
			МассиПечати = Новый Массив;
			МассиПечати.Добавить(ДокументОбъект.Ссылка);
			
			Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваров(МассиПечати,Новый СписокЗначений,Новый Структура);
			Табдок.КоличествоЭкземпляров = 2;
			Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
			
			СтруктураЗаписи = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
			СтруктураЗаписи.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
			СтруктураЗаписи.Макет = "ПерЗЯ";
			СтруктураЗаписи.Хранилище = Хранилище;
			
			РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписи);
			
		КонецЕсли;	
		Ответ.Вставить("UUID_Документ",Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));
		Результат.Результат = Истина;
		Результат.Ответ = Ответ;
 
	Исключение
		ОписаниеШибки = "";
		
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
			ОписаниеШибки =  ДокументОбъект.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		КонецЕсли;

		ОтменитьТранзакцию();
		Результат.Результат = Ложь;
		
		Результат.ОписаниеОшибки = ОписаниеШибки + ОписаниеОшибки();

	КонецПопытки;
	
	
	
КонецПроцедуры

Процедура ЗакрытьЗадачуВерификации(ПодразделениеСсылка,МассивДанных,Результат)
	
	Ответ = Новый Структура;
	УстановитьПривилегированныйРежим(Истина);
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
	ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
	ДокЗаданиеОбъект.Выполнена = Истина;
	ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
	ДокЗаданиеОбъект.Записать();
	Результат.Результат = Истина;
	Результат.Ответ = Ответ;
	
КонецПроцедуры

Процедура СформироватьОтгрузкуКонтролер(ТорговаяПлощадкаСсылка,МассивДанных,Результат)Экспорт
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	ДокументСсылка =  Документы.РезервированиеЗаказовПокупателя.ПолучитьСсылку(ИД_Документа);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда 
		Результат.ОписаниеОшибки = "Документ не нейден.";  
		Возврат;
	КонецЕсли;
	
	
	Если ДокументСсылка.ПометкаУдаления Тогда
		Результат.ОписаниеОшибки = "Выбранный документ помечен на удаление!";  
		Возврат;
	КонецЕсли;
	

	
	Если НЕ ДокументСсылка.РаспределениеОтгрузки.Количество() = 0 Тогда
		ДокЗаказ = ДокументСсылка.РаспределениеОтгрузки[0].ЗаказПокупателя;
	ИначеЕсли  ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
		ДокЗаказ = ДокументСсылка.ДокументОснование;
	Иначе
		Результат.ОписаниеОшибки = "Без документа заказа контроль не возможен";  
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&ДокЗаказ) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.РеализацияТоваров
	               |	И СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СвязанныеДокументы.Ссылка
	               |ИЗ
	               |	КритерийОтбора.СвязанныеДокументы(&ДокЗаказ) КАК СвязанныеДокументы
	               |ГДЕ
	               |	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	               |	И СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокЗаказ", ДокЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда	
		Результат.ОписаниеОшибки = "Документ уже отгружен";
		Возврат;
	КонецЕсли;
	
	//текСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокументСсылка);
	//ОписаниеСтатуса = "";
	//Если НЕ ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.НеНачат,ОписаниеСтатуса)
	//	и НЕ ПроверитьСтатусДокумента(текСостояние,Перечисления.СтатусыСборкиРезервов.ГотовКСборке,ОписаниеСтатуса) Тогда
	//	Результат.ОписаниеОшибки = ОписаниеСтатуса;  
	//	Возврат ;
	//КонецЕсли;

	ТоварыТСД = Новый ТаблицаЗначений;;
	ТоварыТСД.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыТСД.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТоварыТСД.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ТоварыТСД.Колонки.Добавить("Количество",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		
		Если СтрокаТовар.КоличествоВведено = 0  Тогда
			Продолжить;
		КонецЕсли;
		
		Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул",Истина);
		Если Рез.Пустой() Тогда
			стч = ТоварыТСД.Добавить();
			стч.Количество = СтрокаТовар.КоличествоВведено;
			Продолжить;
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		стч = ТоварыТСД.Добавить();
		стч.Номенклатура =  Выборка.Номенклатура;
		стч.Количество = СтрокаТовар.КоличествоВведено;
		стч.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиЕдиницуИзмеренийПоКоф(Выборка.Номенклатура,СтрокаТовар.Коэффициент);
		Попытка
			ЧислоМРЦ = Число(СтрокаТовар.МРЦ);
		Исключение
			ЧислоМРЦ = 0;
		КонецПопытки;
		стч.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура,ЧислоМРЦ);
		
		
	КонецЦикла;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.ХозОперация КАК ХозОперация,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗаказПокупателя.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗаказПокупателя.КурсДокумента КАК КурсДокумента,
	|	ЗаказПокупателя.ТипЦен КАК ТипЦен,
	|	ЗаказПокупателя.СкладКомпании КАК СкладКомпании,
	|	ЗаказПокупателя.РегламентированныйУчет КАК РегламентированныйУчет,
	|	ЗаказПокупателя.ТочкаДоставки КАК ТочкаДоставки,
	|	ЗаказПокупателя.ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель,
	|	ЗаказПокупателя.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ДокЗаказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	РеквизитыЗаказа = РезультатЗапроса.Выбрать();
	РеквизитыЗаказа.Следующий();
	МенеджерСборки = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	
	Если МассивДанных.Свойство("НачалоКонтроля") Тогда
		НачалоКонтроля = МассивДанных.НачалоКонтроля
	Иначе
		НачалоКонтроля =  '00010101';
	КонецЕсли;
	
	СтруктураОчередиНаСборку = Новый Структура("СотрудникКонтроля,Статус,НачалоКонтроля,КонецКонтроля",МенеджерСборки,Перечисления.СтатусыСборкиРезервов.Отгружен,НачалоКонтроля,ТекущаяДатаСеанса());
	
	Если ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(РеквизитыЗаказа.Контрагент) Тогда		
		
		ДокПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ДокПеремещение.Дата = ТекущаяДата();
		ДокПеремещение.Автор = Пользователи.ТекущийПользователь();
		ДокПеремещение.Менеджер = МенеджерСборки;
 
		ДокПеремещение.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПеремещениеТоваровВФилиал");
		ДокПеремещение.ДокументОснование = РеквизитыЗаказа.Ссылка;
		
		СписокСвойств = "РегламентированныйУчет, Организация, ПодразделениеКомпании, ТорговаяПлощадка, ТорговаяПлощадкаПолучатель, СкладКомпании, ВалютаДокумента, КурсДокумента";
		ЗаполнитьЗначенияСвойств(ДокПеремещение, РеквизитыЗаказа, СписокСвойств);	
		ДокПеремещение.СкладКомпанииПолучатель = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(ДокПеремещение.ТорговаяПлощадкаПолучатель);
		ДокПеремещение.ТипЦен = Справочники.СкладыКомпании.ТипЦенРозничный(ДокПеремещение.СкладКомпанииПолучатель);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
		СтруктураДействий.Вставить("ЗаполнитьЦены", Новый Структура("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокПеремещение)));//РеквизитыОснование.Ссылка)));
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
		СтруктураДействий.Вставить("ЦеныБезХарактеристики", Справочники.СкладыКомпании.НеВестиУчетПоХарактеристикамНаСкладе(ДокПеремещение.СкладКомпанииПолучатель, ДокПеремещение.Дата));		
		
		Для Каждого стрТовар Из ТоварыТСД Цикл 		
			
			новСтрока = ДокПеремещение.Товары.Добавить();		
			ЗаполнитьЗначенияСвойств(новСтрока, стрТовар);
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(новСтрока, СтруктураДействий, ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения());	
		КонецЦикла;
		
		ДокПеремещение.СуммаДокумента = ДокПеремещение.Товары.Итог("СуммаВсего");			
		ДокПеремещение.УстановитьНовыйНомер();
		безОшибок = Истина;
		
		
		Если ПолучитьФункциональнуюОпцию("КонтролерНеПроводитПеремещение") Тогда
			режЗаписи = РежимЗаписиДокумента.Запись;
			режПроведения = РежимПроведенияДокумента.Неоперативный;
			
		Иначе
			режЗаписи = РежимЗаписиДокумента.Проведение;
			режПроведения = РежимПроведенияДокумента.Оперативный;
		КонецЕсли;

		СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
			Перечисления.СтатусыСборкиРезервов.Отгружен,ТекущаяДатаСеанса(),МенеджерСборки,ТорговаяПлощадкаСсылка);
		
		НачатьТранзакцию();	
		Попытка
			ДокПеремещение.Записать(режЗаписи, режПроведения);
			//Состояение документа перемещение 
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокПеремещение.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокПеремещение.Ссылка,СтруктураСостояние);
			 //Состояение документа Резерв "очередь на сборку" 
			РегистрыСведений.ТК_ОчередьНаСборкуРезервов.ОбновитьОчередь(ДокументСсылка,СтруктураОчередиНаСборку);
			//Состояение документа Резерв 
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка,СтруктураСостояние);

			
			Если ЗначениеЗаполнено(ДокПеремещение.ДокументОснование) Тогда
				     //Состояение документа Основание 
					РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокПеремещение.ДокументОснование,СтруктураСостояние);
       
					РегистрыСведений.ТК_СостояниеДокументов.ЗаписатьИзмененияПоОснованию(
						ДокПеремещение.Ссылка,ДокПеремещение.ДокументОснование,Перечисления.СтатусыСборкиРезервов.Отгружен,МенеджерСборки,ТорговаяПлощадкаСсылка);	   
			КонецЕсли;
			
			ДокПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();			
			ДокПриход.Заполнить(ДокПеремещение.Ссылка);			
			ДокПриход.Дата = ТекущаяДатаСеанса();
			ДокПриход.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Оперативный);
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокПриход.Ссылка,СтруктураСостояние);
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокПриход.Ссылка,СтруктураСостояние );
			
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			безОшибок = Ложь;
			Результат.ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		Если безОшибок Тогда
			Если МассивДанных.Свойство("ПечатьТСД") И МассивДанных.ПечатьТСД = 0 Тогда
				
				ДвойнаяПечатнаяФорма = ЗначениеНастроекПовтИсп.ПолучитьЗначениеНастройкиТСД(ТорговаяПлощадкаСсылка,"ПечатнаяФормаДвойнаяПеремещениеТоваров",Ложь);
				
				МассиПечати = Новый Массив;
				МассиПечати.Добавить(ДокПеремещение.Ссылка);
				Если ДвойнаяПечатнаяФорма Тогда
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваровДвойная(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 1;
				Иначе
					Табдок = Документы.ПеремещениеТоваров.ПечатьПеремещениеТоваров(МассиПечати,Новый СписокЗначений,Новый Структура);
					Табдок.КоличествоЭкземпляров = 2;
				КонецЕсли;
				Хранилище = Новый ХранилищеЗначения(Табдок,Новый СжатиеДанных(9));
				
				СтруктураЗаписиОчередьПечати = РегистрыСведений.ТК_ОчередьПечатиТСД.СформироватьСтруктуруЗаписи();
				СтруктураЗаписиОчередьПечати.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
				СтруктураЗаписиОчередьПечати.СкладКомпании = ДокПеремещение.СкладКомпании;
				
				СтруктураЗаписиОчередьПечати.Макет = "ПерРН";
				СтруктураЗаписиОчередьПечати.Хранилище = Хранилище;
				
				РегистрыСведений.ТК_ОчередьПечатиТСД.ЗаписатьОчередьПечати(СтруктураЗаписиОчередьПечати);
				
			ИначеЕсли МассивДанных.Свойство("ПечатьТСД") И МассивДанных.ПечатьТСД = 1 Тогда
				Результат.Ответ = Новый Структура("ПечатнаяФорма",Новый Структура("ТипДокумента,UUID_Документ","PrintPR",Строка(ДокПеремещение.Ссылка.УникальныйИдентификатор())));
			КонецЕсли;
		КонецЕсли;
		
		
	Иначе
		
		//Попытка
			ДокРеализация = Документы.РеализацияТоваров.СоздатьДокумент();
			ДокРеализация.Дата = ТекущаяДата();
			ДокРеализация.Автор = Пользователи.ТекущийПользователь();
			ДокРеализация.Менеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);

			ДокРеализация.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РеализацияТоваров");
			ДокРеализация.ДокументОснование = РеквизитыЗаказа.Ссылка;
			
			СписокСвойств = "РегламентированныйУчет, Организация, ПодразделениеКомпании, ТорговаяПлощадка, СкладКомпании, Контрагент, ДоговорВзаиморасчетов, ВалютаДокумента, КурсДокумента, ТочкаДоставки";
			ЗаполнитьЗначенияСвойств(ДокРеализация, РеквизитыЗаказа, СписокСвойств);	
			
			ДокРеализация.Товары.Загрузить(ТоварыТСД);
			
			тзТовары = ДокРеализация.Товары.Выгрузить();
			тзТовары.Колонки.Добавить("ХарактеристикиИспользуются");
			тзТовары.Колонки.Добавить("ГруппаЦенообразования");
			тзТовары.Колонки.Добавить("ТипЦен");
			
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокРеализация.Организация,ДокРеализация.ТорговаяПлощадка,"Реализация"));
			СтруктураДействий.Вставить("ЗаполнитьЦены", Новый Структура("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокРеализация))); //РеквизитыОснование.Ссылка)));
			СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			
			///Цены из договора по группе ценообразования
			СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	
			СтруктураДействий.Вставить("ПересчитатьСуммуВсегоОкругление",ДокРеализация.РегламентированныйУчет);
			
			СтруктураДействий.Вставить("ЗаполнитьГруппуЦенообразования",	Новый Структура("Номенклатура","ГруппаЦенообразования"));
			СтруктураДействий.Вставить("ЦеныИзДоговора",ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровТипаЦенПоДоговору(ДокРеализация));
			
			
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(тзТовары,СтруктураДействий,Неопределено);
			
			ДокРеализация.ТипЦен = тзТовары[0].ТипЦен;
			ДокРеализация.Товары.Загрузить(тзТовары);
			
			ОбработкаТабличнойЧастиСервер.СортироватьТЧ(ДокРеализация.Товары);
			ДокРеализация.СуммаДокумента = ДокРеализация.Товары.Итог("СуммаВсего");
			ДокРеализация.УстановитьНовыйНомер();
			
			безОшибок = ДокРеализация.ПроверитьЗаполнение();
			Если безОшибок Тогда 		
				Попытка
					ДокРеализация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);		
					РегистрыСведений.ТК_ОчередьНаСборкуРезервов.ОбновитьОчередь(ДокументСсылка,СтруктураОчередиНаСборку);

				Исключение
					безОшибок = Ложь;
					Результат.ОписаниеОшибки = "Ошибка проведения реализации: " + ОписаниеОшибки();

				КонецПопытки;
			Иначе
				Результат.ОписаниеОшибки =  "Документ реализация не может быть проведен. Не заполнены основные реквизиты";
			КонецЕсли;
			Результат.Ответ = Новый Структура();

		//Исключение
		//	безОшибок = Ложь;
		//	Результат.ОписаниеОшибки = "Ошибка проведения реализации: " + ОписаниеОшибки();
		//КонецПопытки;
		
	КонецЕсли;
	
	Результат.Результат = безОшибок;
КонецПроцедуры

Процедура ЗаписатьДанныеСканированияТБД(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(ИД_Документа);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Выполнена") Тогда
		Результат.ОписаниеОшибки =  "Задание ТБД уже выплненно";
		Возврат;
	КонецЕсли;
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	СкладКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Склад");
	ПодразделениеКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадкаСсылка,"ПодразделениеКомпании");

	ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
	
//	МассивТоварыИН = Новый Массив;

	НачатьТранзакцию();        
	
	Попытка
		НаборЗаписей = РегистрыСведений.ТК_ТБД_ИтогиСканирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(ДокЗадание);
		НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадкаСсылка);
		
		тзДанные = НаборЗаписей.ВыгрузитьКолонки();
		ДатаЗагрузки = ТекущаяДатаСеанса();
		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
			Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул");
			Если Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			
			НоваяЗапись = тзДанные.Добавить();
			НоваяЗапись.Задание  = ДокЗадание;
			НоваяЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
			НоваяЗапись.Номенклатура   = Выборка.Номенклатура;
			
			НоваяЗапись.ОтсканированоТовар      = СтрокаТовар.СканированиеТовар;
			НоваяЗапись.ОтсканированоЦенник     = СтрокаТовар.СканированиеЦенник;
			//НоваяЗапись.ЦенаПроверена           = СтрокаТовар.ЦенаПроверена;

			НоваяЗапись.ДатаЗагрузки  = ДатаЗагрузки;
			НоваяЗапись.Исполнитель   = СтрудникМенеджер;
			
			//Если СтрокаТовар.СканированиеТовар = 0 Тогда
			//	МассивТоварыИН.Добавить(Выборка.Номенклатура);
			//КонецЕсли;
			//
			
		КонецЦикла;
		
		тзДанные.Свернуть("Задание,ТорговаяПлощадка,Номенклатура,ДатаЗагрузки,Исполнитель","ОтсканированоТовар,ОтсканированоЦенник,ЦенаПроверена");
		НаборЗаписей.Загрузить(тзДанные);
		НаборЗаписей.Записать();
		
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();

//		Если МассивТоварыИН.Количество() > 0  Тогда
//			
//			ДокОбъектИН = Документы.Инвентаризация.СоздатьДокумент();
//			ДокОбъектИН.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров;
//			ДокОбъектИН.Дата = ТекущаяДатаСеанса();
//			ДокОбъектИН.ПодразделениеКомпании  = ПодразделениеКомпании;
//			ДокОбъектИН.Автор = Пользователи.ТекущийПользователь();
//			ДокОбъектИН.ЗадачаТСД = ДокЗадание;
//			ДокОбъектИН.Менеджер = СтрудникМенеджер;
//			ДокОбъектИН.Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадкаСсылка);
//			ДокОбъектИН.СкладКомпании = СкладКомпании;
//			ДокОбъектИН.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
//			ДокОбъектИН.ТипИнвентаризации = Перечисления.ТК_ТипыИнвентаризаций.ТБД;
//			ДокОбъектИН.ТипЦенИтогов =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладКомпании,"ТипЦенРозничнойТорговли");
//			
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
//			|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
//			|	ОстаткиТоваровКомпанииОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
//			|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
//			|ИЗ
//			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
//			|			,
//			|			СкладКомпании = &СкладКомпании
//			|				И Номенклатура В (&Номенклатура)) КАК ОстаткиТоваровКомпанииОстатки";
//			
//			Запрос.УстановитьПараметр("Номенклатура", МассивТоварыИН);
//			Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
//			
//			РезультатЗапроса = Запрос.Выполнить();
//			
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			Ид_Склада = Строка(СкладКомпании.УникальныйИдентификатор());
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//				Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
//				Ид_Характеристика = Строка(ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
//				
//				Попытка 
//					
//					Продажа = ОбменФронт.ПолучитьКоличествоПродажПоОтбору(ПодразделениеПродажи,ВыборкаДетальныеЗаписи.Артикул,Ид_Склада, Ид_Характеристика);
//					Если ТипЗнч(Продажа) <> Тип("Число") Тогда
//						Продажа = 0;
//					КонецЕсли;
//					
//				Исключение
//					Продажа = 0;
//				КонецПопытки;
//				
//				
//				нстрТовары = ДокОбъектИН.Товары.Добавить();
//				нстрТовары.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
//				нстрТовары.ХарактеристикаНоменклатуры = ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры;
//				нстрТовары.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ОсновнаяЕдиницаИзмерения;
//				нстрТовары.Коэффициент = 1;
//				нстрТовары.Количество = Продажа-Остаток;
//				нстрТовары.КоличествоКнижн = Остаток;
//				нстрТовары.КоличествоФакт = Продажа;
//			КонецЦикла;
//			
//			ДокОбъектИН.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
//			ДокЗаданиеОбъект.Предмет = ДокОбъектИН.Ссылка;
//		КонецЕсли;
		
		ДокЗаданиеОбъект.Записать();

		Результат.Результат = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Результат.ОписаниеОшибки =  "Ошибка записи документа "+ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьДанныеСканированияТБД_V2(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(ИД_Документа);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Выполнена") Тогда
		Результат.ОписаниеОшибки =  "Задание ТБД уже выплненно";
		Возврат;
	КонецЕсли;
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	СкладКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Склад");
	ПодразделениеКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадкаСсылка,"ПодразделениеКомпании");
	
	ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
	
	МассивТоварыИН = Новый Массив;
	
	НачатьТранзакцию();        
	
	Попытка
		НаборЗаписей = РегистрыСведений.ТК_ТБД_ИтогиСканирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(ДокЗадание);
		НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадкаСсылка);
		
		тзДанные = НаборЗаписей.ВыгрузитьКолонки();
		тзДанные.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
		тзДанные.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		тзДанные.Колонки.Добавить("Продажа",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		тзДанные.Колонки.Добавить("Остаток",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		
		ДатаЗагрузки = ТекущаяДатаСеанса();
		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
			Рез =   ДанныеТовара(СтрокаТовар.Артикул,"Артикул");
			Если Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				ЧислоМРЦ = Число(СтрокаТовар.МРЦ);
			Исключение
				ЧислоМРЦ = 0;
			КонецПопытки;
			
			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			
			НоваяЗапись = тзДанные.Добавить();
			НоваяЗапись.Задание  = ДокЗадание;
			НоваяЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
			НоваяЗапись.Номенклатура   = Выборка.Номенклатура;
			НоваяЗапись.ЕдиницаИзмерения   = Выборка.Еденица;
			
			НоваяЗапись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Выборка.Номенклатура,ЧислоМРЦ);
			НоваяЗапись.ОтсканированоТовар      = СтрокаТовар.СканированиеТовар;
			НоваяЗапись.ОтсканированоЦенник     = СтрокаТовар.СканированиеЦенник;
			НоваяЗапись.ЦенаПроверена           = СтрокаТовар.ЦенаПроверена;
			
			НоваяЗапись.ДатаЗагрузки  = ДатаЗагрузки;
			НоваяЗапись.Исполнитель   = СтрудникМенеджер;
			НоваяЗапись.Продажа           = СтрокаТовар.Продажи;
			НоваяЗапись.Остаток           = СтрокаТовар.Остаток;

		КонецЦикла;
		
		
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		
		
		ДокОбъектИН = Документы.Инвентаризация.СоздатьДокумент();
		ДокОбъектИН.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров;
		ДокОбъектИН.Дата = ТекущаяДатаСеанса();
		ДокОбъектИН.ПодразделениеКомпании  = ПодразделениеКомпании;
		ДокОбъектИН.Автор = Пользователи.ТекущийПользователь();
		ДокОбъектИН.ЗадачаТСД = ДокЗадание;
		ДокОбъектИН.Менеджер = СтрудникМенеджер;
		ДокОбъектИН.Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадкаСсылка);
		ДокОбъектИН.СкладКомпании = СкладКомпании;
		ДокОбъектИН.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		ДокОбъектИН.ТипИнвентаризации = Перечисления.ТК_ТипыИнвентаризаций.ТБД;
		ДокОбъектИН.ТипЦенИтогов =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладКомпании,"ТипЦенРозничнойТорговли");
		
		мСтрокиДляУдаления = Новый Массив;
		Для Каждого СтрТовар Из тзДанные Цикл 
			
			нстрТовары = ДокОбъектИН.Товары.Добавить();
			нстрТовары.Номенклатура = СтрТовар.Номенклатура;
			нстрТовары.ХарактеристикаНоменклатуры = СтрТовар.ХарактеристикаНоменклатуры;
			нстрТовары.ЕдиницаИзмерения = СтрТовар.ЕдиницаИзмерения;
			нстрТовары.Коэффициент = 1;
			нстрТовары.КоличествоКнижн = СтрТовар.Остаток;
			нстрТовары.КоличествоФакт = СтрТовар.ОтсканированоТовар+СтрТовар.Продажа;
			нстрТовары.Количество = нстрТовары.КоличествоФакт - нстрТовары.КоличествоКнижн;
			Если нстрТовары.Количество = 0 Тогда
				мСтрокиДляУдаления.Добавить(нстрТовары);
			КонецЕсли;
			
		КонецЦикла;
		Для Каждого стрУдалить Из мСтрокиДляУдаления Цикл 
			ДокОбъектИН.Товары.Удалить(стрУдалить);
		КонецЦикла;
		
		Если ДокОбъектИН.Товары.Количество()>0 Тогда
			ДокОбъектИН.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			ДокЗаданиеОбъект.Предмет = ДокОбъектИН.Ссылка;
		КонецЕсли;
		тзДанные.Свернуть("Задание,ТорговаяПлощадка,Номенклатура,ДатаЗагрузки,Исполнитель","ОтсканированоТовар,ОтсканированоЦенник,ЦенаПроверена");
		НаборЗаписей.Загрузить(тзДанные);
		НаборЗаписей.Записать();
		
		
		ДокЗаданиеОбъект.Записать();
		
		Результат.Результат = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Результат.ОписаниеОшибки =  "Ошибка записи документа "+ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьДанныеСканированияТНП(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(ИД_Документа);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Выполнена") Тогда
		Результат.ОписаниеОшибки =  "Задание ТБД уже выплненно";
		Возврат;
	КонецЕсли;
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	СкладКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Склад");
	ПодразделениеКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадкаСсылка,"ПодразделениеКомпании");
	ДатаЗагрузки = ТекущаяДатаСеанса();
	

	
	//МассивТоварыИН = Новый Массив;
	МассивТоварыПР = Новый Массив;
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		
		//Если СтрокаТовар.КоличествоВведено = 0 Тогда
		//	//	МассивТоварыИН.Добавить(Новый Структура("Артикул,МРЦ,Количество,Коэффициент,Продажи",СтрокаТовар.Артикул,СтрокаТовар.МРЦ,0,1,0));
		//Иначе
		Если СтрокаТовар.КоличествоВведено > 0 Тогда
			МассивТоварыПР.Добавить(Новый Структура("Артикул,МРЦ,Количество,Коэффициент,Продажи",СтрокаТовар.Артикул,СтрокаТовар.МРЦ,СтрокаТовар.КоличествоВведено,СтрокаТовар.Коэффициент,0));
		КонецЕсли;
		
		спрНоменклатура = Справочники.Номенклатура.НайтиНоменклатуруПоАртикулу(СтрокаТовар.Артикул);
		НаборЗаписей = РегистрыСведений.ТК_ТНП_ИтогиСканирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(ДокЗадание);
		НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадкаСсылка);
		НаборЗаписей.Отбор.Номенклатура.Установить(спрНоменклатура);
		нЗаписьНабора = НаборЗаписей.Добавить();
		нЗаписьНабора.Задание = ДокЗадание;
		нЗаписьНабора.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		нЗаписьНабора.Номенклатура = спрНоменклатура;
		нЗаписьНабора.ОтсканированоТовар = СтрокаТовар.СканированиеТовар;
		нЗаписьНабора.ОтсканированоЦенник = СтрокаТовар.СканированиеЦенник;
		нЗаписьНабора.ДатаЗагрузки = ДатаЗагрузки;
		нЗаписьНабора.Исполнитель = СтрудникМенеджер;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	сдПеремещение = Новый Структура;
	сдПеремещение.Вставить("UUID_Сотрудник",МассивДанных.UUID_Сотрудник);
	сдПеремещение.Вставить("ХозОперация","ПеремещениеТоваров");
	сдПеремещение.Вставить("UUID_СкладОтправитель",МассивДанных.UUID_СкладОтправитель);
	сдПеремещение.Вставить("UUID_Склад",МассивДанных.UUID_Склад);
	сдПеремещение.Вставить("UUID_Причина",МассивДанных.UUID_Причина);
	
	сдПеремещение.Вставить("Товары",МассивТоварыПР);

	ДокументОбъектПеремещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъектПеремещение.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);

	СтруктураДокумента = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,сдПеремещение,ДокументОбъектПеремещение);
	ЕстьТоварыПеремещения = СтруктураДокумента.Товары.Количество()>0;
	Если ЕстьТоварыПеремещения Тогда
		ДокументОбъектПеремещение.Заполнить(СтруктураДокумента);
		
		РезультатПроверки = ДокументОбъектПеремещение.ПроверитьЗаполнение();
		Если НЕ РезультатПроверки Тогда
			Если ДокументОбъектПеремещение.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				Результат.ОписаниеОшибки =  ДокументОбъектПеремещение.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
			Иначе
				Результат.ОписаниеОшибки = "Ошибка проверки заполнения документа перемещение товаров";
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	//ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
	//
	//сдИнвентаризация = Новый Структура;
	//сдИнвентаризация.Вставить("UUID_Сотрудник",МассивДанных.UUID_Сотрудник);
	//сдИнвентаризация.Вставить("ХозОперация","ИнвентаризацияТоваров");
	//сдИнвентаризация.Вставить("UUID_Склад",МассивДанных.UUID_СкладОтправитель);
	//сдИнвентаризация.Вставить("ПродажиОС",Истина);
	//сдИнвентаризация.Вставить("ПодразделениеПродажиОС",ПодразделениеПродажи);
	//сдИнвентаризация.Вставить("Товары",МассивТоварыИН);

	//ДокументОбъектИнвентаризация = Документы.Инвентаризация.СоздатьДокумент();
	//ДокументОбъектИнвентаризация.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);

	//СтруктураДокумента = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,сдИнвентаризация,ДокументОбъектИнвентаризация);
	//СтруктураДокумента.Вставить("ЗадачаТСД",ДокЗадание);
	//СтруктураДокумента.Вставить("ТипИнвентаризации",Перечисления.ТК_ТипыИнвентаризаций.ТНП);
	//
	//ЕстьТоварыИнвентаризация = СтруктураДокумента.Товары.Количество()>0;
	//Если ЕстьТоварыИнвентаризация Тогда
	//	ДокументОбъектИнвентаризация.Заполнить(СтруктураДокумента);
	//	
	//	РезультатПроверки = ДокументОбъектИнвентаризация.ПроверитьЗаполнение();
	//	Если НЕ РезультатПроверки Тогда
	//		Если ДокументОбъектИнвентаризация.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
	//			Результат.ОписаниеОшибки =  ДокументОбъектИнвентаризация.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
	//		Иначе
	//			Результат.ОписаниеОшибки = "Ошибка проверки заполнения документа инвентаризация товаров";
	//		КонецЕсли;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	НачатьТранзакцию();        
	
	Попытка
		Если ЕстьТоварыПеремещения Тогда
			ДокументОбъектПеремещение.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		КонецЕсли;
		//Если ЕстьТоварыИнвентаризация Тогда
		//	ДокументОбъектИнвентаризация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
		//КонецЕсли;
		
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		Если ЕстьТоварыПеремещения Тогда
			ДокЗаданиеОбъект.Предмет = ДокументОбъектПеремещение.Ссылка;
		КонецЕсли;
		ДокЗаданиеОбъект.Записать();
		
		Результат.Результат = Истина;

		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОШ = "";
		Если ДокументОбъектПеремещение.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
			ОШ = ДокументОбъектПеремещение.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		КонецЕсли;
		//Если ДокументОбъектИнвентаризация.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
		//	ОШ = ОШ + ДокументОбъектИнвентаризация.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		//КонецЕсли;
		Если ПустаяСтрока(ОШ) Тогда
			ОШ = ОписаниеОшибки();
		КонецЕсли;
		Результат.ОписаниеОшибки =  "Ошибка проведение документа "+ОШ;

	КонецПопытки;
	

КонецПроцедуры

Процедура ЗаписатьДанныеСканированияВФ(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(ИД_Документа);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Выполнена") Тогда
		Результат.ОписаниеОшибки =  "Задание ВФ уже выплненно";
		Возврат;
	КонецЕсли;
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	СкладКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Склад");
	ПодразделениеКомпании = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговаяПлощадкаСсылка,"ПодразделениеКомпании");
	
	

	
	МассивТоварыИН = Новый Массив;
	МассивТовары = Новый Массив;
	
	
	Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
		МассивТовары.Добавить(СтрокаТовар.Артикул);
		Если СтрокаТовар.СканированиеТовар = 0 Тогда
			МассивТоварыИН.Добавить(Новый Структура("Артикул,МРЦ,Количество,Коэффициент,Продажи",СтрокаТовар.Артикул,СтрокаТовар.МРЦ,0,1,0));
		//Иначе
		//	МассивТоварыПР.Добавить(Новый Структура("Артикул,МРЦ,Количество,Коэффициент,Продажи",СтрокаТовар.Артикул,СтрокаТовар.МРЦ,СтрокаТовар.КоличествоВведено,СтрокаТовар.Коэффициент,0));
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.Артикул В(&МассивАртикул)";
	
	Запрос.УстановитьПараметр("МассивАртикул", МассивТовары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаТовары = РезультатЗапроса.Выгрузить();
	ТаблицаТовары.Индексы.Добавить("Артикул");
	
	ФормироватьИнвентаризацию = МассивТоварыИН.Количество() > 0;
	Если ФормироватьИнвентаризацию Тогда
		ПодразделениеПродажи = Справочники.ТорговыеПлощадки.ПодразделениеОпенстор(ТорговаяПлощадкаСсылка);
		
		сдИнвентаризация = Новый Структура;
		сдИнвентаризация.Вставить("UUID_Сотрудник",МассивДанных.UUID_Сотрудник);
		сдИнвентаризация.Вставить("ХозОперация","ИнвентаризацияТоваров");
		сдИнвентаризация.Вставить("UUID_Склад",МассивДанных.UUID_Склад);
		сдИнвентаризация.Вставить("ПродажиОС",Истина);
		сдИнвентаризация.Вставить("ПодразделениеПродажиОС",ПодразделениеПродажи);
		сдИнвентаризация.Вставить("Товары",МассивТоварыИН);
		
		ДокументОбъектИнвентаризация = Документы.Инвентаризация.СоздатьДокумент();
		ДокументОбъектИнвентаризация.ДополнительныеСвойства.Вставить("РезультатОбработки",Новый ТекстовыйДокумент);
		
		СтруктураДокумента = ПолучитьСтруктуруДокумента(ТорговаяПлощадкаСсылка,сдИнвентаризация,ДокументОбъектИнвентаризация);
		СтруктураДокумента.Вставить("ЗадачаТСД",ДокЗадание);
		СтруктураДокумента.Вставить("ТипИнвентаризации",Перечисления.ТК_ТипыИнвентаризаций.Верификация);
		
		ДокументОбъектИнвентаризация.Заполнить(СтруктураДокумента);
		
		РезультатПроверки = ДокументОбъектИнвентаризация.ПроверитьЗаполнение();
		Если НЕ РезультатПроверки Тогда
			Если ДокументОбъектИнвентаризация.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
				Результат.ОписаниеОшибки =  ДокументОбъектИнвентаризация.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
			Иначе
				Результат.ОписаниеОшибки = "Ошибка проверки заполнения документа инвентаризация товаров";
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	НачатьТранзакцию();        
	
	Попытка
		ПериодВФ = НачалоДня(ТекущаяДата());
		
		
		Для каждого СтрокаТовар Из МассивДанных.Товары Цикл
			
			СтрокаНоменклатура = ТаблицаТовары.Найти(СтрокаТовар.Артикул,"Артикул");		
			
			Если СтрокаНоменклатура = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписей = РегистрыСведений.ТК_ВерификацияЦенников.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодВФ);
			НаборЗаписей.Отбор.ТорговаяПлощадка.Установить(ТорговаяПлощадкаСсылка);
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаНоменклатура.Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				нЗапись = НаборЗаписей.Добавить();
				нЗапись.Период = ПериодВФ;
				нЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
				нЗапись.Номенклатура = СтрокаНоменклатура.Ссылка;
			ИначеЕсли НаборЗаписей.Количество() = 1 Тогда 	
				нЗапись = НаборЗаписей[0];
			КонецЕсли; 
			
			нЗапись.НеКорректный = ?(СтрокаТовар.ЦенаПроверена=0,1,0);
			нЗапись.Отсканировано = ?(СтрокаТовар.СканированиеЦенник>0 ИЛИ  СтрокаТовар.СканированиеТовар>0,1,0);
			нЗапись.НетЦенников   = ?(СтрокаТовар.СканированиеЦенник=0,1,0);
			нЗапись.Задача = ДокЗадание;
			
			НаборЗаписей.Записать();
	
		КонецЦикла;

		
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		
		Если ФормироватьИнвентаризацию Тогда
			ДокументОбъектИнвентаризация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
			ДокЗаданиеОбъект.Предмет = ДокументОбъектИнвентаризация.Ссылка;
		КонецЕсли;
		
		
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		ДокЗаданиеОбъект.Записать();
		
		Результат.Результат = Истина;
		
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОШ = "";
		Если ДокументОбъектИнвентаризация.ДополнительныеСвойства.Свойство("РезультатОбработки") Тогда
			ОШ = ДокументОбъектИнвентаризация.ДополнительныеСвойства.РезультатОбработки.ПолучитьТекст();
		КонецЕсли;
		Если ПустаяСтрока(ОШ) Тогда
			ОШ = ОписаниеОшибки();
		КонецЕсли;
		Результат.ОписаниеОшибки =  "Ошибка проведение документа "+ОШ;
		
	КонецПопытки;
	

КонецПроцедуры

Процедура ЗаписатьВыполнениеПоЗаданиюУведомление(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокЗадание = Задачи.ТК_ЗадачаТСД.ПолучитьСсылку(ИД_Документа);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокЗадание,"Выполнена") Тогда
		Результат.ОписаниеОшибки =  "Задание уже выплненно";
		Возврат;
	КонецЕсли;
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	
	НачатьТранзакцию();        
	
	Попытка
		
		
		ДокЗаданиеОбъект = ДокЗадание.ПолучитьОбъект();
		ДокЗаданиеОбъект.Выполнена = Истина;
		ДокЗаданиеОбъект.ДатаИсполнения = ТекущаяДатаСеанса();
		
		ДокЗаданиеОбъект.Записать();
		ЗафиксироватьТранзакцию();
		Результат.Результат = Истина;

	Исключение
		ОтменитьТранзакцию();
		ОШ = ОписаниеОшибки();
		
		Результат.ОписаниеОшибки =  "Ошибка проведение документа "+ОШ;
		
	КонецПопытки;
	

КонецПроцедуры

Процедура ЗаписатьДанныеМаршрутныйЛист(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИД_Документа =	Новый УникальныйИдентификатор(МассивДанных.UUID_Документ);
	Исключение
		Результат.ОписаниеОшибки =  "Исключительная ошибка, документ не найден";
		Возврат;
	КонецПопытки;
	
	ДокументСсылкаТТН = Документы.ТК_ТТН.ПолучитьСсылку(ИД_Документа);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылкаТТН) Тогда 
		Результат.ОписаниеОшибки = "Документ не нейден.";  
		Возврат;
	КонецЕсли;
	
	
	
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	
	НачатьТранзакцию();        
	
	Попытка
		
		НаборСостояение = РегистрыСведений.ТК_СостояниеДокументов.СоздатьНаборЗаписей();
		НаборСостояение.Отбор.СсылкаНаОбъект.Установить(ДокументСсылкаТТН);
		нЗапись = НаборСостояение.Добавить();
		нЗапись.СсылкаНаОбъект = ДокументСсылкаТТН;
		нЗапись.Состояние = Перечисления.СтатусыСборкиРезервов.Доставляется;
		нЗапись.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
		нЗапись.АвторИзменения = СтрудникМенеджер;
		нЗапись.ТорговаяПлощадка = ТорговаяПлощадкаСсылка;
		НаборСостояение.Записать();
		
		
		Для Каждого СтрДок Из  МассивДанных.Товары Цикл 
			
			МассивДок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрДок.docid,"_");
			ТипДок = МассивДок[0];
			
			Если ТипДок = "pr" Тогда
				ДокСканировки = "ПеремещениеТоваров";
			ИначеЕсли ТипДок = "rt" Тогда
				ДокСканировки = "РеализацияТоваров";
			ИначеЕсли ТипДок = "vpr" Тогда
				ДокСканировки = "ВыпускПродукции";
			ИначеЕсли ТипДок = "vp" Тогда
				ДокСканировки = "ВозвратПоставщику";
			ИначеЕсли ТипДок = "rzp" Тогда
				ДокСканировки = "РезервированиеЗаказовПокупателя";
			ИначеЕсли ТипДок = "nn" Тогда
				ДокСканировки = "ТК_НалоговаяНакладная";
			Иначе
				Продолжить;
			КонецЕсли;
			ДокСканирование = Документы[ДокСканировки].ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДок[1]));
			Если ОбщегоНазначения.СсылкаСуществует(ДокСканирование) Тогда 
				ТекСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокСканирование);
				Если НЕ ТекСостояние = Перечисления.СтатусыСборкиРезервов.Отгружен Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураСостояние = Новый Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка",
					Перечисления.СтатусыСборкиРезервов.Доставляется,ТекущаяДатаСеанса(),СтрудникМенеджер,ТорговаяПлощадкаСсылка);
					Если ТипЗнч(ДокСканирование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
						РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокСканирование,СтруктураСостояние,Истина); 
						РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокСканирование,СтруктураСостояние,Истина); 
				
					Иначе
						РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокСканирование,СтруктураСостояние); 
					КонецЕсли;
					
				Если ЗначениеЗаполнено(ДокСканирование.ДокументОснование) Тогда
					РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокСканирование.ДокументОснование,СтруктураСостояние);
       
					РегистрыСведений.ТК_СостояниеДокументов.ЗаписатьИзмененияПоОснованию(
						ДокСканирование,ДокСканирование.ДокументОснование,Перечисления.СтатусыСборкиРезервов.Доставляется,СтрудникМенеджер,ТорговаяПлощадкаСсылка);	   
				   
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Результат.Результат = Истина;
	Исключение
		ОтменитьТранзакцию();
		ОШ = ОписаниеОшибки();
		
		Результат.ОписаниеОшибки =  "Ошибка проведение документа "+ОШ;
		
	КонецПопытки;
	

КонецПроцедуры

Процедура ОбновитьСтатусДокументаПеремещение(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВидДокумента = Неопределено;
   	МассивДанных.Свойство("ВидДокумента",ВидДокумента);
	
	Если ВидДокумента = "ttprvoz" Тогда
		
		ТорговаяПлощадкаОтправитель = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоGlobal_ID(МассивДанных.НомерТочки);
		Если Не ОбщегоНазначения.СсылкаСуществует(ТорговаяПлощадкаОтправитель) Тогда
			Результат.Вставить("Результат",Ложь);
			Результат.Вставить("ОписаниеОшибки","Торговий об'єкт не знайдено "+Строка(МассивДанных.НомерТочки));
			Возврат;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров) КАК СсылкаНаОбъект,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Номер КАК Номер,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Дата КАК Дата,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель
		|ИЗ
		|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
		|ГДЕ
		|	ТК_СостояниеДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСборкиРезервов.Отгружен)
		|	И ТК_СостояниеДокументов.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И ТК_СостояниеДокументов.СсылкаНаОбъект ССЫЛКА Документ.ПеремещениеТоваров
		|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВфилиал)
		|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров) КАК СсылкаНаОбъект,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Номер КАК Номер,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).Дата КАК Дата,
		|	ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ТорговаяПлощадкаПолучатель КАК ТорговаяПлощадкаПолучатель
		|ИЗ
		|	РегистрСведений.ТК_СостояниеДокументов КАК ТК_СостояниеДокументов
		|ГДЕ
		|	ТК_СостояниеДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСборкиРезервов.Рекламация)
		|	И ТК_СостояниеДокументов.ТорговаяПлощадка = &ТорговаяПлощадка
		|	И ТК_СостояниеДокументов.СсылкаНаОбъект ССЫЛКА Документ.ПеремещениеТоваров
		|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВфилиал)
		|	И ВЫРАЗИТЬ(ТК_СостояниеДокументов.СсылкаНаОбъект КАК Документ.ПеремещениеТоваров).ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадкаОтправитель);
		//Запрос.УстановитьПараметр("Состояние", Перечисления.СтатусыСборкиРезервов.Отгружен);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Результат.Вставить("Результат",Ложь);
			Результат.Вставить("ОписаниеОшибки","Немає документів на повернення");
			Возврат;
		КонецЕсли;
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("ttotpr",Строка(ТорговаяПлощадкаОтправитель));
		Массивдокументов = Новый Массив;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПеремещение = Новый Структура;
			СтруктураПеремещение.Вставить("doc",Выборка.Номер);
			СтруктураПеремещение.Вставить("docDate",Формат(Выборка.Дата,"ДФ=dd-MM-yy"));
			СтруктураПеремещение.Вставить("adr",Строка(Выборка.ТорговаяПлощадкаПолучатель));
			СтруктураПеремещение.Вставить("docUUID",Строка(Выборка.СсылкаНаОбъект.УникальныйИдентификатор()));
			Массивдокументов.Добавить(СтруктураПеремещение);
		КонецЦикла;
		СтруктураДокумента.Вставить("doc",Массивдокументов);	
	Иначе
		
		Попытка
			ДокументСсылка =  Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.ДокументUUID));
			Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
				ВызватьИсключение "Документ не знайдено";
			КонецЕсли;
		Исключение
			Результат.Вставить("Результат",Ложь);
			Результат.Вставить("ОписаниеОшибки","Документ не знайдено");
			Возврат;
			
		КонецПопытки;
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,"ХозОперация,ТорговаяПлощадкаПолучатель");
		
		 
		Если РеквизитыОбъекта.ХозОперация <> Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			Результат.Вставить("Результат",Ложь);
			Результат.Вставить("ОписаниеОшибки","Документ не знайдено");
			Возврат;
		КонецЕсли;
		
		СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
		
		текСостояние = РегистрыСведений.ТК_СостояниеДокументов.ПолучитьСостояниеДокумента(ДокументСсылка);
		Если ВидДокумента = "acprtt" Тогда
			Если текСостояние = Перечисления.СтатусыСборкиРезервов.Доставлен Тогда
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","Документ відскановано");
				Возврат;
			ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Проведен Тогда	
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","Статус проведено");
				Возврат;

			ИначеЕсли РеквизитыОбъекта.ТорговаяПлощадкаПолучатель <> ТорговаяПлощадкаСсылка Тогда
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","Ви не можете приймати документи іншої точки");
				Возврат;
				
			КонецЕсли;
			СтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.Доставлен,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());	
			
			НачатьТранзакцию();
			
			Попытка
				
				РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка,СтруктураСостояние,Истина);	
				РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументСсылка,СтруктураСостояние,Истина);	
				
				Если ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
					//Состояение документа Основание 
					РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка.ДокументОснование,СтруктураСостояние);
					
					РегистрыСведений.ТК_СостояниеДокументов.ЗаписатьИзмененияПоОснованию(
					ДокументСсылка,ДокументСсылка.ДокументОснование,Перечисления.СтатусыСборкиРезервов.Доставлен,СтрудникМенеджер,ТорговаяПлощадкаСсылка);	   
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
			Исключение
				
				ОтменитьТранзакцию();
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки",ОписаниеОшибки());
				Возврат;

			КонецПопытки;
			
			
			
		Иначе
			Если текСостояние = Перечисления.СтатусыСборкиРезервов.Доставляется Тогда
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","Документ відскановано");
				Возврат;
			ИначеЕсли текСостояние <> Перечисления.СтатусыСборкиРезервов.Отгружен Тогда	
				Результат.Вставить("Результат",Ложь);
				Результат.Вставить("ОписаниеОшибки","Документ має статус "+Строка(текСостояние));
				Возврат;
			КонецЕсли;
			
			СтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.Доставляется,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());	
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка,СтруктураСостояние,Истина);	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументСсылка,СтруктураСостояние,Истина);	

			
		КонецЕсли;
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("doc","№"+ДокументСсылка.Номер+" від "+Формат(ДокументСсылка.Дата,"ДФ=yyyy-MM-dd"));
		СтруктураДокумента.Вставить("adr",Строка(ДокументСсылка.ТорговаяПлощадкаПолучатель));
		

	КонецЕсли;
	
	Результат.Вставить("Результат",Истина);
	Результат.Вставить("Ответ",СтруктураДокумента);
	
	

КонецПроцедуры

Процедура ЗаписатьДанныеЗаявки(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	Попытка 
		ИнициаторЗаявки = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
		Услуга = Справочники.УслугиСервисДеск.УслугаПоКоду(МассивДанных.usluga);	
		
		Если Не ЗначениеЗаполнено(Услуга) Тогда
			Результат.ОписаниеОшибки =  "Невідома послуга";
			Возврат;
		КонецЕсли;
		ИсполнительЗаявки = Обработки.СервисДеск.Исполнитель(Услуга,ТорговаяПлощадкаСсылка);

		Заявка = Новый Структура;
		Заявка.Вставить("Инициатор",ИнициаторЗаявки);
		Заявка.Вставить("Исполнитель",ИсполнительЗаявки);
		Заявка.Вставить("КомментарийВыполнения","");
		Заявка.Вставить("Описание",МассивДанных.info);
		Заявка.Вставить("Срочная", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Услуга,"Срочная"));
		Заявка.Вставить("Статус",Перечисления.СтатусыСервисДеск.opened);
		Заявка.Вставить("Услуга",Услуга);
		Заявка.Вставить("Точка",ТорговаяПлощадкаСсылка);
		Заявка.Вставить("Плановая",Ложь);
		МассивФото = Новый Массив;
		
		Если МассивДанных.Свойство("ФотоДокумента") Тогда
			Попытка
				Для Каждого стрФото Из МассивДанных.ФотоДокумента Цикл 
					ФотоДВ = Base64Значение(стрФото.Фото);
					
					ИмяВСсылке =   Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=")+"_" + ТорговаяПлощадкаСсылка.Код;
					//ИмяВСсылке = "problem";
					ТекстОшибки = "";
					СсылкаФото = ЗаписатьФотоАмазон(ИмяВСсылке,ФотоДВ,ТекстОшибки);
					
					Если СсылкаФото = Неопределено Тогда
						
						ВызватьИсключение ТекстОшибки; 
						
					КонецЕсли;
					
					МассивФото.Добавить(СсылкаФото);
					
				КонецЦикла;
			Исключение
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки = ОписаниеОшибки();
				Возврат;
				
			КонецПопытки;
		КонецЕсли;
		
		Заявка.Вставить("МассивСсылокФото",МассивФото);
		
		
		ПараметрыДляЗапроса = ПланыОбмена.ОбменFirestore.НастройкиУзла("DBG");
		
		ОК = Обработки.СервисДеск.ПодготовитьОтправитьЗаявку(ПараметрыДляЗапроса, Заявка);
	//	ОК = Истина;
		Если ОК Тогда
			Результат.Результат = Истина;
		Иначе
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = "Не удалось создать заявку";
		КонецЕсли;
	Исключение
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьДанныеРекламации(ТорговаяПлощадкаСсылка,МассивДанных,Результат)
	
		
	УстановитьПривилегированныйРежим(Истина);
	СтрудникМенеджер = ТК_ТСД_РаботаHTTP_СервисПовтИсп.ПолучитьСотрудника(МассивДанных.UUID_Сотрудник);
	ДокументСсылка =  Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивДанных.UUID_Документ));
	Если Не ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		ВызватьИсключение "Документ не знайдено";
	КонецЕсли;
	СтатусПровести = МассивДанных.Статус;
	
	НачатьТранзакцию();
	
	Попытка
		Если СтатусПровести Тогда
			Если ДокументСсылка.Проведен = Ложь Тогда
				ДокРасходОбъект = ДокументСсылка.ПолучитьОбъект();
				Если ДокРасходОбъект.ПометкаУдаления Тогда
					ДокРасходОбъект.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
				ДокРасходОбъект.Дата = ТекущаяДатаСеанса();
				ДокРасходОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);

			КонецЕсли;
		
		КонецЕсли;

		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	ПеремещениеТоваров.Проведен КАК Проведен
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	НЕ ПеремещениеТоваров.ПометкаУдаления
		|	И ПеремещениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		|	И ПеремещениеТоваров.ДокументОтгрузки = &ДокументОтгрузки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеТоваров.МоментВремени УБЫВ");
		
		Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументСсылка);
		РезЗапроса = Запрос.Выполнить();
		
		
		Если РезЗапроса.Пустой() Тогда
		
				
				ДокПеремещениеПриход = Документы.ПеремещениеТоваров.СоздатьДокумент();
				ДокПеремещениеПриход.Заполнить(ДокументСсылка);
				ДокПеремещениеПриход.Дата = ТекущаяДатаСеанса();
				ДокПеремещениеПриход.Менеджер = ДокументСсылка.Менеджер;
				ДокПеремещениеПриход.СкладКомпанииПолучатель = ДокументСсылка.СкладКомпанииПолучатель;
				Если СтатусПровести Тогда
					
					ДокПеремещениеПриход.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				Иначе
					ДокПеремещениеПриход.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;

				ДокументОбъектПриходСсылка = ДокПеремещениеПриход.Ссылка;
		
			
		Иначе
			
			Выборка = РезЗапроса.Выбрать();
			Выборка.Следующий();
			ДокументОбъектПриходСсылка  = Выборка.Ссылка;
			Если СтатусПровести Тогда
				Если Не Выборка.Проведен Тогда
					ДокументОбъектПриход = ДокументОбъектПриходСсылка.ПолучитьОбъект();
					Если ДокументОбъектПриход.ПометкаУдаления Тогда
						ДокументОбъектПриход.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;

					ДокументОбъектПриход.Дата = ТекущаяДатаСеанса();
					ДокументОбъектПриход.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
		

		Если СтатусПровести Тогда
			
			текСтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.Проведен,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());	
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка,текСтруктураСостояние);	
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъектПриходСсылка,текСтруктураСостояние);
			
			текСтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.СогласованоРЦ,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументСсылка,текСтруктураСостояние);	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъектПриходСсылка,текСтруктураСостояние);
			
			текСтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.Проведен,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса()+1);	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументСсылка,текСтруктураСостояние);	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъектПриходСсылка,текСтруктураСостояние);

		Иначе
			
			текСтруктураСостояние = Новый Структура("Состояние,АвторИзменения,ТорговаяПлощадка,ДатаПоследнегоИзменения",Перечисления.СтатусыСборкиРезервов.ОтклоненоРЦ,СтрудникМенеджер,ТорговаяПлощадкаСсылка,ТекущаяДатаСеанса());	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументСсылка,текСтруктураСостояние);	
			РегистрыСведений.ТК_СостояниеДокументовИзменения.ЗаписатьСостояниеДокумента(ДокументОбъектПриходСсылка,текСтруктураСостояние);
			
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументСсылка,текСтруктураСостояние);	
			РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ДокументОбъектПриходСсылка,текСтруктураСостояние);
		КонецЕсли;
	
		ЗафиксироватьТранзакцию();
		Результат.Результат = Истина;

	Исключение
		ОтменитьТранзакцию();
		
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
КонецПроцедуры






Функция ПроверитьСтатусДокумента(текСостояние,ОжидаемыйСтатус,ОписаниеСтатуса="")
	
	Если текСостояние = ОжидаемыйСтатус Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если текСостояние = Перечисления.СтатусыСборкиРезервов.Собран Тогда
		ОписаниеСтатуса = "Документ собран.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Доставляется Тогда	
		ОписаниеСтатуса = "Документ доставляется.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Доставлен Тогда	
		ОписаниеСтатуса = "Документ доставлен."; 
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Отгружен Тогда	
		ОписаниеСтатуса = "Готов к доставке.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.ГотовКСборке Тогда	
		ОписаниеСтатуса = "Документ готов к сборке.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.ВСборке Тогда	
		ОписаниеСтатуса = "Документ в сборке.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Отменен Тогда	
	     ОписаниеСтатуса = "Документ отменен.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.Отказ Тогда	
	     ОписаниеСтатуса = "Документ отказ.";  
	ИначеЕсли текСостояние = Перечисления.СтатусыСборкиРезервов.НеНачат Тогда	
	     ОписаниеСтатуса = "Документ не начат.";  
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

