
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьГруппыОтчетов();
	ЗаполнитьВариантыОтчетов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппыОтчетов()
	ГруппыОтчетов.Добавить("Приходы по фабрикам",,Ложь);
	ГруппыОтчетов.Добавить("ІТЮ - Обсяги продажу",,Ложь);
	ГруппыОтчетов.Добавить("Продажи по фабрикам",,Ложь);
	ГруппыОтчетов.Добавить("Реализация Табака",,Ложь);
	ГруппыОтчетов.Добавить("Продажи Табак ОПТ",,Ложь);
	ГруппыОтчетов.Добавить("СТИКИ и VELO",,Ложь);
	ГруппыОтчетов.Добавить(".ФМУ",,Ложь);
	ГруппыОтчетов.Добавить("Отчет оперативный ежедневный",,Ложь);
	ГруппыОтчетов.Добавить("Новый Шаблон заказа сигарет на РЦ",,Ложь);
	ГруппыОтчетов.Добавить("Шаблон заказа сигарет на РЦ",,Ложь);
	ГруппыОтчетов.Добавить("Шаблон заказа электронных сигарет на РЦ",,Ложь);
	ГруппыОтчетов.Добавить("Отчет по оборачиваемости товара",,Ложь);
	ГруппыОтчетов.Добавить("Отчет для совета директоров",,Ложь);
	ГруппыОтчетов.Добавить("Дебиторы Аттики",,Ложь);
	ГруппыОтчетов.Добавить("Доступность товара",,Ложь);
	ГруппыОтчетов.Добавить("Продажи дистрибуции по форме",,Ложь);
	ГруппыОтчетов.Добавить("Продажи ОПТа и Дистрибуции",,Ложь);
	ГруппыОтчетов.Добавить("Товарооборот и маржа",,Ложь);
	ГруппыОтчетов.Добавить("Выкупленный товар",,Ложь);
	ГруппыОтчетов.Добавить("Продажи по ТТ эл.сигарет",,Ложь);
	ГруппыОтчетов.Добавить("Отчеты БАТ",,Ложь);
	ГруппыОтчетов.Добавить("Отчеты JTI",,Ложь);
	ГруппыОтчетов.Добавить("Отчеты ФМУ",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("ФМУ продажи от Миши",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненныйНаДвеЧетверти);
	ГруппыОтчетов.Добавить("ИТЮ продажи от Миши",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("для ИТЮ продажи",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Приходы табака по поставщикам",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Приходы табака по поставщикам тыс.шт",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Аналитика дистрибуции",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Продажи ТОП 100",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("ФИЧ продажи от Миши",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Остатки на РЦ для ФМУ",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("ФИЧ сводный",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Сводная реализация по ТМ",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Продажи розницы для ИТЮ",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("ТБД",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Остатки ИТЮ",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
	ГруппыОтчетов.Добавить("Новые клиенты Дистрибуции",,Ложь,БиблиотекаКартинок.ОформлениеКругЗаполненный);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыОтчетов()
	Для Каждого Группа Из ГруппыОтчетов Цикл
		Если Группа.Значение = "Приходы по фабрикам" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Приходы по фабрикам");
			
		ИначеЕсли Группа.Значение = "ІТЮ - Обсяги продажу" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ІТЮ - Обсяги продажу",Истина);
			
		ИначеЕсли Группа.Значение = "Продажи по фабрикам" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи по фабрикам");
			
		ИначеЕсли Группа.Значение = "Реализация Табака" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Реализация Табака");
			
		ИначеЕсли Группа.Значение = ".ФМУ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ФМУ Fich");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Инструменты");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Стики БАТ");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Стики ФМУ");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Тотал");
			спВариантыОтчетов.Добавить(Группа,"ФМУ Точки Аттики");
			
		ИначеЕсли Группа.Значение = "Продажи Табак ОПТ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи ОПТа и Дистрибуции","Продажи Табак ОПТ");
			
		ИначеЕсли Группа.Значение = "СТИКИ и VELO" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"СТИКИ и VELO");
			
		ИначеЕсли Группа.Значение = "Отчет оперативный ежедневный" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Аттика");
			спВариантыОтчетов.Добавить(Группа,"Баффет");
			спВариантыОтчетов.Добавить(Группа,"Табак_Дигма");
			
		ИначеЕсли Группа.Значение = "Новый Шаблон заказа сигарет на РЦ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Харьков");
			спВариантыОтчетов.Добавить(Группа,"Полтава");
			
		ИначеЕсли Группа.Значение = "Шаблон заказа сигарет на РЦ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Заказ сигарет на РЦ");
			
		ИначеЕсли Группа.Значение = "Шаблон заказа электронных сигарет на РЦ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Шаблон заказа сигарет на РЦ");
			
		ИначеЕсли Группа.Значение = "Отчет по оборачиваемости товара" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Buffet+ПЛ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ИЕ-Роз/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ИЕ-Роз/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаРЦ+ИЕ/Г");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаРЦ+ИЕ/");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/Х");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/С");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/П");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт/В");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/Х",Истина);
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/С");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/П");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+ПЛ-Опт+Сиг/В");		
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаАттика+ПЛ-Роз/");	//	должен быть в конце
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность АттикаДигма+ПЛ-Роз/");	//	должен быть в конце
			
		ИначеЕсли Группа.Значение = "Отчет для совета директоров" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Аттика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Баффет");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-ТабакД");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-Фабрика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Обороты-ОПТ");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Баффет");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-ТабакД");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-Розница");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-ОПТ");
			спВариантыОтчетов.Добавить(Группа,"Еженедельная отчетность Аттика+Остатки-Аттика-РЦ");
			
		ИначеЕсли Группа.Значение = "Дебиторы Аттики" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Дальность дебиторки Аттика Детальный");
			
		ИначеЕсли Группа.Значение = "Доступность товара" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Баффет",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Аттика",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Табак-Дигма",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Фабрика Сыра",,БиблиотекаКартинок.Записать);
			спВариантыОтчетов.Добавить(Группа,"Доступность товара Склады РЦ",,БиблиотекаКартинок.Записать);
			
		ИначеЕсли ТипЗнч(Группа) = Тип ("СписокЗначений") И Группа[0].Представление = "Продажи дистрибуции по форме" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции по форме");
			
		ИначеЕсли Группа.Значение = "Продажи дистрибуции по форме" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
			
			спВариантыОтчетов.Добавить(Период,"Продажи Дистрибуции по форме");
			
			Период = Новый СтандартныйПериод;
			Период.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоМесяца;
			спВариантыОтчетов.Добавить(Период,"Продажи Дистрибуции по форме");
			
		ИначеЕсли Группа.Значение = "Продажи ОПТа и Дистрибуции" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции Детальный",Истина);
			спВариантыОтчетов.Добавить(Группа,"Продажи Дистрибуции Сравнительный",Истина);
			спВариантыОтчетов.Добавить(Группа,"Продажи ОПТа Детальный",Истина);
			
		ИначеЕсли Группа.Значение = "Товарооборот и маржа" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Да");
			спВариантыОтчетов.Добавить(Группа,"Нет");
			
		ИначеЕсли Группа.Значение = "Выкупленный товар" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"Выкупленный товар ТС Buffet");
			спВариантыОтчетов.Добавить(Группа,"Выкупленный товар ТС Аттика");
			
		ИначеЕсли Группа.Значение = "ФМУ продажи от Миши" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "ИТЮ продажи от Миши" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Продажи по ТТ эл.сигарет" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя");
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Продажи по ТТ эл.сигарет_Месяц" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи по ТТ эл.сигарет","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Продажи по ТТ эл.сигарет_Неделя" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи по ТТ эл.сигарет","ПрошлаяНеделя");
			
		ИначеЕсли Группа.Значение = "Отчеты БАТ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлаяНеделя");
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Отчеты БАТ_Неделя" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлаяНеделя");
			
		ИначеЕсли Группа.Значение = "Отчеты БАТ_Месяц" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовБАТ","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Отчеты JTI" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Отчеты JTI_Неделя" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			
		ИначеЕсли Группа.Значение = "Отчеты JTI_Месяц" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ТК_ФормированиеОтчетовJTI","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Приходы табака по поставщикам" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам","ПрошлаяНеделя");
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Приходы табака по поставщикам тыс.шт" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам тыс.шт","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить("Приходы табака по поставщикам тыс.шт","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Аналитика дистрибуции" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Аналитика дистрибуции","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Продажи ТОП 100" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи ТОП 100","ПрошлаяНеделя",Истина);
			спВариантыОтчетов.Добавить("Продажи ТОП 100","ПрошлыйМесяц",Истина);
			
		ИначеЕсли Группа.Значение = "ФИЧ продажи от Миши" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ФИЧ продажи от Миши","ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			
		ИначеЕсли Группа.Значение = "для ИТЮ продажи" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"ПрошлаяНеделя",,БиблиотекаКартинок.ОтправитьЭлектронноеПисьмо);
			спВариантыОтчетов.Добавить(Группа,"ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "Остатки на РЦ для ФМУ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Остатки для ФМУ","СНачалаЭтогоМесяца");
			
		ИначеЕсли Группа.Значение = "ФИЧ сводный" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа,"НачалоЭтогоДня");
			
		ИначеЕсли Группа.Значение = "Сводная реализация по ТМ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Сводная реализация по ТМ","ПрошлыйМесяц",Истина);
			спВариантыОтчетов.Добавить("Сводная реализация по ТМ","СНачалаЭтогоГода",Истина);
			
		ИначеЕсли Группа.Значение = "Продажи розницы для ИТЮ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Продажи розницы для ИТЮ","ПрошлыйМесяц");
			
		ИначеЕсли Группа.Значение = "ТБД" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Buffet","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Аттика","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Табак-Дигма","НачалоПрошлогоДня");
			спВариантыОтчетов.Добавить("Товары без продаж новый (плоский) - Фабрика Сыра","НачалоПрошлогоДня");
			
		ИначеЕсли Группа.Значение = "Отчеты ФМУ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("ОтчетыЕжедневные");
			спВариантыОтчетов.Добавить("ОтчетНедельный","0 БЕЗ ЗАДЕРЖЕК");
			спВариантыОтчетов.Добавить("ОтчетыМесячные","0 БЕЗ ЗАДЕРЖЕК");
			спВариантыОтчетов.Добавить("ОтчетыМесячные","1 МЕС ЗАДЕРЖКИ");
			спВариантыОтчетов.Добавить("ОтчетыМесячные","3 МЕС ЗАДЕРЖКИ");
			спВариантыОтчетов.Добавить("ОтчетыМесячные","6 МЕС ЗАДЕРЖКИ");
			
		ИначеЕсли Группа.Значение = "Остатки ИТЮ" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить("Остатки ИТЮ","Вчера");
			
		ИначеЕсли Группа.Значение = "Новые клиенты Дистрибуции" Тогда
			спВариантыОтчетов = Новый СписокЗначений;
			спВариантыОтчетов.Добавить(Группа, "ПрошлаяНеделя",Истина);
			
			
		КонецЕсли;
		
		Для Каждого Вариант Из спВариантыОтчетов Цикл
			стрВариант = ВариантыОтчетов.Добавить();
			ЗаполнитьЗначенияСвойств(стрВариант,Вариант);
			стрВариант.Группа = Группа.Значение;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Отбор = ВариантыОтчетов.НайтиСтроки(Новый Структура("Выбран",Истина));
	
	Обработки.ФоновоеФормированиеОтчетов.СформироватьОтчеты(Отбор);
	//Обработки.ФоновоеФормированиеОтчетов.СформироватьОтчеты(ГруппыОтчетов);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОтчетовПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ГруппыОтчетов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		//При активизации строки ТекДанные не заполонены
		Элементы.Техника.ОтборСтрок = Неопределено;
	Иначе
		// Для ТЧ «Техника» устанавливаем отбор по текущему сотруднику
		ТекГруппа = ТекДанные.Значение;
		Элементы.ВариантыОтчетов.ОтборСтрок = Новый ФиксированнаяСтруктура("Группа", ТекГруппа);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОтчетовПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Группа = ТекущиеДанные.Значение;
	Пометка = ТекущиеДанные.Пометка;
	ОтборПоГруппе = ВариантыОтчетов.НайтиСтроки(Новый Структура("Группа",Группа));
	Для Каждого Вариант Из ОтборПоГруппе Цикл
		Вариант.Выбран = Пометка;
	КонецЦикла;
КонецПроцедуры


