
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция УслугаПоКоду(КодУслуги)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спрУслугиСервисДеск.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УслугиСервисДеск КАК спрУслугиСервисДеск
		|ГДЕ
		|	спрУслугиСервисДеск.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодУслуги);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.УслугиСервисДеск.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции


#КонецЕсли
