
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ПланВидовХарактеристикСсылка.ВопросыДляАнкетирования") Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьИзВопросыДляАнкетирования(ДанныеЗаполнения);
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры



Процедура ЗаполнитьИзВопросыДляАнкетирования(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВопросыДляАнкетирования.Родитель КАК Родитель,
	|	ВопросыДляАнкетирования.Родитель.Наименование КАК РодительНаименование,
	|	ВопросыДляАнкетирования.Родитель.Наименование КАК РодительФормулировка,
	|	ВопросыДляАнкетирования.Родитель.ВидРасчетаИтогов КАК РодительВидРасчетаИтогов,
	|	ВопросыДляАнкетирования.Родитель.Коэффициент КАК РодительКоэффициент,
	|	ВопросыДляАнкетирования.Ссылка КАК Ссылка,
	|	ВопросыДляАнкетирования.Наименование КАК Наименование,
	|	ВопросыДляАнкетирования.Формулировка КАК Формулировка
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
	|ГДЕ
	|	ВопросыДляАнкетирования.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И ВопросыДляАнкетирования.Родитель <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВопросыДляАнкетирования.Родитель,
	|	ВопросыДляАнкетирования.Код";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Ничего не выбрано, ввод шаблона анкеты невозможен!"; 
	КонецЕсли;
	
	Заголовок = ДанныеЗаполнения.Наименование;
	Наименование = ДанныеЗаполнения.Наименование+ТекущаяДата();
	//ЧеклистКуратора = Истина;
	ЭтотОбъект.Записать();	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Родитель") Цикл
		Если Выборка.Родитель = ДанныеЗаполнения Тогда
			Продолжить;
		КонецЕсли;
		РазделОбъект = Справочники.ВопросыШаблонаАнкеты.СоздатьГруппу();
		РазделОбъект.Владелец = ЭтотОбъект.Ссылка;
		Если Выборка.Родитель.Родитель <> ДанныеЗаполнения Тогда
			РазделОбъект.Родитель = Выборка.Родитель.Родитель;
		КонецЕсли;
		РазделОбъект.Наименование = Выборка.РодительНаименование;
		РазделОбъект.Формулировка = Выборка.РодительФормулировка;
		РазделОбъект.ВидРасчетаИтогов = Выборка.РодительВидРасчетаИтогов;
		РазделОбъект.Коэффициент = Выборка.РодительКоэффициент;
		РазделОбъект.Записать();
		Сообщить(Выборка.Родитель);
		Пока Выборка.Следующий() Цикл
			ВопросОбъект = Справочники.ВопросыШаблонаАнкеты.СоздатьЭлемент();
			ВопросОбъект.Владелец = ЭтотОбъект.Ссылка;
			ВопросОбъект.Родитель = РазделОбъект.Ссылка;
			ВопросОбъект.Наименование = Выборка.Наименование;
			ВопросОбъект.Формулировка = Выборка.Формулировка;
			ВопросОбъект.Обязательный = Истина;
			ВопросОбъект.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Простой;
			ВопросОбъект.СпособОтображенияПодсказки = Перечисления.СпособыОтображенияПодсказок.КонтекстнаяПодсказка;
			ВопросОбъект.ЭлементарныйВопрос = Выборка.Ссылка;
			ВопросОбъект.Записать();
			Сообщить("								" +Выборка.Ссылка);
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры
