&НаСервере
Перем КэшиПеречислений, ТчТовары; 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураКолонок = Параметры.СтруктураКолонок;
	ЭтоАттика = Параметры.ЭтоАттика;
	СписокПараметров.Добавить(Параметры.ТчТовары,"ТчТовары");	
	СписокПараметров.Добавить(Параметры.КэшиПеречислений,"КэшиПеречислений");	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЭтоАттика Тогда
		Элементы.ФормаТпИзСкладов.Видимость = Ложь;	
		Элементы.ФормаТпИзМатрицы.Видимость = Ложь;	
	КонецЕсли;
	СформироватьШапкуТабличногоДокумента(ТабДокумент,СтруктураКолонок);
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент) 
	ПоследняяСтрока = ТабДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабДокумент.ШиринаТаблицы;
	ОбластьЯчеек = ТабДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	// Создаем объект для интеллектуального построения отчетов,
	// указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	// Результат выгружаем в таблицу значений.
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	Возврат ТабЗначений
КонецФункции

&НаСервере
Функция ПолучитьЗначение(ИмяКолонки, Значение) 
	
	Если ИмяКолонки = "Номенклатура" тогда
		ПолученноеЗначение = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Значение);
		Если Не ЗначениеЗаполнено(ПолученноеЗначение) Тогда
			ПолученноеЗначение = Справочники.Номенклатура.НайтиПоНаименованию(Значение);
		КонецЕсли;
	ИначеЕсли ИмяКолонки = "ТорговаяПлощадка" тогда
		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеПлощадки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|ГДЕ
		|	ТорговыеПлощадки.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", Значение);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если  РезультатЗапроса.Пустой() Тогда
			ПолученноеЗначение = Справочники.ТорговыеПлощадки.ПустаяСсылка();
		Иначе	
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ПолученноеЗначение  = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
		//ПолученноеЗначение = Справочники.ТорговыеПлощадки.НайтиПоНаименованию(Значение);
	ИначеЕсли ИмяКолонки = "МодельЗаказа" тогда
		СсылкаПеречисление = СписокПараметров[1].Значение.КэшМоделейЗаказа.Получить(Значение);
		ПолученноеЗначение = ?(СсылкаПеречисление=Неопределено,Перечисления.ВидыКоличестваЗаказа.АвтоматическийРассчет,СсылкаПеречисление);
	ИначеЕсли ИмяКолонки = "ВариантОкругления" тогда
		СсылкаПеречисление = СписокПараметров[1].Значение.КэшВариантовОкругления.Получить(Значение);
		ПолученноеЗначение = ?(СсылкаПеречисление=Неопределено,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,СсылкаПеречисление);
	Иначе
		ПолученноеЗначение = Значение;
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
КонецФункции	

&НаСервере
Функция ЗагрузитьНаСервере()
	ТзТп = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
	ТЗ = СписокПараметров[0].Значение.Выгрузить().СкопироватьКолонки();
	КолонкиТаблицы = ТзТп.Колонки;
	Для каждого ТекСтрока из ТзТп Цикл
		НоваяСтрока = ТЗ.Добавить();
		Для каждого ТекСтрокаКолонка из КолонкиТаблицы Цикл
			Если НЕ ТекСтрока[ТекСтрокаКолонка.Имя] = "" тогда
				Значение = ПолучитьЗначение(ТекСтрокаКолонка.Имя,ТекСтрока[ТекСтрокаКолонка.Имя]);
				НоваяСтрока[ТекСтрокаКолонка.Имя] = Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	Закрыть(ЗагрузитьНаСервере());
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьШапкуТабличногоДокумента(ТабличныйДокумент,СтруктураКолонок) Экспорт
	ТабличныйДокумент.Очистить();
	Колонки = Новый СписокЗначений;
	Номер = 0;
	Для каждого ТекСтрока из СтруктураКолонок цикл
		Если не ТекСтрока.Ключ = "НомерСтроки" тогда
			Номер = Номер + 1;
			Колонки.Добавить(Номер, ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	Колонки.СортироватьПоЗначению();
	ШиринаКолонки = 25;
	Для каждого Колонка Из Колонки Цикл	
		НомерКолонки = Число(Колонка.Значение);
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = Не ПустаяСтрока(Область.Текст);
		Область.Текст       = Колонка.Представление;
		Область.Расшифровка = Колонка.Представление;
		Область.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереформироватьТабДокСПлощадками(ТабличныйДокумент,СтруктураКолонок,ТЗ) Экспорт
	ТабличныйДокумент.Очистить();
	Колонки = Новый СписокЗначений;
	Номер = 0;
	Для каждого ТекСтрока из СтруктураКолонок цикл
		Если не ТекСтрока.Ключ = "НомерСтроки" тогда
			Номер = Номер + 1;
			Колонки.Добавить(Номер, ТекСтрока.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	Колонки.СортироватьПоЗначению();
	ШиринаКолонки = 25;
	
	Для каждого Колонка Из Колонки Цикл	
		НомерКолонки = Число(Колонка.Значение);
		Область = ТабличныйДокумент.Область("R1C"+НомерКолонки);
		БылТекст = Не ПустаяСтрока(Область.Текст);
		Область.Текст       = Колонка.Представление;
		Область.Расшифровка = Колонка.Представление;
		Область.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
		Область.Обвести(Линия, Линия, Линия, Линия);
		
		ОбластьКолонки = ТабличныйДокумент.Область("C"+НомерКолонки);
		ОбластьКолонки.ШиринаКолонки = ?(БылТекст,Макс(ОбластьКолонки.ШиринаКолонки,ШиринаКолонки),ШиринаКолонки);
	КонецЦикла;
	
	Для каждого строка Из ТЗ Цикл
		НомерСтроки = Формат(ТЗ.Индекс(строка) + 2,"ЧГ=");
		Для каждого Колонка Из Колонки Цикл	
			НомерКолонки = Число(Колонка.Значение);
			Область = ТабличныйДокумент.Область("R"+НомерСтроки+"C"+НомерКолонки);
			Область.Текст       = строка[Колонка.Представление];
			Область.Расшифровка = строка[Колонка.Представление];
			Область.ЦветФона = ЦветаСтиля.ЦветФонаШапкиТаблицы;
			Область.Обвести(Линия, Линия, Линия, Линия);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПлощадкиИзСкладов(Кнопка)
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСклад(Код)
	Возврат Справочники.СкладыКомпании.НайтиПоКоду(Код);
КонецФункции


&НаСервере
Процедура ВводСтроки(ПолученноеЗначение, ПереданныеПараметры) Экспорт
	
	СписокПлощадок = Новый СписокЗначений;
	
	Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
		зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
		Если ПустаяСтрока(зн) Тогда
			Продолжить;
		КонецЕсли;
		
		нНом = ПолучитьСклад(зн);
		Если нНом = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
			Сообщить("Склад не найдена, код: " +зн);
			Продолжить;
		КонецЕсли;
		
		Если нНом.ЭтоГруппа Тогда
			Сообщить("Введена группа склада '"+нНом+"'");
			Продолжить;
		КонецЕсли;
		
		Если нНом.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
			Сообщить("Торговая площадка не заполнена у склада: " +нНом);
			Продолжить;
		КонецЕсли;
		
		Если СписокПлощадок.НайтиПоЗначению(нНом.ТорговаяПлощадка)= Неопределено Тогда
			СписокПлощадок.Добавить(нНом.ТорговаяПлощадка);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
	тзСПлощадками = ТЗ.СкопироватьКолонки();
	тзСПлощадками.Колонки.Удалить("ТорговаяПлощадка");
	тзСПлощадками.Колонки.Добавить("ТорговаяПлощадка");
	Для каждого Площадка Из СписокПлощадок Цикл	
		Для каждого строка Из ТЗ Цикл
			ЗаполнитьЗначенияСвойств(тзСПлощадками.Добавить(),строка);
			тзСПлощадками[тзСПлощадками.Количество()-1].ТорговаяПлощадка = Площадка.Значение;
		КонецЦикла;
	КонецЦикла;
	
	ПереформироватьТабДокСПлощадками(ТабДокумент,СтруктураКолонок,тзСПлощадками);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ТпИзСкладовНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТпИзСкладов(Команда)
	Текст = "";
	Подсказка = "Введите код склада, новый код с новой строки";
	СписокПлощадок = Новый СписокЗначений;
	Строка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка,,Истина);
	//ТпИзСкладовНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМатриц()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АссортиментнаяМатрица.Ссылка КАК Матрица
	|ИЗ
	|	Справочник.АссортиментнаяМатрица КАК АссортиментнаяМатрица
	|АВТОУПОРЯДОЧИВАНИЕ"	;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//создадим список значений
	СписокМатриц = Новый СписокЗначений;
	//загрузим значения колонки
	СписокМатриц.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Матрица"));
	Возврат СписокМатриц;
КонецФункции

&НаСервере
Процедура ТпИзМатрицыНаСервере(ВыбранныеМатрицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.АссортиментнаяМатрица В(&АссортиментнаяМатрица)
	|	И НЕ СкладыКомпании.ЭтоГруппа
	|	И НЕ СкладыКомпании.ПометкаУдаления
	|	И (СкладыКомпании.Маршрут > 0
	|			ИЛИ СкладыКомпании.АссортиментнаяМатрица.Код = ""AT000008"")
	|
	|СГРУППИРОВАТЬ ПО
	|	СкладыКомпании.ТорговаяПлощадка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("АссортиментнаяМатрица", ВыбранныеМатрицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ТЗ = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
		тзСПлощадками = ТЗ.СкопироватьКолонки();
		тзСПлощадками.Колонки.Удалить("ТорговаяПлощадка");
		тзСПлощадками.Колонки.Добавить("ТорговаяПлощадка");
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Для каждого строка Из ТЗ Цикл
				ЗаполнитьЗначенияСвойств(тзСПлощадками.Добавить(),строка);
				тзСПлощадками[тзСПлощадками.Количество()-1].ТорговаяПлощадка = ВыборкаДетальныеЗаписи.ТорговаяПлощадка;
			КонецЦикла;
		КонецЦикла;
		
		ПереформироватьТабДокСПлощадками(ТабДокумент,СтруктураКолонок,тзСПлощадками);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пусто!!!");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТпИзМатрицы(Команда)
	СписокМатриц = ПолучитьСписокМатриц();
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);	
	СписокМатриц.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов,"Выберите нужные матрицы");
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
	
	Если Элементы <> Неопределено Тогда
		ВыбранныеМатрицы = Новый СписокЗначений;
		Для Каждого Элемент из Элементы Цикл
			Если Элемент.Пометка Тогда
				ВыбранныеМатрицы.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыбранныеМатрицы) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Надо было выбрать хоть что-то!!!");
		Возврат;
	КонецЕсли;
	
	ТпИзМатрицыНаСервере(ВыбранныеМатрицы);	
	
КонецПроцедуры


