
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ГрафикЗаказов"));
	
	Если Объект.ЧерезТСД Тогда
		Элементы.ЧерезТСД.ЦветТекстаЗаголовка = WebЦвета.Пурпурный;	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
КонецПроцедуры


#КонецОбласти


#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Если НЕ Параметры.Ключ.Пустая() И Объект.Проведен 
		И НЕ НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()) Тогда 
		ЭтаФорма.ТолькоПросмотр = ИСТИНА;
	Иначе
		Если НЕ Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ТорговаяПлощадка) И ЗначениеЗаполнено(Объект.Договор) Тогда 
			Элементы.Контрагент.ТолькоПросмотр = ИСТИНА;
			Элементы.Договор.ТолькоПросмотр = ИСТИНА;
			Элементы.ТорговаяПлощадка.ТолькоПросмотр = ИСТИНА;
		КонецЕсли;
		
		УправлениеДиалогом();
		
	КонецЕсли;
	
	Элементы.Миксация.Видимость							= ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	УправлениеДоговором();
	//Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < ТекущаяДата() Тогда
	//	Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
	//	Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
	//	Элементы.Договор.ЦветРамки			= WebЦвета.Коралловый;
	//	Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоговором()
	
	Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
		Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
		Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки			= WebЦвета.Коралловый;
		Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Договор) И Объект.Контрагент <> Объект.Договор.Контрагент Тогда
		Элементы.Договор.ЦветФона						= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки						= WebЦвета.Красный;
		Элементы.Контрагент.ЦветФона					= WebЦвета.Коралловый;
		Элементы.Контрагент.ЦветРамки					= WebЦвета.Красный;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветРамки			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
	
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(Объект.Договор) И Объект.Контрагент <> Объект.Договор.Контрагент Тогда
		Элементы.Договор.ЦветФона						= WebЦвета.Коралловый;
		Элементы.Договор.ЦветРамки						= WebЦвета.Красный;
		Элементы.Контрагент.ЦветФона					= WebЦвета.Коралловый;
		Элементы.Контрагент.ЦветРамки					= WebЦвета.Красный;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветРамки			= WebЦвета.Красный;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= WebЦвета.Красный;
	Иначе
		Элементы.Договор.ЦветФона						= Новый Цвет;
		Элементы.Договор.ЦветРамки						= Новый Цвет;
		Элементы.Контрагент.ЦветФона					= Новый Цвет;
		Элементы.Контрагент.ЦветРамки					= Новый Цвет;
		Элементы.Контрагент.ЦветТекстаЗаголовка			= Новый Цвет;
		Элементы.КонтрагентДоговора.ЦветРамки			= Новый Цвет;
		Элементы.КонтрагентДоговора.ЦветТекстаЗаголовка	= Новый Цвет;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) И Объект.Договор.ДатаОкончанияДействия < НачалоДня(ТекущаяДата()) Тогда
		Элементы.Договор.ЦветФона			= WebЦвета.Коралловый;
		Элементы.Договор.ЦветТекстаЗаголовка= WebЦвета.Коралловый;
		Элементы.Договор.Заголовок = "Договор ПРОСРОЧЕН...";
	Иначе
		Элементы.Договор.ЦветФона			= Новый Цвет;
		Элементы.Договор.ЦветТекстаЗаголовка= Новый Цвет;
		Элементы.Договор.Заголовок = "Договор:";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
// управляет видимостью элементов диалога
Процедура УправлениеДиалогом()
	
	Элементы.КоличествоДнейПериодичности.ТолькоПросмотр	= Объект.ПериодичностьЗаказа <> ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","ОдинРазВУказанноеКоличествоДней");
	Элементы.СрокПоставки.ТолькоПросмотр				= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.ВремяОтправкиЗаказа.ТолькоПросмотр			= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.СуммаМинимальногоЗаказа.ТолькоПросмотр		= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	Элементы.ДниНедели.ТолькоПросмотр					= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.ПериодичностьПоДнямНедели.ТолькоПросмотр	= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный");
	Элементы.КоличествоМинимальногоЗаказа.ТолькоПросмотр= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.СуммаМинимальногоЗаказа);
	Элементы.Миксация.ТолькоПросмотр					= Объект.ПериодичностьЗаказа = ПолучитьЗначениеПеречисления("ВидыПериодичностиЗаказов","Неактуальный") ИЛИ ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
	Элементы.Миксация.Видимость							= ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМинимальнымЗаказом()
	Элементы.СуммаМинимальногоЗаказа.ТолькоПросмотр = ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа) ИЛИ Объект.Миксация;
	Элементы.КоличествоМинимальногоЗаказа.ТолькоПросмотр = ЗначениеЗаполнено(Объект.СуммаМинимальногоЗаказа);
	Элементы.Миксация.Видимость = ЗначениеЗаполнено(Объект.КоличествоМинимальногоЗаказа) ИЛИ Объект.Миксация;
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьЗаказаПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура СуммаМинимальногоЗаказаПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМинимальногоЗаказаПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура МиксацияПриИзменении(Элемент)
	УправлениеМинимальнымЗаказом()
КонецПроцедуры

&НаКлиенте
Процедура ДниНеделиПриИзменении(Элемент)
	Если СтрДлина(СокрЛП(Объект.ДниНедели))>1 И Объект.ПериодичностьЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.Ежедневно")
		И Объект.ПериодичностьЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.НеИспользовать") Тогда
		ПоказатьПредупреждение(,"Установленная периодичность '"+Объект.ПериодичностьЗаказа+"' подразумевает выбор только одного дня недели!!!");	
	ИначеЕсли СтрДлина(СокрЛП(Объект.ДниНедели))=1 И Объект.ПериодичностьЗаказа = ПредопределенноеЗначение("Перечисление.ВидыПериодичностиЗаказов.Ежедневно") Тогда
		ПоказатьПредупреждение(,"Установленная периодичность '"+Объект.ПериодичностьЗаказа+"'"+Символы.ПС+" НЕ подразумевает выбор только одного дня недели!!!");
	КонецЕсли;
	
КонецПроцедуры

функция ПолучитьЗначениеПеречисления (ИмяПеречисления,ИмяЭлемента)
	Возврат перечисления[ИмяПеречисления][ИмяЭлемента];	
КонецФункции


&НаКлиенте
Процедура ДниНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Ложь);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Переодичность,ДниНедели", Ложь, СокрЛП(Элементы.ДниНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДниНедели(Результат,Переодичность)	Экспорт
	Если Переодичность Тогда
		Объект.ПериодичностьПоДнямНедели = Результат;
	Иначе
		Объект.ДниНедели = Результат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПериодичностьПоДнямНеделиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПолучитьДниНедели",ЭтотОбъект,Истина);
	ОткрытьФорму("ОбщаяФорма.ДниНедели", Новый Структура("Переодичность,ДниНедели,ДеньПоставкиПоДнямНедели", Истина, СокрЛП(Элементы.ДниНедели.ТекстРедактирования), СокрЛП(Элементы.ПериодичностьПоДнямНедели.ТекстРедактирования)), ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//СтандартнаяОбработка=Ложь;
КонецПроцедуры


&НаКлиенте
Процедура НачалоВыбораПоСкладу(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяПлощадкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ВыборПоСкладу Тогда
		СтандартнаяОбработка = Ложь;
		НачалоВыбораПоСкладу(Элемент);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТорговаяПлощадкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыборПоСкладу Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ТорговаяПлощадка = получитьЗначениеРеквизита(ВыбранноеЗначение,"ТорговаяПлощадка");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
функция получитьЗначениеРеквизита (эл,имяРеквизита)
	Возврат эл[имяРеквизита];
КонецФункции

&НаКлиенте
Процедура ВыборПоСкладуПриИзменении(Элемент)
	Если ВыборПоСкладу Тогда
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Зеленый;	
	Иначе
		Элемент.ЦветТекстаЗаголовка = Новый Цвет;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЧерезТСДПриИзменении(Элемент)
	Если Объект.ЧерезТСД Тогда
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Пурпурный;	
	Иначе
		Элемент.ЦветТекстаЗаголовка = Новый Цвет;	
	КонецЕсли;
	
КонецПроцедуры

