#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	//	
	//	Если ДанныеЗаполнения.Свойство("Товары") Тогда
	//		Товары.Загрузить(ДанныеЗаполнения.Товары);
	//	КонецЕсли;
	//Иначе
	//	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СтатусЗаказаВеб	  	  = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовВеб.НеОтправлен");
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Автор 				  = Пользователи.ТекущийПользователь();
	ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	КурсДокумента         = 1;
	СтатусЗаказаВеб	  	  = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовВеб.НеОтправлен");
	ХозОперация 	  = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПоставщикуКонсолидированный");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("Товары") Тогда
			Товары.Загрузить(ДанныеЗаполнения.Товары);
		КонецЕсли;
	Иначе
		Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
		ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
		СкладКомпании		  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнойСклад",,СкладКомпании);	
		ТорговаяПлощадка	  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяТорговаяПлощадка",,ТорговаяПлощадка);	
		//	Если ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002") Тогда
		//	Иначе
		//		ХозОперация 	  = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПоставщику");
		//	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	/////Не регистрировать для выгрузки голобал центр
	//Если НЕ ТорговаяПлощадка.РегистрироватьТК Тогда
	//	ДополнительныеСвойства.Вставить("ОбменТК");
	//КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЕстьНулевыеЦены = ЕстьНулевыеЦены();
		Отказ = Отказ ИЛИ ЕстьНулевыеЦены; 
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ЗаказПоставщику.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ЗаказыСервер.ОтразитьЗаказыПоставщикам(ДополнительныеСвойства, Движения, Отказ);
	
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаОбработкаЗаказовПоставщику") Тогда
		ЗаказыСервер.ОтразитьОбработкаЗаказовПоставщику(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//ЗаказыСервер.ОтразитьОбработкаЗаказовПоставщику(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры



Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если  СрокПоставки < Дата Или СрокПоставки < ТекущаяДата() Тогда
		ОбщегоНазначения.СообщитьПользователю("Срок поставки не может быть меньше даты документа, либо текущей даты!!!",
		ЭтотОбъект,
		"СрокПоставки");
		
		Отказ = Истина;
	КонецЕсли;
	
	Если ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(Контрагент) Тогда 
		ПроверяемыеРеквизиты.Добавить("СкладКомпании");
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьНулевыеЦены()
	мСтрокБезЦены = Товары.НайтиСтроки(Новый Структура("Цена",0));
	Для Каждого строка Из мСтрокБезЦены Цикл
		ОбщегоНазначения.СообщитьПользователю("Отсутствует закупочная цена ("+строка.Номенклатура.Артикул+") " + СокрЛП(строка.Номенклатура));
	КонецЦикла;
	Возврат мСтрокБезЦены.Количество();
КонецФункции


#КонецЕсли
