
Процедура ВыполнитьЗагрузку(Загруженные,НаДату, ЗагружатьЗКС = Истина, ЗагружатьПРРО = Истина) Экспорт
	
	ОбработкаОбъект = Обработки.ТК_zFoc.Создать();
	ОбработкаОбъект.ВыполнитьЗагрузку(Загруженные, НаДату, ЗагружатьЗКС, ЗагружатьПРРО);
	
КонецПроцедуры


Процедура ЗапуститьВыгузку(ДатаВыгрузкиПродаж = Неопределено,ВыгружатьПродажи=Истина,ВыгружатьОстатки=Истина)Экспорт

	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "zFoc";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = "Выгрузка продажи/остатки Аттика Foc";
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Пользователь: "+Пользователи.ТекущийПользователь(), СтруктруаЗаписиРезультатаВыполнения,СтатусСообщения.Информация);
	ЗавершитьСошибкой = Ложь;

	Если ДатаВыгрузкиПродаж = Неопределено Тогда
		ДатаПродаж = НачалоДня(ТекущаяДатаСеанса()-60*60*24);
	Иначе
		ДатаПродаж = ДатаВыгрузкиПродаж;
	КонецЕсли;
	
	Если ВыгружатьПродажи Тогда
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Дата выгрузки продаж - "+Формат(ДатаПродаж,"ДФ=yyyy-MM-dd"), СтруктруаЗаписиРезультатаВыполнения,СтатусСообщения.Информация);
		НачалоВыгрузки = ТекущаяДатаСеанса();
		ПараметрыВыгрузки = Новый Структура;
		ПараметрыВыгрузки.Вставить("ВыгружатьПродажи",Новый Структура("ДатаПродаж",ДатаПродаж));
		
		
		ОбработкаОбъект = Обработки.ТК_zFoc.Создать();
		Попытка
			ОбработкаОбъект.ВыполнитьВыгрузку(ПараметрыВыгрузки); 
		Исключение
			пОшибка = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(пОшибка);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(пОшибка,СтруктруаЗаписиРезультатаВыполнения);
			ЗавершитьСошибкой = Истина;
		КонецПопытки;
		КонецВыгрузки = ТекущаяДатаСеанса(); 
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Время выполнения выгрузки продаж - "+Строка(КонецВыгрузки-НачалоВыгрузки)+"с.", СтруктруаЗаписиРезультатаВыполнения,СтатусСообщения.Информация);
	КонецЕсли;
	
	Если ВыгружатьОстатки Тогда
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Выгрузка текущих остатков", СтруктруаЗаписиРезультатаВыполнения,СтатусСообщения.Информация);
		
		ПараметрыВыгрузки = Новый Структура;
		ПараметрыВыгрузки.Вставить("ВыгружатьОстатки",Истина);
		НачалоВыгрузки = ТекущаяДатаСеанса();
		Попытка
			ОбработкаОбъект.ВыполнитьВыгрузку(ПараметрыВыгрузки); 
		Исключение
			пОшибка = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(пОшибка);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(пОшибка,СтруктруаЗаписиРезультатаВыполнения);
			ЗавершитьСошибкой = Истина;
		КонецПопытки;
		
		КонецВыгрузки = ТекущаяДатаСеанса(); 
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Время выполнения выгрузки остатков - "+Строка(КонецВыгрузки-НачалоВыгрузки)+"с.", СтруктруаЗаписиРезультатаВыполнения,СтатусСообщения.Информация);
	КонецЕсли;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, НЕ ЗавершитьСошибкой);
 
	
КонецПроцедуры
