
Функция ПолучитьДанныеДляПечати(Маршрут, Склад, Организация)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПечатиМашрутныхЛистов.Ссылка КАК Ссылка,
		|	ДанныеДляПечатиМашрутныхЛистов.Наименование КАК Наименование,
		|	ДанныеДляПечатиМашрутныхЛистов.Маршрут КАК Маршрут,
		|	ДанныеДляПечатиМашрутныхЛистов.Принтер КАК Принтер,
		|	ДанныеДляПечатиМашрутныхЛистов.Склад КАК Склад,
		|	ДанныеДляПечатиМашрутныхЛистов.Автомобиль КАК Автомобиль,
		|	ДанныеДляПечатиМашрутныхЛистов.Водитель КАК Водитель,
		|	ДанныеДляПечатиМашрутныхЛистов.Перевозчик КАК Перевозчик,
		|	ДанныеДляПечатиМашрутныхЛистов.Организация КАК Организация,
		|	ДанныеДляПечатиМашрутныхЛистов.Экспедитор КАК Экспедитор,
		|	ДанныеДляПечатиМашрутныхЛистов.Пользователи.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Пользователь КАК Пользователь
		|	) КАК Пользователи
		|ИЗ
		|	Справочник.ДанныеДляПечатиМашрутныхЛистов КАК ДанныеДляПечатиМашрутныхЛистов
		|ГДЕ
		|	ДанныеДляПечатиМашрутныхЛистов.Маршрут = &Маршрут
		|	И ДанныеДляПечатиМашрутныхЛистов.Склад = &Склад
		|	И ДанныеДляПечатиМашрутныхЛистов.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции 