

#Область ВосстановленияПоследовательностиПартии

Процедура ЗапуститьФоновоеВосстановлениеПартий(МассивСкладов=Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПартий);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ЗапуститьФоновоеВосстановлениеПартий(МассивСкладов);
	
КонецПроцедуры

Процедура ЗапуститьФоновоеВосстановлениеВзаиморасчеты(МассивДоговораКонтрагента=Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиВзаиморасчетов);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ЗапуститьФоновоеВосстановлениеВзаиморасчеты(МассивДоговораКонтрагента);
	
КонецПроцедуры

Процедура ЗапуститьФоновоеВосстановлениеПартииОрганизаций(МассивДляОтбора=Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностиПартийОрганизаций);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ЗапуститьФоновоеВосстановлениеПартииОрганизаций(МассивДляОтбора);
	
КонецПроцедуры




Процедура ВыполнитьВосстановлениеПартий(Склад, МоментВремени,КоличествоДокументовПотоке,ДобавитьНовыеПотокиПослеЗавершения=Ложь,МассивСкладовДляОтбора=Неопределено)Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ВыполнитьВосстановлениеПоследовательностиПартийПоСкладу(Склад, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивСкладовДляОтбора);	
	
КонецПроцедуры

Процедура ВыполнитьВосстановлениеВзаиморасчеты(ДоговорКонтрагента, МоментВремени,КоличествоДокументовПотоке,ДобавитьНовыеПотокиПослеЗавершения=Ложь,МассивДоговораДляОтбора=Неопределено)Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ВыполнитьВосстановлениеПоследовательностиВзаиморасчетовПоДоговору(ДоговорКонтрагента, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивДоговораДляОтбора);	
	
КонецПроцедуры

Процедура ВыполнитьВосстановлениеПоследовательностиПартийПоОрганизации(Организация, МоментВремени,КоличествоДокументовПотоке,ДобавитьНовыеПотокиПослеЗавершения=Ложь,МассивДляОтбора=Неопределено)Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ВыполнитьВосстановлениеПоследовательностиПартийПоОрганизации(Организация, МоментВремени, КоличествоДокументовПотоке, ДобавитьНовыеПотокиПослеЗавершения, МассивДляОтбора);	
	
КонецПроцедуры




#КонецОбласти


#Область ОбменДанными

Процедура ЗапуститьЗагрузкуКонтактнойИнормацииДК()Экспорт
	ОбработкаОбъект = Обработки.ТК_ОбменСайтДигма.Создать();
	ОбработкаОбъект.ВыполнитьОбмен();
КонецПроцедуры

Процедура ЗапуститьЗагрузкуНормативноСправочнойИнформации() Экспорт 
	//	ОбработкаОбъект = Обработки.ТК_ЗагрузкаИзменений_Global_Center.Создать();
	//	ОбработкаОбъект.ЗагрузитьДанные("ЗагрузкаСправочники_Global_Center");
КонецПроцедуры

Процедура ЗапуститьЗагрузкуДокументов() Экспорт 
	//ОбработкаОбъект = Обработки.ТК_ЗагрузкаИзменений_Global_Center.Создать();
	
	//ОбработкаОбъект.ЗагрузитьДанные("ЗагрузкаДокументы_Global_Center");
КонецПроцедуры

Процедура ЗапуститьЗагрузкуДокументов_УпрДок() Экспорт 
	ОбработкаОбъект = Обработки.ТК_ЗагрузкаИзменений_УпрДок.Создать();
	ОбработкаОбъект.ЗагрузитьДанные("ЗагрузкаДокументы_УпрДок");
КонецПроцедуры

Процедура ЗапуститьЗагрузкуДокументов_ФС() Экспорт 
	
	ОбработкаОбъект = Обработки.ТК_ЗагрузкаИзменений_ФС.Создать();
	ОбработкаОбъект.ЗагрузитьДанные("ЗагрузкаДокументы_ФС");
	
КонецПроцедуры


Процедура ЗапуститьЗагрузкуДокументовПоступления() Экспорт 
	ОбработкаОбъект = Обработки.ТК_ЗагрузкаИзменений_Global_Center.Создать();
	Массив = Новый Массив;
	Массив.Добавить("ПротоколСогласованияЦен");
	Массив.Добавить("ИзменениеЦен");
	Массив.Добавить("ИзменениеАссортиментаПодразделения");
	Массив.Добавить("ПоступлениеТоваров");
	Массив.Добавить("ЗаказПоставщику");
	Массив.Добавить("арт_ГрафикЗаказов");
	Массив.Добавить("арт_УстановкаГраницОстаткаНоменклатуры");
	Массив.Добавить("ВыпискаПоПодразделению");
	Массив.Добавить("ПриходныйКассовыйОрдер");
	Массив.Добавить("РасходныйКассовыйОрдер");
	ОбработкаОбъект.ЗагрузитьДанные("ЗагрузкаДокументы_Global_Center",Массив);
КонецПроцедуры

Процедура ЗапуститьВыгрузкуДокументов_УпрДок() Экспорт 
	Если Метаданные.Обработки.Найти("ТК_ВыгрузкаИзменений_УпрДок") <> Неопределено Тогда
		Обработки["ТК_ВыгрузкаИзменений_УпрДок"].ВыгрузитьДанные();
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьВыгрузкуДокументов_Консолидация() Экспорт 
	Если Метаданные.Обработки.Найти("ТК_ВыгрузкаИзменений_Консолидация") <> Неопределено Тогда
		Обработки["ТК_ВыгрузкаИзменений_Консолидация"].ВыгрузитьДанные();
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьВыгрузкуДокументов_Бухгалтерия() Экспорт 
	Если Метаданные.Обработки.Найти("ВыгрузкаДокументовВБухгалтерию") <> Неопределено Тогда
		Обработки["ВыгрузкаДокументовВБухгалтерию"].ВыгрузитьДанные();
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьВыгрузкуНСИ() Экспорт 
	Если Метаданные.Обработки.Найти("ВыгрузкаНСИ") <> Неопределено Тогда
		Обработки["ВыгрузкаНСИ"].ВыгрузитьДанные();
		//Обработки["ВыгрузкаНСИ"].ВыгрузитьВБазу("OrdersChees","MLK");
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьЗагрузкаПлатежныхПоручений() Экспорт 
	Если Метаданные.Обработки.Найти("ЗагрузкаПлатежныхПоручений") <> Неопределено Тогда
		Обработки["ЗагрузкаПлатежныхПоручений"].ЗапуститьЗагрузку();
	КонецЕсли;
КонецПроцедуры

Процедура ЗапуститьВыгрузкуPlanohero() Экспорт
	
	ОбработкаОбъект = Обработки.ВыгрузкаPlanohero.Создать();
	ОбработкаОбъект.НачатьВыгрузку();	
	
КонецПроцедуры

Процедура ЗагрузкаДокументовВендинг() Экспорт
	
	Перем ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов;
	
	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("ЗакрытиеСмены");
	
	НачалоПериода = НачалоДня(ТекущаяДата() - 3 * 86400);
	КонецПериода = ТекущаяДата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВендинг = Обработки.ВендингАвтоматы;
	ОбработкаВендинг = МенеджерВендинг.Создать();
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗагрузки.Вставить("КонецПериода", КонецПериода);
	ПараметрыЗагрузки.Вставить("ОтборПоСкладам", Ложь);
	ПараметрыЗагрузки.Вставить("МассивСкладов", МенеджерВендинг.МассивСкладов());
	
	ИдентификаторОбработки = "АвтоматыВендинг";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;	
	
	пТаблицаДокументов 		 = ОбработкаВендинг.ТаблицаДокументов.Выгрузить();
	пТаблицаСнятыхЗетОтчетов = ОбработкаВендинг.ТаблицаСнятыхЗетОтчетов.Выгрузить();
	
	Для Каждого ВидДокумента Из МассивВидовДокументов Цикл 
		Отказ = Ложь;
		
		пТаблицаДокументов.Очистить();
		пТаблицаСнятыхЗетОтчетов.Очистить();
		
		СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
		СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
		СтруктураЗаписи.КлючОбработки = "Загрузка документа " + ВидДокумента;
		
		регРезультатВыполнения.ДобавитьКомментарий(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Начата загрузка документа ''%1'' за период с %2 - %3",
		ВидДокумента,
		ПараметрыЗагрузки.НачалоПериода,
		ПараметрыЗагрузки.КонецПериода),
		СтруктураЗаписи);
		
		Попытка
			Результат = МенеджерВендинг.ЗагрузитьТаблицуДокументов(ВидДокумента, ПараметрыЗагрузки, пТаблицаДокументов, пТаблицаСнятыхЗетОтчетов);
			Если ТипЗнч(Результат) <> Тип("Структура") Тогда 				
				регРезультатВыполнения.СообщитьОбОшибке("Не получен результат загрузки документов!", СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
		Исключение
			регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецПопытки;
		
		Если Не Отказ Тогда 			
			ТаблицаДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаДокументов", пТаблицаДокументов);
			ТаблицаСнятыхЗетОтчетов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаСнятыхЗетОтчетов", пТаблицаСнятыхЗетОтчетов);
			
			Если Результат.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(Результат.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;				
		КонецЕсли;				
		
		РезультатЗагрузки = Неопределено;
		Если Не Отказ Тогда 
			Попытка
				нСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
				Если нСтроки.Количество() > 0 Тогда 
					регРезультатВыполнения.ДобавитьКомментарий("Отмечено "+нСтроки.Количество()+" документ(ов) на загрузку", СтруктураЗаписи);
					РезультатЗагрузки = МенеджерВендинг.ВыполнитьЗагрузкуДокументов(ВидДокумента, 1, ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов);
				Иначе
					регРезультатВыполнения.ДобавитьКомментарий("Нет отмеченых документов для загрузки", СтруктураЗаписи);
				КонецЕсли;								
			Исключение
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
		Если Не Отказ И ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда 
			Если РезультатЗагрузки.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(РезультатЗагрузки.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;	
			
			текСообщения = Неопределено;
			Если РезультатЗагрузки.Свойство("СообщенияПользователю", текСообщения) И ТипЗнч(текСообщения) = Тип("ФиксированныйМассив") Тогда 
				Для Каждого Сообщение Из текСообщения Цикл
					Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
						регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Отказ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЗагрузки, "ЕстьОшибки", Ложь);
		КонецЕсли;
		
		// Проверим оставшиеся сообщения
		прСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ТипЗнч(прСообщения) = Тип("ФиксированныйМассив") Тогда 
			Для Каждого Сообщение Из прСообщения Цикл 
				Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
					регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Не Отказ);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыгрузкаДанныхВFirestore() Экспорт
	УзелПланаОбмена = ПланыОбмена.ОбменFirestore.НайтиПоКоду("DBG");
	Состав = УзелПланаОбмена.Метаданные().Состав;
	МассивМетаданных = Новый Массив;
	
	Для каждого Элемент Из Состав Цикл
		МассивМетаданных.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокУзлов", УзелПланаОбмена);
	
	Текст = "";
	Для Каждого Элемент Из МассивМетаданных Цикл
		Если ПустаяСтрока(Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Текст = Текст + ?(Текст = "", "", "ОБЪЕДИНИТЬ ВСЕ") + " 
		|ВЫБРАТЬ 
		|	""" + Элемент + """ КАК МетаПолноеИмя,
		|	Узел                КАК УзелОбмена,
		|	КОЛИЧЕСТВО(*) > 0	КАК Пометка,
		|	КОЛИЧЕСТВО(*)       КАК КоличествоИзменений
		|ИЗ
		|	" + Элемент + ".Изменения
		|ГДЕ
		|	Узел В (&СписокУзлов)
		|СГРУППИРОВАТЬ ПО
		|	Узел
		|";
	КонецЦикла;
	
	Если Текст <> "" Тогда
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить().Выгрузить();
		ОбработкаСервисДеск = Обработки.СервисДеск.Создать();
		ОбработкаСервисДеск.УзелПланаОбмена = УзелПланаОбмена;
		ОбработкаСервисДеск.ВыгрузитьДанныеВFirestore(Результат);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузкаДанныхПоОбучению() Экспорт
	УзелПланаОбмена = ПланыОбмена.ОбменОбучение.НайтиПоКоду("DBG");
	Состав = УзелПланаОбмена.Метаданные().Состав;
	МассивМетаданных = Новый Массив;
	
	Для каждого Элемент Из Состав Цикл
		МассивМетаданных.Добавить(Элемент.Метаданные.ПолноеИмя());
	КонецЦикла;
	
	СоответствиеКоллекций = Новый Соответствие;
	СоответствиеКоллекций.Вставить("Справочник.ФизическиеЛица",	0);
	СоответствиеКоллекций.Вставить("Справочник.ТестовыеВопросы",1);
	СоответствиеКоллекций.Вставить("Справочник.Лекции",			2);
	СоответствиеКоллекций.Вставить("Справочник.Курсы",			3);
	СоответствиеКоллекций.Вставить("Справочник.Дисциплины",		4);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокУзлов", УзелПланаОбмена);
	
	Текст = "";
	Для Каждого Элемент Из МассивМетаданных Цикл
		Если ПустаяСтрока(Элемент) Тогда
			Продолжить;
		КонецЕсли;
		
		Порядок = СоответствиеКоллекций.Получить(Элемент);
		
		Текст = Текст + ?(Текст = "", "", "ОБЪЕДИНИТЬ ВСЕ") + " 
		|ВЫБРАТЬ 
		|	""" + Элемент + """ КАК МетаПолноеИмя,
		|	Узел                КАК УзелОбмена,
		|	"+Порядок+"         КАК Порядок,
		|	КОЛИЧЕСТВО(*) > 0	КАК Пометка,
		|	КОЛИЧЕСТВО(*)       КАК КоличествоИзменений
		|ИЗ
		|	" + Элемент + ".Изменения
		|ГДЕ
		|	Узел В (&СписокУзлов)
		|СГРУППИРОВАТЬ ПО
		|	Узел
		|";
	КонецЦикла;
	
	Если Текст <> "" Тогда
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Сортировать("Порядок");
		ОбработкаСервисДеск = Обработки.Обучение.Создать();
		ОбработкаСервисДеск.УзелПланаОбмена = УзелПланаОбмена;
		ОбработкаСервисДеск.ВыгрузитьДанныеВFirestore(Результат);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузитьСотрудниковНаОбучение() Экспорт
	Если Метаданные.Обработки.Найти("Обучение") <> Неопределено Тогда
		УзелПланаОбмена = ПланыОбмена.ОбменОбучение.НайтиПоКоду("DBG");
		ОбработкаОбъект = Обработки["Обучение"].Создать();
		ОбработкаОбъект.УзелПланаОбмена = УзелПланаОбмена;
		ОбработкаОбъект.ЗарегистрироватьНаВыгрузкуСотрудниковПоОбучению();
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузитьРежимыРаботыВЗУП() Экспорт 	
	Если Метаданные.Обработки.Найти("ТК_ВыгрузитьИзменения_ЗУП") <> Неопределено Тогда
		Обработки["ТК_ВыгрузитьИзменения_ЗУП"].ВыгрузитьДанные();
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти


#Область ПроцедурыЗаданий

Процедура ОчиститьРезультатыВыполненияОбработок()
	
	
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "ТК_ОчиститьУстаревшиеЗаписиРегистраВыполненияЗаданий";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = "РегламентныеЗадания";
	
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(ИмяКомпьютера(), СтруктруаЗаписиРезультатаВыполнения, Неопределено);
	
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 200
		|	РезультатыВыполненияОбработок.Дата КАК Дата,
		|	РезультатыВыполненияОбработок.ИдентификаторОбработки КАК ИдентификаторОбработки,
		|	РезультатыВыполненияОбработок.КлючОбработки КАК КлючОбработки
		|ИЗ
		|	РегистрСведений.РезультатыВыполненияОбработок КАК РезультатыВыполненияОбработок
		|ГДЕ
		|	РезультатыВыполненияОбработок.Дата <= &ДатаУдаления";
		
		Запрос.УстановитьПараметр("ДатаУдаления", ТекущаяДата()-60*60*24*10);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Нет данных для удаления!", СтруктруаЗаписиРезультатаВыполнения, Неопределено);
			РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);		
			Возврат;
		КонецЕсли;
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаКоличество = ВыборкаДетальныеЗаписи.Количество();
		РегистрыСведений.РезультатыВыполненияОбработок.ОчиститьУстаревшиеЗаписиРегистра(ВыборкаДетальныеЗаписи);
		
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Удалено записей " + ВыборкаКоличество, СтруктруаЗаписиРезультатаВыполнения, Неопределено);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);		
		
		
	Исключение
		
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание ошибки "+ОписаниеОшибки(), СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ОчиститьЖурналМобильныхАгентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	ТК_ЖурналМобильныхАгентов.Агент КАК Агент,
	|	ТК_ЖурналМобильныхАгентов.ДатаВремя КАК ДатаВремя,
	|	ТК_ЖурналМобильныхАгентов.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	РегистрСведений.ТК_ЖурналМобильныхАгентов КАК ТК_ЖурналМобильныхАгентов
	|ГДЕ
	|	ТК_ЖурналМобильныхАгентов.ДатаВремя <= &ДатаУдаления";
	
	Запрос.УстановитьПараметр("ДатаУдаления", ТекущаяДата()-60*60*24*10);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РегистрыСведений.ТК_ЖурналМобильныхАгентов.ОчиститьУстаревшиеЗаписиРегистра(ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Процедура ОчиститьОчередьПечатиТСД()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 200
	|	ТК_ОчередьПечатиТСД.Дата КАК Дата,
	|	ТК_ОчередьПечатиТСД.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_ОчередьПечатиТСД.Макет КАК Макет
	|ИЗ
	|	РегистрСведений.ТК_ОчередьПечатиТСД КАК ТК_ОчередьПечатиТСД
	|ГДЕ
	|	ТК_ОчередьПечатиТСД.Дата <= &ДатаУдаления";
	
	Запрос.УстановитьПараметр("ДатаУдаления", ТекущаяДата()-60*60*24*10);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РегистрыСведений.ТК_ОчередьПечатиТСД.ОчиститьУстаревшиеЗаписиРегистра(ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Процедура ОчиститьОтсканированныеQRКоды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 200
	|	ТК_ОтсканированныеQRкоды.ДанныеСканирования КАК ДанныеСканирования,
	|	ТК_ОтсканированныеQRкоды.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	РегистрСведений.ТК_ОтсканированныеQRкоды КАК ТК_ОтсканированныеQRкоды
	|ГДЕ
	|	ТК_ОтсканированныеQRкоды.Дата <= &ДатаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТК_ОтсканированныеQRкоды.Дата";
	
	Запрос.УстановитьПараметр("ДатаУдаления", ТекущаяДата() - (60*60*24*60));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВыборкаДеталныеЗаписи = РезультатЗапроса.Выбрать();
	
	РегистрыСведений.ТК_ОтсканированныеQRкоды.ОчиститьУстаревшиеЗаписиРегистра(ВыборкаДеталныеЗаписи);
	
КонецПроцедуры

Процедура СоздатьУдалитьОбновитьЗадачу(Заявка,Статус)
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	|	ЗадачиПоЗаявкам.Ссылка
	|ИЗ
	|	КритерийОтбора.ТК_ЗадачиПоЗаявкам(&ДокЗаявка) КАК ЗадачиПоЗаявкам";
	Запрос.УстановитьПараметр("ДокЗаявка",Заявка);
	
	Рез = Запрос.Выполнить();
	
	Если Статус = 1 Тогда
		Если НЕ  Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗадачаОбъект.Описание = ЗадачаОбъект.Описание + Символы.ПС +"Задача отменена - "+Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
			ЗадачаОбъект.Выполнена = Истина;
			ЗадачаОбъект.ПометкаУдаления = Истина;
			ЗадачаОбъект.Записать();
		КонецЕсли;
	Иначе
		Если Рез.Пустой() Тогда
			
			ЗадачаОбъект = Задачи.ТК_ЗадачаТСД.СоздатьЗадачу();
		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
		КонецЕсли;
		
		ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
		//ЗадачаОбъект.Инициатор   = Заявка.Автор;
		ЗадачаОбъект.ПометкаУдаления = Ложь;
		ЗадачаОбъект.ТорговаяПлощадка = Заявка.ТорговаяПлощадка;
		ЗадачаОбъект.Склад = Заявка.СкладКомпании;
		
		ЗадачаОбъект.Исполнитель   = Заявка.Автор;
		ЗадачаОбъект.Основание     = Заявка;
		ЗадачаОбъект.СрокИсполнения  = Заявка.СрокИсполнения;
		ЗадачаОбъект.Описание = ЗадачаОбъект.Описание + Символы.ПС +"Задача создана - "+Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
		ТипЗаявки =  ТипЗнч(Заявка);
		Если ТипЗаявки = Тип("ДокументСсылка.ТК_ЗаявкаНаВозвратПоставщику") Тогда
			ЗадачаОбъект.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.ВернутьПоставщику;
			ЗадачаОбъект.Наименование = "Вернуть поставщику: " +Строка(Заявка.Контрагент);
		ИначеЕсли ТипЗаявки = Тип("ДокументСсылка.ТК_ЗаявкаНаПеремещение") Тогда
			ЗадачаОбъект.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.Перемещение;
			ЗадачаОбъект.Наименование = "Перемещение на : " +Строка(Заявка.ТорговаяПлощадкаПолучатель);
		КонецЕсли;
		ЗадачаОбъект.Записать();
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗапуститьРасчетТБД(Параметры) Экспорт
	Перем Склад,ТорговаяПлощадка;
	
	Параметры.Свойство("Склад",Склад);
	Параметры.Свойство("ТорговаяПлощадка",ТорговаяПлощадка);
	
	ЗапросТекст =  "ВЫБРАТЬ
	|	ПродажиОбороты.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиОбороты.Номенклатура
	|		ИНАЧЕ ПродажиОбороты.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ вт_продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, , Период, &Парам1) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиОбороты.Номенклатура
	|		ИНАЧЕ ПродажиОбороты.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ,
	|	ПродажиОбороты.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ КАК ГруппировкаПоНоменклатуре,
	|	СУММА(ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Остаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&НачалоПериода, , Период, , &Парам2) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура
	|		ИНАЧЕ ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ,
	|	ОстаткиТоваровКомпанииОстаткиИОбороты.СкладКомпании.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ост.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	Ост.ГруппировкаПоНоменклатуре КАК Номенклатура,
	|	Ост.НачальныйОстаток КАК НачальныйОстаток,
	|	Ост.Остаток КАК Остаток,
	|	ЕСТЬNULL(Прод.КоличествоОборот, 0) КАК Продажи
	|ПОМЕСТИТЬ вт_ОстПрод
	|ИЗ
	|	ВТ_Остатки КАК Ост
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_продажи КАК Прод
	|		ПО Ост.ГруппировкаПоНоменклатуре = Прод.Номенклатура
	|			И Ост.ТорговаяПлощадка = Прод.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ОстаткиСумма
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(, &Парам2) КАК ПартииТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОстатки.СкладКомпании.ТорговаяПлощадка,
	|	ПартииТоваровКомпанииОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроизводствоОбороты.Ингредиент КАК Ингредиент
	|ПОМЕСТИТЬ Произвдство
	|ИЗ
	|	РегистрНакопления.Производство.Обороты(, , , СкладКомпании.Подразделение = &ПодразделениеКомпании) КАК ПроизводствоОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОстПрод.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	вт_ОстПрод.Номенклатура КАК Номенклатура,
	|	вт_ОстПрод.Остаток КАК Количество,
	|	вт_ОстПрод.Продажи КАК Продажи,
	|	ОстаткиСумма.СуммаОстаток КАК Сумма
	|ИЗ
	|	вт_ОстПрод КАК вт_ОстПрод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСумма КАК ОстаткиСумма
	|		ПО вт_ОстПрод.ТорговаяПлощадка = ОстаткиСумма.ТорговаяПлощадка
	|			И вт_ОстПрод.Номенклатура = ОстаткиСумма.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Произвдство КАК Произвдство
	|		ПО вт_ОстПрод.Номенклатура = Произвдство.Ингредиент
	|ГДЕ
	|	вт_ОстПрод.Продажи = 0
	|	И вт_ОстПрод.НачальныйОстаток <> 0
	|	И вт_ОстПрод.Остаток > 0
	|	И ВЫБОР
	|			КОГДА Произвдство.Ингредиент ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТорговаяПлощадка";
	Запрос = Новый Запрос;
	
	Если Не Склад = Неопределено Тогда
		
		ЗапросТекст = СтрЗаменить(ЗапросТекст,"&Парам1","ТорговаяПлощадка = &ТорговаяПлощадка");
		ЗапросТекст = СтрЗаменить(ЗапросТекст,"&Парам2","СкладКомпании = &СкладКомпании");
		
		
		Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадка);
		Запрос.УстановитьПараметр("СкладКомпании",Склад);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад,"Подразделение"));
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст,"&Парам1","ПодразделениеКомпании = &ПодразделениеКомпании И СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)");
		ЗапросТекст = СтрЗаменить(ЗапросТекст,"&Парам2","СкладКомпании.Подразделение = &ПодразделениеКомпании И СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)");
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании",Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008"));
	КонецЕсли;
	
	
	
	
	Запрос.Текст = ЗапросТекст;
	
	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДатаСеанса()-60*60*24*28);
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	Выборка = РезультатЗапроса.Выбрать();
	Период = ТекущаяДатаСеанса();
	Пока Выборка.СледующийПоЗначениюПоля("ТорговаяПлощадка") Цикл 
		
		НаборЗаписиПериод = РегистрыСведений.ТК_ТБД_Периоды.СоздатьНаборЗаписей();
		НаборЗаписиПериод.Отбор.Период.Установить(Период);
		НаборЗаписиПериод.Отбор.ТорговаяПлощадка.Установить(Выборка.ТорговаяПлощадка);
		
		НоваяЗаписьПериод = НаборЗаписиПериод.Добавить();
		НоваяЗаписьПериод.Период = Период;
		НоваяЗаписьПериод.ТорговаяПлощадка = Выборка.ТорговаяПлощадка;
		НаборЗаписиПериод.Записать();
		
		
		НаборЗаписи = РегистрыСведений.ТК_ТБД.СоздатьНаборЗаписей();
		НаборЗаписи.Отбор.Дата.Установить(Период);
		НаборЗаписи.Отбор.ТорговаяПлощадка.Установить(Выборка.ТорговаяПлощадка);
		
		
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = НаборЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Выборка,"ТорговаяПлощадка,Номенклатура,Количество,Сумма");
			НоваяЗапись.Дата = Период;
			
		КонецЦикла;
		
		НаборЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеРегламентныхФоновыхЗаданий

Функция ЗапускРегламентногоЗаданияРазрешен(РегламентноеЗадание) Экспорт
	
	Если НЕ РегламентноеЗадание.Использование Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Расписание = РегламентноеЗадание.Расписание;
	
	ТекущаяДата = ТекущаяДата();
	ТекущееВремя = Дата(0001, 01, 01, Час(ТекущаяДата), Минута(ТекущаяДата), Секунда(ТекущаяДата));
	
	Возврат (Расписание.ВремяНачала <= ТекущееВремя И ТекущееВремя <= Расписание.ВремяКонца);
	
КонецФункции // ЗапускРегламентногоЗаданияРазрешен()

#КонецОбласти


#Область ФормированиеОтчетов

Процедура ЗапуститьФормированиеОтчетовФМУ() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать(".ФМУ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовСтики() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("СТИКИ и VELO");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиТабакОпт() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Продажи Табак ОПТ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовРеализацияТабака() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Реализация Табака");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиПоФабрикам() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Продажи по фабрикам");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОбсягиПродажуІТЮ() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("ІТЮ - Обсяги продажу");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПриходыПоФабрикам() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Приходы по фабрикам");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОперативныйЕжедневный() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчет оперативный ежедневный");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовНовыйШаблонЗаказаСигаретНаРЦ() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Новый Шаблон заказа сигарет на РЦ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовШаблонЗаказаСигаретНаРЦ() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Шаблон заказа сигарет на РЦ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовШаблонЗаказаЭлектроСигаретНаРЦ() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Шаблон заказа электронных сигарет на РЦ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПоОборачиваемости() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчет по оборачиваемости товара");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовДляСоветаДиректоров() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчет для совета директоров");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовДебиторыАттики() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Дебиторы Аттики");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовДоступностьТовара() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Доступность товара");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиДистрибуцииПоФорме_ПрошлыйМесяц() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.ПрошлыйМесяц;
		
		Вариант = Новый СписокЗначений;
		Вариант.Добавить(Период,"Продажи дистрибуции по форме");
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать(Вариант);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиДистрибуцииПоФорме_СНачалаЭтогоМесяца() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.СНачалаЭтогоМесяца;
		
		Вариант = Новый СписокЗначений;
		Вариант.Добавить(Период,"Продажи дистрибуции по форме");
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать(Вариант);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиОптаДистрибуции() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Продажи ОПТа и Дистрибуции");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовТоварооборотИМаржа() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Товарооборот и маржа");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовВыкупленныйТовар() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Выкупленный товар");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовФмуПродажиОтМиши() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("ФМУ продажи от Миши");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиЭлСигаретПоТТ_ПрошлыйМесяц () Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Продажи по ТТ эл.сигарет_Месяц");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовПродажиЭлСигаретПоТТ_ПрошлаяНеделя () Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Продажи по ТТ эл.сигарет_Неделя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОтчетБАТ_ПрошлыйМесяц() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчеты БАТ_Месяц");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОтчетБАТ_ПрошлаяНеделя() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчеты БАТ_Неделя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОтчетJTI_ПрошлыйМесяц() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчеты JTI_Месяц");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормированиеОтчетовОтчетJTI_ПрошлаяНеделя() Экспорт
	
	Если Метаданные.Обработки.Найти("ФоновоеФормированиеОтчетов") <> Неопределено Тогда
		Обработки["ФоновоеФормированиеОтчетов"].Сформировать("Отчеты JTI_Неделя");
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти


#Область РегламентныеЗадания

Процедура ОчиститьУстаревшиеРезультатыВыполненияОбработок ()Экспорт
	
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ОчиститьУстаревшиеЗаписиРегистраВыполненияЗаданий);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОчиститьРезультатыВыполненияОбработок();
	ОчиститьЖурналМобильныхАгентов();
	ОчиститьОчередьПечатиТСД();
	
	ОчиститьОтсканированныеQRКоды();
КонецПроцедуры

Процедура РасчитатьТБД()Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_РасчетТБД);
	
	УстановитьПривилегированныйРежим(Истина);
	Параметры = Новый Структура;
	ЗапуститьРасчетТБД(Параметры);
	
	
КонецПроцедуры


Процедура ЗагрузитьДокументыOS(ПараметрыЗагрузки, МассивВидовДокументов)
	
	
	Перем ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, ТаблицаТКС;
	
	ИдентификаторОбработки = "ТК_ОбменOpenStore";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;	
	
	МенеджерОС = Обработки.ТК_ОбменOpenStore;
	ОбработкаОС = МенеджерОС.Создать();
	
	пТаблицаДокументов 		 = ОбработкаОС.ТаблицаДокументов.Выгрузить();
	пТаблицаСнятыхЗетОтчетов = ОбработкаОС.ТаблицаСнятыхЗетОтчетов.Выгрузить();
	пТаблицаТКС				 = ОбработкаОС.ТаблицаТКС.Выгрузить();	
	
	Для Каждого ВидДокумента Из МассивВидовДокументов Цикл 
		Отказ = Ложь;
		
		пТаблицаДокументов.Очистить();
		пТаблицаСнятыхЗетОтчетов.Очистить();
		пТаблицаТКС.Очистить();
		
		
		СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
		СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
		СтруктураЗаписи.КлючОбработки = "Загрузка документа " + ВидДокумента + " по узлу "+Строка(ПараметрыЗагрузки.УзелОбмена);
		
		регРезультатВыполнения.ДобавитьКомментарий(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Начата загрузка документа ''%1'' за период с %2 - %3",
		ВидДокумента,
		ПараметрыЗагрузки.НачалоПериода,
		ПараметрыЗагрузки.КонецПериода),
		СтруктураЗаписи);
		
		Попытка
			Результат = МенеджерОС.ЗагрузитьТаблицуДокументов(ВидДокумента, ПараметрыЗагрузки, пТаблицаДокументов, пТаблицаСнятыхЗетОтчетов, пТаблицаТКС);
			Если ТипЗнч(Результат) <> Тип("Структура") Тогда 				
				регРезультатВыполнения.СообщитьОбОшибке("Не получен результат загрузки документов!", СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
		Исключение
			регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецПопытки;
		
		Если Не Отказ Тогда 			
			ТаблицаДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаДокументов", пТаблицаДокументов);
			ТаблицаСнятыхЗетОтчетов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаСнятыхЗетОтчетов", пТаблицаСнятыхЗетОтчетов);
			ТаблицаТКС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаТКС", пТаблицаТКС);
			
			Если Результат.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(Результат.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;				
		КонецЕсли;				
		
		РезультатЗагрузки = Неопределено;
		Если Не Отказ Тогда 
			Попытка
				нСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
				Если нСтроки.Количество() > 0 Тогда 
					регРезультатВыполнения.ДобавитьКомментарий("Отмечено "+нСтроки.Количество()+" документ(ов) на загрузку", СтруктураЗаписи);
					РезультатЗагрузки = МенеджерОС.ВыполнитьЗагрузкуДокументов(ВидДокумента, 1, ПараметрыЗагрузки, ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, ТаблицаТКС);
				Иначе
					регРезультатВыполнения.ДобавитьКомментарий("Нет отмеченых документов для загрузки", СтруктураЗаписи);
				КонецЕсли;								
			Исключение
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
		Если Не Отказ И ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда 
			Если РезультатЗагрузки.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(РезультатЗагрузки.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;	
			
			текСообщения = Неопределено;
			Если РезультатЗагрузки.Свойство("СообщенияПользователю", текСообщения) И ТипЗнч(текСообщения) = Тип("ФиксированныйМассив") Тогда 
				Для Каждого Сообщение Из текСообщения Цикл
					Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
						регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Отказ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЗагрузки, "ЕстьОшибки", Ложь);
		КонецЕсли;
		
		// Проверим оставшиеся сообщения
		прСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ТипЗнч(прСообщения) = Тип("ФиксированныйМассив") Тогда 
			Для Каждого Сообщение Из прСообщения Цикл 
				Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
					регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Не Отказ);
	КонецЦикла;	
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыOS(ПараметрыВыгрузки, МассивВидовДокументов)
	
	Перем ТаблицаДокументов, ТаблицаСнятыхЗетОтчетов, ТаблицаТКС;
	
	ИдентификаторОбработки = "ТК_ОбменOpenStore";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;	
	
	МенеджерОС = Обработки.ТК_ОбменOpenStore;
	ОбработкаОС = МенеджерОС.Создать();
	
	пТаблицаДокументов 		 = ОбработкаОС.ТаблицаДокументов.Выгрузить();
	пТаблицаСнятыхЗетОтчетов = ОбработкаОС.ТаблицаСнятыхЗетОтчетов.Выгрузить();
	пТаблицаТКС				 = ОбработкаОС.ТаблицаТКС.Выгрузить();	
	
	Для Каждого ВидДокумента Из МассивВидовДокументов Цикл 
		Отказ = Ложь;
		
		УзелОбмена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "УзелОбмена", Неопределено);
		
		СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
		СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
		СтруктураЗаписи.КлючОбработки = "Выгрузка документа " + ВидДокумента + ?(УзелОбмена <> Неопределено, " по узлу " + Строка(УзелОбмена), "");
		
		регРезультатВыполнения.ДобавитьКомментарий(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Начата выгрузка документа ''%1'' за период с %2 - %3",
		ВидДокумента,
		ПараметрыВыгрузки.НачалоПериода,
		ПараметрыВыгрузки.КонецПериода),
		СтруктураЗаписи);
		
		Попытка					
			Результат = МенеджерОС.ЗаполнитьТаблицуДокументовДляВыгрузи(ВидДокумента, ПараметрыВыгрузки, пТаблицаДокументов);
			Если ТипЗнч(Результат) <> Тип("Структура") Тогда 				
				регРезультатВыполнения.СообщитьОбОшибке("Не получен результат выгрузкидокуме документов!", СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецЕсли;
		Исключение
			регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецПопытки;
		
		Если Не Отказ Тогда 			
			ТаблицаДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ТаблицаДокументов", пТаблицаДокументов);
			
			Если Результат.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(Результат.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;				
		КонецЕсли;				
		
		РезультатВыгрузки = Неопределено;
		Если Не Отказ Тогда 
			Попытка
				нСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
				Если нСтроки.Количество() > 0 Тогда 
					регРезультатВыполнения.ДобавитьКомментарий("Отмечено "+нСтроки.Количество()+" документ(ов) на выгрузку", СтруктураЗаписи);
					РезультатВыгрузки = МенеджерОС.ВыполнитьВыгрузкуДокументов(ВидДокумента, ПараметрыВыгрузки, ТаблицаДокументов);
				Иначе
					регРезультатВыполнения.ДобавитьКомментарий("Нет отмеченых документов на выгрузку", СтруктураЗаписи);
				КонецЕсли;								
			Исключение
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
		Если Не Отказ И ТипЗнч(РезультатВыгрузки) = Тип("Структура") Тогда 
			Если РезультатВыгрузки.Свойство("СообщениеЗавершения") Тогда 
				регРезультатВыполнения.ДобавитьКомментарий(РезультатВыгрузки.СообщениеЗавершения, СтруктураЗаписи);
			КонецЕсли;	
			
			текСообщения = Неопределено;
			Если РезультатВыгрузки.Свойство("СообщенияПользователю", текСообщения) И ТипЗнч(текСообщения) = Тип("ФиксированныйМассив") Тогда 
				Для Каждого Сообщение Из текСообщения Цикл
					Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
						регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Отказ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыгрузки, "ЕстьОшибки", Ложь);
		КонецЕсли;
		
		// Проверим оставшиеся сообщения
		прСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ТипЗнч(прСообщения) = Тип("ФиксированныйМассив") Тогда 
			Для Каждого Сообщение Из прСообщения Цикл 
				Если Не Найти(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}") Тогда 
					регРезультатВыполнения.ДобавитьКомментарий(Сообщение.Текст, СтруктураЗаписи);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Не Отказ);
	КонецЦикла;		
	
КонецПроцедуры

Процедура ЗагрузкаДокументовИзOS() Экспорт 
	
	ДатаЗагрузки = ТекущаяДата() - 60*60*24*10;
	НачалоПериода = НачалоДня(ДатаЗагрузки);
	КонецПериода  = КонецДня(ТекущаяДата()- 60*60*24);
	
	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("ЗакрытиеСмены");
	МассивВидовДокументов.Добавить("ТКС");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ОбменФронт.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	ОбменФронт.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ОбменФронт.ЭтотУзел";
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыЗагрузки.Вставить("КонецПериода", КонецПериода);
		ПараметрыЗагрузки.Вставить("Подразделение", Выборка.ПодразделениеКомпании);
		ПараметрыЗагрузки.Вставить("УзелОбмена", Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("Проверка", Истина);
		ПараметрыЗагрузки.Вставить("ОтборПоСкладам", Ложь);
		ПараметрыПодключения = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыПодключения(Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("ПараметрыПодключения", ПараметрыПодключения);
		
		ЗагрузитьДокументыOS(ПараметрыЗагрузки, МассивВидовДокументов);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыгрузитьДокументыOS_ФС() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Загрузка документов
	Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000006"); //Фабрика сыра
	
	текДата = ТекущаяДата();
	НачалоПериода = НачалоДня(текДата - 60*60*24);
	КонецПериода  = КонецДня(текДата);
	
	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("ПеремещениеТоваров");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ОбменФронт.Ссылка КАК УзелОбмена,
	|	ОбменФронт.ВыгружатьПеремещения КАК ВыгружатьПеремещения,
	|	ОбменФронт.ПодразделениеКомпании.РежимЗагрузкиПеремещенийOS = 1 КАК ЗагружатьКорректировкиПеремещения
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	ОбменФронт.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ОбменФронт.ЭтотУзел
	|	И ОбменФронт.ПодразделениеКомпании = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыЗагрузки.Вставить("КонецПериода", КонецПериода);
		ПараметрыЗагрузки.Вставить("Подразделение", Выборка.ПодразделениеКомпании);
		ПараметрыЗагрузки.Вставить("УзелОбмена", Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("Проверка", Истина);
		ПараметрыЗагрузки.Вставить("ОтборПоСкладам", Истина);
		ПараметрыПодключения = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыПодключения(Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("ПараметрыПодключения", ПараметрыПодключения);
		ПараметрыЗагрузки.Вставить("ЗагружатьКорректировкиПеремещения", Выборка.ЗагружатьКорректировкиПеремещения); 
		
		ЗагрузитьДокументыOS(ПараметрыЗагрузки, МассивВидовДокументов);
		
		Если Выборка.ВыгружатьПеремещения Тогда 				
			МассивВидовДокументовВыгрузки = Новый Массив;
			МассивВидовДокументовВыгрузки.Добавить("ПеремещениеТоваров");		
			
			ПараметрыВыгрузки = Новый Структура("НачалоПериода,КонецПериода,Подразделение,УзелОбмена");
			ЗаполнитьЗначенияСвойств(ПараметрыВыгрузки, ПараметрыЗагрузки);
			ПараметрыВыгрузки.Вставить("ИзПланаОбмена", Истина);
			ПараметрыВыгрузки.Вставить("ПланОбмена", Выборка.УзелОбмена);
			
			ВыгрузитьДокументыOS(ПараметрыВыгрузки, МассивВидовДокументовВыгрузки);	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗагрузитьДокументыИзOS_ТС_Аттика() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002"); //ТС Аттика
	
	текДата = ТекущаяДата();
	НачалоПериода = НачалоДня(текДата - 60*60*24);
	КонецПериода  = КонецДня(текДата);
	
	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("ПоступлениеТоваров");
	МассивВидовДокументов.Добавить("ПеремещениеТоваров");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменФронт.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ОбменФронт.Ссылка КАК УзелОбмена
	|ИЗ
	|	ПланОбмена.ОбменФронт КАК ОбменФронт
	|ГДЕ
	|	ОбменФронт.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ОбменФронт.ЭтотУзел
	|	И ОбменФронт.ПодразделениеКомпании = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыЗагрузки.Вставить("КонецПериода", КонецПериода);
		ПараметрыЗагрузки.Вставить("Подразделение", Выборка.ПодразделениеКомпании);
		ПараметрыЗагрузки.Вставить("УзелОбмена", Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("Проверка", Истина);
		ПараметрыЗагрузки.Вставить("ОтборПоСкладам", Истина);
		ПараметрыПодключения = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыПодключения(Выборка.УзелОбмена);
		ПараметрыЗагрузки.Вставить("ПараметрыПодключения", ПараметрыПодключения);
		
		ЗагрузитьДокументыOS(ПараметрыЗагрузки, МассивВидовДокументов);
	КонецЦикла;	
	
	//Выгрузка документов
	ПараметрыВыгрузки = Новый Структура("НачалоПериода,КонецПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыВыгрузки, ПараметрыЗагрузки);
	ПараметрыВыгрузки.Вставить("Подразделение", Подразделение);
	ПараметрыВыгрузки.Вставить("Результат", Истина);
	ПараметрыВыгрузки.Вставить("СозданныеВБазе", Истина);
	
	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("Инвентаризация");
	
	ВыгрузитьДокументыOS(ПараметрыВыгрузки, МассивВидовДокументов);
КонецПроцедуры

Процедура ЗапуститьРасчетПотребностей(ТаблицаЗаказов,ИндексНачала,РазмерПроции,ТаблицаАнализАБЦ,РасчетСРц) Экспорт
	Попытка
		ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Авто расчет потребностей товара");   
		ДвоичныеДанные = ВнешняяОбработка.ХранилищеОбработки.Получить();
		ИмяФайла = ПолучитьИмяВременногоФайла("epf");
		ДвоичныеДанные.Записать(ИмяФайла);
		ОбъектОписанияЗащиты = новый ОписаниеЗащитыОтОпасныхДействий;
		ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла,Ложь,ОбъектОписанияЗащиты);
	Исключение
		ЗаписьЖурналаРегистрации("Расчет потребностей автозаказа",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
	ВсеОк = Истина; Ошибки = "";
	
	Попытка
		ВнешняяОбработка.РассчитатьПотребности(ТаблицаЗаказов,ИндексНачала,РазмерПроции,ТаблицаАнализАБЦ,,РасчетСРц);
	Исключение
		СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
		СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "АвтоЗаказ";
		СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = "Автозаказ фоново";
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(?(РасчетСРц,"с РЦ ","")+"Авто Формирование заказов АттикА"+Символы.ПС+ОписаниеОшибки(),СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
		
		ЗаписьЖурналаРегистрации(?(РасчетСРц,"с РЦ ","")+"Авто Формирование заказов АттикА",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗапуститьЗакрытиеЗаказовПоставщику() Экспорт
	
	Если Метаданные.Обработки.Найти("ЗакрытиеЗаказовПоставщику") <> Неопределено Тогда
		Обработки["ЗакрытиеЗаказовПоставщику"].СформироватьКорректировкуЗаказа(ТекущаяДата(),1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОбработкуАссортиментногоКомитета() Экспорт
	
	Если Метаданные.Обработки.Найти("ОбработкаАссортиментногоКомитета") <> Неопределено Тогда
		Обработки["ОбработкаАссортиментногоКомитета"].ОбработатьАссортиментныйКомитет();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьЗакрытиеОбработкаЗаказовПоставщику() Экспорт
	
	Если Метаданные.Обработки.Найти("ЗакрытиеОбработкаЗаказовПоставщику") <> Неопределено Тогда
		Обработки["ЗакрытиеОбработкаЗаказовПоставщику"].СформироватьКорректировку(ТекущаяДата(),15);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьЧисткуРасcчитанныхПотребностейТовара() Экспорт
	
	Если Метаданные.Обработки.Найти("ЧисткаРасcчитанныхПотребностейТовара") <> Неопределено Тогда
		Обработки["ЧисткаРасcчитанныхПотребностейТовара"].ВыполнитьЧистку(ТекущаяДата(),33);
	КонецЕсли;
	
КонецПроцедуры

Процедура ТК_ОбновитьИсториюДанных() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ОбновитьИсториюДанных);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсторияДанных.ОбновитьИсторию();
	
КонецПроцедуры

Процедура ОбработатьОчередиИзмененияНалоговыхНакладных() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбработки = "Формирование Налоговых накладных";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;		
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = "Обработка очереди создания Налоговых Накладных";		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров) КАК Документ,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров).Дата КАК Дата,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров).Проведен КАК Проведен,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров).ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров).РегламентированныйУчет КАК РеглУчет,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.РеализацияТоваров).ХозОперация КАК ХозОперация,
	|	""РеализацияТоваров"" КАК ВидДокумента
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.ТК_ОчередьНаОбработкуНалоговыхНакладных КАК ТК_ОчередьНаОбработкуНалоговыхНакладных
	|ГДЕ
	|	ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ ССЫЛКА Документ.РеализацияТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции),
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции).Дата,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции).Проведен,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции).ПометкаУдаления,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции).РегламентированныйУчет,
	|	ВЫРАЗИТЬ(ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ КАК Документ.ВыпускПродукции).ХозОперация,
	|	""ВыпускПродукции""
	|ИЗ
	|	РегистрСведений.ТК_ОчередьНаОбработкуНалоговыхНакладных КАК ТК_ОчередьНаОбработкуНалоговыхНакладных
	|ГДЕ
	|	ТК_ОчередьНаОбработкуНалоговыхНакладных.Документ ССЫЛКА Документ.ВыпускПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТК_НалоговаяНакладная.ДокументОснование КАК ДокументОснование,
	|	ТК_НалоговаяНакладная.Ссылка КАК ДокументНН,
	|	ТК_НалоговаяНакладная.Дата КАК Дата,
	|	ТК_НалоговаяНакладная.Проведен КАК Проведен,
	|	ТК_НалоговаяНакладная.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ТК_НалоговаяНакладная.Проведен
	|			ТОГДА 1
	|		КОГДА НЕ ТК_НалоговаяНакладная.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Документ.ТК_НалоговаяНакладная КАК ТК_НалоговаяНакладная
	|ГДЕ
	|	ТК_НалоговаяНакладная.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втДокументы.Документ КАК Документ
	|			ИЗ
	|				втДокументы КАК втДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ КАК Документ,
	|	втДокументы.Дата КАК Дата,
	|	втДокументы.Проведен КАК Проведен,
	|	втДокументы.ПометкаУдаления КАК ПометкаУдаления,
	|	втДокументы.РеглУчет КАК РеглУчет,
	|	втДокументы.ХозОперация КАК ХозОперация,
	|	втДокументы.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДокумента УБЫВ,
	|	Дата";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДокументы = МассивРезультатов[2];
	
	Если РезультатДокументы.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаНН = МассивРезультатов[1].Выгрузить();
	ТаблицаНН.Индексы.Добавить("ДокументОснование");
	ТаблицаНН.Сортировать("ДокументОснование, Порядок, Дата");
	
	Выборка = РезультатДокументы.Выбрать();	
	
	Статистика = Новый Структура("Обработано, РеализацияТоваров, ВыпускПродукции, СОшибками, Всего", 0, 0, 0, 0, Выборка.Количество());	
	регРезультатВыполнения.ДобавитьКомментарий("Начало обработки очереди - " + Статистика.Всего, СтруктураЗаписи);
	
	Пока Выборка.Следующий() Цикл 
		ВсеОк = Истина;
		
		ссДокумент = Выборка.Документ;				
		
		нСтрокиНН = ТаблицаНН.НайтиСтроки(Новый Структура("ДокументОснование", ссДокумент));				
		КоличествоНН = нСтрокиНН.Количество();
		
		СтруктураНН = Новый Структура("ДокументНН, Проведен, ПометкаУдаления", Неопределено, Ложь, Ложь);
		
		Если КоличествоНН > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтруктураНН, нСтрокиНН.Получить(0));
			
			Если КоличествоНН > 1 Тогда 
				Для Ит = 1 По нСтрокиНН.ВГраница() Цикл 
					текСтрНН = нСтрокиНН.Получить(Ит);
					Если Не текСтрНН.ПометкаУдаления Тогда 
						обДокНН = текСтрНН.ДокументНН.ПолучитьОбъект();
						Попытка
							обДокНН.УстановитьПометкуУдаления(Истина);
						Исключение	
						КонецПопытки;						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		//Vov41k 20.03.2023
		Если Выборка.ВидДокумента = "РеализацияТоваров" Тогда 
			ТребуетсяНН = Выборка.РеглУчет;
		ИначеЕсли Выборка.ВидДокумента = "ВыпускПродукции" Тогда 
			ТребуетсяНН = Выборка.РеглУчет И Выборка.ХозОперация = Справочники.ХозОперации.ВыпускПродукцииСРеализацией;
		Иначе
			ТребуетсяНН = Ложь;
		КонецЕсли;
		
		Если ТребуетсяНН И Выборка.Проведен Тогда
			
			Если КоличествоНН > 0 И СтруктураНН.ДокументНН <> Неопределено Тогда 
				обДокументНН = СтруктураНН.ДокументНН.ПолучитьОбъект();
				Если обДокументНН.ПометкаУдаления Тогда 
					обДокументНН.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				обДокументНН = Документы.ТК_НалоговаяНакладная.СоздатьДокумент();				
			КонецЕсли;
			
			обДокументНН.Заполнить(ссДокумент);
			обДокументНН.Дата = Выборка.Дата + 1;
			
			//Если обДокументНН.ЭтоНовый() Тогда 
			//	обДокументНН.УстановитьНовыйНомер();
			//КонецЕсли;
			//
			//Если ПустаяСтрока(обДокументНН.НомерДляБухгалтерии) Тогда 
			//	обДокументНН.НомерДляБухгалтерии = ОбщегоНазначенияТК.ПолучитьНомерНалоговогоДокументаДляБухгалтерии(обДокументНН.Дата, обДокументНН.Номер, обДокументНН.Организация);
			//КонецЕсли;
			
			Попытка
				обДокументНН.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			КонецПопытки;		
			
		ИначеЕсли КоличествоНН > 0 Тогда
			
			Если Не СтруктураНН.ПометкаУдаления И Не ТребуетсяНН Тогда
				
				обДокументНН = СтруктураНН.ДокументНН.ПолучитьОбъект();
				Попытка
					обДокументНН.УстановитьПометкуУдаления(Истина);			
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;
				
			ИначеЕсли СтруктураНН.Проведен Тогда 
				
				обДокументНН = СтруктураНН.ДокументНН.ПолучитьОбъект();			
				Попытка
					обДокументНН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;								
				
			КонецЕсли;
			
		КонецЕсли;			
		
		Если ВсеОк Тогда 
			Попытка
				МенеджерЗаписи = РегистрыСведений.ТК_ОчередьНаОбработкуНалоговыхНакладных.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Документ = ссДокумент;
				МенеджерЗаписи.Удалить();
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(Строка(ссДокумент) + ". Ошибки: " + ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);	
			КонецПопытки;
		КонецЕсли;		
		
		Если ВсеОк Тогда 						
			Статистика.Обработано = Статистика.Обработано + 1;
			
			Если Выборка.ВидДокумента = "РеализацияТоваров" Тогда 
				Статистика.РеализацияТоваров = Статистика.РеализацияТоваров + 1;
			ИначеЕсли Выборка.ВидДокумента = "ВыпускПродукции" Тогда 
				Статистика.ВыпускПродукции = Статистика.ВыпускПродукции + 1;
			КонецЕсли;
		Иначе
			Статистика.СОшибками = Статистика.СОшибками + 1;
		КонецЕсли;		
	КонецЦикла;
	
	регРезультатВыполнения.ДобавитьКомментарий(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Обработано - %1, ошибки - %2
	|    - РеализацияТоваров - %3
	|    - ВыпускПродукции - %4",
	Статистика.Обработано,
	Статистика.СОшибками,
	Статистика.РеализацияТоваров,
	Статистика.ВыпускПродукции),			
	СтруктураЗаписи);
	
	регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Статистика.СОшибками = 0);
	
КонецПроцедуры

Процедура ОбработатьОчередиИзмененияКорректировокНН() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбработки = "Формирование Корректировок налоговых накладных";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;		
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = "Обработка очереди ""Возврат от покупателя""";		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТК_ОчередьНаОбработкуВозвратаОтПокупателя.Документ КАК Документ,
	|	ТК_ОчередьНаОбработкуВозвратаОтПокупателя.Документ.Дата КАК Дата,
	|	ТК_ОчередьНаОбработкуВозвратаОтПокупателя.Документ.ПометкаУдаления КАК ПометкаУдаления,
	|	ТК_ОчередьНаОбработкуВозвратаОтПокупателя.Документ.Проведен КАК Проведен,
	|	ТК_ОчередьНаОбработкуВозвратаОтПокупателя.Документ.РегламентированныйУчет КАК РеглУчет
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.ТК_ОчередьНаОбработкуВозвратаОтПокупателя КАК ТК_ОчередьНаОбработкуВозвратаОтПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТК_Приложение2КНалоговойНакладной.Ссылка КАК ДокументПР2,
	|	ТК_Приложение2КНалоговойНакладной.Дата КАК Дата,
	|	ТК_Приложение2КНалоговойНакладной.ПометкаУдаления КАК ПометкаУдаления,
	|	ТК_Приложение2КНалоговойНакладной.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА ТК_Приложение2КНалоговойНакладной.Проведен
	|			ТОГДА 1
	|		КОГДА НЕ ТК_Приложение2КНалоговойНакладной.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Порядок,
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ТК_Приложение2КНалоговойНакладной КАК ТК_Приложение2КНалоговойНакладной
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТК_НалоговаяНакладная.Ссылка КАК Налоговая,
	|			втДокументы.Документ КАК ДокументОснование
	|		ИЗ
	|			Документ.ТК_НалоговаяНакладная КАК ТК_НалоговаяНакладная
	|				ЛЕВОЕ СОЕДИНЕНИЕ втДокументы КАК втДокументы
	|				ПО ТК_НалоговаяНакладная.ДокументОснование = втДокументы.Документ.ДокументОснование
	|		ГДЕ
	|			ТК_НалоговаяНакладная.ДокументОснование В
	|					(ВЫБРАТЬ
	|						втДокументы.Документ.ДокументОснование КАК ДокументДокументОснование
	|					ИЗ
	|						втДокументы КАК втДокументы)) КАК ВложенныйЗапрос
	|		ПО ТК_Приложение2КНалоговойНакладной.НалоговаяНакладная = ВложенныйЗапрос.Налоговая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ КАК Документ,
	|	втДокументы.Дата КАК Дата,
	|	втДокументы.ПометкаУдаления КАК ПометкаУдаления,
	|	втДокументы.Проведен КАК Проведен,
	|	втДокументы.РеглУчет КАК РеглУчет
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДокументы = МассивРезультатов[2];
	
	Если РезультатДокументы.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаНН = МассивРезультатов[1].Выгрузить();
	ТаблицаНН.Индексы.Добавить("ДокументОснование");
	ТаблицаНН.Сортировать("ДокументОснование, Порядок, Дата");
	
	Выборка = РезультатДокументы.Выбрать();	
	
	Статистика = Новый Структура("Обработано, СОшибками, Всего", 0, 0, Выборка.Количество());	
	регРезультатВыполнения.ДобавитьКомментарий("Начало обработки очереди - " + Статистика.Всего, СтруктураЗаписи);
	
	Пока Выборка.Следующий() Цикл 
		ВсеОк = Истина;
		
		ссДокумент = Выборка.Документ;				
		
		нСтрокиНН = ТаблицаНН.НайтиСтроки(Новый Структура("ДокументОснование", ссДокумент));				
		КоличествоНН = нСтрокиНН.Количество();
		
		СтруктураНН = Новый Структура("ДокументПР2, Проведен, ПометкаУдаления", Неопределено, Ложь, Ложь);
		
		Если КоличествоНН > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтруктураНН, нСтрокиНН.Получить(0));
			
			Если КоличествоНН > 1 Тогда 
				Для Ит = 1 По нСтрокиНН.ВГраница() Цикл 
					текСтрНН = нСтрокиНН.Получить(Ит);
					Если Не текСтрНН.ПометкаУдаления Тогда 
						обДокНН = текСтрНН.ДокументПР2.ПолучитьОбъект();
						Попытка
							обДокНН.УстановитьПометкуУдаления(Истина);
							регРезультатВыполнения.ДобавитьКомментарий("Документ " + обДокНН.ссылка + " помечен на удаление проверка 1, "+ссДокумент+" документ основание", СтруктураЗаписи);
						Исключение	
						КонецПопытки;						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Проведен И Выборка.РеглУчет Тогда
			
			Если КоличествоНН > 0 И СтруктураНН.ДокументПР2 <> Неопределено Тогда 
				обДокументПР2 = СтруктураНН.ДокументПР2.ПолучитьОбъект();
				Если обДокументПР2.ПометкаУдаления Тогда 
					обДокументПР2.УстановитьПометкуУдаления(Ложь);
					регРезультатВыполнения.ДобавитьКомментарий("Документ " + обДокументПР2.ссылка + " помечен на удаление проверка 2, "+ссДокумент + " документ основание", СтруктураЗаписи);
				КонецЕсли;
			Иначе
				обДокументПР2 = Документы.ТК_Приложение2КНалоговойНакладной.СоздатьДокумент();
			КонецЕсли;
			
			обДокументПР2.Заполнить(ссДокумент);
			обДокументПР2.Дата = Выборка.Дата + 1;
			
			Попытка
				обДокументПР2.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			КонецПопытки;		
			
		ИначеЕсли КоличествоНН > 0 Тогда
			
			Если Не СтруктураНН.ПометкаУдаления И (Не Выборка.РеглУчет ИЛИ Выборка.ПометкаУдаления) Тогда
				
				обДокументПР2 = СтруктураНН.ДокументПР2.ПолучитьОбъект();
				Попытка
					обДокументПР2.УстановитьПометкуУдаления(Истина);			
					регРезультатВыполнения.ДобавитьКомментарий("Документ " + обДокументПР2.ссылка + " помечен на удаление проверка 3, "+ссДокумент + " документ основание", СтруктураЗаписи);
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;
				
			ИначеЕсли СтруктураНН.Проведен Тогда 
				
				обДокументПР2 = СтруктураНН.ДокументПР2.ПолучитьОбъект();			
				Попытка
					обДокументПР2.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;								
				
			КонецЕсли;
			
		КонецЕсли;			
		
		Если ВсеОк Тогда 
			Попытка
				МенеджерЗаписи = РегистрыСведений.ТК_ОчередьНаОбработкуВозвратаОтПокупателя.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Документ = ссДокумент;
				МенеджерЗаписи.Удалить();
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);	
			КонецПопытки;
		КонецЕсли;		
		
		Если ВсеОк Тогда 						
			Статистика.Обработано = Статистика.Обработано + 1;
		Иначе
			Статистика.СОшибками = Статистика.СОшибками + 1;
		КонецЕсли;		
	КонецЦикла;
	
	регРезультатВыполнения.ДобавитьКомментарий(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Обработано - %1, ошибки - %2",
	Статистика.Обработано,
	Статистика.СОшибками),			
	СтруктураЗаписи);
	
	регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Статистика.СОшибками = 0);
	
КонецПроцедуры

Процедура ОбработатьОчередиИзмененияКонсолидированныхПриходов() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбработки = "Формирование Консолидированных приходов";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;		
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = "Обработка очереди ""Консолидированных приходов""";		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТК_ОчередьНаОбработкуКонсолидированыхПриходов.Документ КАК Документ,
	|	ТК_ОчередьНаОбработкуКонсолидированыхПриходов.Документ.Дата КАК Дата,
	|	ТК_ОчередьНаОбработкуКонсолидированыхПриходов.Документ.Проведен КАК Проведен,
	|	ТК_ОчередьНаОбработкуКонсолидированыхПриходов.Документ.ПометкаУдаления КАК ПометкаУдаления,
	|	ТК_ОчередьНаОбработкуКонсолидированыхПриходов.Документ.РН КАК РН
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.ТК_ОчередьНаОбработкуКонсолидированыхПриходов КАК ТК_ОчередьНаОбработкуКонсолидированыхПриходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсолидированныеОстаткиОрганизации.ДокументОснование КАК ДокументОснование,
	|	КонсолидированныеОстаткиОрганизации.Ссылка КАК ДокументКонс,
	|	КонсолидированныеОстаткиОрганизации.Дата КАК Дата,
	|	КонсолидированныеОстаткиОрганизации.Проведен КАК Проведен,
	|	КонсолидированныеОстаткиОрганизации.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА КонсолидированныеОстаткиОрганизации.Проведен
	|			ТОГДА 1
	|		КОГДА НЕ КонсолидированныеОстаткиОрганизации.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Документ.КонсолидированныеОстаткиОрганизации КАК КонсолидированныеОстаткиОрганизации
	|ГДЕ
	|	КонсолидированныеОстаткиОрганизации.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втДокументы.Документ КАК Документ
	|			ИЗ
	|				втДокументы КАК втДокументы)
	|	И КонсолидированныеОстаткиОрганизации.ДокументОснование ССЫЛКА Документ.ТК_НалоговаяНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ КАК Документ,
	|	втДокументы.Дата КАК Дата,
	|	втДокументы.Проведен КАК Проведен,
	|	втДокументы.ПометкаУдаления КАК ПометкаУдаления,
	|	втДокументы.РН КАК РН
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДокументы = МассивРезультатов[2];
	
	Если РезультатДокументы.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаНН = МассивРезультатов[1].Выгрузить();
	ТаблицаНН.Индексы.Добавить("ДокументОснование");
	ТаблицаНН.Сортировать("ДокументОснование, Порядок, Дата");
	
	Выборка = РезультатДокументы.Выбрать();	
	
	Статистика = Новый Структура("Обработано, СОшибками, Всего", 0, 0, Выборка.Количество());	
	регРезультатВыполнения.ДобавитьКомментарий("Начало обработки очереди - " + Статистика.Всего, СтруктураЗаписи);
	
	Пока Выборка.Следующий() Цикл 
		ВсеОк = Истина;
		
		ссДокумент = Выборка.Документ;				
		Внутренний = ссДокумент.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Внутренний;
		
		нСтрокиНН = ТаблицаНН.НайтиСтроки(Новый Структура("ДокументОснование", ссДокумент));				
		КоличествоНН = нСтрокиНН.Количество();
		
		СтруктураНН = Новый Структура("ДокументКонс, Проведен, ПометкаУдаления", Неопределено, Ложь, Ложь);
		
		Если КоличествоНН > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтруктураНН, нСтрокиНН.Получить(0));
			
			Если КоличествоНН > 1 Тогда 
				Для Ит = 1 По нСтрокиНН.ВГраница() Цикл 
					текСтрНН = нСтрокиНН.Получить(Ит);
					Если Не текСтрНН.ПометкаУдаления Тогда 
						обДокНН = текСтрНН.ДокументКонс.ПолучитьОбъект();
						Попытка
							обДокНН.УстановитьПометкуУдаления(Истина);
						Исключение	
						КонецПопытки;						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Проведен И Выборка.РН И Внутренний Тогда
			
			Если КоличествоНН > 0 И СтруктураНН.ДокументКонс <> Неопределено Тогда 
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();
				Если обДокументНН.ПометкаУдаления Тогда 
					обДокументНН.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				обДокументНН = Документы.КонсолидированныеОстаткиОрганизации.СоздатьДокумент();				
			КонецЕсли;
			
			обДокументНН.Заполнить(ссДокумент);
			обДокументНН.Дата = Выборка.Дата + 1;
			
			
			Если обДокументНН.ЭтоНовый() Тогда 
				обДокументНН.УстановитьНовыйНомер();
			КонецЕсли;
			
			Попытка
				обДокументНН.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			КонецПопытки;		
			
		ИначеЕсли КоличествоНН > 0 Тогда
			
			Если Не СтруктураНН.ПометкаУдаления И (Не Выборка.РН И НЕ Внутренний ИЛИ Выборка.ПометкаУдаления) Тогда
				
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();
				Попытка
					обДокументНН.УстановитьПометкуУдаления(Истина);			
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;
				
			ИначеЕсли СтруктураНН.Проведен Тогда 
				
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();			
				Попытка
					обДокументНН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;								
				
			КонецЕсли;
			
		КонецЕсли;			
		
		Если ВсеОк Тогда 
			Попытка
				МенеджерЗаписи = РегистрыСведений.ТК_ОчередьНаОбработкуКонсолидированыхПриходов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Документ = ссДокумент;
				МенеджерЗаписи.Удалить();
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);	
			КонецПопытки;
		КонецЕсли;		
		
		Если ВсеОк Тогда 						
			Статистика.Обработано = Статистика.Обработано + 1;
		Иначе
			Статистика.СОшибками = Статистика.СОшибками + 1;
		КонецЕсли;		
	КонецЦикла;
	
	регРезультатВыполнения.ДобавитьКомментарий(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Обработано - %1, ошибки - %2",
	Статистика.Обработано,
	Статистика.СОшибками),			
	СтруктураЗаписи);
	
	регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Статистика.СОшибками = 0);
	
КонецПроцедуры

Процедура ОбработатьОчередиИзмененияКонсолидированныхРасходов() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбработки = "Формирование Консолидированных расходов";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;		
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = "Обработка очереди ""Приложения2КНН""";		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТК_ОчередьНаОбработкуКонсолидированыхРасходов.Документ КАК Документ,
	|	ТК_ОчередьНаОбработкуКонсолидированыхРасходов.Документ.Дата КАК Дата,
	|	ТК_ОчередьНаОбработкуКонсолидированыхРасходов.Документ.Проведен КАК Проведен,
	|	ТК_ОчередьНаОбработкуКонсолидированыхРасходов.Документ.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.ТК_ОчередьНаОбработкуКонсолидированыхРасходов КАК ТК_ОчередьНаОбработкуКонсолидированыхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонсолидированныеОстаткиОрганизации.ДокументОснование КАК ДокументОснование,
	|	КонсолидированныеОстаткиОрганизации.Ссылка КАК ДокументКонс,
	|	КонсолидированныеОстаткиОрганизации.Дата КАК Дата,
	|	КонсолидированныеОстаткиОрганизации.Проведен КАК Проведен,
	|	КонсолидированныеОстаткиОрганизации.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА КонсолидированныеОстаткиОрганизации.Проведен
	|			ТОГДА 1
	|		КОГДА НЕ КонсолидированныеОстаткиОрганизации.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Документ.КонсолидированныеОстаткиОрганизации КАК КонсолидированныеОстаткиОрганизации
	|ГДЕ
	|	КонсолидированныеОстаткиОрганизации.ДокументОснование В
	|			(ВЫБРАТЬ
	|				втДокументы.Документ КАК Документ
	|			ИЗ
	|				втДокументы КАК втДокументы)
	|	И КонсолидированныеОстаткиОрганизации.ДокументОснование ССЫЛКА Документ.ТК_Приложение2КНалоговойНакладной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументы.Документ КАК Документ,
	|	втДокументы.Дата КАК Дата,
	|	втДокументы.Проведен КАК Проведен,
	|	втДокументы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА втДокументы.Документ.НалоговаяНакладная ССЫЛКА Документ.ТК_НалоговаяНакладная
	|			ТОГДА втДокументы.Документ.НалоговаяНакладная.РН
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РН
	|ИЗ
	|	втДокументы КАК втДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатДокументы = МассивРезультатов[2];
	
	Если РезультатДокументы.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаНН = МассивРезультатов[1].Выгрузить();
	ТаблицаНН.Индексы.Добавить("ДокументОснование");
	ТаблицаНН.Сортировать("ДокументОснование, Порядок, Дата");
	
	Выборка = РезультатДокументы.Выбрать();	
	
	Статистика = Новый Структура("Обработано, СОшибками, Всего", 0, 0, Выборка.Количество());	
	регРезультатВыполнения.ДобавитьКомментарий("Начало обработки очереди - " + Статистика.Всего, СтруктураЗаписи);
	
	Пока Выборка.Следующий() Цикл 
		ВсеОк = Истина;
		
		ссДокумент = Выборка.Документ;				
		Внутренний = ссДокумент.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Внутренний;
		
		нСтрокиНН = ТаблицаНН.НайтиСтроки(Новый Структура("ДокументОснование", ссДокумент));				
		КоличествоНН = нСтрокиНН.Количество();
		
		СтруктураНН = Новый Структура("ДокументКонс, Проведен, ПометкаУдаления", Неопределено, Ложь, Ложь);
		
		Если КоличествоНН > 0 Тогда 
			ЗаполнитьЗначенияСвойств(СтруктураНН, нСтрокиНН.Получить(0));
			
			Если КоличествоНН > 1 Тогда 
				Для Ит = 1 По нСтрокиНН.ВГраница() Цикл 
					текСтрНН = нСтрокиНН.Получить(Ит);
					Если Не текСтрНН.ПометкаУдаления Тогда 
						обДокНН = текСтрНН.ДокументКонс.ПолучитьОбъект();
						Попытка
							обДокНН.УстановитьПометкуУдаления(Истина);
						Исключение	
						КонецПопытки;						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.Проведен И Выборка.РН И Внутренний Тогда
			
			Если КоличествоНН > 0 И СтруктураНН.ДокументКонс <> Неопределено Тогда 
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();
				Если обДокументНН.ПометкаУдаления Тогда 
					обДокументНН.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				обДокументНН = Документы.КонсолидированныеОстаткиОрганизации.СоздатьДокумент();				
			КонецЕсли;
			
			обДокументНН.Заполнить(ссДокумент);
			обДокументНН.Дата = Выборка.Дата + 1;
			
			
			Если обДокументНН.ЭтоНовый() Тогда 
				обДокументНН.УстановитьНовыйНомер();
			КонецЕсли;
			
			Попытка
				обДокументНН.Записать(РежимЗаписиДокумента.Проведение);
				ВсеОк = Истина;
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
			КонецПопытки;		
			
		ИначеЕсли КоличествоНН > 0 Тогда
			
			Если Не СтруктураНН.ПометкаУдаления И (Не Выборка.РН И НЕ Внутренний ИЛИ Выборка.ПометкаУдаления) Тогда
				
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();
				Попытка
					обДокументНН.УстановитьПометкуУдаления(Истина);			
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;
				
			ИначеЕсли СтруктураНН.Проведен Тогда 
				
				обДокументНН = СтруктураНН.ДокументКонс.ПолучитьОбъект();			
				Попытка
					обДокументНН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ВсеОк = Ложь;
					регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);					
				КонецПопытки;								
				
			КонецЕсли;
			
		КонецЕсли;			
		
		Если ВсеОк Тогда 
			Попытка
				МенеджерЗаписи = РегистрыСведений.ТК_ОчередьНаОбработкуКонсолидированыхРасходов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Документ = ссДокумент;
				МенеджерЗаписи.Удалить();
			Исключение
				ВсеОк = Ложь;
				регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);	
			КонецПопытки;
		КонецЕсли;		
		
		Если ВсеОк Тогда 						
			Статистика.Обработано = Статистика.Обработано + 1;
		Иначе
			Статистика.СОшибками = Статистика.СОшибками + 1;
		КонецЕсли;		
	КонецЦикла;
	
	регРезультатВыполнения.ДобавитьКомментарий(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Обработано - %1, ошибки - %2",
	Статистика.Обработано,
	Статистика.СОшибками),			
	СтруктураЗаписи);
	
	регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Статистика.СОшибками = 0);
	
КонецПроцедуры

Процедура СверкаОбмена_Global_Center() Экспорт 
	
	Отказ = Ложь;          
	
	текДата = ТекущаяДата();
	НачалоПериода = НачалоДня(НачалоМесяца(ДобавитьМесяц(текДата, -1)));
	КонецПериода = НачалоДня(текДата) - 1;
	
	ИдентификаторОбработки = "ТК_ОбработкаСверкиSQL";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;	
	
	АдресаПолучателей = "vladimir.mirgorod@digma.ua, oleg.danchenko@digma.ua";
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПриходныйКассовыйОрдер");
	СтруктураДействий.Вставить("РасходныйКассовыйОрдер");
	СтруктураДействий.Вставить("ПоступлениеБезналичныхДенежныхСредств");
	СтруктураДействий.Вставить("СписаниеБезналичныхДенежныхСредств");
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("НачДата", НачалоПериода);
	ПараметрыВыполнения.Вставить("КонДата", КонецПериода);
	ПараметрыВыполнения.Вставить("Действия", СтруктураДействий);	
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = "Сверка обмена Work_Global_Center";
	
	регРезультатВыполнения.ДобавитьКомментарий(
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"Начало сверки за период с %1 - %2",
	НачалоПериода,
	КонецПериода),
	СтруктураЗаписи);
	
	Попытка
		Результат = Обработки.ТК_ОбработкаСверкиSQL.ВыполнитьСверку(ПараметрыВыполнения);
		
		Действия		 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Действия", Новый Структура);	
		СтруктураОтчетов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Отчеты", Новый Структура);
		
		ТекстРезультат = "";
		Для Каждого СтрРез Из Действия Цикл 		
			Ключ = СтрРез.Ключ;
			Если ЗначениеЗаполнено(СтрРез.Значение) Тогда 
				Значение = СтрРез.Значение;
			Иначе
				Значение = "Нет данных";
			КонецЕсли;
			
			ТекстРезультат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1%2: %3",
			?(Не ПустаяСтрока(ТекстРезультат), ТекстРезультат + Символы.ПС, ""),
			Строка(Ключ),
			Значение);
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекстРезультат) Тогда 
			регРезультатВыполнения.ДобавитьКомментарий(ТекстРезультат, СтруктураЗаписи);
		КонецЕсли;
		
		МассивВложений = Новый Массив;	
		
		Для Каждого Стр Из СтруктураОтчетов Цикл 					
			Структура = Стр.Значение;		
			ТабДок = Структура.ТабличныйДокумент;
			
			ПотокФайла = Новый ПотокВПамяти();
			ТабДок.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.XLSX);				
			ДвоичныеДанные = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
			
			СтруктураВложения = Новый Структура;
			СтруктураВложения.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1_%2-%3.xlsx",
			Структура.СинонимМакета,
			Формат(НачалоПериода, "ДФ=dd.MM.yy"),
			Формат(КонецПериода, "ДФ=dd.MM.yy")));
			
			СтруктураВложения.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
			СтруктураВложения.Вставить("Кодировка","");
			СтруктураВложения.Вставить("Идентификатор","");
			
			МассивВложений.Добавить(СтруктураВложения);
		КонецЦикла;	
		
		Если МассивВложений.Количество() > 0 Тогда 
			
			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Кому", АдресаПолучателей);
			ПараметрыПисьма.Вставить("Тема", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Сверка обмена Work_Global_Center с %1 по %2", Формат(НачалоПериода, "ДФ=dd.MM.yy"), Формат(КонецПериода, "ДФ=dd.MM.yy")));
			ПараметрыПисьма.Вставить("Тело", ТекстРезультат);
			ПараметрыПисьма.Вставить("Вложения",МассивВложений);
			
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
			РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);	
		КонецЕсли;
		
	Исключение
		регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);
		Отказ = Истина;	
	КонецПопытки;		
	
	регРезультатВыполнения.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписи, Не Отказ);
	
КонецПроцедуры

Процедура ПроверкаПустыхЕдиницИзмеренияНоменклатуры() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.ОсновнаяЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.НеАктивный = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстПисьма = Новый ТекстовыйДокумент;
	
	ТаблицаТоваров = Новый ТабличныйДокумент;
	ТаблицаТоваров.Область(1,1,1,1).Текст = "Артикул";
	ТаблицаТоваров.Область(1,2,1,2).Текст = "Наименование";
	
	текСтр = 1;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		текСтр = текСтр + 1;
		
		ТаблицаТоваров.Область(текСтр, 1, текСтр, 1).Текст = Выборка.Артикул;
		ТаблицаТоваров.Область(текСтр, 2, текСтр, 2).Текст = Выборка.Номенклатура;
		
		новСтр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"[%1] - %2",
		Выборка.Артикул,
		Выборка.Номенклатура);						
		ТекстПисьма.ДобавитьСтроку(новСтр);					
	КонецЦикла;
	
	АдресаПолучателей = "vladimir.mirgorod@digma.ua, oleg.danchenko@digma.ua";
	
	МассивВложений = Новый Массив;
	
	ПотокФайла = Новый ПотокВПамяти();
	ТаблицаТоваров.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.XLSX);				
	ДвоичныеДанные = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
	
	СтруктураВложения = Новый Структура;
	СтруктураВложения.Вставить("Представление", "Список номенклатуры.xlsx");	
	СтруктураВложения.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
	СтруктураВложения.Вставить("Кодировка","");
	СтруктураВложения.Вставить("Идентификатор","");
	
	МассивВложений.Добавить(СтруктураВложения);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", АдресаПолучателей);
	ПараметрыПисьма.Вставить("Тема", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не заполнены Основные единицы измерения (%2 поз.) %1", ТекущаяДата(), Выборка.Количество()));
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма.ПолучитьТекст());
	ПараметрыПисьма.Вставить("Вложения",МассивВложений);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);			
	
КонецПроцедуры

Процедура ВывестиРаспроданныйТовар() Экспорт
	
	Если Метаданные.Обработки.Найти("ОбработкаАссортиментногоКомитета") <> Неопределено Тогда
		Обработки["ОбработкаАссортиментногоКомитета"].ВывестиРаспроданныйТовар(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОтчетПоВыполнениюАктивности_Ленточки() Экспорт
	
	Если Метаданные.Отчеты.Найти("ВыполнениеПлановАктивности") <> Неопределено Тогда
		Отчеты["ВыполнениеПлановАктивности"].СформироватьОтчет(Неопределено, "Ленточки", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОтчетПоВыполнениюАктивности_Премия() Экспорт
	
	ТекДень = День(ТекущаяДата());
	Если ТекДень = 1 Или ТекДень = 16 Тогда
		Если Метаданные.Отчеты.Найти("ВыполнениеПлановАктивности") <> Неопределено Тогда
			Отчеты["ВыполнениеПлановАктивности"].СформироватьОтчет(Неопределено, "Премия", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОтчетПоВыполнениюАктивности_Итого() Экспорт
	
	Если Метаданные.Отчеты.Найти("ВыполнениеПлановАктивности") <> Неопределено Тогда
		Отчеты["ВыполнениеПлановАктивности"].СформироватьОтчет(Неопределено, "Итого", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОтчетПоВыполнениюПлана() Экспорт
	
	Если Метаданные.Отчеты.Найти("ВыполнениеПлановАктивности") <> Неопределено Тогда
		Отчеты["ВыполнениеПлановАктивности"].СформироватьОтчет(Неопределено, "Выполнение", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОтчетПродажиВНоль(Фон = Ложь,ПараметрыОтчета = Неопределено, Ключ ="") Экспорт
	
	Если Метаданные.Отчеты.Найти("ПродажиВНоль") <> Неопределено Тогда
		
		Если Фон Тогда
			Отчеты["ПродажиВНоль"].ОтчетВывести(ПараметрыОтчета,Истина,Ключ);
		Иначе
			
			ВсЁОк = Истина;
			РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
			СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
			СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ПродажиВНоль";
			СтруктураЗаписиЖурнала.КлючОбработки = "ПродажиВНоль";
			СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
			
			РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
			
			МассивЗаданий	= Новый Массив;
			ПараметрыОтчета	= Новый Структура("Дата,Склады,ИсключитьСклады,Товар,ИсключитьТовар");
			
			Наименование = "НулевыеПродажи";
			
			Дата = НачалоДня(ТекущаяДата());
			
			СкладыАттика = Новый СписокЗначений;
			СкладыАттика.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("AT000003"),"АТТ");	//	Аттика 2007 ООО
			СкладыАттика.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("DG000003"),"СБС");	//	Современные бизнес-системы ООО
			СкладыАттика.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("GL000104"),"ОСН");	//	Основа Инфо ООО
			СкладыАттика.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("GL000440"),"ТКС");	//	Табачная компания Слобожанщины ООО
			СкладыАттика.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ФС000012"),"ОСА");	//	Оптовая Сигаретная Ассоциация
			
			СкладыКиев = Новый СписокЗначений;
			СкладыКиев.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("GL000519"));	//	ТС Buffet
			
			СкладыСуммы = Справочники.СкладыКомпании.МассивСкладовПоПодразделению(Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009"));	//	ТС Табак-Дигма
			
			ТоварТабак = Новый СписокЗначений;
			ТоварТабак.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0009000"));		//	Табачные изделия
			
			ТоварЖидкость = Новый СписокЗначений;
			ТоварЖидкость.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0100000"));	//	Алкогольные напитки
			ТоварЖидкость.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0095000"));	//	Безалкогольные напитки
			
			ТоварОстальное = Новый СписокЗначений;
			ТоварОстальное.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0009000"));	//	Табачные изделия
			ТоварОстальное.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0100000"));	//	Алкогольные напитки
			ТоварОстальное.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0095000"));	//	Безалкогольные напитки
			
			///		КИЕВ	///
			
			Отч = "Киев_Всё";
			
			ПараметрыОтчета.Дата			= Дата;	
			ПараметрыОтчета.Склады			= СкладыКиев;	
			ПараметрыОтчета.ИсключитьСклады	= Ложь;	
			ПараметрыОтчета.Товар			= Справочники.Номенклатура.ПустаяСсылка();	
			ПараметрыОтчета.ИсключитьТовар	= Ложь;
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Истина);
			ПараметрыЗадания.Добавить(ПараметрыОтчета);
			ПараметрыЗадания.Добавить(Отч);
			
			Ключ = Наименование+"_" + Отч;
			Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ЗапуститьОтчетПродажиВНоль", ПараметрыЗадания,Ключ,Ключ);
			МассивЗаданий.Добавить(Задание);
			РезультатыВыполнения.ДобавитьКомментарий("Запущено ("+Отч+")", СтруктураЗаписиЖурнала);
			
			///		СУМЫ	///
			
			Отч = "Сумы_Всё";
			
			ПараметрыОтчета.Дата			= Дата;	
			ПараметрыОтчета.Склады			= СкладыСуммы;	
			ПараметрыОтчета.ИсключитьСклады	= Ложь;	
			ПараметрыОтчета.Товар			= Справочники.Номенклатура.ПустаяСсылка();	
			ПараметрыОтчета.ИсключитьТовар	= Ложь;
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Истина);
			ПараметрыЗадания.Добавить(ПараметрыОтчета);
			ПараметрыЗадания.Добавить(Отч);
			
			Ключ = Наименование+"_" + Отч;
			Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ЗапуститьОтчетПродажиВНоль", ПараметрыЗадания,Ключ,Ключ);
			МассивЗаданий.Добавить(Задание);
			РезультатыВыполнения.ДобавитьКомментарий("Запущено ("+Отч+")", СтруктураЗаписиЖурнала);
			
			Для Каждого Орг Из СкладыАттика Цикл
				
				///		Табак	///
				
				Отч = Орг.Представление + "_Табак";
				//Отч = "Атт_Табак";
				
				ПараметрыОтчета.Дата			= Дата;	
				ПараметрыОтчета.Склады			= Орг.Значение;	
				//ПараметрыОтчета.Склады			= СкладыАттика;	
				ПараметрыОтчета.ИсключитьСклады	= Ложь;	
				ПараметрыОтчета.Товар			= ТоварТабак;	
				ПараметрыОтчета.ИсключитьТовар	= Ложь;
				
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Истина);
				ПараметрыЗадания.Добавить(ПараметрыОтчета);
				ПараметрыЗадания.Добавить(Отч);
				
				Ключ = Наименование+"_" + Отч;
				Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ЗапуститьОтчетПродажиВНоль", ПараметрыЗадания,Ключ,Ключ);
				МассивЗаданий.Добавить(Задание);
				РезультатыВыполнения.ДобавитьКомментарий("Запущено ("+Отч+")", СтруктураЗаписиЖурнала);
				
				///		Жидкость	///
				
				Отч = Орг.Представление + "_Жидкость";
				//Отч = "Атт_Жидкость";
				
				ПараметрыОтчета.Дата			= Дата;	
				ПараметрыОтчета.Склады			= Орг.Значение;	
				//ПараметрыОтчета.Склады			= СкладыАттика;	
				ПараметрыОтчета.ИсключитьСклады	= Ложь;	
				ПараметрыОтчета.Товар			= ТоварЖидкость;	
				ПараметрыОтчета.ИсключитьТовар	= Ложь;
				
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Истина);
				ПараметрыЗадания.Добавить(ПараметрыОтчета);
				ПараметрыЗадания.Добавить(Отч);
				
				Ключ = Наименование+"_" + Отч;
				Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ЗапуститьОтчетПродажиВНоль", ПараметрыЗадания,Ключ,Ключ);
				МассивЗаданий.Добавить(Задание);
				РезультатыВыполнения.ДобавитьКомментарий("Запущено ("+Отч+")", СтруктураЗаписиЖурнала);
				
				///		Остальное	///
				
				Отч = Орг.Представление + "_Остальное";
				//Отч = "Атт_Остальное";
				
				ПараметрыОтчета.Дата			= Дата;	
				ПараметрыОтчета.Склады			= Орг.Значение;	
				//ПараметрыОтчета.Склады			= СкладыАттика;	
				ПараметрыОтчета.ИсключитьСклады	= Ложь;	
				ПараметрыОтчета.Товар			= ТоварОстальное;	
				ПараметрыОтчета.ИсключитьТовар	= Истина;
				
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Истина);
				ПараметрыЗадания.Добавить(ПараметрыОтчета);
				ПараметрыЗадания.Добавить(Отч);
				
				Ключ = Наименование+"_" + Отч;
				Задание = ФоновыеЗадания.Выполнить("ФоновыеЗаданияТК.ЗапуститьОтчетПродажиВНоль", ПараметрыЗадания,Ключ,Ключ);
				МассивЗаданий.Добавить(Задание);
				РезультатыВыполнения.ДобавитьКомментарий("Запущено ("+Отч+")", СтруктураЗаписиЖурнала);
				
			КонецЦикла;
			
			Попытка 
				РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
			Исключение
				//
			КонецПопытки;
			
			///		Проверка	///
			
			Готово = Ложь;
			
			Пока НЕ Готово Цикл
				МЗ = Новый Массив;
				Если МассивЗаданий.Количество() > 0 Тогда
					ФЗ = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивЗаданий);
					Для Каждого ФонЗад Из ФЗ Цикл
						Если ФонЗад.Состояние = СостояниеФоновогоЗадания.Активно Тогда
							МЗ.Добавить(ФонЗад);
						Иначе
							Если ФонЗад.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
								ВсЁОк = ВсЁОк И Истина;
								РезультатыВыполнения.ДобавитьКомментарий("Завершено ("+ФонЗад.Ключ+")", СтруктураЗаписиЖурнала);
							ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
								ВсЁОк = ВсЁОк И Ложь;
								РезультатыВыполнения.СообщитьОбОшибке("ЗавершеноАварийно ("+ФонЗад.Ключ+") "+ФонЗад.ИнформацияОбОшибке, СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
							ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
								ВсЁОк = ВсЁОк И Ложь;
								РезультатыВыполнения.ДобавитьКомментарий("Отменено ("+ФонЗад.Ключ+")", СтруктураЗаписиЖурнала);
							ИначеЕсли ФонЗад.Состояние = СостояниеФоновогоЗадания.Активно Тогда
								ВсЁОк = ВсЁОк И Ложь;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					Попытка 
						РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ВсЁОк);
					Исключение
						//
					КонецПопытки;
					
				Иначе
					Готово = Истина;	
				КонецЕсли;
				МассивЗаданий = МЗ;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСписокПротоволовДляСогласования() Экспорт
	
	КлючОбработки		   = "Регламентное задание отправки писем со списком протоколов согласования цен";
	ИдентификаторОбработки = "РассылкаПротоколовДляСогласования";
	регРезультатВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;	
	
	СтруктураЗаписи = регРезультатВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписи.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписи.КлючОбработки = КлючОбработки;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласователиПротоколов.ТипЦен КАК ТипЦен,
	|	СогласователиПротоколов.Согласователь КАК Согласователь,
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК Адрес
	|ИЗ
	|	РегистрСведений.СогласователиПротоколов КАК СогласователиПротоколов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО СогласователиПротоколов.Согласователь = ПользователиКонтактнаяИнформация.Ссылка.ФизическоеЛицо
	|ИТОГИ ПО
	|	ТипЦен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипЦен = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипЦен.Следующий() Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок = ПолучитьТаблицуПротоколовДляСогласования(ВыборкаТипЦен.ТипЦен, ТабДок);
		
		Если ТабДок.ВысотаТаблицы = 1 Тогда
			Продолжить;
		КонецЕсли; 
		
		ВыборкаСогласователи = ВыборкаТипЦен.Выбрать();
		СписокПолучателей = Новый Соответствие;
		
		Пока ВыборкаСогласователи.Следующий() Цикл
			СписокПолучателей.Вставить(ВыборкаСогласователи.Согласователь, ВыборкаСогласователи.Адрес);
		КонецЦикла;
		
		ПредставлениеПолучателей = "";
		АдресаПолучателей = "";
		
		Для Каждого Стр Из СписокПолучателей Цикл 			
			ПредставлениеПолучателей = ПредставлениеПолучателей + Символы.ПС + Стр.Ключ + " <" + Стр.Значение + ">";
			АдресаПолучателей = ?(Не ПустаяСтрока(АдресаПолучателей), АдресаПолучателей + ", ", "") + Стр.Значение;
		КонецЦикла;
		
		ТемаПисьма = "Документы для согласования";
		ТелоПисьма = "";
		
		ИмяВрФайла = ПолучитьИмяВременногоФайла("html");
		ТабДок.Записать(ИмяВрФайла, ТипФайлаТабличногоДокумента.HTML5);
		Файл = Новый ЧтениеТекста(ИмяВрФайла);
		Текст = Файл.Прочитать();
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", АдресаПолучателей);
		ПараметрыПисьма.Вставить("Тема", ТемаПисьма);
		ПараметрыПисьма.Вставить("Тело", ТелоПисьма);
		//ПараметрыПисьма.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.HTML);
		
		Попытка
			Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
			Письмо.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.HTML);
			Письмо.ОбработатьТексты();
			
			РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);	
			
			регРезультатВыполнения.ДобавитьКомментарий(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Отправлено эл. письмо получателям:
			|%1",
			ПредставлениеПолучателей),
			СтруктураЗаписи);				
			
		Исключение
			регРезультатВыполнения.ДобавитьКомментарий(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Ошибка отправки эл. письма получателям:
			|%1
			|Описание ошибки:
			|%2",
			ПредставлениеПолучателей,
			ОписаниеОшибки()), СтруктураЗаписи);
			
			регРезультатВыполнения.СообщитьОбОшибке(ОписаниеОшибки(), СтруктураЗаписи, СтатусСообщения.ОченьВажное);						
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьТаблицуПротоколовДляСогласования(ТипЦен, ТабДок)
	
	Запрос = Новый ПостроительОтчета;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколСогласованияЦен.Ссылка КАК Документ,
	|	ПротоколСогласованияЦен.Организация КАК Организация,
	|	ПротоколСогласованияЦен.Контрагент КАК Контрагент,
	|	ПротоколСогласованияЦен.Автор КАК Автор,
	|	ПротоколСогласованияЦен.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ИЗ
	|	Документ.ПротоколСогласованияЦен КАК ПротоколСогласованияЦен
	|ГДЕ
	|	ПротоколСогласованияЦен.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ПротоколСогласованияЦен.Проведен
	|	И ПротоколСогласованияЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПротоколовСогласованияЦен.ТребуетСогласования)
	|	И ПротоколСогласованияЦен.ТипЦен = &ТипЦен
	|	И НЕ ПротоколСогласованияЦен.ПометкаУдаления";
	
	Запрос.Параметры.Вставить("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(ТекущаяДата())-7*24*3600);
	Запрос.Параметры.Вставить("ТипЦен", ТипЦен);
	
	Запрос.Выполнить();
	Запрос.Вывести(ТабДок);
	
	Возврат ТабДок;
	
КонецФункции

Процедура ЗапуститьЗагрузкуКураторов() Экспорт 
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ЗагрузкаКураторов);	
	
	УстановитьПривилегированныйРежим(Истина);
	
	спСправочники.ОбновитьСписокКураторовТорговыхПлощадок();
	спСправочники.ОбновитьГрафикиРаботыТорговыхПлощадок();
	
	
	
	
КонецПроцедуры

Функция ПроверитьПриход(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Проведен
	|	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.ПеремещениеТоваров.ПустаяСсылка();
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();	
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЕсли;
КонецФункции

Процедура СформироватьДокументовПоРасхождениямПеремещений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыКПоступлениюОстатки.КПоступлениюОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению.Остатки(&ДК, ) КАК ТоварыКПоступлениюОстатки
	|ГДЕ
	|	ТоварыКПоступлениюОстатки.ДокументПоступления <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ДокументПоступления";
	
	ДК = НачалоМесяца(ТекущаяДата());
	Запрос.УстановитьПараметр("ДК", ДК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
			Приход = ПроверитьПриход(ВыборкаДетальныеЗаписи.ДокументПоступления);
			
			Если Приход = Документы.ПеремещениеТоваров.ПустаяСсылка() Тогда
				Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
				Док.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала;
				Док.Дата = ВыборкаДетальныеЗаписи.ДокументПоступления.Дата+60;
				Док.ТорговаяПлощадка = ВыборкаДетальныеЗаписи.ДокументПоступления.СкладКомпании.ТорговаяПлощадка;
				Док.СкладКомпанииПолучатель = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадки(ВыборкаДетальныеЗаписи.ДокументПоступления.ТорговаяПлощадкаПолучатель);
				Результат = РегистрыСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних(ТекущаяДата(), Новый Структура("ТорговаяПлощадка", Док.СкладКомпанииПолучатель.ТорговаяПлощадка));
				Если НЕ Результат.Количество()=0 Тогда
					Док.Организация = Результат[0].Организация;
				КонецЕсли;
				Док.ПодразделениеКомпании = Док.СкладКомпанииПолучатель.Подразделение;
				Док.Автор = ПараметрыСеанса.АвторизованныйПользователь;
				Док.КурсДокумента = ВыборкаДетальныеЗаписи.ДокументПоступления.КурсДокумента;
				Док.ВалютаДокумента = ВыборкаДетальныеЗаписи.ДокументПоступления.ВалютаДокумента;
				Док.ТипЦен = ВыборкаДетальныеЗаписи.ДокументПоступления.ТипЦен;
				Док.ДокументОтгрузки = ВыборкаДетальныеЗаписи.ДокументПоступления;
				Док.УстановитьНовыйНомер();
				ВыборкаТовары = ВыборкаДетальныеЗаписи.Выбрать();
				Пока ВыборкаТовары.Следующий() Цикл
					НоваяСтрока = Док.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаТовары);
					СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрока.ХарактеристикаНоменклатуры);
					СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", НоваяСтрока.ЕдиницаИзмерения);
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
				КонецЦикла;
				Попытка 
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Док.Записать();
				КонецПопытки;
				
			Иначе
				ВыборкаТовары = ВыборкаДетальныеЗаписи.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество > 0 Тогда
					Док = Приход.ПолучитьОбъект();
					Пока ВыборкаТовары.Следующий() Цикл
						НоваяСтрока = Док.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаТовары);
						НоваяСтрока.КоличествоБазовое = ВыборкаТовары.Количество;
						СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрока.ХарактеристикаНоменклатуры);
						СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", НоваяСтрока.ЕдиницаИзмерения);
						ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					КонецЦикла;
				Иначе
					Док = ВыборкаДетальныеЗаписи.ДокументПоступления.ПолучитьОбъект();
					Пока ВыборкаТовары.Следующий() Цикл
						НоваяСтрока = Док.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаТовары);
						НоваяСтрока.Количество = -ВыборкаТовары.Количество;
						НоваяСтрока.КоличествоБазовое = -ВыборкаТовары.Количество;
						СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрока.ХарактеристикаНоменклатуры);
						СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", НоваяСтрока.ЕдиницаИзмерения);
						ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
					КонецЦикла;
				КонецЕсли;
				
				
				Док.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	//ОбщегоНазначения.СообщитьПользователю("Документы сформированы!!!");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ТК_ЗагрузкаZFoc() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ЗагрузкаZFoc);
	УстановитьПривилегированныйРежим(Истина);
	Обработки.ТК_zFoc.ВыполнитьЗагрузку(Ложь,Ложь);
	
	
КонецПроцедуры

Процедура ТК_ВыгрузкаZFoc() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ВыгрузкаZFoc);
	УстановитьПривилегированныйРежим(Истина);
	Обработки.ТК_zFoc.ЗапуститьВыгузку();
	
	
КонецПроцедуры

Процедура АвтоматическоеПродлениеДоговоров() Экспорт
	
	ОбработаноДоговоров = 0;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "АвтоматическоеПродлениеДоговоров";
	СтруктураЗаписиЖурнала.КлючОбработки = "АвтоматическоеПродлениеДоговоров";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ДатаОкончанияДействия <= &ТекДата
	|	И ДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ДоговорыКонтрагентов.ВариантПродления = ЗНАЧЕНИЕ(Перечисление.ВариантыПродленияДоговоров.НаГод)
	|			ИЛИ ДоговорыКонтрагентов.ВариантПродления = ЗНАЧЕНИЕ(Перечисление.ВариантыПродленияДоговоров.КаждыйГод))";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РезультатыВыполнения.ДобавитьКомментарий("Найдено договоров - "+Формат(Выборка.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Пока Выборка.Следующий() Цикл 
		
		ДоговорСсылка = Выборка.Ссылка;		
		
		ДоговорОбъект = ДоговорСсылка.ПолучитьОбъект();				
		
		Если ДоговорОбъект.ВариантПродления = Перечисления.ВариантыПродленияДоговоров.НаГод Тогда
			
			ДоговорОбъект.ВариантПродления = Перечисления.ВариантыПродленияДоговоров.НеПродлевается;
			
		КонецЕсли;
		
		ДоговорОбъект.ДатаОкончанияДействия = ДобавитьМесяц(ДоговорОбъект.ДатаОкончанияДействия, 12);
		
		//ДоговорОбъект.Комментарий = ДоговорОбъект.Комментарий + Символы.ПС + "[Договор автоматически продлен на год. Дата продления: "+ТекущаяДата()+"]";
		
		Попытка 
			ДоговорОбъект.Записать();
			ОбработаноДоговоров = 1 + ОбработаноДоговоров;
			РезультатыВыполнения.ДобавитьКомментарий("Договор автоматически продлен на год < ("+СокрЛП(ДоговорСсылка.Код)+") "+СокрЛП(ДоговорСсылка)+" >", СтруктураЗаписиЖурнала);
		Исключение
			РезультатыВыполнения.СообщитьОбОшибке("Договор не удалось продлить < ("+СокрЛП(ДоговорСсылка.Код)+") "+СокрЛП(ДоговорСсылка)+" > . Ошибка записи: " + ОписаниеОшибки(), СтруктураЗаписиЖурнала ,СтатусСообщения.Важное);
		КонецПопытки;
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Обработанно договоров	- "+Формат(ОбработаноДоговоров,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки.", СтруктураЗаписиЖурнала);
	
	РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, ОбработаноДоговоров = Выборка.Количество());
	
КонецПроцедуры

Процедура ЗапуститьЗагрузкуПриходовТедис() Экспорт
	
	Если Метаданные.Обработки.Найти("ТК_ЗагрузкаПриходовТедис") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючОбработки			= "Загрузка Приходов Тедис";
	ИдентификаторОбработки	= "ЗагрузкаПриходовТедис";		
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктруаЗаписиРезультатаВыполнения);
	
	ДеревоДокументов = Новый ДеревоЗначений;
	ДеревоДокументов.Колонки.Добавить("Выбор");
	ДеревоДокументов.Колонки.Добавить("ДокументНоменклатура");
	ДеревоДокументов.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ДеревоДокументов.Колонки.Добавить("ЕдиницаИзмерения");
	ДеревоДокументов.Колонки.Добавить("Количество");
	ДеревоДокументов.Колонки.Добавить("Цена");
	ДеревоДокументов.Колонки.Добавить("СуммаВсего");
	ДеревоДокументов.Колонки.Добавить("СкладКомпании");
	ДеревоДокументов.Колонки.Добавить("ИмяФайла");
	ДеревоДокументов.Колонки.Добавить("ДатаДокумента");
	ДеревоДокументов.Колонки.Добавить("НомерДокумента");
	ДеревоДокументов.Колонки.Добавить("ДокументАгента");
	ДеревоДокументов.Колонки.Добавить("ЗаказПокупателя");
	ДеревоДокументов.Колонки.Добавить("ДоговорПокупателя");
	ДеревоДокументов.Колонки.Добавить("ТочкаДоставки");
	ДеревоДокументов.Колонки.Добавить("Маршрут");
	ДеревоДокументов.Колонки.Добавить("Контрагент");
	ДеревоДокументов.Колонки.Добавить("ДокументЗагрузки");
	ДеревоДокументов.Колонки.Добавить("ДокументОснование");
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("СоздатьМРЦ", Истина);
	ПараметрыЗагрузки.Вставить("ДеревоДокументов", ДеревоДокументов);
	
	РезультатЗагрузки = Обработки.ТК_ЗагрузкаПриходовТедис.ЗагрузитьФайлы(ПараметрыЗагрузки);
	
	Если НЕ РезультатЗагрузки.Свойство("ДеревоДокументов", ДеревоДокументов) Тогда 
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Найдено 0 файлов на FTP...'", СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
		Возврат;
	КонецЕсли;
	Если РезультатЗагрузки.ДеревоДокументов.Строки.Количество() = 0 Тогда
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Найдено О файлов на FTP...", СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		Возврат;
	КонецЕсли;
	
	КолВоФайлов = ДеревоДокументов.Строки.Количество();
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Найдено "+КолВоФайлов+" файлов на FTP...", СтруктруаЗаписиРезультатаВыполнения);
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
	
	спДоговоров = Новый СписокЗначений;
	спДоговоров.Добавить(Справочники.ДоговорыКонтрагентов.НайтиПоКоду("GL049186"));		//	ТС АТТИКА
	спДоговоров.Добавить(Справочники.ДоговорыКонтрагентов.НайтиПоКоду("GL052045"));		//	ТС Табак-Дигма
	
	дВ = ДеревоДокументов.Строки.НайтиСтроки(Новый Структура("Выбор",Истина)).Количество();
	//дВ = 0;
	//Для Каждого Документ Из ДеревоДокументов.Строки Цикл
	//	Если Документ.Выбор Тогда
	//		дВ = дВ+1;
	//	КонецЕсли;
	//КонецЦикла;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Всего "+дВ+" документов к загрузке...", СтруктруаЗаписиРезультатаВыполнения);
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
	
	Для Каждого Договор Из спДоговоров Цикл
		
		КонтрагентПоставщик = Договор.Значение.Контрагент;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДоговорПоставщик", Договор.Значение);
		ДополнительныеПараметры.Вставить("КонтрагентПоставщик", КонтрагентПоставщик);
		
		РезультатДокументы = Обработки.ТК_ЗагрузкаПриходовТедис.СформироватьДокументы(ДеревоДокументов, ДополнительныеПараметры);
		
		Если НЕ РезультатДокументы.Свойство("ДеревоДокументов", ДеревоДокументов) Тогда 
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Что-то пошло не так...", СтруктруаЗаписиРезультатаВыполнения);
			РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
			Возврат;
		КонецЕсли;
		
		д = ДеревоДокументов.Строки.НайтиСтроки(Новый Структура("Выбор",Ложь)).Количество();
		//д = 0;
		//Для Каждого Документ Из ДеревоДокументов.Строки Цикл
		//	Если НЕ Документ.Выбор Тогда
		//		д = д+1;
		//	КонецЕсли;
		//КонецЦикла;
		
		дЗ = дВ+д-КолВоФайлов;
		дВ = дВ-дЗ;
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Загружено "+дЗ+" документа - "+Договор.Значение.Подразделение, СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
	КонецЦикла;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Окончание обработки.", СтруктруаЗаписиРезультатаВыполнения);
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, дВ=0);
	
КонецПроцедуры


Процедура ЗапуститьВыгрузкуДанныхPowerBi() Экспорт 
	
	Обработки.ТК_ВыгрузкаДанныхPowerBi.ВыгрузитьДанные();
	
КонецПроцедуры

Процедура ПолучитьПроизводственныйКалендарьЗУП() Экспорт
	РезВО = РегистрыСведений.РезультатыВыполненияОбработок;	
	СтрЗР = РезВО.СформироватьСтруктуруЗаписиРезультатов();
	СтрЗР.ИдентификаторОбработки = "ЗагрузкаПроизводственногоКалендаря";
	СтрЗР.КлючОбработки = "Загрузка Производственного Календаря";
	
	Определение = Новый WSОпределения("https://orders.space.digma/work_Zarplata/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.СледующийМесяц;
	Дата1 = Период.ДатаНачала;
	Дата2 = Период.ДатаОкончания;
	тПериод = ПредставлениеПериода(Дата1,Дата2);
	
	СтрокаXML = WS.ReturnCalendar(Дата1, Дата2);
	
	РезВО.ДобавитьКомментарий("Календарь из ЗУП получен " + тПериод, СтрЗР);
	
	тзРезультат = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	
	ПроизводственныйКалендарь = Справочники.ПроизводственныеКалендари.НайтиПоКоду("УК");
	
	Для Каждого СтрРезультат Из тзРезультат Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеПроизводственногоКалендаря.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрРезультат);
		МенеджерЗаписи.ПроизводственныйКалендарь = ПроизводственныйКалендарь;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	РезВО.ДобавитьКомментарий("Календарь в ТК заисан " + тПериод, СтрЗР);
	
	ОбработкаСервисДеск = Обработки.СервисДеск.Создать();
	ОбработкаСервисДеск.УзелПланаОбмена = ПланыОбмена.ОбменFirestore.НайтиПоКоду("DBG");
	ОбработкаСервисДеск.ВыгрузитьКалендарьВFirestore(Дата1, Дата2);
	
	РезВО.ДобавитьКомментарий("Календарь в Firestore выгружен " + тПериод, СтрЗР);
	РезВО.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтрЗР,Истина);
	
КонецПроцедуры

Процедура ЗакрытиеНеактивныхЗаказов() Экспорт
	Обработки.ЗакрытиеНеактивныхЗаказов.ЗакрытьНеактивныеЗаказы(НачалоДня(ТекущаяДата()), 0);
КонецПроцедуры

Процедура ПроверкаАктуальностиТочек() Экспорт
	
	ТекДата = ТекущаяДата();
	ТабДок = Новый ТабличныйДокумент;
	сПолучатели = Новый Соответствие;
	сПолучатели.Вставить("Харьков",	"Агафонова Инна Сергеевна");
	сПолучатели.Вставить("Киев",	"Свидерская Людмила Владимировна");
	сПолучатели.Вставить("Сумы",	"ерик Наталья Сергеевна");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ПодразделениеКомпании.Код = ""000000008""
	|			ТОГДА ""Киев""
	|		КОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ПодразделениеКомпании.Код = ""AT000009""
	|			ТОГДА ""Сумы""
	|		ИНАЧЕ ""Харьков""
	|	КОНЕЦ КАК Регион,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ПодразделениеКомпании КАК Подразделение,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.Код КАК Код,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия КАК ДатаОткрытия,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия КАК ДатаЗакрытия,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Куратор
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия > ДАТАВРЕМЯ(1, 1, 1)
	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаЗакрытия < &ТекДата";
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата); 
	
	РезультатЗапроса = Запрос.Выполнить();
	тзРезультат = РезультатЗапроса.Выгрузить();
	
	Для Каждого Регион Из сПолучатели Цикл
		тзРегион = тзРезультат.Скопировать(Новый Структура("Регион",Регион.Ключ));
		Если тзРегион.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(тзРегион);       
		Построитель.ТекстЗаголовка = "Неоднозначные данные по точкам " + ТекДата + Символы.ПС + "Необходимо в точке очистить или <ДатаЗакрытия> или <Куратор>";
		Построитель.Вывести(ТабДок);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		ТекстФайла = Новый ЧтениеТекста(ИмяВременногоФайла);
		ТекстHTML = ТекстФайла.Прочитать();
		ТекстФайла.Закрыть();
		УдалитьФайлы(ИмяВременногоФайла);
		
		Получатели = Новый СписокЗначений;
		Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию(Регион.Значение));
		
		СтрокаАдрес = "";
		
		ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
		
		Для Каждого Получатель Из Получатели Цикл
			ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель.Значение,ВидКИ);
			
			Если ПустаяСтрока(ЭлАдрес) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
		КонецЦикла;
		
		Если ПустаяСтрока(СтрокаАдрес) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому","Sergey.Chizhov@digma.ua;"+СтрокаАдрес);
		ПараметрыПисьма.Вставить("Тема","Проверка актуальности точек " + ТекДата);
		ПараметрыПисьма.Вставить("Тело",ТекстHTML);
		ПараметрыПисьма.Вставить("Копии","sergey.lohvitskiy@digma.ua;");
		ПараметрыПисьма.Вставить("ТипТекста", "HTML");
		
		Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
		РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	КонецЦикла;
КонецПроцедуры

Процедура СписокТБДДляПеремещения() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры



#КонецОбласти


#Область ОбменEDI

Процедура ОтправитьЗагрузитьСообщенияEDI()Экспорт
	
	ТК_ОбменEDI.ОтправкаFTPСообщенийПровайдеровЕDI();
	ТК_ОбменEDI.ЗагрузкаFTPСобщенийEDI();
	
КонецПроцедуры


Процедура ВыполнитьОбработкуВходящихСообщенийEDI()Экспорт
	ТК_ОбменEDI.ОбработатьВходящиеСообщенияEDI();
	ТК_ОбменEDI.ОбработатьЖурналДокументовEDI();
	
КонецПроцедуры

Процедура ОбработатьЗадания()Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_ЗаданияТСД);
	УстановитьПривилегированныйРежим(Истина);
	ТК_ТСД_ЗадачиСервер.ОбработатьГрафикиЗаДату(ТекущаяДатаСеанса());
	ТК_ТСД_ЗадачиСервер.ОбработатьГрафикиИнвентаризаций(ТекущаяДатаСеанса());
	ТК_ТСД_ЗадачиСервер.ЗакрытьЗадачиТСД();
	
КонецПроцедуры


#КонецОбласти


#Область ТСД

Процедура ТК_ОбработатьОчередьПечатиТСД() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьПечатиТСД.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОчередьПечатиТСД.СкладКомпании КАК СкладКомпании,
	|	ОчередьПечатиТСД.Дата КАК Дата,
	|	ОчередьПечатиТСД.Макет КАК Макет,
	|	ОчередьПечатиТСД.Хранилище КАК Хранилище,
	|	ВЫБОР
	|		КОГДА ОчередьПечатиТСД.Копий = 0
	|			ТОГДА 1
	|		ИНАЧЕ ОчередьПечатиТСД.Копий
	|	КОНЕЦ КАК Копий,
	|	ТК_ПринтераТорговыхПлощадок.Принтер КАК Принтер
	|ИЗ
	|	РегистрСведений.ТК_ОчередьПечатиТСД КАК ОчередьПечатиТСД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПринтераТорговыхПлощадок КАК ТК_ПринтераТорговыхПлощадок
	|		ПО ОчередьПечатиТСД.ТорговаяПлощадка = ТК_ПринтераТорговыхПлощадок.ТорговаяПлощадка
	|			И ОчередьПечатиТСД.СкладКомпании = ТК_ПринтераТорговыхПлощадок.СкладКомпании
	|ГДЕ
	|	ОчередьПечатиТСД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОчередьПечатиТСД.Статус = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ТекущаяДата())-60*60*24);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		
		ТабДок = ВыборкаДетальныеЗаписи.Хранилище.Получить();
		Если ТабДок = Неопределено Тогда
			
			
			НаборЗап = РегистрыСведений.ТК_ОчередьПечатиТСД.СоздатьНаборЗаписей();
			НаборЗап.Отбор.ТорговаяПлощадка.Установить(ВыборкаДетальныеЗаписи.ТорговаяПлощадка);
			НаборЗап.Отбор.СкладКомпании.Установить(ВыборкаДетальныеЗаписи.СкладКомпании);

			НаборЗап.Отбор.Дата.Установить(ВыборкаДетальныеЗаписи.Дата);
			НаборЗап.Отбор.Макет.Установить(ВыборкаДетальныеЗаписи.Макет);
			НаборЗап.Прочитать();
			
			НабЗапись = НаборЗап[0];
			НабЗапись.Статус = 2;
			НабЗапись.Ошибки = "Пустой файл печати";
			НаборЗап.Записать();	
			
			Продолжить;
		КонецЕсли;
		
		ИмяВрФайла = ПолучитьИмяВременногоФайла(".PDF");
		
		Табдок.Записать(ИмяВрФайла,ТипФайлаТабличногоДокумента.PDF);
		Ошибка = "";
		ТК_ТСД_РаботаHTTP_Сервис.НапечататьФайл(ИмяВрФайла,ВыборкаДетальныеЗаписи.Копий,ВыборкаДетальныеЗаписи.Принтер,Ошибка);
		
		
		НаборЗап = РегистрыСведений.ТК_ОчередьПечатиТСД.СоздатьНаборЗаписей();
		НаборЗап.Отбор.ТорговаяПлощадка.Установить(ВыборкаДетальныеЗаписи.ТорговаяПлощадка);
		НаборЗап.Отбор.СкладКомпании.Установить(ВыборкаДетальныеЗаписи.СкладКомпании);

		НаборЗап.Отбор.Дата.Установить(ВыборкаДетальныеЗаписи.Дата);
		НаборЗап.Отбор.Макет.Установить(ВыборкаДетальныеЗаписи.Макет);
		НаборЗап.Прочитать();
		
		НабЗапись = НаборЗап[0];
		Если ПустаяСтрока(Ошибка) Тогда
			НабЗапись.Статус = 1; 
		Иначе
			НабЗапись.Статус = 2;
			НабЗапись.Ошибки = Ошибка;
		КонецЕсли;
		НаборЗап.Записать();	
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ТК_СфрмироватьЗадачиТСД() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ТК_СфрмироватьЗадачиТСД);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	ТК_ОчередьЗаявок.Заявка КАК Заявка,
	|	ТК_ОчередьЗаявок.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ТК_ОчередьЗаявок КАК ТК_ОчередьЗаявок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СоздатьУдалитьОбновитьЗадачу(ВыборкаДетальныеЗаписи.Заявка,ВыборкаДетальныеЗаписи.Статус);
		
		НаборЗаписей = РегистрыСведений.ТК_ОчередьЗаявок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заявка.Установить(ВыборкаДетальныеЗаписи.Заявка);
		НаборЗаписей.Записать();
		
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура РассылкаУведомленийАрендыТСД() Экспорт
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/work_buh_uu/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пароль ="bynthghbpf";
	WS.Пользователь="ObmenSSL";
	
	Рез = WS.ReturnTSD();
	
	Для Каждого стр Из Рез.List Цикл
		
		ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиПоКоду(стр.ТорговаяПлощадка);
		Дата = стр.Дата;
		СуммаВыдачи = стр.Сумма;
		
		ЗадачаОбъект = Задачи.ТК_ЗадачаТСД.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
		ЗадачаОбъект.ПометкаУдаления = Ложь;
		ЗадачаОбъект.ВидЗадачи = Перечисления.ТК_ВидыЗадачТСД.Уведомление;
		ЗадачаОбъект.ТорговаяПлощадка = ТорговаяПлощадка;
		ЗадачаОбъект.Наименование = "Выдать "+СуммаВыдачи+ " грн Аренда";
		ЗадачаОбъект.СрокИсполнения  = КонецДня(Дата);
		ЗадачаОбъект.Описание = ЗадачаОбъект.Описание + Символы.ПС +"Задача создана - "+Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd");
		ЗадачаОбъект.Записать();
		
	КонецЦикла; 
	
	
КонецПроцедуры

#КонецОбласти



#Область ТСД

Процедура ЗагрузитьКонтрагентаYouControl(Контрагент)Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	apiKey="ca090000f10b72ae3d9db919dafa6f30a277c888";	//	6/08/2020 на 2000 запросов
	
	СправочникОбъект = Контрагент.ПолучитьОбъект();
	
	ФормаСобственности = СправочникОбъект.ЮрФизЛицо;
	ВидКонтрагента = СправочникОбъект.ВидКонтрагента;
	Наименование = СправочникОбъект.НаименованиеПолное;
	КодОКПО = СправочникОбъект.КодПоЕДРПОУ;
	ФОП = СтрДлина(СокрЛП(КодОКПО))=10;
	СправочникОбъект.Код = КодОКПО;
	
	Если ФОП Тогда
		Соединение = Новый HTTPСоединение("api.youscore.com.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Запрос = Новый HTTPЗапрос("/v1/usr/"+КодОКПО+"?showCurrentData=True&apiKey="+apiKey);			//	12
		Данные = Соединение.Получить(Запрос);
		jsonОтвет = Данные.ПолучитьТелоКакСтроку();
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(jsonОтвет);
		Структура = ПрочитатьJSON(Чтение);
		
		Попытка
			Если Структура.code = "InvalidParameters" Или Структура.code = "NotFound" Тогда
				ТестСообщения = Структура.message+" код ЄДРПОУ "+КодОКПО+" недействителен";
				ОбщегоНазначения.СообщитьПользователю(ТестСообщения+Символы.ПС+Структура.message);
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если Структура.code = "ForbiddenDueToRequestsLimit" И Структура.message = "Access denied: API calls limits have been reached" Тогда
				ТестСообщения = "ForbiddenDueToRequestsLimit - «Запрещено из-за лимита запросов»"+Символы.ПС+"Access denied: API calls limits have been reached - «Доступ запрещен: пределы вызовов API достигнуты»";
				ОбщегоНазначения.СообщитьПользователю(ТестСообщения);
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		СправочникОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		СправочникОбъект.Наименование = Структура.name;
		Если Структура.Свойство("shortName") Тогда
			СправочникОбъект.НаименованиеПолное = Структура.shortName;
		Иначе
			СправочникОбъект.НаименованиеПолное = Структура.name;
		КонецЕсли;
		
		
		ОжидаемыйВид = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ЮридическийАдресКонтрагента");
		
		СтрокаАдрес = 	СправочникОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,ОжидаемыйВид));
		Если СтрокаАдрес.Количество()>0 Тогда
			
			Для Каждого стАдрес Из СтрокаАдрес Цикл 
				СправочникОбъект.КонтактнаяИнформация.Удалить(стАдрес);
			КонецЦикла;
			
		КонецЕсли;
		
		КонтИнф = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Структура.address, ОжидаемыйВид);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(СправочникОбъект,КонтИнф,ОжидаемыйВид,Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		
	Иначе
		
		Соединение = Новый HTTPСоединение("api.youscore.com.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		Запрос = Новый HTTPЗапрос("/v1/companyInfo/"+КодОКПО+"?apiKey="+apiKey);							//	1
		Данные = Соединение.Получить(Запрос);
		jsonОтвет = Данные.ПолучитьТелоКакСтроку();
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(jsonОтвет);
		Структура = ПрочитатьJSON(Чтение);
		
		Попытка
			Если Структура.code = "InvalidParameters" Или Структура.code = "NotFound" Тогда
				ТестСообщения = Структура.message+" код ЄДРПОУ "+КодОКПО+" недействителен";
				ОбщегоНазначения.СообщитьПользователю(ТестСообщения+Символы.ПС+Структура.message);
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если Структура.code = "ForbiddenDueToRequestsLimit" И Структура.message = "Access denied: API calls limits have been reached" Тогда
				ТестСообщения = "ForbiddenDueToRequestsLimit - «Запрещено из-за лимита запросов»"+Символы.ПС+"Access denied: API calls limits have been reached - «Доступ запрещен: пределы вызовов API достигнуты»";
				ОбщегоНазначения.СообщитьПользователю(ТестСообщения);
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		СправочникОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		СправочникОбъект.НаименованиеПолное = Структура.name;
		СправочникОбъект.Наименование = Структура.shortName;
		
		ОжидаемыйВид = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ЮридическийАдресКонтрагента");
		
		СтрокаАдрес = 	СправочникОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,ОжидаемыйВид));
		Если СтрокаАдрес.Количество()>0 Тогда
			
			Для Каждого стАдрес Из СтрокаАдрес Цикл 
				СправочникОбъект.КонтактнаяИнформация.Удалить(стАдрес);
			КонецЦикла;
			
		КонецЕсли;
		
		КонтИнф = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Структура.address, ОжидаемыйВид);
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(СправочникОбъект,КонтИнф,ОжидаемыйВид,Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Если Структура.director <> "NotFound" Тогда
			
			ПараметрыСоздания = Новый Структура;
			ЗначенияЗаполнения = Новый Структура;
			ФамилияИмяОтчество = ОбщегоНазначенияТК.ЧастиИмени(Структура.director);
			ЗначенияЗаполнения.Вставить("Наименование", СокрЛП(Структура.director));
			ЗначенияЗаполнения.Вставить("Фамилия", ФамилияИмяОтчество.Фамилия);
			ЗначенияЗаполнения.Вставить("Имя", ФамилияИмяОтчество.Имя);
			ЗначенияЗаполнения.Вставить("Отчество", ФамилияИмяОтчество.Отчество);
			ЗначенияЗаполнения.Вставить("Должность", "Директор");
			ЗначенияЗаполнения.Вставить("ОбъектВладелец", СправочникОбъект.Ссылка);
			ЗначенияЗаполнения.Вставить("ВидКонтактногоЛица", Перечисления.ТК_ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента);
			ПараметрыСоздания.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
			Справочники.ТК_КонтактныеЛица.СоздатьКонтактноеЛицо(ПараметрыСоздания);
		КонецЕсли;
		
		Запрос = Новый HTTPЗапрос("/v1/Vat/"+КодОКПО+"?showCurrentData=True&apiKey="+apiKey);		//	9
		Данные = Соединение.Получить(Запрос);
		jsonОтвет = Данные.ПолучитьТелоКакСтроку();
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(jsonОтвет);
		Структура = ПрочитатьJSON(Чтение);
		
		Если Структура.code <> "NotFound" Тогда
			СправочникОбъект.НомерСвидетельстваПлательщикаНДС = Структура.code;		
		КонецЕсли;
		
	КонецЕсли;
	
	СправочникОбъект.Записать();
	
	ОсталосьЗапросов = Данные.Заголовки.Получить("x-ratelimit-keyremaining");
	ТестСообщения = "Данные you control. Осталось запросов - "+ОсталосьЗапросов;
	ОбщегоНазначения.СообщитьПользователю(ТестСообщения);
	
КонецПроцедуры
















#КонецОбласти

