
&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	 ПолныйДоступ =  Пользователи.ЭтоПолноправныйПользователь()ИЛИ РольДоступна("ТК_СервисДескПроведениеРедактирование");
	 ЧтениеВсехЗаявок = ПолныйДоступ ИЛИ ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(),"ПросмотрЗаявокИнициаторов",Ложь);

	 
	 ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"СтраницаАналитика","Видимость",ПолныйДоступ);
	 //ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Инициатор,ТекущийИсполнитель,КрайнийСрокУстранения","ТолькоПросмотр",НЕ ПолныйДоступ);
	 СвойстваТолькоПросмотр ="Инициатор,ТекущийИсполнитель,КрайнийСрокУстранения";
	 Если Объект.Статус <> Перечисления.СтатусыПроцессов.Открыт Тогда
			СвойстваТолькоПросмотр = СвойстваТолькоПросмотр +",Объект";
	 КонецЕсли;
	 ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,СвойстваТолькоПросмотр,"ТолькоПросмотр",НЕ ЧтениеВсехЗаявок);
	 ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,"Наименование,Описание","ТолькоПросмотр",НЕ  Пользователи.ЭтоПолноправныйПользователь());
	 
	 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	Попытка
		
		ПараметрыФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыФайла.ИдентификаторФормы = ИдентификаторФормы;
		ПараметрыФайла.ВызыватьИсключение = Ложь;
		Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ПараметрыФайла).СсылкаНаДвоичныеДанныеФайла;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
&НаСервере
Процедура ЗаполнитьПереписку();

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрТЧ Из Объект.Переписка Цикл 
		 нстрока = ТаблицаКомментарий.Добавить();
		ЗаполнитьЗначенияСвойств(нстрока,СтрТЧ,"Дата,Пользователь,Текст");
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_СтатусыЗадач.Период КАК Дата,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТК_СтатусыЗадач.Статус) КАК Текст
		|ИЗ
		|	РегистрСведений.ТК_СтатусыЗадач КАК ТК_СтатусыЗадач
		|ГДЕ
		|	ТК_СтатусыЗадач.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 		нстрока = ТаблицаКомментарий.Добавить();
		ЗаполнитьЗначенияСвойств(нстрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

	ТаблицаКомментарий.Сортировать("Дата Убыв");
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	
	// Установка значения реквизита АдресКартинки.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не Объект.ФайлКартинки.Пустая() Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(Объект.ФайлКартинки, УникальныйИдентификатор)
		Иначе
			АдресКартинки = "";
		КонецЕсли;
	КонецЕсли;

	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	
	ПараметрыПоля = РаботаСФайлами.ПолеФайла();
	ПараметрыПоля.Размещение  = "ГруппаКартинка";
	ПараметрыПоля.ПутьКДанным = "Объект.ФайлКартинки";
	ПараметрыПоля.ПутьКДаннымИзображения = "АдресКартинки";
	
	ДобавляемыеЭлементы = Новый Массив;
	ДобавляемыеЭлементы.Добавить(ПараметрыГиперссылки);
	ДобавляемыеЭлементы.Добавить(ПараметрыПоля);
	
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ДобавляемыеЭлементы);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	ЗаполнитьПереписку();
	
КонецПроцедуры  


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами


&НаСервереБезКонтекста
Функция КатегорияПриИзмененииНаСервере(Категория)
	Если ЗначениеЗаполнено(Категория) Тогда
		СрокВыполнения = Категория.СрокВыполнения*60*60*24;
	Иначе
		СрокВыполнения = 0;
	КонецЕсли;
	Возврат СрокВыполнения;
КонецФункции

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	СрокВыполнения = КатегорияПриИзмененииНаСервере(Объект.Категория);
	Объект.КрайнийСрокУстранения =  Объект.ДатаСоздания + СрокВыполнения;
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если НЕ ЭтаФорма.Записать() Тогда
		Возврат
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйКомментарий(Команда)
	
	
	Подсказка = "Введите текст";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтотОбъект , Параметры);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина);
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
    Если НЕ Строка = Неопределено Тогда
     	нСтрока = Объект.Переписка.Добавить();
		нСтрока.Пользователь = ПользователиКлиент.ТекущийПользователь();
		нСтрока.Дата         = ТекущаяДата();
		нСтрока.Текст = Строка;
		нстрокак = ТаблицаКомментарий.Добавить();
		нстрокак.Пользователь = Строка(нСтрока.Пользователь);
		нстрокак.Дата = нСтрока.Дата;
		нстрокак.Текст = нСтрока.Текст;
		
		ТаблицаКомментарий.Сортировать("Дата Убыв");

	КонецЕсли;

КонецПроцедуры;







