
&НаСервере
функция СоставТорговаяПлощадкаПриИзмененииНаСервере(текТорговаяПлощадка)
	найд = справочники.ТорговыеПлощадки.Выбрать(текТорговаяПлощадка);
	возврат найд.Следующий();
КонецФункции

&НаКлиенте
Процедура СоставТорговаяПлощадкаПриИзменении(Элемент)
	
	Если СоставТорговаяПлощадкаПриИзмененииНаСервере(элементы.Состав.ТекущиеДанные.ТорговаяПлощадка) тогда
		Сообщить ("Можно выбирать только торговые площадки, но не группы");
		элементы.Состав.ТекущиеДанные.ТорговаяПлощадка = неопределено;
	КонецЕсли;
	
КонецПроцедуры
