#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьПартииВТЧТовары(Объект) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзТовары = Объект.Товары.Выгрузить();
	тзТоварыСверн = тзТовары.Скопировать();
	
	тзТоварыСверн.Свернуть("Номенклатура, ХарактеристикаНоменклатуры");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиПартий.Партия КАК Партия,
	|	ЕСТЬNULL(ОстаткиПартий.КоличествоОстаток, 0) КАК КвоОстаток,
	|	ЕСТЬNULL(ОстаткиПартий.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|				&МоментВремени,
	|				СкладКомпании = &Склад
	|					И (Номенклатура, ХарактеристикаНоменклатуры) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|							ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|						ИЗ
	|							ТаблицаТоваров КАК ТаблицаТоваров)
	|					И Партия ССЫЛКА Документ.ПоступлениеТоваров
	|					И ВЫРАЗИТЬ(Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов = &Договор
	|					И ВЫРАЗИТЬ(Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет = &РеглУчет) КАК ОстаткиПартий
	|		ПО ТаблицаТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|			И ТаблицаТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиПартий.Партия.Дата";
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Товары", тзТоварыСверн);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("МоментВремени", Объект.Ссылка.МоментВремени());
	Иначе
		Запрос.УстановитьПараметр("МоментВремени",ТекущаяДата());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Объект.СкладКомпании);
	//Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("РеглУчет", Объект.РегламентированныйУчет);
	
	тзПартии = Запрос.Выполнить().Выгрузить();
	
	тзТовары.Очистить();
	
	Для Каждого стрТовары Из Объект.Товары Цикл
		КвоСписать = стрТовары.Количество;
		МассивПартии = тзПартии.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", стрТовары.Номенклатура, стрТовары.ХарактеристикаНоменклатуры));
		
		Для Каждого стрПартии Из МассивПартии Цикл						
			Если стрПартии.КвоОстаток <= 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			КвоСписываем = Мин(КвоСписать, стрПартии.КвоОстаток/стрТовары.Коэффициент);
			НовСтрТовары = тзТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТовары, стрТовары);
			ЗаполнитьЗначенияСвойств(НовСтрТовары, стрПартии);			
			
			НовСтрТовары.Партия = стрПартии.Партия;
			НовСтрТовары.Количество = КвоСписываем;			
			
			Если стрПартии.КвоОстаток = 0 Тогда 
				НовСтрТовары.Сумма 	 = стрПартии.СуммаОстаток;
			Иначе
				НовСтрТовары.Сумма	 = стрПартии.СуммаОстаток * (КвоСписываем*стрТовары.Коэффициент/стрПартии.КвоОстаток);			
				НовСтрТовары.Цена	 = стрПартии.СуммаОстаток / стрПартии.КвоОстаток;
			КонецЕсли;
			
			СтруктураДействий = Новый Структура;			
			
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС");			
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовСтрТовары, СтруктураДействий, Неопределено);
			
			стрПартии.КвоОстаток = стрПартии.КвоОстаток - КвоСписываем*стрТовары.Коэффициент;
			стрПартии.СуммаОстаток = стрПартии.СуммаОстаток - НовСтрТовары.Сумма;
			КвоСписать = КвоСписать - КвоСписываем;
			
			Если КвоСписать = 0 Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КвоСписать <> 0 Тогда 
			НовСтрТовары = тзТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТовары, стрТовары);
			НовСтрТовары.Партия = "";
			НовСтрТовары.Количество = КвоСписать;
			
			СтруктураДействий = Новый Структура;			
			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");			
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовСтрТовары, СтруктураДействий, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Загрузить(тзТовары);
КонецПроцедуры



// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Устанавливает параметры загрузки.
//
// Параметры:
//  Параметры - Структура - параметры загрузки данных из файла.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                               находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                               являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	Товары = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Штрихкод КАК СТРОКА(200)) КАК Штрихкод,
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(25)) КАК Артикул,
	|	ВЫРАЗИТЬ(ДанныеДляСопоставления.Номенклатура КАК СТРОКА(100)) КАК Номенклатура,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставления
	|ИЗ
	|	&ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Ссылка,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоАртикулу
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО ДанныеДляСопоставления.Артикул = спрНоменклатура.Артикул
	|			И (ДанныеДляСопоставления.Артикул <> """")
	|			И (НЕ спрНоменклатура.ЭтоГруппа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСопоставления.Штрихкод КАК Штрихкод,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставленияПоШтрихКоду
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|ГДЕ
	|	НЕ ДанныеДляСопоставления.Идентификатор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу)
	|	И ДанныеДляСопоставления.Штрихкод <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Ссылка,
	|	ДанныеДляСопоставленияПоШтрихКоду.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоШтрихкоду
	|ИЗ
	|	ДанныеДляСопоставленияПоШтрихКоду КАК ДанныеДляСопоставленияПоШтрихКоду
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ДанныеДляСопоставленияПоШтрихКоду.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляСопоставления.Номенклатура КАК Номенклатура,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеДляСопоставленияПоНаименованию
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|ГДЕ
	|	НЕ ДанныеДляСопоставления.Идентификатор В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоАртикулу.Идентификатор КАК Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу
	|		
	|				ОБЪЕДИНИТЬ ВСЕ
	|		
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор
	|				ИЗ
	|					СопоставленнаяНоменклатураПоШтрихкоду КАК СопоставленнаяНоменклатураПоШтрихкоду)
	|	И ДанныеДляСопоставления.Номенклатура <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Ссылка,
	|	ДанныеДляСопоставленияПоНаименованию.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ СопоставленнаяНоменклатураПоНаименованию
	|ИЗ
	|	ДанныеДляСопоставленияПоНаименованию КАК ДанныеДляСопоставленияПоНаименованию
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО ДанныеДляСопоставленияПоНаименованию.Номенклатура = спрНоменклатура.Наименование
	|			И (НЕ спрНоменклатура.ЭтоГруппа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоНаименованию.Идентификатор КАК Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоНаименованию.Ссылка) КАК Ссылка,
	|	""Наименование"" КАК ПолеПоиска,
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоНаименованию.Идентификатор) КАК Количество
	|ИЗ
	|	СопоставленнаяНоменклатураПоНаименованию КАК СопоставленнаяНоменклатураПоНаименованию
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоНаименованию.Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоАртикулу.Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоАртикулу.Ссылка),
	|	""Артикул"",
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоАртикулу.Идентификатор)
	|ИЗ
	|	СопоставленнаяНоменклатураПоАртикулу КАК СопоставленнаяНоменклатураПоАртикулу
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоАртикулу.Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор,
	|	МАКСИМУМ(СопоставленнаяНоменклатураПоШтрихкоду.Ссылка),
	|	""Штрихкод"",
	|	КОЛИЧЕСТВО(СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор)
	|ИЗ
	|	СопоставленнаяНоменклатураПоШтрихкоду КАК СопоставленнаяНоменклатураПоШтрихкоду
	|
	|СГРУППИРОВАТЬ ПО
	|	СопоставленнаяНоменклатураПоШтрихкоду.Идентификатор";
	
	Запрос.УстановитьПараметр("ДанныеДляСопоставления", ЗагружаемыеДанные);
	
	ТаблицаНоменклатура = Запрос.Выполнить().Выгрузить();	
	ТаблицаНоменклатура.Индексы.Добавить("Идентификатор");
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл 
		Товар = Товары.Добавить();
		
		Товар.Идентификатор = СтрокаТаблицы.Идентификатор;
		Товар.Количество = СтрокаТаблицы.Количество;
		
		нСтрока = ТаблицаНоменклатура.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		Если нСтрока <> Неопределено Тогда 			
			Если нСтрока.Количество = 1 Тогда 
				
				Товар.Номенклатура = нСтрока.Ссылка;			
				
			ИначеЕсли нСтрока.Количество > 1 Тогда 
				
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор;
				ЗаписьОНеоднозначности.Колонка = "Номенклатура";
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	ПоместитьВоВременноеХранилище(Товары, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//    ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//    ИмяКолонки               - Строка - Имя колонки, в который возникла неоднозначность. 
//    СписокНеоднозначностей    - Массив  - Массив для заполнения с неоднозначными данными.
//    ЗагружаемыеЗначенияСтрока - Строка  - Загружаемые данные, на основании которых возникла неоднозначность.
//    ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "Номенклатура" Тогда 
		Запрос = Новый Запрос;
		
		ТекстГде = "";
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Артикул) Тогда 
			ТекстГде = "И спрНоменклатура.Артикул = &Артикул";
			Запрос.УстановитьПараметр("Артикул", ЗагружаемыеЗначенияСтрока.Артикул);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Номенклатура) Тогда 
			ТекстГде = ?(ПустаяСтрока(ТекстГде), "И ", ТекстГде + " ИЛИ ") + "спрНоменклатура.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Номенклатура);
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК спрНоменклатура
		|ГДЕ
		|	НЕ спрНоменклатура.ЭтоГруппа " + ТекстГде;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
#КонецОбласти
	


#КонецЕсли