#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда







Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры




Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата = ТекущаяДата();
	Автор =  Пользователи.ТекущийПользователь();
	
	ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	КурсДокумента         = 1;
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	ИспользоватьЦеныИзПротоколов = ЗначениеНастроекПовтИсп.ПолучитьНастройкуПодразделения(ПодразделениеКомпании);
	ХозОперация = Справочники.ХозОперации.ЗаявкаНаВозвратПоставщику;

	СкладКомпании = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнойСклад",,СкладКомпании);	
	Если ЗначениеЗаполнено(СкладКомпании.ТипЦенСебестоимости) Тогда
		ТипЦен = СкладКомпании.ТипЦенСебестоимости;
	Иначе
		ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	КонецЕсли;

КонецПроцедуры







#КонецЕсли

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");

КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ТК_ОчередьЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Заявка = Ссылка;
	НоваяЗапись.Статус = ?(ЭтотОбъект.ПометкаУдаления,1,0);
	НаборЗаписей.Записать();

	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Если ЗначениеЗаполнено(ДокументОтгрузки) Тогда 
		ДокументОтгрузки = Неопределено;
	КонецЕсли;
	Выполнено = Ложь;
	Для Каждого Стр Из Товары Цикл 
		Стр.Партия = Неопределено;
	КонецЦикла;

КонецПроцедуры

