Процедура ЗапуститьЗагрузку() Экспорт 
	
	КлючОбработки			= "Загрузка Платежных поручений";
	ИдентификаторОбработки	= "ЗагрузкаПлатежныхПоручений";		
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктруаЗаписиРезультатаВыполнения);
	
	Попытка
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/Buh/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ИнициализацияОбработки - Не удалось подключится к базе: " + КлючОбработки;						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктруаЗаписиРезультатаВыполнения);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
		Возврат;
	КонецПопытки;
	
	//Правило = ПолучитьМакет("Правило").ПолучитьТекст();
	//ХранилищеДанных = Новый ХранилищеЗначения(Правило, Новый СжатиеДанных(9));	

	ХранилищеДанных = ОбменДаннымиПереопределяемый.ПравилаКонвертацииОбъектов("ОбменБухгалтерия", Истина);
	
	ВсеОК = Истина;	
	Description = "";
	
	ПараметрПродолжитьЗагрузку = Ложь;
	
	ЗначенияПараметров = Новый Структура("ДатаГраница,КодУзлаОбмена", Дата(2021,11,1), "SSL");
	ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);
	
	//резРег = WS.RegDoc("ОбменБанкТК");
	//Если Не резРег Тогда
	//	РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
	//	Возврат;
	//КонецЕсли;
	
	
	ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПараметрПродолжитьЗагрузку, Истина);					
	
	Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML("ПлатежныеПоручения",ИдентификаторОбработки,ДанныеЗагрузки);
	
	ВсеОК = Рез.Success;
	Description = Рез.Description;
	
	Если ЗначениеЗаполнено(Description) Тогда 
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Description, СтруктруаЗаписиРезультатаВыполнения);
	КонецЕсли;
	
	Если ВсеОК Тогда
		резДел = WS.DelRegDoc("ОбменБанкТК");
		Если Не резДел Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
			Возврат;
		Иначе
			РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Конец обработки.", СтруктруаЗаписиРезультатаВыполнения);
		КонецЕсли;
	Иначе
		резРег = WS.RegDoc("ОбменБанкТК");
		Если Не резРег Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ВсеОК Тогда		
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+Description, СтруктруаЗаписиРезультатаВыполнения);	
	КонецЕсли;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, ВсеОк);
	
КонецПроцедуры
