
&НаСервере
Функция ПоказатьПечатнуюФормуНаСервере(МассивСтрок)
	
	Табдок = Новый ТабличныйДокумент;
	Для Каждого Стр Из МассивСтрок Цикл 
		
		Очередь = РегистрыСведений.ТК_ОчередьПечатиТСД.СоздатьМенеджерЗаписи();
		Очередь.Дата = Стр.Дата;
		Очередь.ТорговаяПлощадка = Стр.ТорговаяПлощадка;
		Очередь.СкладКомпании = Стр.СкладКомпании;
		Очередь.Макет = Стр.Макет;
		Очередь.Прочитать();
		Если Очередь.Выбран() Тогда
			текТабДок = Очередь.Хранилище.Получить();
			Если Табдок = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Табдок.Вывести(текТабДок);
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	Возврат Табдок;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПечатнуюФорму(Команда)
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;

	ТабличныйДокумент = ПоказатьПечатнуюФормуНаСервере(МассивСтрок);
	ТабличныйДокумент.Показать();
КонецПроцедуры
