

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекстСостоянияEDI(СсылкаНаВладельца, ЭлементДоступен = Истина) Экспорт
	
	Результат = ТК_ОбменEDIВызовСервера.ТекстСостоянияEDI(СсылкаНаВладельца, ЭлементДоступен);
	
	Возврат Результат;
	
КонецФункции


Процедура ЗаполнитьСостояниеEDI(Форма, ДокументСсылка, ДекорацияСостояниеEDI, ГруппаСостояниеEDI = Неопределено) Экспорт
	
	
	Если ГруппаСостояниеEDI = Неопределено Тогда
		ДекорацияСостояниеEDI.Видимость = Истина;
	Иначе
		ГруппаСостояниеEDI.Видимость = Истина;
	КонецЕсли;
	
	
	ДекорацияДоступность = Истина;
	ТекстСостояния = ПолучитьТекстСостоянияEDI(ДокументСсылка, ДекорацияДоступность);
	
	Если ПустаяСтрока(ТекстСостояния) Тогда
		Если ГруппаСостояниеEDI = Неопределено Тогда
			ДекорацияСостояниеEDI.Видимость = Ложь;
		Иначе
			ГруппаСостояниеEDI.Видимость = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДекорацияСостояниеEDI.Заголовок = ТекстСостояния;
	ДекорацияСостояниеEDI.Доступность = ДекорацияДоступность;
	
КонецПроцедуры

Функция ЕстьДействие(ПереченьДействий, Действие) Экспорт
	
	Возврат (СтрНайти(ПереченьДействий, Действие) > 0);
	
КонецФункции

#КонецОбласти
