
&НаСервереБезКонтекста
Функция ПолучитьОрганизацию(КодПоЕДРПОУ)
	Возврат Справочники.Организации.ПолучитьОрганизациюПоЕДРПО(КодПоЕДРПОУ);
КонецФункции


&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл ключа электронно-цифровой подписи";
	Диалог.Фильтр = "Файл данных (*.ZS2)|*.ZS2";

	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьСертефикатИзФайлаЗавершение",ЭтотОбъект));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертефикатИзФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры)Экспорт
	
	
	Если ВыбранныеФайлы = Неопределено ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	EUTax = ТК_ПользовательЦСК_КлиентСервер.Инициализация_EUTaxService();
	
	
	Для Каждого ТекФайл Из ВыбранныеФайлы Цикл
		ТекФайлОбъект = Новый Файл(ТекФайл);
		Если ТекФайлОбъект.Существует() Тогда
			СтрокаBase64_Сертификат = Base64Строка(Новый ДвоичныеДанные(ТекФайл));
			Запись.ТелоКлюча = 	СтрокаBase64_Сертификат;
			//	
			КодПоЕДРПОУ = Лев(ТекФайлОбъект.Имя,8);
			Запись.Организация = ПолучитьОрганизацию(КодПоЕДРПОУ);
			//
			Если Найти(ТекФайлОбъект.Имя,"_DS") > 0 Тогда
				Запись.ВидКлюча = ПредопределенноеЗначение("Перечисление.ТК_ВидыКлючейЦП.Директор");
			ИначеЕсли Найти(ТекФайлОбъект.Имя,"_S") > 0 Тогда
				Запись.ВидКлюча = ПредопределенноеЗначение("Перечисление.ТК_ВидыКлючейЦП.Печать");
			ИначеЕсли Найти(ТекФайлОбъект.Имя,"_ВS") > 0 Тогда
				Запись.ВидКлюча = ПредопределенноеЗначение("Перечисление.ТК_ВидыКлючейЦП.Бухгалтер");
			КонецЕсли;
			
			
		КонецЕсли;	
	КонецЦикла;	 
КонецПроцедуры


&НаКлиенте
Процедура СохранитьФайл(Команда)

	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПолноеИмяФайла  = Запись.ИмяФайлаЦП;
	
	ДиалогВыбора.Заголовок = "Выберите путь сохранения файла";
	ДиалогВыбора.Показать(Новый ОписаниеОповещения("СохранитьФайлЗавершение",ЭтотОбъект));
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьФайлЗавершение(ВыбранныйКаталог, ДополнительныеПараметры)Экспорт
	
	
	Если ВыбранныйКаталог = Неопределено ИЛИ ВыбранныйКаталог.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Путь = ВыбранныйКаталог[0];
	Если ПустаяСтрока(Запись.ИмяФайлаЦП)Тогда
		тФайл = Путь +"\Ключ_"+Строка(Запись.ВидКлюча)+"_"+Строка(Запись.Организация)+".ZS2";	
	Иначе
		тФайл = Путь +"\"+Запись.ИмяФайлаЦП;	
	КонецЕсли;
	
	ДВ = Base64Значение(Запись.ТелоКлюча);
	ДВ.Записать(тФайл);
	
КонецПроцедуры

