
#Область ПроцедурыЗаписиДвиженийВРегистр

Процедура ОтразитьСогласованиеЦен(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСогласованиеЦен;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.СогласованиеЦен.Записывать = Истина;
	Движения.СогласованиеЦен.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьСогласованиеЦенАкция(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСогласованиеЦенАкция;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.СогласованиеЦенАкция.Записывать = Истина;
	Движения.СогласованиеЦенАкция.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьЦеныКонтрагентов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЦеныКонтрагентов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ЦеныКонтрагентов.Записывать = Истина;
	Движения.ЦеныКонтрагентов.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьЦены(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЦены;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Цены.Записывать = Истина;
	Движения.Цены.Загрузить(Таблица);	
	
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыИФункцииПолученияЦен

Функция ПолучитьЦенуПоОтбору(ИмяРегистра, ПараметрыОтбора) Экспорт 
	Перем ТипЦенЗакупки, Контрагент;
	ДобавитьВОтборКонтрагента = Ложь;
	
	ПараметрыОтбора.Свойство("ТипЦенЗакупки", ТипЦенЗакупки);	
	ДобавитьВОтборКонтрагента = ПараметрыОтбора.Свойство("Контрагент", Контрагент) И ТипЦенЗакупки;
	
	Запрос = Новый Запрос;
	
	Для Каждого Параметр Из ПараметрыОтбора Цикл		
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрЦенСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений." + ?(ТипЦенЗакупки, "ЦеныКонтрагентов", "Цены") + ".СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &ХарактеристикаНоменклатуры "+ ?(ДобавитьВОтборКонтрагента, "И Контрагент = &Контрагент", "") + "
	|				И ТипЦен = &ТипЦен) КАК РегистрЦенСрезПоследних"  + ?(ТипЦенЗакупки, " ГДЕ РегистрЦенСрезПоследних.Регистратор.СрокДействия >= &Дата УПОРЯДОЧИТЬ ПО РегистрЦенСрезПоследних.Период УБЫВ, РегистрЦенСрезПоследних.Регистратор.Дата УБЫВ", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьТекстЗапросаПолученияЦен(Запрос, ИмяРегистра, ИмяПоля, ПараметрыОтбора, НомерЗапроса) Экспорт
	Перем ТекстЗапроса;
	Перем Дата, Контрагент, ДоговорВзаиморасчетов, ТипЦен,ХарактеристикаНоменклатуры;
	
	ДополнительныеПоляОтбора = "";
	
	Если НЕ ЗначениеЗаполнено(ИмяРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Запрос) <> Тип("Запрос") Тогда
		Запрос = Новый Запрос;
	КонецЕсли;	
	
	//Установка основных параметров
	Если НЕ Запрос.Параметры.Свойство("Номенклатура") Тогда
		Запрос.Параметры.Вставить("Номенклатура");
		ЗаполнитьЗначенияСвойств(Запрос.Параметры, ПараметрыОтбора, "Номенклатура");
	КонецЕсли;
	
	//Если НЕ Запрос.Параметры.Свойство("ХарактеристикаНоменклатуры") Тогда
	//	Запрос.Параметры.Вставить("ХарактеристикаНоменклатуры");
	//	ЗаполнитьЗначенияСвойств(Запрос.Параметры, ПараметрыОтбора, "ХарактеристикаНоменклатуры");	
	//КонецЕсли;
	
	//Установка Параметра Дата
	ОтборДата = "ОтборДата" + НомерЗапроса;
	Если НЕ ПараметрыОтбора.Свойство("Дата", Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ГраницаИсклюая = Ложь;	
	Если ПараметрыОтбора.Свойство("ГраницаИсклюая", ГраницаИсклюая) Тогда
		Если ГраницаИсклюая = Истина Тогда
			Дата = Новый Граница(Дата, ВидГраницы.Исключая);
		КонецЕсли;
	КонецЕсли;	
	Запрос.УстановитьПараметр(ОтборДата, Дата);
	Запрос.УстановитьПараметр("ИмяПоля"+НомерЗапроса, ИмяПоля);
	
	Если ИмяРегистра = "СогласованиеЦен" Тогда
		
		//ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		//               |	&ИмяПоля КАК ИмяПоля,
		//               |	ЕСТЬNULL(СогласованиеЦен.Цена, 0) КАК Цена
		//               |ИЗ
		//               |	РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
		//               |ГДЕ
		//               |	СогласованиеЦен.Номенклатура = &Номенклатура
		//               |	И СогласованиеЦен.Характеристика = &ХарактеристикаНоменклатуры
		//               |	И &%ОтборДата% МЕЖДУ НАЧАЛОПЕРИОДА(СогласованиеЦен.Период, ДЕНЬ) И КОНЕЦПЕРИОДА(СогласованиеЦен.СрокДействия, ДЕНЬ)
		//			   |	%ДополнительныеПоляОтбора%";
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ИмяПоля"+НомерЗапроса+" КАК ИмяПоля,
		|	ЕСТЬNULL(ВложенныйЗапрос.Цена, 0) КАК Цена
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		1 КАК Порядок,
		|		СогласованиеЦен.Цена КАК Цена
		|	ИЗ
		|		РегистрСведений.СогласованиеЦенАкция КАК СогласованиеЦен
		|	ГДЕ
		|		СогласованиеЦен.Номенклатура = &Номенклатура
		//		|		И СогласованиеЦен.Характеристика = &ХарактеристикаНоменклатуры
		|		И &%ОтборДата% МЕЖДУ НАЧАЛОПЕРИОДА(СогласованиеЦен.Период, ДЕНЬ) И КОНЕЦПЕРИОДА(СогласованиеЦен.СрокДействия, ДЕНЬ)
		|	    %ДополнительныеПоляОтбора%
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|		2,
		|		СогласованиеЦен.Цена
		|	ИЗ
		|		РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
		|	ГДЕ
		|		СогласованиеЦен.Номенклатура = &Номенклатура
		//	|		И СогласованиеЦен.Характеристика = &ХарактеристикаНоменклатуры
		|		И &%ОтборДата% МЕЖДУ НАЧАЛОПЕРИОДА(СогласованиеЦен.Период, ДЕНЬ) И КОНЕЦПЕРИОДА(СогласованиеЦен.СрокДействия, ДЕНЬ)
		|		%ДополнительныеПоляОтбора%) КАК ВложенныйЗапрос";
		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	СогласованиеЦен.Регистратор.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СогласованиеЦен.СрокДействия КАК СрокДействия,
		|	СогласованиеЦен.Регистратор.Дата КАК РегистраторДата,
		|	СогласованиеЦен.Регистратор КАК Регистратор,
		|	СогласованиеЦен.Цена КАК Цена
		|ПОМЕСТИТЬ АкЦена
		|ИЗ
		|	РегистрСведений.СогласованиеЦенАкция КАК СогласованиеЦен
		|ГДЕ
		|	СогласованиеЦен.Номенклатура = &Номенклатура
		//	|	И СогласованиеЦен.Характеристика = &ХарактеристикаНоменклатуры
		|	И &%ОтборДата% МЕЖДУ СогласованиеЦен.Период И СогласованиеЦен.СрокДействия
		|    %ДополнительныеПоляОтбора%
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	2 КАК Порядок,
		|	СогласованиеЦен.Регистратор.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	СогласованиеЦен.СрокДействия КАК СрокДействия,
		|	СогласованиеЦен.Регистратор.Дата КАК РегистраторДата,
		|	СогласованиеЦен.Регистратор КАК Регистратор,
		|	СогласованиеЦен.Цена КАК Цена
		|ПОМЕСТИТЬ ОбЦена
		|ИЗ
		|	РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
		|ГДЕ
		|	СогласованиеЦен.Номенклатура = &Номенклатура
		//		|	И СогласованиеЦен.Характеристика = &ХарактеристикаНоменклатуры
		|	И &%ОтборДата% МЕЖДУ СогласованиеЦен.Период И СогласованиеЦен.СрокДействия
		|    %ДополнительныеПоляОтбора%
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АкЦена.Порядок КАК Порядок,
		|	АкЦена.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	АкЦена.СрокДействия КАК СрокДействия,
		|	АкЦена.РегистраторДата КАК РегистраторДата,
		|	АкЦена.Регистратор КАК Регистратор,
		|	АкЦена.Цена КАК Цена
		|ПОМЕСТИТЬ Цены
		|ИЗ
		|	АкЦена КАК АкЦена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбЦена.Порядок,
		|	ОбЦена.ДатаНачалаДействия,
		|	ОбЦена.СрокДействия,
		|	ОбЦена.РегистраторДата,
		|	ОбЦена.Регистратор,
		|	ОбЦена.Цена
		|ИЗ
		|	ОбЦена КАК ОбЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ИмяПоля"+НомерЗапроса+" КАК ИмяПоля,
		|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
		|	Цены.Порядок КАК Порядок,
		|	Цены.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	Цены.СрокДействия КАК СрокДействия,
		|	Цены.РегистраторДата КАК РегистраторДата,
		|	Цены.Регистратор КАК Регистратор
		|ИЗ
		|	Цены КАК Цены
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ДатаНачалаДействия УБЫВ,
		|	СрокДействия,
		|	РегистраторДата УБЫВ,
		|	Регистратор УБЫВ";
		
		Если ПараметрыОтбора.Свойство("Контрагент", Контрагент) Тогда
			Если Контрагент <> Неопределено Тогда
				ИмяПараметра = "Контрагент" + НомерЗапроса;
				Запрос.УстановитьПараметр(ИмяПараметра, Контрагент);
				ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И СогласованиеЦен.Контрагент = &" + ИмяПараметра;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов) Тогда
			ИмяПараметра = "ДоговорВзаиморасчетов" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ДоговорВзаиморасчетов);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И СогласованиеЦен.ДоговорВзаиморасчетов = &" + ИмяПараметра;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры) Тогда
			ИмяПараметра = "ХарактеристикаНоменклатуры" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ХарактеристикаНоменклатуры);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И СогласованиеЦен.Характеристика = &" + ИмяПараметра;
		КонецЕсли;
		
		
		
	ИначеЕсли ИмяРегистра = "ЦеныКонтрагентов" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ИмяПоля"+НомерЗапроса+" КАК ИмяПоля,
		|	ЕСТЬNULL(ЦеныКонтрагентов.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныКонтрагентов.СрезПоследних(
		|			&%ОтборДата%,
		|			Номенклатура = &Номенклатура
		//	|				И Характеристика = &ХарактеристикаНоменклатуры
		|				%ДополнительныеПоляОтбора%) КАК ЦеныКонтрагентов";	
		
		Если ПараметрыОтбора.Свойство("ТипЦен", ТипЦен) Тогда
			ИмяПараметра = "ТипЦен" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ТипЦен);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И ТипЦен = &" + ИмяПараметра;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Контрагент", Контрагент) Тогда
			Если Контрагент <> Неопределено Тогда
				ИмяПараметра = "Контрагент" + НомерЗапроса;
				Запрос.УстановитьПараметр(ИмяПараметра, Контрагент);
				
				ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И Контрагент = &" + ИмяПараметра;
			КонецЕсли;
		КонецЕсли;	
		
		Если ПараметрыОтбора.Свойство("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры) Тогда
			ИмяПараметра = "ХарактеристикаНоменклатуры" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ХарактеристикаНоменклатуры);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И Характеристика = &" + ИмяПараметра;
		КонецЕсли;
		
	ИначеЕсли ИмяРегистра = "Цены" Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ИмяПоля"+НомерЗапроса+" КАК ИмяПоля,
		|	ЕСТЬNULL(РегистрЦены.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(
		|			&%ОтборДата%,
		|			Номенклатура = &Номенклатура
		//	|				И Характеристика = &ХарактеристикаНоменклатуры
		|				%ДополнительныеПоляОтбора%) КАК РегистрЦены";
		
		Если ПараметрыОтбора.Свойство("ТипЦен", ТипЦен) Тогда
			ИмяПараметра = "ТипЦен" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ТипЦен);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И ТипЦен = &" + ИмяПараметра;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры) Тогда
			ИмяПараметра = "ХарактеристикаНоменклатуры" + НомерЗапроса;
			Запрос.УстановитьПараметр(ИмяПараметра, ХарактеристикаНоменклатуры);
			
			ДополнительныеПоляОтбора = ДополнительныеПоляОтбора + " И Характеристика = &" + ИмяПараметра;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("УпорядочитьРезультат") Тогда
			ТекстЗапроса = ТекстЗапроса + " ГДЕ   РегистрЦены.Цена <> 0  УПОРЯДОЧИТЬ ПО Цена УБЫВ";
		КонецЕсли;
		
		
		
	КонецЕсли;																	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ОтборДата%", ОтборДата);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ДополнительныеПоляОтбора%", ДополнительныеПоляОтбора);
	
	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС, "") + ТекстЗапроса;	
КонецПроцедуры

Процедура ЗаполнитьЦеныПоТипуЦенВТЧ(ТабличнаяЧасть, ВыделенныеСтроки = Неопределено, СтруктураПолейЗаполнения, СтруктураДействий = Неопределено, КэшированныеЗначения = Неопределено) Экспорт
	Если СтруктураПолейЗаполнения = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Параметры заполнения не указаны'; uk='Параметри не зазначені'");
		Возврат;
	КонецЕсли;
	
	ИменаКолонок = "НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры";
	
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Товары = ТабличнаяЧасть.Выгрузить(ВыделенныеСтроки, ИменаКолонок);	
	Иначе	
		Товары = ТабличнаяЧасть.Выгрузить(, ИменаКолонок);
	КонецЕсли;	
	
	Если Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;" + Символы.ПС;
	
	Запрос.УстановитьПараметр("Таблица", Товары);
	
	ТекстЗапросаЦен = "////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	%ПоляЦен%
	|ИЗ
	|	втТаблица КАК втТаблица
	|		&ПоляСоединений&";
	
	Инд = 0;
	ПоляЦен = "";
	ПоляСоединений = "";
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Поле Из СтруктураПолейЗаполнения Цикл
		Инд = Инд + 1;
		ИмяПоля = Поле.Ключ;
		ИмяЗапроса = "ЗапросЦен" + Инд;
		Параметры = Поле.Значение;
		ТипЦен = Параметры.ТипЦен;
		ТипЦенЗакупки = ТипЦен.ТипЦенЗакупки;
		ДобавитьВОтборКонтрагента = Параметры.Свойство("Контрагент") И ТипЦенЗакупки;
		
		СтруктураЗаполнения.Вставить(ИмяПоля, 0);	
		
		Для Каждого Параметр Из Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ + Инд, Параметр.Значение);
		КонецЦикла;
		
		ПоляЦен = ПоляЦен + ?(ЗначениеЗаполнено(ПоляЦен), "," + Символы.ПС, "") + "	ЕСТЬNULL(" + ИмяЗапроса + ".Цена, 0) КАК " + ИмяПоля;
		
		ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+ ?(ТипЦенЗакупки, "ЦеныКонтрагентов", "Цены") +".СрезПоследних(
		|				&Дата"+Инд+",
		|				ТипЦен = &ТипЦен"+Инд+" " + ?(ДобавитьВОтборКонтрагента, "И Контрагент = &Контрагент" + Инд, "") + "
		|					И (Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							втТаблица.Номенклатура КАК Номенклатура,
		|							втТаблица.ХарактеристикаНоменклатуры КАК Характеристика
		|						ИЗ
		|							втТаблица КАК втТаблица)) КАК "+ИмяЗапроса+"
		|		ПО втТаблица.Номенклатура = "+ИмяЗапроса+".Номенклатура
		|			И втТаблица.ХарактеристикаНоменклатуры = "+ИмяЗапроса+".Характеристика";
		
		ПоляСоединений = ПоляСоединений + ?(ЗначениеЗаполнено(ПоляСоединений), Символы.ПС, "") + "		" + ТекстСоединения;
	КонецЦикла;
	
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "%ПоляЦен%", ПоляЦен);
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "&ПоляСоединений&", ПоляСоединений);	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаЦен;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);	
		СтрокаТЧ = ТабличнаяЧасть[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		
		Если СтруктураДействий <> Неопределено Тогда
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьЦеныПоТипуЦенВТаблицеЗначений(Таблица, ВыделенныеСтроки = Неопределено,СтруктураПолейЗаполнения) Экспорт
	
	ИменаКолонок = "НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры";
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Товары = Таблица.Скопировать(ВыделенныеСтроки, ИменаКолонок);	
	Иначе	
		Товары = Таблица.Скопировать(, ИменаКолонок);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;" + Символы.ПС;
	
	Запрос.УстановитьПараметр("Таблица", Товары);
	
	
	ТекстЗапросаЦен = "////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	%ПоляЦен%
	|ИЗ
	|	втТаблица КАК втТаблица
	|		&ПоляСоединений&";
	
	
	Инд = 0;
	ПоляЦен = "";
	ПоляСоединений = "";
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Поле Из СтруктураПолейЗаполнения Цикл
		Инд = Инд + 1;
		ИмяПоля = Поле.Ключ;
		ИмяЗапроса = "ЗапросЦен" + Инд;
		Параметры = Поле.Значение;
		ТипЦен = Параметры.ТипЦен;
		ТипЦенЗакупки = ТипЦен.ТипЦенЗакупки;
		ДобавитьВОтборКонтрагента = Параметры.Свойство("Контрагент") И ТипЦенЗакупки;
		
		СтруктураЗаполнения.Вставить(ИмяПоля, 0);	
		
		
		Для Каждого Параметр Из Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ + Инд, Параметр.Значение);
		КонецЦикла;
		
		ПоляЦен = ПоляЦен + ?(ЗначениеЗаполнено(ПоляЦен), "," + Символы.ПС, "") + "	ЕСТЬNULL(" + ИмяЗапроса + ".Цена, 0) КАК " + ИмяПоля;
		
		ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+ ?(ТипЦенЗакупки, "ЦеныКонтрагентов", "Цены") +".СрезПоследних(
		|				&Дата"+Инд+",
		|				ТипЦен = &ТипЦен"+Инд+" " + ?(ДобавитьВОтборКонтрагента, "И Контрагент = &Контрагент" + Инд, "") + "
		|					И (Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							втТаблица.Номенклатура КАК Номенклатура,
		|							втТаблица.ХарактеристикаНоменклатуры КАК Характеристика
		|						ИЗ
		|							втТаблица КАК втТаблица)) КАК "+ИмяЗапроса+"
		|		ПО втТаблица.Номенклатура = "+ИмяЗапроса+".Номенклатура
		|			И втТаблица.ХарактеристикаНоменклатуры = "+ИмяЗапроса+".Характеристика";
		
		ПоляСоединений = ПоляСоединений + ?(ЗначениеЗаполнено(ПоляСоединений), Символы.ПС, "") + "		" + ТекстСоединения;
	КонецЦикла;
	
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "%ПоляЦен%", ПоляЦен);
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "&ПоляСоединений&", ПоляСоединений);	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаЦен;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);	
		СтрокаТЧ = Таблица[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьЦеныДоприходаПоТипуЦенВТаблицеЗначений(Таблица, ВыделенныеСтроки = Неопределено,СтруктураПолейЗаполнения) Экспорт
	
	ИменаКолонок = "НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры";
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Товары = Таблица.Скопировать(ВыделенныеСтроки, ИменаКолонок);	
	Иначе	
		Товары = Таблица.Скопировать(, ИменаКолонок);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;" + Символы.ПС;
	
	Запрос.УстановитьПараметр("Таблица", Товары);
	
	
	ТекстЗапросаЦен = "////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.НомерСтроки КАК НомерСтроки,
	|	втТаблица.Номенклатура КАК Номенклатура,
	|	втТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	%ПоляЦен%
	|ИЗ
	|	втТаблица КАК втТаблица
	|		&ПоляСоединений&";
	
	
	Инд = 0;
	ПоляЦен = "";
	ПоляСоединений = "";
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Поле Из СтруктураПолейЗаполнения Цикл
		Инд = Инд + 1;
		ИмяПоля = Поле.Ключ;
		ИмяЗапроса = "ЗапросЦен" + Инд;
		Параметры = Поле.Значение;
		ТипЦен = Параметры.ТипЦен;
		//ТипЦенЗакупки = ТипЦен.ТипЦенЗакупки;
		//ДобавитьВОтборКонтрагента = Параметры.Свойство("Контрагент") И ТипЦенЗакупки;
		
		СтруктураЗаполнения.Вставить(ИмяПоля, 0);	
		
		
		Для Каждого Параметр Из Параметры Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ + Инд, Параметр.Значение);
		КонецЦикла;
		
		ПоляЦен = ПоляЦен + ?(ЗначениеЗаполнено(ПоляЦен), "," + Символы.ПС, "") + "	ЕСТЬNULL(" + ИмяЗапроса + ".Цена, 0) КАК " + ИмяПоля;
		
		ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		|				&Дата"+Инд+",
		|				ТипЦен = &ТипЦен"+Инд+ "
		|					И (Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							втТаблица.Номенклатура КАК Номенклатура,
		|							втТаблица.ХарактеристикаНоменклатуры КАК Характеристика
		|						ИЗ
		|							втТаблица КАК втТаблица)) КАК "+ИмяЗапроса+"
		|		ПО втТаблица.Номенклатура = "+ИмяЗапроса+".Номенклатура
		|			И втТаблица.ХарактеристикаНоменклатуры = "+ИмяЗапроса+".Характеристика";
		
		ПоляСоединений = ПоляСоединений + ?(ЗначениеЗаполнено(ПоляСоединений), Символы.ПС, "") + "		" + ТекстСоединения;
	КонецЦикла;
	
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "%ПоляЦен%", ПоляЦен);
	ТекстЗапросаЦен = СтрЗаменить(ТекстЗапросаЦен, "&ПоляСоединений&", ПоляСоединений);	
	ТекстЗапроса = ТекстЗапроса + ТекстЗапросаЦен;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);	
		СтрокаТЧ = Таблица[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураЗаполнения);
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьТипЦен(Объект,ГруппаЦенообразования,Знач ВидУчета = Неопределено,Знач НаДату = Неопределено)Экспорт
	
	НаДату = ?(НаДату=Неопределено, ТекущаяДата(), НаДату);
	
	Если ВидУчета = Неопределено Тогда
		пВидУчета =  Перечисления.ВидыУчета.РегламентированныйУчет;
	Иначе
		пВидУчета = ?(ВидУчета,Перечисления.ВидыУчета.РегламентированныйУчет,Перечисления.ВидыУчета.НеРегламентированныйУчет);
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияДоговора.ТипЦены КАК ТипЦенДоговора,
	|	NULL КАК ТипЦенПодразделения
	|ИЗ
	|	РегистрСведений.ТК_УсловияЦенообразования.СрезПоследних(
	|			&НаДату,
	|			Объект = &Объект
	|				И ГруппаЦенообразования = &ГруппаЦенообразования) КАК УсловияДоговора
	|ГДЕ
	|	УсловияДоговора.Действует
	|	И УсловияДоговора.НачалоДействия <= &НаДату
	|	И (УсловияДоговора.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ УсловияДоговора.КонецДействия >= &НаДату)
	|	И (УсловияДоговора.ВидУчета = &ВидУчета
	|			ИЛИ УсловияДоговора.ВидУчета = &ВидУчетаОбщий)";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ГруппаЦенообразования", ГруппаЦенообразования);
	Запрос.УстановитьПараметр("ВидУчета", пВидУчета);
	Запрос.УстановитьПараметр("ВидУчетаОбщий", Перечисления.ВидыУчета.ОбщийУчет);
	
	
	
	тзРез = Запрос.Выполнить().Выгрузить();
	ТипЦенДоговора = Справочники.ТипыЦен.ПустаяСсылка();
	Для каждого стзРез Из тзРез Цикл
		Если ЗначениеЗаполнено(стзРез.ТипЦенДоговора) тогда
			Возврат стзРез.ТипЦенДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипЦенДоговора;
	
КонецФункции

Функция ПолучитьЗакупочнуюЦену(СтруктураОтбора)Экспорт
	
	Цена  = 0;
	
	Цена = ПолучитьЦенуПоОтбору("ЦеныКонтрагентов",СтруктураОтбора);
	Если Цена = 0 Тогда
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПартииТоваровКомпании.Сумма / ПартииТоваровКомпании.Количество КАК Цена
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	ПартииТоваровКомпании.СкладКомпании = &СкладКомпании
		|	И ПартииТоваровКомпании.Номенклатура = &Номенклатура
		|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ПартииТоваровКомпании.Период < &Период
		|	И ПартииТоваровКомпании.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|	И ПартииТоваровКомпании.Количество > 0
		|	И ПартииТоваровКомпании.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПартииТоваровКомпании.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", СтруктураОтбора.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтруктураОтбора.ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("СкладКомпании", СтруктураОтбора.СкладКомпании);
		Запрос.УстановитьПараметр("Период", СтруктураОтбора.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Цена = Выборка.Цена;
		КонецЕсли;
	КонецЕсли;
	
	Если Цена = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПартииТоваровКомпании.Сумма / ПартииТоваровКомпании.Количество КАК Цена
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	ПартииТоваровКомпании.Номенклатура = &Номенклатура
		|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ПартииТоваровКомпании.Период < &Период
		|	И ПартииТоваровКомпании.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|	И ПартииТоваровКомпании.Количество > 0
		|	И ПартииТоваровКомпании.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПартииТоваровКомпании.Период УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", СтруктураОтбора.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтруктураОтбора.ХарактеристикаНоменклатуры);
		//Запрос.УстановитьПараметр("СкладКомпании", СтруктураОтбора.СкладКомпании);
		Запрос.УстановитьПараметр("Период", СтруктураОтбора.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Цена = Выборка.Цена;
		КонецЕсли;
		
		
		
	КонецЕсли;
	
	
	Возврат Цена;
	
КонецФункции

Функция ПолучитьМинимальнуюРозничнуюЦену(Номенклатура)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_МинимальныеРозничныеЦеныСрезПоследних.ЦенаРозничная КАК ЦенаРозничная,
	|	ТК_МинимальныеРозничныеЦеныСрезПоследних.УчитыватьКрепость КАК УчитыватьКрепость
	|ИЗ
	|	РегистрСведений.ТК_МинимальныеРозничныеЦены.СрезПоследних(, ТипИндикатива = &ТипИндикатива) КАК ТК_МинимальныеРозничныеЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("ТипИндикатива", Номенклатура.ТипИндикатива);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		КоэффициентЕдиницы = УправлениеСвойствами.ЗначениеСвойства(Номенклатура,"КоличествоСигарет_ОснЕдиницы");
		Если КоэффициентЕдиницы = Неопределено Тогда
			КоэффициентЕдиницы = 1;
		Иначе
			КоэффициентЕдиницы = КоэффициентЕдиницы /1000;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.УчитыватьКрепость Тогда
			Если Номенклатура.Крепость = 0 Тогда
				КрепостьКоэффициент = 0.4;
			Иначе
				КрепостьКоэффициент = Номенклатура.Крепость*0.01;
			КонецЕсли;
			
		Иначе
			КрепостьКоэффициент = 1;
		КонецЕсли;
		
		Возврат(ВыборкаДетальныеЗаписи.ЦенаРозничная *КоэффициентЕдиницы * КрепостьКоэффициент);
		
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции


// получает действующие скидки
Функция ЗапросСкидок(Объект,ТипСкидки=Неопределено,ТорговаяПлощадка) Экспорт
	Запрос = новый Запрос;
	ЗапросТекст = "ВЫБРАТЬ
	              |	СкидкиВнутр.Активность КАК Активность,
	              |	СкидкиВнутр.ТорговаяПлощадка КАК ТорговаяПлощадка,
	              |	СкидкиВнутр.Объект КАК Объект,
	              |	СкидкиВнутр.НачалоДействия КАК НачалоДействия,
	              |	СкидкиВнутр.КонецДействия КАК КонецДействия,
	              |	СкидкиВнутр.ДниНедели КАК ДниНедели,
	              |	СкидкиВнутр.ЭтоПодарок КАК ЭтоПодарок,
	              |	СкидкиВнутр.ДисконтнаяКарта КАК ДисконтнаяКарта,
	              |	СкидкиВнутр.СуммаНакопления КАК СуммаНакопления,
	              |	СкидкиВнутр.ЗалОбслуживания КАК ЗалОбслуживания,
	              |	СкидкиВнутр.СуммаСтроки КАК СуммаСтроки,
	              |	СкидкиВнутр.СуммаЧека КАК СуммаЧека,
	              |	СкидкиВнутр.Количество КАК Количество,
	              |	СкидкиВнутр.Правило КАК Правило,
	              |	СкидкиВнутр.Скидка КАК Скидка,
	              |	СкидкиВнутр.ЗначениеСкидки КАК ЗначениеСкидки,
	              |	СкидкиВнутр.СпособВычисления КАК СпособВычисления,
	              |	СкидкиВнутр.ФлагВытеснения КАК ФлагВытеснения,
	              |	СкидкиВнутр.МаксимальнаяСуммаПодарка КАК МаксимальнаяСуммаПодарка,
	              |	СкидкиВнутр.Порядок КАК Порядок,
	              |	СУММА(ВЫБОР
	              |			КОГДА СкидкиВнутр.Действует
	              |				ТОГДА 1
	              |			ИНАЧЕ -1
	              |		КОНЕЦ) КАК Действует,
	              |	СкидкиВнутр.КлассификаторПродаж КАК КлассификаторПродаж
	              |ПОМЕСТИТЬ Скидки
	              |ИЗ
	              |	РегистрСведений.ТК_Скидки КАК СкидкиВнутр
	              |ГДЕ
	              |	&НаДату МЕЖДУ СкидкиВнутр.НачалоДействия И СкидкиВнутр.КонецДействия
	              |	И СкидкиВнутр.ТорговаяПлощадка = &ТорговаяПлощадка
	              |	И СкидкиВнутр.СпособВычисления = &СпособВычисления
	              |	И 1 = 1
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	СкидкиВнутр.Скидка,
	              |	СкидкиВнутр.Порядок,
	              |	СкидкиВнутр.ЭтоПодарок,
	              |	СкидкиВнутр.Правило,
	              |	СкидкиВнутр.ДисконтнаяКарта,
	              |	СкидкиВнутр.ЗалОбслуживания,
	              |	СкидкиВнутр.СпособВычисления,
	              |	СкидкиВнутр.ФлагВытеснения,
	              |	СкидкиВнутр.Активность,
	              |	СкидкиВнутр.НачалоДействия,
	              |	СкидкиВнутр.ДниНедели,
	              |	СкидкиВнутр.КонецДействия,
	              |	СкидкиВнутр.ТорговаяПлощадка,
	              |	СкидкиВнутр.Объект,
	              |	СкидкиВнутр.СуммаНакопления,
	              |	СкидкиВнутр.СуммаСтроки,
	              |	СкидкиВнутр.СуммаЧека,
	              |	СкидкиВнутр.Количество,
	              |	СкидкиВнутр.ЗначениеСкидки,
	              |	СкидкиВнутр.МаксимальнаяСуммаПодарка,
	              |	СкидкиВнутр.КлассификаторПродаж
	              |
	              |ИМЕЮЩИЕ
	              |	СУММА(ВЫБОР
	              |			КОГДА СкидкиВнутр.Действует
	              |				ТОГДА 1
	              |			ИНАЧЕ -1
	              |		КОНЕЦ) > 0
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ ПЕРВЫЕ 2
	              |	Скидки.Активность КАК Активность,
	              |	Скидки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	              |	Скидки.Объект КАК Объект,
	              |	Скидки.НачалоДействия КАК НачалоДействия,
	              |	Скидки.КонецДействия КАК КонецДействия,
	              |	Скидки.ДниНедели КАК ДниНедели,
	              |	Скидки.ЭтоПодарок КАК ЭтоПодарок,
	              |	Скидки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	              |	Скидки.СуммаНакопления КАК СуммаНакопления,
	              |	Скидки.ЗалОбслуживания КАК ЗалОбслуживания,
	              |	Скидки.СуммаСтроки КАК СуммаСтроки,
	              |	Скидки.СуммаЧека КАК СуммаЧека,
	              |	Скидки.Количество КАК Количество,
	              |	Скидки.Правило КАК Правило,
	              |	Скидки.Скидка КАК Скидка,
	              |	Скидки.ЗначениеСкидки КАК ЗначениеСкидки,
	              |	Скидки.СпособВычисления КАК СпособВычисления,
	              |	Скидки.ФлагВытеснения КАК ФлагВытеснения,
	              |	Скидки.МаксимальнаяСуммаПодарка КАК МаксимальнаяСуммаПодарка,
	              |	Скидки.Порядок КАК Порядок,
	              |	Скидки.Действует КАК Действует,
	              |	Скидки.КлассификаторПродаж КАК КлассификаторПродаж
	              |ИЗ
	              |	Скидки КАК Скидки
	              |ГДЕ
	              |	&НаДату МЕЖДУ Скидки.НачалоДействия И Скидки.КонецДействия
				  |	И Скидки.Порядок В
	              |			(ВЫБРАТЬ
	              |				МАКСИМУМ(СкидкиВнутр.Порядок)
	              |			ИЗ
	              |				РегистрСведений.ТК_Скидки КАК СкидкиВнутр
	              |			ГДЕ
	              |				&НаДату МЕЖДУ СкидкиВнутр.НачалоДействия И СкидкиВнутр.КонецДействия
	              |				И СкидкиВнутр.ТорговаяПлощадка = Скидки.ТорговаяПлощадка
	              |				И СкидкиВнутр.Объект = Скидки.Объект
	              |				И СкидкиВнутр.ДниНедели = Скидки.ДниНедели
	              |				И СкидкиВнутр.ЭтоПодарок = Скидки.ЭтоПодарок
	              |				И СкидкиВнутр.ДисконтнаяКарта = Скидки.ДисконтнаяКарта
	              |				И СкидкиВнутр.СуммаНакопления = Скидки.СуммаНакопления
	              |				И СкидкиВнутр.ЗалОбслуживания = Скидки.ЗалОбслуживания
	              |				И СкидкиВнутр.СуммаСтроки = Скидки.СуммаСтроки
	              |				И СкидкиВнутр.СуммаЧека = Скидки.СуммаЧека
	              |				И СкидкиВнутр.Количество = Скидки.Количество
	              |				И СкидкиВнутр.Правило = Скидки.Правило
	              |				И СкидкиВнутр.Скидка = Скидки.Скидка
	              |			СГРУППИРОВАТЬ ПО
	              |				СкидкиВнутр.ТорговаяПлощадка,
	              |				СкидкиВнутр.Объект,
	              |				СкидкиВнутр.ДниНедели,
	              |				СкидкиВнутр.ЭтоПодарок,
	              |				СкидкиВнутр.ДисконтнаяКарта,
	              |				СкидкиВнутр.СуммаНакопления,
	              |				СкидкиВнутр.ЗалОбслуживания,
	              |				СкидкиВнутр.СуммаСтроки,
	              |				СкидкиВнутр.СуммаЧека,
	              |				СкидкиВнутр.Количество,
	              |				СкидкиВнутр.Правило,
	              |				СкидкиВнутр.Скидка
	              |			ИМЕЮЩИЕ
	              |				СУММА(ВЫБОР
	              |						КОГДА СкидкиВнутр.Действует
	              |							ТОГДА 1
	              |						ИНАЧЕ -1
	              |					КОНЕЦ) > 0)";
	
	Если ТипСкидки = Неопределено Тогда
		УсловиеОтбора = "
		|	И СкидкиВнутр.Скидка = ЗНАЧЕНИЕ(Справочник.ТК_ТипыСкидок.СкидкаНаКоличествоТовара)
		|	И (СкидкиВнутр.Объект = &Объект ИЛИ СкидкиВнутр.Объект = &Группа1 ИЛИ СкидкиВнутр.Объект = &Группа2 ИЛИ СкидкиВнутр.Объект = &Группа3 ИЛИ СкидкиВнутр.Объект = &Группа4 ИЛИ СкидкиВнутр.Объект = &Группа5)";
		
	Иначе
		УсловиеОтбора = "
		| И СкидкиВнутр.Скидка = &ТипСкидкиСпецЦена
		| И СкидкиВнутр.Объект = &Объект";
	КонецЕсли;
	ЗапросТекст = СтрЗаменить(ЗапросТекст, "И 1 = 1", УсловиеОтбора);
	
	Запрос.Текст=ЗапросТекст;
	
	Запрос.УстановитьПараметр("НаДату",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТорговаяПлощадка",ТорговаяПлощадка);
	
	Если ТипСкидки=Справочники.ТК_ТипыСкидок.СпециальнаяЦена Тогда
		Запрос.УстановитьПараметр("СпособВычисления",Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена);
	ИначеЕсли ТипСкидки=Справочники.ТК_ТипыСкидок.СкидкаНаТовар Тогда
		Запрос.УстановитьПараметр("СпособВычисления",Перечисления.СкидкиСпособВычисления.Относительная);
	ИначеЕсли ТипСкидки=Справочники.ТК_ТипыСкидок.СкидкаНаНабор Тогда
		Запрос.УстановитьПараметр("СпособВычисления",Перечисления.СкидкиСпособВычисления.ПустаяСсылка());
	Иначе
		Запрос.УстановитьПараметр("СпособВычисления",Перечисления.СкидкиСпособВычисления.Абсолютная);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипСкидкиСпецЦена",ТипСкидки);
	
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Группа1",Объект.Родитель);
	Запрос.УстановитьПараметр("Группа2",Объект.Родитель.Родитель);
	Запрос.УстановитьПараметр("Группа3",Объект.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("Группа4",Объект.Родитель.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("Группа5",Объект.Родитель.Родитель.Родитель.Родитель.Родитель);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьЦенуТорговойПлощадки(Номенклатура,Характеристика,СкладТорговойПлощадки)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпанииДоступныеЦены.НомерСтроки КАК НомерСтроки,
	|	СкладыКомпанииДоступныеЦены.ТипЦен КАК ТипЦен
	|ПОМЕСТИТЬ ТипыЦен
	|ИЗ
	|	Справочник.СкладыКомпании.ДоступныеЦены КАК СкладыКомпанииДоступныеЦены
	|ГДЕ
	|	СкладыКомпанииДоступныеЦены.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1000,
	|	СкладыКомпании.ТипЦенРозничнойТорговли
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.Ссылка = &Ссылка
	|	И НЕ СкладыКомпании.ТипЦенРозничнойТорговли = ЗНАЧЕНИЕ(справочник.ТипыЦен.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СкладыКомпании.ТипЦенРозничнойТорговли
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СкладыКомпании.ДоступныеЦены.ТипЦен) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&НаДату,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И ТипЦен В
	|					(ВЫБРАТЬ
	|						ТипыЦен.ТипЦен КАК ТипЦен
	|					ИЗ
	|						ТипыЦен КАК ТипыЦен)) КАК ЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыЦен.НомерСтроки КАК НомерСтроки,
	|	ТипыЦен.ТипЦен КАК ТипЦен,
	|	Цены.Цена КАК Цена
	|ИЗ
	|	ТипыЦен КАК ТипыЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО ТипыЦен.ТипЦен = Цены.ТипЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Цена УБЫВ";
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Ссылка", СкладТорговойПлощадки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Цена = 0;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции


#КонецОбласти


Функция ПолучитьСтруктуруРекомендованныхНаценок(ТекНоменклатура, ТипЦен) Экспорт
	СтруктураРекомендованныхНаценок = Новый Структура;
	
	ТекРодитель = ТекНоменклатура.Родитель;
	ТекТипНоменклатуры = ТекНоменклатура.ТипНоменклатуры;
	ТекГруппаЦенообразования = ТекНоменклатура.ГруппаЦенообразования;
	
	Если НЕ ЗначениеЗаполнено(ТекНоменклатура) Тогда
		Возврат СтруктураРекомендованныхНаценок;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Номенклатура", ТекНоменклатура);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	""РекомендуемыйПроцентНаценкиНоменклатура"" КАК ИмяПоля,
	|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
	|	Наценки.Отклонение КАК Отклонение
	|ИЗ
	|	РегистрСведений.Наценки КАК Наценки
	|ГДЕ
	|	Наценки.ТипЦен = &ТипЦен
	|	И Наценки.Объект ССЫЛКА Справочник.Номенклатура
	|	И Наценки.Объект = &Номенклатура
	|	И НЕ Наценки.Объект.ЭтоГруппа
	|";
	
	Если ЗначениеЗаполнено(ТекРодитель) Тогда
		СписокРодителей = Новый СписокЗначений;
		РодительНоменклатуры = ТекРодитель;
		
		Пока НЕ РодительНоменклатуры = Справочники.Номенклатура.ПустаяСсылка() Цикл
			СписокРодителей.Добавить(РодительНоменклатуры);
			РодительНоменклатуры = РодительНоменклатуры.Родитель;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("СписокРодителей", СписокРодителей);
		
		ТекстЗапросаРодитель = "ВЫБРАТЬ
		|	""РекомендуемыйПроцентНаценкиРодитель"" КАК ИмяПоля,
		|	ВложенныйЗапрос.ПроцентНаценки КАК ПроцентНаценки,
		|	ВложенныйЗапрос.Отклонение КАК Отклонение
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		Наценки.ПроцентНаценки КАК ПроцентНаценки,
		|		Наценки.Отклонение КАК Отклонение,
		|		ВЫБОР
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 1
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 2
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 3
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 4
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 5
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 6
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 7
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 8
		|			КОГДА Наценки.Объект В
		|					(ВЫБРАТЬ
		|						Справочник.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|					ИЗ
		|						Справочник.Номенклатура
		|					ГДЕ
		|						Справочник.Номенклатура.Ссылка = &Номенклатура)
		|				ТОГДА 9
		|			ИНАЧЕ 10
		|		КОНЕЦ КАК Порядок
		|	ИЗ
		|		РегистрСведений.Наценки КАК Наценки
		|	ГДЕ
		|		Наценки.ТипЦен = &ТипЦен
		|		И Наценки.Объект ССЫЛКА Справочник.Номенклатура
		|		И Наценки.Объект.ЭтоГруппа
		|		И Наценки.Объект В(&СписокРодителей)
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		Порядок) КАК ВложенныйЗапрос";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапросаРодитель;	               
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекТипНоменклатуры) Тогда
		Запрос.УстановитьПараметр("ТипыНоменклатуры", ТекТипНоменклатуры);
		
		ТекстЗапросаТипНоменклатуры = "ВЫБРАТЬ
		|	""РекомендуемыйПроцентНаценкиТип"",
		|	Наценки.ПроцентНаценки,
		|	Наценки.Отклонение
		|ИЗ
		|	РегистрСведений.Наценки КАК Наценки
		|ГДЕ
		|	Наценки.ТипЦен = &ТипЦен
		|	И Наценки.Объект ССЫЛКА Справочник.ТипыНоменклатуры
		|	И Наценки.Объект = &ТипыНоменклатуры
		|";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапросаТипНоменклатуры;	               
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекГруппаЦенообразования) Тогда
		Запрос.УстановитьПараметр("ГруппаЦенообразования", ТекГруппаЦенообразования);
		
		ТекстЗапросаГрЦенообразования = "ВЫБРАТЬ
		|	""РекомендуемыйПроцентНаценкиГруппаЦенообразования"",
		|	Наценки.ПроцентНаценки,
		|	Наценки.Отклонение
		|ИЗ
		|	РегистрСведений.Наценки КАК Наценки
		|ГДЕ
		|	Наценки.ТипЦен = &ТипЦен
		|	И Наценки.Объект ССЫЛКА Справочник.ГруппыЦенообразования
		|	И Наценки.Объект = &ГруппаЦенообразования
		|";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапросаГрЦенообразования;	               
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураРекомендованныхНаценок.Вставить(Выборка.ИмяПоля, Выборка.ПроцентНаценки);	
	КонецЦикла;
	
	Возврат СтруктураРекомендованныхНаценок;
КонецФункции


//	//	ПереоЦенка МРЦ	//	//

Функция СоздаватьИзменениеЦен(Номенклатура)	Экспорт
	
	ТоварнаяМарка = Новый СписокЗначений;
	ТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т10"));	//	Бритиш Американ Тобакко
	ТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т20"));	//	Джапан Тобакко Інтернешнл
	ТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т40"));	//	Империал Тобакко
	ТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т80"));	//	Филип Моррис
	ТоварнаяМарка.Добавить(Справочники.ТоварныеМарки.НайтиПоКоду("Т60"));	//	Львовская табачная фабрика
	
	спГруппНоменклатура = Новый СписокЗначений;
	спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0001002"));	//	Сигареты
	спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0002000"));	//	Сигары
	спГруппНоменклатура.Добавить(Справочники.Номенклатура.НайтиПоКоду("D0000880"));	//	Стики для нагревания
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	|	И Номенклатура.ТоварнаяМарка В ИЕРАРХИИ(&ТоварнаяМарка)";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", спГруппНоменклатура);
	Запрос.УстановитьПараметр("ТоварнаяМарка", ТоварнаяМарка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
Процедура ПереоЦенкаМРЦ(Номенклатура, МРЦ, ГУИД_МРЦ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыЦен = Новый СписокЗначений;
	ТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("AC000014"));	//	51
	ТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("AC000015"));	//	МРЦ
	
	Для Каждого ТипЦен Из ТипыЦен Цикл
		СозданиеИзменениеЦенМРЦ(ТипЦен.Значение,Номенклатура,МРЦ,ГУИД_МРЦ);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СозданиеИзменениеЦенМРЦ(ТипЦен,Номенклатура,МРЦ,ГУИД_МРЦ) 
	
	Автор = Пользователи.ТекущийПользователь();
	ТекДата = ТекущаяДата();
	
	Док = Документы.ИзменениеЦен.СоздатьДокумент();
	Док.Автор 					= Автор;
	Док.Дата 					= ТекДата;
	Док.ДатаНачалаДействия 		= НачалоДня(ТекДата);
	Док.ХозОперация 			= ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен");
	Док.ПодразделениеКомпании 	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, Док.ПодразделениеКомпании);
	Док.Организация 			= ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",, Док.Организация);	
	Док.ВалютаДокумента 		= ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Док.ВалютаДокумента);
	Док.КурсДокумента         	= 1;
	Док.ТипЦен		         	= ТипЦен;
	Док.Комментарий 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Создано автоматически при создании ""МРЦ %1"" %2'"), Формат(МРЦ, "ЧДЦ=2"), ТекДата);
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД_МРЦ));
	НоваяЦена = РасчитатьНовуюЦену(ТипЦен,Номенклатура,Характеристика,МРЦ);
	
	Если УправлениеСвойствами.ЗначениеСвойства(Номенклатура, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "КоличествоСигарет_ОснЕдиницы")) = 1 Тогда
		НоваяЦена = НоваяЦена / 20;
	КонецЕсли;
	
	НоваяСтрока = Док.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;
	НоваяСтрока.НоваяЦена = НоваяЦена;
	
	Если НоваяЦена = 0 Тогда
		Док.Записать();
		ОтправитьПисьмо(ТипЦен,Номенклатура,Характеристика,МРЦ,Док.Ссылка);
	Иначе
		Док.Записать(РежимЗаписиДокумента.Проведение);
		СоздатьИзмененияЦенСЗависимымиТипамиЦенМРЦ(Док.Ссылка)
	КонецЕсли;
	
КонецПроцедуры

Функция РасчитатьНовуюЦену(ТипЦен,Номенклатура,Характеристика,МРЦ)
	
	Если ТипЦен.Код = "AC000015" Тогда	//	МРЦ
		Возврат МРЦ;
	ИначеЕсли ТипЦен.Код = "AC000014" Тогда	//	51
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиНоменклатуры.Владелец КАК Владелец,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка,
		|	ХарактеристикиНоменклатуры.ЗначениеМРЦ КАК МРЦпредыдущее,
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК ЦенаМРЦпредыдущего,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(, ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		|		ПО ХарактеристикиНоменклатуры.Ссылка = ЦеныСрезПоследних.Характеристика
		|			И ХарактеристикиНоменклатуры.Владелец = ЦеныСрезПоследних.Номенклатура
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Ссылка <> &Ссылка
		|	И ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И НЕ ХарактеристикиНоменклатуры.НеАктивная
		|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
		|	И ЦеныСрезПоследних.Цена <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХарактеристикиНоменклатуры.ЗначениеМРЦ УБЫВ";
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.УстановитьПараметр("Ссылка", Характеристика);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат 0;
		Иначе	
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Выборка.Следующий();
			//Если Выборка.Следующий() Тогда
			ЦенаПредварительная = МРЦ - (МРЦ * (1 - Выборка.ЦенаМРЦпредыдущего / Выборка.МРЦпредыдущее));
			НоваяЦена = ОКР(ЦенаПредварительная / 1.2 + 0.005,2) * 1.2;
			Возврат НоваяЦена;
		КонецЕсли;;
	КонецЕсли;;
	
КонецФункции

Процедура ОтправитьПисьмо(ТипЦен,Номенклатура,Характеристика,МРЦ,ДокСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Получатели = Новый СписокЗначений;
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Набойченко Михаил Анатольевич"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Лохвицкий Сергей Викторович"));
	//Получатели.Добавить(Справочники.Пользователи.НайтиПоНаименованию("ЛохвицкийСВ"));
	
	Тело = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Для позиции %1 %2 ""МРЦ %3"" по типу цен ""%4"" не найдена предыдущая цена.%5%6'; uk = 'Для позиції %1 %2 ""МРЦ %3"" по типу цін ""%4"" не знайдена попередня ціна.%5%6'"),
	Номенклатура.Артикул,
	Номенклатура,
	МРЦ,
	ТипЦен,
	Символы.ПС,
	ДокСсылка);
	
	СтрокаАдрес = "";
	
	ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("EmailПользователя");
	
	Для Каждого Получатель Из Получатели Цикл
		ЭлАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель.Значение,ВидКИ);
		
		Если ПустаяСтрока(ЭлАдрес) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаАдрес = СтрокаАдрес + ЭлАдрес+";";	
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаАдрес) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет пользователей для отправки уведомлений'; uk = 'Немає користувачів для відправки повідомлень'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",СтрокаАдрес);
	ПараметрыПисьма.Вставить("Тема","Нет цены или новая позиция");
	ПараметрыПисьма.Вставить("Тело",Тело);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),ПараметрыПисьма);
	РеОтпр = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(),Письмо);
	
КонецПроцедуры

Процедура СоздатьИзмененияЦенСЗависимымиТипамиЦенМРЦ(ДокОснование)
	
	БазовыйТипЦен = ДокОснование.ТипЦен;
	
	ПроводитьДокументы = Истина;
	
	Если ДокОснование.Пустая()
		Или БазовыйТипЦен.Пустая() Тогда 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТипыЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТипыЦен.БазовыйТипЦен = &БазовыйТипЦен
	|	И НЕ ТипыЦен.ПометкаУдаления
	|	И НЕ ТипыЦен.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("БазовыйТипЦен", БазовыйТипЦен);
	
	Результат = Запрос.Выполнить();
	//	Результат.Выгрузить();
	
	Если Результат.Пустой() Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для типа цен ""%1"" нет подчиненных типов цен'; uk = 'Для типа ціни ""%1"" немає підпорядкованих типів цін'"),
		БазовыйТипЦен),
		ДокОснование,
		,
		,
		Отказ);
		
		Возврат;
	КонецЕсли;
	
	Обработки.ТК_ВводНаОснованииИзменениеЦен.ЗаполнитьНаОснованииИзмененияЦен(ДокОснование, Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"), ПроводитьДокументы,,ДокОснование);
	
КонецПроцедуры


//	//	Установка цен для РЦ	//	//

Процедура УстановкаЦенДляРЦ(МассивПриходов)	Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыЦен = Новый СписокЗначений;
	ТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("AC000014"));	//	51
	ТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("AC000015"));	//	МРЦ
	
	Для Каждого Приход Из МассивПриходов Цикл
		Если НеОбрабатывать(Приход) Тогда
			Продолжить;
		КонецЕсли;
		
		Протокол = Документы.ПротоколСогласованияЦен.СоздатьДокумент();
		Протокол.Заполнить(Приход);
		Протокол.Дата		= ТекущаяДата();
		Протокол.ТипЦен		= Справочники.ТипыЦен.НайтиПоКоду("AC000014");	//	51
		Протокол.Комментарий= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Создано автоматически %1 для %2.'; uk = 'Створено автоматично %1 для %2.'"),ТекущаяДата(),Приход);
		Протокол.Записать(РежимЗаписиДокумента.Проведение);
		
		Для Каждого ТипЦен Из ТипыЦен Цикл
			СозданиеИзменениеЦенЛТФ(Протокол.Ссылка,ТипЦен.Значение);
		КонецЦикла;
		
		СозданиеИзменениеЦенПоСоответствиюЛТФ(Протокол.Ссылка);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция НеОбрабатывать(Приход)
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("36929041");				//	Марвел ТД (бывш. Львовская табачная фабрика ТД) ООО
	ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиПоКоду("ХGL000295");	//	04 РЦ ТАБАК
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Ссылка КАК Ссылка,
	|	ПоступлениеТоваров.Контрагент КАК Контрагент,
	|	ПоступлениеТоваров.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка = &Ссылка
	|	И ПоступлениеТоваров.Контрагент = &Контрагент
	|	И ПоступлениеТоваров.ТорговаяПлощадка В ИЕРАРХИИ(&ТорговаяПлощадка)
	|	И ПоступлениеТоваров.Проведен";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Ссылка", Приход);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();	
	
КонецФункции

Процедура СозданиеИзменениеЦенЛТФ(Протокол,ТипЦен) 
	
	Приход = Протокол.ДокументОснование;
	
	ТекДата = ТекущаяДата();
	
	ДокИзмЦен = Документы.ИзменениеЦен.СоздатьДокумент();
	
	ДокИзмЦен.Дата 					= ТекДата;
	ДокИзмЦен.Автор 				= Пользователи.ТекущийПользователь();
	ДокИзмЦен.ТипЦен		        = ТипЦен;
	ДокИзмЦен.Комментарий 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Создано автоматически %1 для %2.'; uk = 'Створено автоматично %1 для %2.'"),ТекДата,Протокол.ДокументОснование);
	ДокИзмЦен.ХозОперация 			= ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен");
	ДокИзмЦен.Организация 			= Приход.Организация;
	ДокИзмЦен.КурсДокумента 		= 1;
	ДокИзмЦен.ВалютаДокумента 		= Приход.ВалютаДокумента;
	ДокИзмЦен.ДокументОснование		= Протокол;
	ДокИзмЦен.ДатаНачалаДействия 	= НачалоДня(ТекДата);
	ДокИзмЦен.ПодразделениеКомпании	= Приход.ПодразделениеКомпании;
	
	Для Каждого строка Из Приход.Товары Цикл	
		НоваяСтрока = ДокИзмЦен.Товары.Добавить();
		НоваяСтрока.Номенклатура = строка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = строка.ХарактеристикаНоменклатуры;
		Если ТипЦен.Код = "AC000015" Тогда	//	МРЦ
			ШтСигВОснЕд = РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект,Свойство",строка.Номенклатура,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КоличествоСигарет_ОснЕдиницы"))).Значение;
			НоваяСтрока.НоваяЦена = строка.ХарактеристикаНоменклатуры.ЗначениеМРЦ / ?(ШтСигВОснЕд = 1,20,1);	//	Так сказал Набойченко
		ИначеЕсли ТипЦен.Код = "AC000014" Тогда	//	51
			НоваяСтрока.НоваяЦена = строка.СуммаВсего / строка.КоличествоБазовое;
		КонецЕсли;
	КонецЦикла;
	
	ДокИзмЦен.Записать(РежимЗаписиДокумента.Проведение);
	Если ТипЦен.Код = "AC000015" Тогда	//	МРЦ
		СоздатьИзмененияЦенСЗависимымиТипамиЦенЛТФ(ДокИзмЦен.Ссылка)
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьИзмененияЦенСЗависимымиТипамиЦенЛТФ(ДокОснование)
	
	БазовыйТипЦен = ДокОснование.ТипЦен;
	
	ПроводитьДокументы = Истина;
	
	Если ДокОснование.Пустая()
		Или БазовыйТипЦен.Пустая() Тогда 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТипыЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТипыЦен.БазовыйТипЦен = &БазовыйТипЦен
	|	И НЕ ТипыЦен.ПометкаУдаления
	|	И НЕ ТипыЦен.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("БазовыйТипЦен", БазовыйТипЦен);
	
	Результат = Запрос.Выполнить();
	//	Результат.Выгрузить();
	
	Если Результат.Пустой() Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для типа цен ""%1"" нет подчиненных типов цен'; uk = 'Для типа ціни ""%1"" немає підпорядкованих типів цін'"),
		БазовыйТипЦен),
		ДокОснование,
		,
		,
		Отказ);
		
		Возврат;
	КонецЕсли;
	
	Обработки.ТК_ВводНаОснованииИзменениеЦен.ЗаполнитьНаОснованииИзмененияЦен(ДокОснование, Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"), ПроводитьДокументы);
	
КонецПроцедуры

Процедура СозданиеИзменениеЦенПоСоответствиюЛТФ(ДокОснование)
	
	Статистика = Новый Структура;
	Статистика.Вставить("Создано", 0);
	Статистика.Вставить("СОшибками", 0);
	
	Если ДокОснование.Пустая() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеНаценок.ТипЦен КАК ТипЦен,
	|	СоответствиеНаценок.БазовыйТипЦен КАК БазовыйТипЦен,
	|	СоответствиеНаценок.ПроцентНаценки КАК ПроцентНаценки,
	|	СоответствиеНаценок.ТипЦен.ВалютаЦены КАК ВалютаДокумента,
	|	СоответствиеНаценок.ТипЦен.ВариантОкругления КАК ВариантОкругления,
	|	СоответствиеНаценок.ТипЦен.Точность КАК Точность,
	|	СоответствиеНаценок.ТипЦен.ПравилоРасчета КАК ПравилоРасчета
	|ИЗ
	|	РегистрСведений.СоответствиеНаценок КАК СоответствиеНаценок
	|ГДЕ
	|	СоответствиеНаценок.ПроцентНаценки <> 0";
	
	Результат = Запрос.Выполнить();
	//	Результат.Выгрузить();
	
	Если Результат.Пустой() Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не найдены соответствия наценок'; uk = 'Не знайдені відповідності націнок'")));
		
		Возврат;
	КонецЕсли;
	
	ВыборкаТипыЦен = Результат.Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПротоколСогласованияЦен.Ссылка КАК ДокументОснование,
	|	ПротоколСогласованияЦен.Организация КАК Организация,
	|	ПротоколСогласованияЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПротоколСогласованияЦен.КурсДокумента КАК КурсДокумента,
	|	ПротоколСогласованияЦен.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|		Цена КАК ЦенаБазовая
	|	) КАК Товары
	|ИЗ
	|	Документ.ПротоколСогласованияЦен КАК ПротоколСогласованияЦен
	|ГДЕ
	|	ПротоколСогласованияЦен.Ссылка = &Ссылка";
	
	
	РезультатДок = Запрос.Выполнить();
	
	РеквизитыИзменениеЦен = РезультатДок.Выбрать();
	
	СтруктураРеквизитов = Новый Структура("ДокументОснование, Организация, ПодразделениеКомпании, КурсДокумента");	
	
	РеквизитыИзменениеЦен.Следующий();	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, РеквизитыИзменениеЦен);
	
	СтруктураРеквизитов.Вставить("Дата", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ДатаНачалаДействия", ТекущаяДата());
	СтруктураРеквизитов.Вставить("ХозОперация", ПредопределенноеЗначение("Справочник.ХозОперации.ИзменениеЦен"));
	
	ТаблицаТовары = РеквизитыИзменениеЦен.Товары.Выгрузить();
	
	Если ТаблицаТовары.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Пока ВыборкаТипыЦен.Следующий() Цикл 
		
		СтруктураТипаЦен = Новый Структура("ТипЦен, БазовыйТипЦен, ВалютаДокумента, ");
		ЗаполнитьЗначенияСвойств(СтруктураТипаЦен, ВыборкаТипыЦен);
		ОкруглятьДо =  1 / Pow(10, ВыборкаТипыЦен.Точность);
		
		СтруктураТипаЦен.Вставить("ОкруглятьДо",ОкруглятьДо);
		
		ПараметрыОкргуления = Новый Структура;
		ПараметрыОкргуления.Вставить("ОкруглятьДо", ОкруглятьДо);
		ПараметрыОкргуления.Вставить("ВариантОкругления", ВыборкаТипыЦен.ВариантОкругления);
		ПараметрыОкргуления.Вставить("Точность",  ВыборкаТипыЦен.Точность);
		
		ДокИЦ = Документы.ИзменениеЦен.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокИЦ, СтруктураТипаЦен);
		
		//ДокИЦ.УстановитьНовыйНомер();
		
		ДокИЦ.Товары.Загрузить(ТаблицаТовары);
		
		Для Каждого СтрТЧ ИЗ ДокИЦ.Товары Цикл
			СтрТЧ.ПроцентНаценки = ВыборкаТипыЦен.ПроцентНаценки;			
		КонецЦикла;
		
		СтруктураДействий = Новый Структура;
		ПараметрыПолученияЦены = Новый Структура;
		ПараметрыПолученияЦены.Вставить("Дата",ДокИЦ.Дата);
		ПараметрыПолученияЦены.Вставить("ТипЦен", ДокИЦ.БазовыйТипЦен);
		ПараметрыПолученияЦены.Вставить("ГраницаИсклюая", Истина);
		
		ПараметрыСтаройЦены = Новый Структура;
		ПараметрыСтаройЦены.Вставить("ИмяРегистра", "Цены");
		ПараметрыСтаройЦены.Вставить("Дата", ДокИЦ.Дата);
		ПараметрыСтаройЦены.Вставить("ТипЦен", ДокИЦ.ТипЦен);
		ПараметрыСтаройЦены.Вставить("ГраницаИсклюая", Истина);
		
		СтруктураПолейДляЗаполненияЦен = Новый Структура;			
		СтруктураПолейДляЗаполненияЦен.Вставить("ЦенаБазовая", ПараметрыПолученияЦены);	
		СтруктураПолейДляЗаполненияЦен.Вставить("СтараяЦена", ПараметрыСтаройЦены);	
		
		СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
		
		СтруктураДействий.Вставить("ЗаполнитьРекомендованныеНаценки", Новый Структура("ТипЦен", ДокИЦ.ТипЦен));
		//СтруктураДействий.Вставить("ЗаполнитьПроцентНаценкиИзРекомендованных");
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуПоПроцентуНаценки",ВыборкаТипыЦен.ПравилоРасчета);	
		СтруктураДействий.Вставить("ПересчитатьНовуюЦенуСУчетомОкругления", ПараметрыОкргуления);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокИЦ.Товары, СтруктураДействий, КэшированныеЗначения);
		
		Попытка
			ДокИЦ.Записать(РежимЗаписиДокумента.Проведение);
			Статистика.Вставить("Создано", Статистика.Создано + 1);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Статистика.Вставить("СОшибками", Статистика.СОшибками + 1);
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры

