#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстЗапросаТаблицаКонсолидированныеПродажи(Запрос, ТекстыЗапроса, Регистры);
			
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
		
	

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)

	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонсолидированныеПродажи.Дата КАК Период,
	               |	КонсолидированныеПродажи.Ссылка КАК Ссылка,
	               |	КонсолидированныеПродажи.ХозОперация КАК ХозОперация,
	               |	КонсолидированныеПродажи.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.КонсолидированныеПродажи КАК КонсолидированныеПродажи
	               |ГДЕ
	               |	КонсолидированныеПродажи.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ХозОперация",Реквизиты.ХозОперация);
	//Запрос.УстановитьПараметр("Организация",Реквизиты.Организация);
	//Запрос.УстановитьПараметр("ПодразделениеКомпании",Реквизиты.ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("ТорговаяПлощадка",Реквизиты.ТорговаяПлощадка);
	//Запрос.УстановитьПараметр("Контрагент",Реквизиты.Контрагент);
	//Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",Реквизиты.ДоговорВзаиморасчетов);
	//Запрос.УстановитьПараметр("ВалютаДокумента",Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("МоментВремени", Реквизиты.МоментВремени);

КонецПроцедуры

Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ВтТаблицаТовары";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КонсолидированныеПродажиТовары.Ссылка.Ссылка КАК Ссылка,
	               |	КонсолидированныеПродажиТовары.Ссылка.ХозОперация КАК ХозОперация,
	               |	КонсолидированныеПродажиТовары.НомерСтроки КАК НомерСтроки,
	               |	КонсолидированныеПродажиТовары.СтатусПартии КАК СтатусПартии,
	               |	КонсолидированныеПродажиТовары.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	КонсолидированныеПродажиТовары.СкладКомпании КАК СкладКомпании,
	               |	КонсолидированныеПродажиТовары.Номенклатура КАК Номенклатура,
	               |	КонсолидированныеПродажиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	КонсолидированныеПродажиТовары.СтавкаНДС КАК СтавкаНДС,
	               |	КонсолидированныеПродажиТовары.Количество КАК Количество,
	               |	КонсолидированныеПродажиТовары.Себестоимость КАК Себестоимость,
	               |	КонсолидированныеПродажиТовары.СуммаВсего КАК СуммаВсего,
	               |	КонсолидированныеПродажиТовары.СуммаНДС КАК СуммаНДС
	               |ПОМЕСТИТЬ ВтТаблицаТовары
	               |ИЗ
	               |	Документ.КонсолидированныеПродажи.Товары КАК КонсолидированныеПродажиТовары
	               |ГДЕ
	               |	КонсолидированныеПродажиТовары.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаКонсолидированныеПродажи(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "КонсолидированныеПродажи";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса ="ВЫБРАТЬ
	              |	&Период КАК Период,
	              |	ВтТаблицаТовары.ПодразделениеКомпании КАК ПодразделениеКомпании,
	              |	ВтТаблицаТовары.СкладКомпании КАК СкладКомпании,
	              |	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
	              |	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	              |	ВтТаблицаТовары.ХозОперация КАК ХозОперация,
	              |	ВтТаблицаТовары.СтатусПартии КАК СтатусПартии,
	              |	ВтТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	              |	ВтТаблицаТовары.СуммаНДС КАК СуммаНДС,
	              |	ВтТаблицаТовары.Количество КАК Количество,
	              |	ВтТаблицаТовары.СуммаВсего КАК Сумма,
	              |	ВтТаблицаТовары.Себестоимость КАК Себестоимость
	              |ИЗ
	              |	ВтТаблицаТовары КАК ВтТаблицаТовары"; 
		
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти




#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.МестоРазмещения = "ПодменюОтчеты";
	КонецЕсли;
	
	
КонецПроцедуры




#КонецОбласти	


#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры



#КонецОбласти	




#Иначе
	
#КонецЕсли