

Процедура ВыгрузитьДанные() Экспорт
	РезультатВыполненияОбработки = РегистрыСведений.РезультатыВыполненияОбработок;	
	СтруктураЗаписиРезультата = РезультатВыполненияОбработки.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиРезультата.ИдентификаторОбработки = "ВыгрузкаPlanohero Тест Задания";
	СтруктураЗаписиРезультата.КлючОбработки = "ВыгрузкаPlanohero Тест Задания";
	РезультатВыполненияОбработки.ДобавитьКомментарий("Тест Задания.Planohero", СтруктураЗаписиРезультата);
	РезультатВыполненияОбработки.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиРезультата,Истина);
КонецПроцедуры
