
#Область ОбработчикиСобытийФорм


Функция ПараметрыПриСозданииНаСервере_ФормаДокумента() Экспорт
	
	ПараметрыПриСоздании = Новый Структура("Форма, ДокументСсылка, ДекорацияСостояниеEDI, ГруппаСостояниеEDI, МестоРазмещенияКоманд, Направление");
	
	Возврат ПараметрыПриСоздании;
	
КонецФункции

Процедура ПриСозданииНаСервере_ФормаДокумента(ПараметрыПриСозданииНаСервере) Экспорт
	
	ЗаполнитьСостояниеEDI(ПараметрыПриСозданииНаСервере);
	
	ТК_ОбменEDIВызовСервера.РазместитьНаФормеКомандыEDI(ПараметрыПриСозданииНаСервере.Форма,ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд,"ТК_ОбменEDI",ПараметрыПриСозданииНаСервере.Направление);
	
КонецПроцедуры

Функция ПараметрыПриСозданииНаСервере_ФормаСписка() Экспорт
	
	ПараметрыПриСоздании = Новый Структура("Форма, МестоРазмещенияКоманд, Направление");
	
	Возврат ПараметрыПриСоздании;
	
КонецФункции

Процедура ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере) Экспорт
	
	ТК_ОбменEDIВызовСервера.РазместитьНаФормеКомандыEDI(ПараметрыПриСозданииНаСервере.Форма,ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд,"ТК_ОбменEDI",ПараметрыПриСозданииНаСервере.Направление);
	
КонецПроцедуры

#КонецОбласти


#Область РаботаFTP

Функция ПолучитьСоединениеFTP(Параметры)
	
	
	Если Параметры.Свойство("ИмяСервераFTP") тогда
		Если (Параметры.ИмяСервераFTP=неопределено) или (СтрДлина(Параметры.ИмяСервераFTP)=0) тогда
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	//Если порт не передали, пробуем стандартный
	Если Параметры.Свойство("ПортFTP") тогда
		Если (Параметры.ПортFTP=неопределено) или (СтрДлина(Параметры.ПортFTP)=0) тогда
			Параметры.ПортFTP = "21";
		КонецЕсли;
	Иначе
		Параметры.Вставить("ПортFTP","21");
	КонецЕсли;
	
	//Если ИмяПользователяFTP не передали, пробуем стандартный
	Если Параметры.Свойство("ИмяПользователяFTP") тогда
		Если (Параметры.ИмяПользователяFTP=неопределено) или (СтрДлина(Параметры.ИмяПользователяFTP)=0) тогда
			Параметры.ИмяПользователяFTP = "anonymous";
		КонецЕсли;
	Иначе
		Параметры.Вставить("ИмяПользователяFTP","anonymous");
	КонецЕсли;
	//Если ИмяПользователяFTP не передали, пробуем стандартный
	Если Параметры.Свойство("ПарольFTP") тогда
		Если (Параметры.ПарольFTP=неопределено) или (СтрДлина(Параметры.ПарольFTP)=0) тогда
			Параметры.ПарольFTP = "anonymous@digma.ua";
		КонецЕсли;
	Иначе
		Параметры.Вставить("ПарольFTP","anonymous@digma.ua");
	КонецЕсли;
	Если Параметры.Свойство("ТекущийКаталогFTP") тогда
		Если (Параметры.ТекущийКаталогFTP=неопределено) или (СтрДлина(Параметры.ТекущийКаталогFTP)=0) тогда
			Параметры.ТекущийКаталогFTP = "/";
		КонецЕсли;
	Иначе
		Параметры.Вставить("ТекущийКаталогFTP","/");
	КонецЕсли;
	Если Параметры.Свойство("МаскаФайлов") тогда
		Если (Параметры.МаскаФайлов=неопределено) или (СтрДлина(Параметры.МаскаФайлов)=0) тогда
			Параметры.МаскаФайлов = "*";
		КонецЕсли;
	Иначе
		Параметры.Вставить("МаскаФайлов","*");
	КонецЕсли;
	
	ПроксиСервер = Неопределено; //ПроксиСервер = Новый ИнтернетПрокси(Истина);
	Если Параметры.Свойство("ИмяПроксиСервера") тогда
		Если (Параметры.ИмяПроксиСервера<>Неопределено) ИЛИ (НЕ СтрДлина(Параметры.ИмяПроксиСервера)=0) тогда
			
			ПроксиСервер = Новый ИнтернетПрокси(Ложь);
			ПроксиСервер.Пользователь = Параметры.ПроксиСерверПользователь;
			ПроксиСервер.Пароль = Параметры.ПроксиСерверПароль;
			ПроксиСервер.Установить("ftp",Параметры.ИмяПроксиСервера,Параметры.ПортПроксиСервера);
			ПроксиСервер.Установить("http",Параметры.ИмяПроксиСервера,Параметры.ПортПроксиСервера);
			//ПроксиСервер.Сервер = Параметры.ИмяПроксиСервера;
			//ПроксиСервер.Порт = Параметры.ПортПроксиСервера;
			ИспользоватьПрокси = Истина;
		КонецЕсли;
	КонецЕсли;
	SSL = Неопределено;
	Если Параметры.Свойство("ИспользоватьSSL") тогда
		Если (Параметры.ИспользоватьSSL=неопределено) или Параметры.ИспользоватьSSL=Ложь тогда
			SSL = Неопределено;
		Иначе
			SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено);
		КонецЕсли;
	Иначе
		SSL = Неопределено;
	КонецЕсли;

	
	Попытка 
		Сервер = Новый FTPСоединение(СокрЛП(Параметры.ИмяСервераFTP), Параметры.ПортFTP, СокрЛП(Параметры.ИмяПользователяFTP), СокрЛП(Параметры.ПарольFTP), ПроксиСервер, Параметры.ПассивныйРежим,60,SSL); //ПроксиСервер
	Исключение 
		Сервер = Неопределено;
	КонецПопытки;

	//Сервер.УстановитьТекущийКаталог(СокрЛП(Параметры.ТекущийКаталогFTP));

	Возврат Сервер;
	
КонецФункции

//Входные параметры:
	// ИмяСервераFTP
	// ПортFTP
	// ИмяПользователяFTP
	// ПарольFTP
	// ИмяПроксиСервера
	// ПортПроксиСервера
	// ПроксиСерверПользователь 
	// ПроксиСерверПароль   
	// ТекущийКаталогFTP
	// КаталогНахожденияФайла
	// ИмяФайлаСообщения
	// Архивировать
	// ИмяВременногоФайла на ftp    Если заполнено то после записи файла создает пустой файл на ftp
	// Удалять файлы после записи
	// защищенный режим
	//ПараметрыПередачи = Новый Структура("ИмяСервераFTP,ПортFTP,ИмяПользователяFTP,ПарольFTP,ИмяПроксиСервера,ПортПроксиСервера,ПроксиСерверПользователь,ПроксиСерверПароль,ТекущийКаталогFTP,КаталогНахожденияФайла,ИмяФайлаСообщения,Архивировать,Удалять");
Функция ПередатьНаFTP(ПараметрыПередачи) Экспорт
	
	Если ПараметрыПередачи.Свойство("ИмяСервераFTP") тогда
		Если (ПараметрыПередачи.ИмяСервераFTP=неопределено) или (СтрДлина(ПараметрыПередачи.ИмяСервераFTP)=0) тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//Если порт не передали, пробуем стандартный
	Если ПараметрыПередачи.Свойство("ПортFTP") тогда
		Если (ПараметрыПередачи.ПортFTP=неопределено) или (СтрДлина(ПараметрыПередачи.ПортFTP)=0) тогда
			ПараметрыПередачи.ПортFTP = "21";
		КонецЕсли;
	Иначе
		ПараметрыПередачи.Вставить("ПортFTP","21");
	КонецЕсли;
	
	//Если ИмяПользователяFTP не передали, пробуем стандартный
	Если ПараметрыПередачи.Свойство("ИмяПользователяFTP") тогда
		Если (ПараметрыПередачи.ИмяПользователяFTP=неопределено) или (СтрДлина(ПараметрыПередачи.ИмяПользователяFTP)=0) тогда
			ПараметрыПередачи.ИмяПользователяFTP = "anonymous";
		КонецЕсли;
	Иначе
		ПараметрыПередачи.Вставить("ИмяПользователяFTP","anonymous");
	КонецЕсли;
	
	
	//Если ИмяПользователяFTP не передали, пробуем стандартный
	Если ПараметрыПередачи.Свойство("ПарольFTP") тогда
		Если (ПараметрыПередачи.ПарольFTP=неопределено) или (СтрДлина(ПараметрыПередачи.ПарольFTP)=0) тогда
			ПараметрыПередачи.ПарольFTP = "anonymous@digma.ua";
		КонецЕсли;
	Иначе
		ПараметрыПередачи.Вставить("ПарольFTP","anonymous@digma.ua");
	КонецЕсли;
	
	ИспользоватьПрокси = Ложь;
	ПроксиСервер = Неопределено; //ПроксиСервер = Новый ИнтернетПрокси(Истина);
	Если ПараметрыПередачи.Свойство("ИмяПроксиСервера") тогда
		Если (НЕ ПараметрыПередачи.ИмяПроксиСервера=неопределено) или (НЕ СтрДлина(ПараметрыПередачи.ИмяПроксиСервера)=0) тогда
			ПроксиСервер = Новый ИнтернетПрокси(Ложь);
			ПроксиСервер.Пользователь =  ПараметрыПередачи.ПроксиСерверПользователь;
			ПроксиСервер.Пароль  =  ПараметрыПередачи.ПроксиСерверПароль;
			ПроксиСервер.Установить("ftp", ПараметрыПередачи.ИмяПроксиСервера,ПараметрыПередачи.ПортПроксиСервера);			
			ПроксиСервер.Установить("http", ПараметрыПередачи.ИмяПроксиСервера,ПараметрыПередачи.ПортПроксиСервера);			
		КонецЕсли;
	КонецЕсли;
		
	Если ПараметрыПередачи.Свойство("ИспользоватьSSL") тогда
		Если (ПараметрыПередачи.ИспользоватьSSL=неопределено) или ПараметрыПередачи.ИспользоватьSSL=Ложь тогда
			ПараметрыПередачи.Вставить("SSL",Неопределено);
		Иначе
			ПараметрыПередачи.Вставить("SSL",Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		КонецЕсли;
	Иначе
		ПараметрыПередачи.Вставить("SSL",Неопределено);
	КонецЕсли;

	ИмяФайлаСообщения = ПараметрыПередачи.ИмяФайлаСообщения;
	
	Если ПараметрыПередачи.Свойство("ИмяФайлаВНРег") И ПараметрыПередачи.ИмяФайлаВНРег = Истина Тогда
		
		 ИмяФайлаСообщения = НРег(ИмяФайлаСообщения);
		 
	КонецЕсли;
	
		
		
	Попытка
		Сервер = Новый FTPСоединение(СокрЛП(ПараметрыПередачи.ИмяСервераFTP), ПараметрыПередачи.ПортFTP, СокрЛП(ПараметрыПередачи.ИмяПользователяFTP), СокрЛП(ПараметрыПередачи.ПарольFTP), ПроксиСервер, ПараметрыПередачи.ПассивныйРежим,60,ПараметрыПередачи.SSL);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 не выгружен!'; uk = 'Документ %1 не вивантажений!'"),
				Строка(ИмяФайлаСообщения+ Символы.ПС+ОписаниеОшибки())));

				ВызватьИсключение;
	КонецПопытки;
	Сервер.УстановитьТекущийКаталог(СокрЛП(ПараметрыПередачи.ТекущийКаталогFTP));
	
	
		
	ЗаписьИзПотока = Ложь;
	
	Если ПараметрыПередачи.Свойство("Данные") Тогда
		ЗаписьИзПотока	= Истина;
		чПоток = ПараметрыПередачи.Данные.ОткрытьПотокДляЧтения();	
		
	КонецЕсли;
	

	Если Не ЗаписьИзПотока Тогда
		ПолныйПутьФайла = ПараметрыПередачи.КаталогНахожденияФайла;
		Если НайтиФайлы(ПолныйПутьФайла).Количество() = 0 тогда
			//файлы не найдены
			Возврат Ложь;
		КонецЕсли;
		
		//для отправки на FTP сервер
		Если ПараметрыПередачи.Свойство("Архивировать") тогда
			Если (ПараметрыПередачи.Архивировать=неопределено) тогда
				ПараметрыПередачи.Архивировать = ложь;
			КонецЕсли;
			Если ПараметрыПередачи.Архивировать тогда
				ИмяФайлаСообщения = ИмяФайлаСообщения+".zip";
				
				ФайлАрхива = Новый ЗаписьZipФайла(ИмяФайлаСообщения, , ,
				МетодСжатияZIP.Сжатие,
				УровеньСжатияZIP.Оптимальный);
				ФайлАрхива.Добавить(ПолныйПутьФайла,
				РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
				РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				ФайлАрхива.Записать();
				ПолныйПутьФайла = ПараметрыПередачи.КаталогНахожденияФайла;
			КонецЕсли;
		КОнецЕсли;
	КонецЕсли;
	
	
	
	Попытка
		Если ЗаписьИзПотока Тогда
			Сервер.Записать(ИмяФайлаСообщения,чПоток);
		Иначе
			Сервер.Записать(ПолныйПутьФайла,ИмяФайлаСообщения);
		КонецЕсли;
	Исключение
		
			тОшибка = ОписаниеОшибки();
			ВызватьИсключение тОшибка;
		//Попытка
		//	Сервер = Новый FTPСоединение(СокрЛП(ПараметрыПередачи.ИмяСервераFTP), ПараметрыПередачи.ПортFTP, СокрЛП(ПараметрыПередачи.ИмяПользователяFTP), СокрЛП(ПараметрыПередачи.ПарольFTP), ПроксиСервер, ПараметрыПередачи.ПассивныйРежим,60,ПараметрыПередачи.SSL);
		//	Сервер.УстановитьТекущийКаталог(СокрЛП(ПараметрыПередачи.ТекущийКаталогFTP));
		//	
		//	Если ЗаписьИзПотока Тогда
		//		Сервер.Записать(ИмяФайлаСообщения,чПоток);
		//	Иначе
		//		Сервер.Записать(ПолныйПутьФайла,ИмяФайлаСообщения);
		//	КонецЕсли;
		//Исключение
		//		ВызватьИсключение ОписаниеОшибки();
		//КонецПопытки;
		
	КонецПопытки;
	
	Если ЗаписьИзПотока = Ложь И ПараметрыПередачи.Удалять тогда
		УдалитьФайлы(ПолныйПутьФайла);
	КонецЕсли;
	
	Сервер = "";
	Возврат Истина; // Если все ОК!!!!
КонецФункции

Функция ПолучитьСписокФайловНаFTP(Сервер,ПараметрыПриема)
	
	ТаблицаДляВозврата = Новый ТаблицаЗначений();
	ТаблицаДляВозврата.Колонки.Добавить("ИмяФайл", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)));
	ТаблицаДляВозврата.Колонки.Добавить("ПолноеИмяФайла", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250,ДопустимаяДлина.Переменная)));

	ТаблицаДляВозврата.Колонки.Добавить("ДатаИВремя",Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ЧислоСтрокДляАнализа = 1024;
	ТаблицаДляВозврата.Колонки.Добавить("ШапкаФайла", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(ЧислоСтрокДляАнализа,ДопустимаяДлина.Переменная))); // Для анализа заголовка
	ТаблицаДляВозврата.Колонки.Добавить("ИмяВременногоФайла", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(512,ДопустимаяДлина.Переменная)));
	ТаблицаДляВозврата.Колонки.Добавить("Удалять");
	
	
	
	МассивФайлов = Сервер.НайтиФайлы(СокрЛП(ПараметрыПриема.ТекущийКаталогFTP),ПараметрыПриема.МаскаФайлов); 

	//МассивФайлов = Сервер.НайтиФайлы(СокрЛП(ПараметрыПриема.ТекущийКаталогFTP),ПараметрыПриема.МаскаФайлов); 
	Для каждого Файла из МассивФайлов Цикл
		Если Файла.ЭтоФайл() тогда
			НоваяСтрока = ТаблицаДляВозврата.Добавить();
			НоваяСтрока.ИмяФайл = Файла.Имя;
			НоваяСтрока.ПолноеИмяФайла = Файла.ПолноеИмя;
			НоваяСтрока.ДатаИВремя = Файла.ПолучитьВремяИзменения();
			ИмяВременогоФайла = ПолучитьИмяВременногоФайла("xml");
			
			Попытка
				Сервер.Получить(Файла.ПолноеИмя,ИмяВременогоФайла); 
			Исключение
				Сервер = ПолучитьСоединениеFTP(ПараметрыПриема);
				Сервер.Получить(Файла.ПолноеИмя,ИмяВременогоФайла);
			КонецПопытки;
			
			Файл = Новый ЧтениеТекста(ИмяВременогоФайла,КодировкаТекста.UTF8);
			НоваяСтрока.ШапкаФайла = Файл.Прочитать(ЧислоСтрокДляАнализа);
			Файл.Закрыть();
			НоваяСтрока.ИмяВременногоФайла = ИмяВременогоФайла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДляВозврата; 
	
КонецФункции


#КонецОбласти

Процедура ДобавитьОшибкуВСтруктуруДокумента(ТекстОшибки,СтруктураДокумента,ОшибкиДокумента,Ошибка = Истина)
	
	Если Ошибка Тогда
		СтруктураДокумента.Вставить("ДокументКорректен",0);
	КонецЕсли;
	ОшибкиДокумента.ДобавитьСтроку(ТекстОшибки);
	
КонецПроцедуры

Функция СтруктураДокументаВерна(СтруктураДокумента)
	Если СтруктураДокумента.ДокументКорректен = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция КонтрагентПоGLN(xmlПоставщикGLN,СтруктураДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТК_ПараметрыОбменаEDI.Контрагент КАК Контрагент,
	               |	ТК_ПараметрыОбменаEDI.ФормироватьЗаказИзПрихода КАК ФормироватьЗаказИзПрихода,
	               |	ТК_ПараметрыОбменаEDI.НеИспользоватьПротоколыЦен КАК НеИспользоватьПротоколыЦен
	               |ИЗ
	               |	РегистрСведений.ТК_ПараметрыОбменаEDI КАК ТК_ПараметрыОбменаEDI
	               |ГДЕ
	               |	ТК_ПараметрыОбменаEDI.УчетнаяЗаписьEDI = &УчетнаяЗаписьEDI
	               |	И ТК_ПараметрыОбменаEDI.GLN = &КонтрагентGLN";
	
	Запрос.УстановитьПараметр("КонтрагентGLN", xmlПоставщикGLN);
	Запрос.УстановитьПараметр("УчетнаяЗаписьEDI", СтруктураДокумента.УчетнаяЗаписьEDI);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиКонтрагента = Новый Структура("ФормироватьЗаказИзПрихода,НеИспользоватьПротоколыЦен");
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(НастройкиКонтрагента,Выборка,"ФормироватьЗаказИзПрихода,НеИспользоватьПротоколыЦен");
	СтруктураДокумента.Вставить("НастройкиКонтрагента",НастройкиКонтрагента);
	Возврат Выборка.Контрагент;
	
КонецФункции

Функция ПолучитьТаблицуТоваров(ТипДокумента)
	
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("НоменклатураНаименование");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("ЕденицаПоКлассификатору");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("Коэффициент",ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ДокументТЧ.Колонки.Добавить("Количество",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("КоличествоБазовое",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("Цена",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("ЦенаБезНалогов",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("СуммаБезНалогов",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("ЦенаСНДС",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("Сумма",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	
	ДокументТЧ.Колонки.Добавить("ПроцентСкидки",ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	ДокументТЧ.Колонки.Добавить("СуммаСкидки",ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	ДокументТЧ.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДокументТЧ.Колонки.Добавить("МРЦ",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
	
	ДокументТЧ.Колонки.Добавить("СуммаВсего",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("PRICE",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("PRICEWITHVAT",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("TAXRATE");
	ДокументТЧ.Колонки.Добавить("СтавкаНДС");
	ДокументТЧ.Колонки.Добавить("СуммаНДС",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ДокументТЧ.Колонки.Добавить("НоменклатураОшибки");
	
	Если ТипДокумента = "ORDRSP" Тогда
		ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
		ДокументТЧ.Колонки.Добавить("КоличествоИмеющееся");
		ДокументТЧ.Колонки.Добавить("Действия");
		ДокументТЧ.Колонки.Добавить("Примечание");
	ИначеЕсли ТипДокумента ="DESADV" Тогда
		ДокументТЧ.Колонки.Добавить("НомерСтрокиДокументаПоставщика");
		ДокументТЧ.Колонки.Добавить("КоличествоВЗаказе");
		ДокументТЧ.Колонки.Добавить("КоличествоРасхождение");
		
		ДокументТЧ.Колонки.Добавить("РасхождениеКоличество",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ДокументТЧ.Колонки.Добавить("ЦенаПоставщика",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ДокументТЧ.Колонки.Добавить("РасхождениеЦена",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ДокументТЧ.Колонки.Добавить("СуммаПФ",ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	
		
		ДокументТЧ.Колонки.Добавить("СтранаПроизводитель");
		ДокументТЧ.Колонки.Добавить("НомерГТД");
	ИначеЕсли ТипДокумента ="ORDER" Тогда
		 ДокументТЧ.Колонки.Добавить("ORDERUNIT");
		 ДокументТЧ.Колонки.Добавить("НоменклатураПоставщика");
	КонецЕсли;
	
	Возврат ДокументТЧ;
	
КонецФункции

Процедура ДозаполнитьТаблицуТоваров(ДокументТЧ, ШтрихКода,ТипДокумента="")
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	 |	ВложенныйЗапрос.Упаковка КАК ЕдиницаИзмерения,
	 |	ВложенныйЗапрос.Коэффициент КАК Коэффициент,
	 |	ВложенныйЗапрос.НоменклатураСтавкаНДС КАК СтавкаНДС,
	 |	ВложенныйЗапрос.НоменклатураСтавкаНДССтавка КАК Ставка,
	 |	ВложенныйЗапрос.Штрихкод КАК Штрихкод,
	 |	ВложенныйЗапрос.ИспХар КАК ИспХар
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	 |		ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	 |		ШтрихкодыНоменклатуры.Упаковка.Коэффициент КАК Коэффициент,
	 |		ШтрихкодыНоменклатуры.Номенклатура.СтавкаНДС КАК НоменклатураСтавкаНДС,
	 |		ШтрихкодыНоменклатуры.Номенклатура.СтавкаНДС.Ставка КАК НоменклатураСтавкаНДССтавка,
	 |		ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	 |		ШтрихкодыНоменклатуры.Номенклатура.ИспользованиеХарактеристик КАК ИспХар
	 |	ИЗ
	 |		РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	 |	ГДЕ
	 |		ШтрихкодыНоменклатуры.Штрихкод В(&СписокШтрихкод)
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		Номенклатура.Ссылка,
	 |		Номенклатура.ОсновнаяЕдиницаИзмерения,
	 |		Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент,
	 |		Номенклатура.СтавкаНДС,
	 |		Номенклатура.СтавкаНДС.Ставка,
	 |		Номенклатура.ОсновнойШтрихКод,
	 |		Номенклатура.ИспользованиеХарактеристик
	 |	ИЗ
	 |		Справочник.Номенклатура КАК Номенклатура
	 |	ГДЕ
	 |		Номенклатура.ОсновнойШтрихКод В(&СписокШтрихкод)) КАК ВложенныйЗапрос" ;
	
	
	Запрос.УстановитьПараметр("СписокШтрихкод", ШтрихКода);
	
	тзТовары = Запрос.Выполнить().Выгрузить();
	СписокАктиулов = Новый СписокЗначений;
	
	
	Для Каждого СтрТовары Из ДокументТЧ Цикл 
		нСтрока =   тзТовары.Найти(СтрТовары.ШтрихКод,"ШтрихКод");
		Если нСтрока <> Неопределено Тогда
			СтрТовары.Номенклатура     = нСтрока.Номенклатура;
			СтрТовары.ЕдиницаИзмерения = нСтрока.ЕдиницаИзмерения;
			СтрТовары.Коэффициент      = нСтрока.Коэффициент;
			СтрТовары.СтавкаНДС        = нСтрока.СтавкаНДС;
			СтрТовары.TAXRATE          = нСтрока.Ставка;
			СтрТовары.ХарактеристикиИспользуются = нСтрока.ИспХар;
			Если нСтрока.ИспХар И  СтрТовары.МРЦ <> 0 Тогда
				СтрТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(нСтрока.Номенклатура,СтрТовары.МРЦ,Истина);
			КонецЕсли;
			
			//Если ТипДокумента <> "ORDER" Тогда
				РасчитатьСтоимостьПоСтроке(СтрТовары,ТипДокумента);
			//КонецЕсли;
			
		ИначеЕсли ТипДокумента ="ORDER" И  ЗначениеЗаполнено(СтрТовары.АртикулПоставщика) Тогда
			 СписокАктиулов.Добавить(СтрТовары.АртикулПоставщика);
		ИначеЕсли ЗначениеЗаполнено(СтрТовары.АртикулПокупателя) Тогда
			СписокАктиулов.Добавить(СтрТовары.АртикулПокупателя);
		Иначе
			СтрТовары.НоменклатураОшибки = "Ошибка поиска номенклатуры по штрих-коду: "+ СтрТовары.ШтрихКод+?(ЗначениеЗаполнено(СтрТовары.НоменклатураНаименование)," Наименование "+СтрТовары.НоменклатураНаименование,"");
		КонецЕсли;
	КонецЦикла;
	
	Если СписокАктиулов.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	сНоменклатура.Артикул КАК Артикул,
		|	сНоменклатура.Ссылка КАК Номенклатура,
		|	сНоменклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	сНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		|	сНоменклатура.СтавкаНДС КАК СтавкаНДС,
		|	сНоменклатура.СтавкаНДС.Ставка КАК Ставка,
		|	сНоменклатура.ИспользованиеХарактеристик КАК ИспХар
		|ИЗ
		|	Справочник.Номенклатура КАК сНоменклатура
		|ГДЕ
		|	сНоменклатура.Артикул В(&Артикул)
		|	И НЕ сНоменклатура.ЭтоГруппа";
		
		Запрос.УстановитьПараметр("Артикул", СписокАктиулов);
		
		тзТовары = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрТовары Из ДокументТЧ Цикл 
			Если ЗначениеЗаполнено(СтрТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если  ТипДокумента ="ORDER" Тогда
				нСтрока =   тзТовары.Найти(СтрТовары.АртикулПоставщика,"Артикул");
			Иначе
				нСтрока =   тзТовары.Найти(СтрТовары.АртикулПокупателя,"Артикул");
			КонецЕсли;
			Если нСтрока<> Неопределено Тогда
				СтрТовары.Номенклатура     = нСтрока.Номенклатура;
				СтрТовары.ЕдиницаИзмерения = нСтрока.ЕдиницаИзмерения;
				СтрТовары.Коэффициент      = нСтрока.Коэффициент;
				СтрТовары.СтавкаНДС        = нСтрока.СтавкаНДС;
				СтрТовары.TAXRATE          = нСтрока.Ставка;
				СтрТовары.ХарактеристикиИспользуются = нСтрока.ИспХар;

				Если нСтрока.ИспХар И СтрТовары.МРЦ <> 0 Тогда
					СтрТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(нСтрока.Номенклатура,СтрТовары.МРЦ,Истина);
				КонецЕсли;

				
				//Если ТипДокумента <> "ORDER" Тогда
					РасчитатьСтоимостьПоСтроке(СтрТовары,ТипДокумента);
				//КонецЕсли;


			Иначе
				СтрТовары.НоменклатураОшибки = "Ошибка поиска номенклатуры по штрих-коду: "+ СтрТовары.ШтрихКод+" и артикулу: "+ СтрТовары.АртикулПокупателя;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруПоставщика(ДокументТЧ,Поставщик)
КонецПроцедуры

Процедура ПроверитьТЧ_ТоварыДокумента(ДокументТЧ,СтруктураДокумента,ОшибкиДокумента)
	
	МассивДляУдаления = Новый Массив;
	
	Для Каждого СтрТовары Из ДокументТЧ Цикл 
		
		Если не ЗначениеЗаполнено(СтрТовары.Номенклатура) Тогда
			МассивДляУдаления.Добавить(СтрТовары);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДляУдаления.Количество() =0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого строкаУдалить Из МассивДляУдаления Цикл 
		ДобавитьОшибкуВСтруктуруДокумента(строкаУдалить.НоменклатураОшибки,СтруктураДокумента,ОшибкиДокумента,Ложь);
		ДокументТЧ.Удалить(строкаУдалить);
	КонецЦикла;
	
	
КонецПроцедуры


Процедура РасчитатьСтоимостьПоСтроке(СтрокаТоваров,ТипДокумента)
	
	TAXRATE = 20;
	Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
		
		Если СтрокаТоваров.TAXRATE = 1000 Тогда
			//СтрокаТоваров.TAXRATE = СтрокаТоваров.Номенклатура.СтавкаНДС.Ставка;
			//TAXRATE = СтрокаТоваров.TAXRATE;
			//Попытка
			//	СтрокаТоваров.СтавкаНДС = СтавкиНДС[Число(СтрокаТоваров.TAXRATE)];
			//Исключение
			//	СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
			//КонецПопытки;
		Иначе
			TAXRATE = СтрокаТоваров.TAXRATE;
		КонецЕсли;
	КонецЕсли;
	
	ЦенаБезНДС  = 0;
	ЦенаСНДС    = 0;
	Коэффициент = ?(СтрокаТоваров.Коэффициент = Неопределено,1,СтрокаТоваров.Коэффициент);
	
	Если СтрокаТоваров.PRICE <> 0 Тогда
		ЦенаБезНДС = СтрокаТоваров.PRICE;
	ИначеЕсли СтрокаТоваров.PRICEWITHVAT <> 0 Тогда
		ЦенаСНДС = СтрокаТоваров.PRICEWITHVAT;
	КонецЕсли;

	
	Если ЦенаБезНДС <> 0 Тогда
		
		Если СтрокаТоваров.Коэффициент = 0  Тогда
			СтрокаТоваров.Цена = ЦенаБезНДС*(1+TAXRATE/100);
		Иначе
			СтрокаТоваров.Цена = ЦенаБезНДС*(1+TAXRATE/100) / Коэффициент;
		КонецЕсли;
		
	ИначеЕсли ЦенаСНДС <> 0 Тогда
		
		Если СтрокаТоваров.Коэффициент = 0  Тогда
			СтрокаТоваров.Цена = ЦенаСНДС;
		Иначе
			СтрокаТоваров.Цена = ЦенаСНДС / Коэффициент;
		КонецЕсли;
	Иначе
		СтрокаТоваров.Цена = 0;
		
	КонецЕсли;
	
	СтрокаТоваров.КоличествоБазовое = СтрокаТоваров.Количество * Коэффициент;
	СтрокаТоваров.СуммаВсего        =  СтрокаТоваров.КоличествоБазовое * СтрокаТоваров.Цена;// * (1+СтрокаТоваров.TAXRATE/100);
	СтрокаТоваров.Сумма             =  СтрокаТоваров.КоличествоБазовое * СтрокаТоваров.Цена;// * (1+СтрокаТоваров.TAXRATE/100);
	
	
	Попытка
		СуммаБезНДС=(100*СтрокаТоваров.СуммаВсего)/(100+TAXRATE);
		СтрокаТоваров.СуммаНДС = Окр(СтрокаТоваров.СуммаВсего-СуммаБезНДС, 6);
	Исключение
	КонецПопытки; 

	СтрокаТоваров.СуммаБезНалогов = СтрокаТоваров.Сумма - СтрокаТоваров.СуммаНДС;
	СтрокаТоваров.ЦенаБезНалогов  = СтрокаТоваров.СуммаБезНалогов / ?(СтрокаТоваров.КоличествоБазовое=0,1,СтрокаТоваров.КоличествоБазовое);
	
КонецПроцедуры

Процедура ПроверитьТаблицуТоваров(СтруктураДокумента,ОшибкиДокумента)
	
	ТоварыДокумента = СтруктураДокумента.ДокументТЧ;
	Если ТоварыДокумента.Количество() = 0 Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Таблица товаров пустая",СтруктураДокумента,ОшибкиДокумента);
	КонецЕсли;
	мСтрокиУдалить = Новый Массив;
	ФормироватьЗаказ =  СтруктураДокумента.Свойство("НастройкиКонтрагента") И СтруктураДокумента.НастройкиКонтрагента.ФормироватьЗаказИзПрихода; 

	
	Для Каждого стТовары Из ТоварыДокумента Цикл 
		Если НЕ ЗначениеЗаполнено(стТовары.Номенклатура) Тогда
			Если ФормироватьЗаказ Тогда
				мСтрокиУдалить.Добавить(стТовары);
				ДобавитьОшибкуВСтруктуруДокумента(стТовары.НоменклатураОшибки,СтруктураДокумента,ОшибкиДокумента,Ложь);
			Иначе
				ДобавитьОшибкуВСтруктуруДокумента(стТовары.НоменклатураОшибки,СтруктураДокумента,ОшибкиДокумента);
			КонецЕсли;
		
		ИначеЕсли стТовары.ХарактеристикиИспользуются И НЕ ЗначениеЗаполнено(стТовары.ХарактеристикаНоменклатуры) Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Не указана характеристика по товару "+Строка(стТовары.Номенклатура),СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если мСтрокиУдалить.Количество()>0 Тогда
		Для Каждого СтрУд Из  мСтрокиУдалить Цикл 
			ТоварыДокумента.Удалить(СтрУд);
		КонецЦикла;
		Если ТоварыДокумента.Количество() = 0 Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Таблица товаров пустая",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры



#Область XML


Процедура РекурсияЧтенияXML(СтрокаДерева, Чтение)
    
    АтрибутыСоответствие = Новый Соответствие();
    Пока Чтение.ПрочитатьАтрибут() Цикл
        АтрибутыСоответствие.Вставить(Чтение.Имя, Чтение.Значение);
    КонецЦикла;
    Если АтрибутыСоответствие.Количество() > 0 Тогда
        СтрокаДерева.Атрибуты = АтрибутыСоответствие;
    Иначе
        АтрибутыСоответствие = 0;
    КонецЕсли;
    Пока Чтение.Прочитать() Цикл
        Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            Прервать;
        ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
            СтрокаДерева.Текст = Чтение.Значение;
        ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            Дочерний         = СтрокаДерева.Строки.Добавить();
            Дочерний.Элемент = Чтение.Имя;
            РекурсияЧтенияXML(Дочерний, Чтение);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Функция ПолучитьУзелДерева(СтрокаДерева, ТипУзла, ИмяПоля)
    
    Если ТипУзла = "Строка" Тогда
        xmlУзел = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
    ИначеЕсли ТипУзла = "Массив" Тогда
        xmlУзел = СтрокаДерева.НайтиСтроки(Новый Структура("Элемент", ИмяПоля), Ложь);
    Иначе
        xmlУзел = Неопределено;
    КонецЕсли;
    
    Возврат xmlУзел;
    
КонецФункции

Функция ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, ИмяПоля, Обязательное)
    
    xmlЗначение = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
    
    Если xmlЗначение = Неопределено Тогда
        
        
        Возврат Неопределено;
        
    Иначе
        
        ТекстовоеЗначение = xmlЗначение.Текст;
        
        Если Не ЗначениеЗаполнено(ТекстовоеЗначение) Тогда
            
            Возврат Неопределено;
            
        Иначе
            
            Возврат ТекстовоеЗначение;
            
        КонецЕсли;
        
    КонецЕсли;
    
КонецФункции


Функция ОбработатьПоле(Имя,СтруктураДокумента,СтрокаДерева,ТипДокумента,ОшибкиДокумента)
	ВсеОк = Истина;	
	
	Если Имя ="NUMBER" ИЛИ Имя ="DespatchAdviceNumber" Тогда
		
		xmlНомерДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерДокумента = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерДокумента", СокрЛП(xmlНомерДокумента));
			Если Имя ="DespatchAdviceNumber" Тогда
				 СтруктураДокумента.Вставить("НомерНакладной", СокрЛП(xmlНомерДокумента));
			КонецЕсли;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""NUMBER / Номер документа",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "DATE" ИЛИ Имя ="DespatchAdviceDate" Тогда
		xmlДатаДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатаДокумента = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаДокумента", Дата(Прав(СокрЛП(xmlДатаДокумента),2)+"."+Сред(СокрЛП(xmlДатаДокумента),6,2)+"."+Лев(СокрЛП(xmlДатаДокумента),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DATE / Дата"" "+xmlДатаДокумента,СтруктураДокумента,ОшибкиДокумента);
			КонецПопытки
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DATE / Дата"" ",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
	ИначеЕсли Имя ="ORDERDATE" ИЛИ Имя ="OrderDate" Тогда
		
		xmlДатаЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатаЗаказа = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаЗаказа", Дата(Прав(СокрЛП(xmlДатаЗаказа),2)+"."+Сред(СокрЛП(xmlДатаЗаказа),6,2)+"."+Лев(СокрЛП(xmlДатаЗаказа),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""ORDERDATE / Дата заказа"" "+xmlДатаЗаказа,СтруктураДокумента,ОшибкиДокумента);
			КонецПопытки;
		//Иначе
		//	ВсеОк = Ложь;
		//	ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""ORDERDATE / Дата заказа"" ",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
	ИначеЕсли Имя = "DELIVERYDATE" ИЛИ Имя ="EstimatedDeliveryDate" Тогда  	// Дата поставки(обязательное поле)
		xmlДатапоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатапоставки = Неопределено Тогда
			Попытка
				тДатаПоставки = Дата(Прав(СокрЛП(xmlДатапоставки),2)+"."+Сред(СокрЛП(xmlДатапоставки),6,2)+"."+Лев(СокрЛП(xmlДатапоставки),4)+" 0:00:00");
				СтруктураДокумента.Вставить("ДатаПоставки", тДатаПоставки);
				Если  Имя ="EstimatedDeliveryDate" Тогда
					СтруктураДокумента.Вставить("ДатаНакладной", тДатаПоставки);
				КонецЕсли;
				
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DELIVERYDATE / Дата поставки"" "+xmlДатапоставки,СтруктураДокумента,ОшибкиДокумента);
				
			КонецПопытки;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYDATE / Дата поставки""",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
	ИначеЕсли Имя = "DELIVERYNOTEDATE"  Тогда  	// Дата поставки(обязательное поле)
		xmlДатапоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатапоставки = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаНакладной", Дата(Прав(СокрЛП(xmlДатапоставки),2)+"."+Сред(СокрЛП(xmlДатапоставки),6,2)+"."+Лев(СокрЛП(xmlДатапоставки),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DELIVERYNOTEDATE / Дата накладной"" "+xmlДатапоставки,СтруктураДокумента,ОшибкиДокумента);
			КонецПопытки;
		Иначе
			ВсеОк = Ложь;
			Если СтруктураДокумента.Свойство("ДатаПоставки") Тогда
				СтруктураДокумента.Вставить("ДатаНакладной",СтруктураДокумента.Датапоставки);
			Иначе
				ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYNOTEDATE / Дата накладной""",СтруктураДокумента,ОшибкиДокумента);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли  Имя = "TIME"  Тогда
		
		xmlВремяСозданияДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlВремяСозданияДокумента = Неопределено Тогда
			СтруктураДокумента.Вставить("ВремяСозданияДокумента", СокрЛП(xmlВремяСозданияДокумента));
		КонецЕсли;
		
	ИначеЕсли Имя = "ORDERNUMBER" ИЛИ Имя = "BuyerOrderNumber" Тогда
		xmlНомерЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерЗаказа = Неопределено Тогда
			
			Если Найти(xmlНомерЗаказа,"_")>0 ИЛИ Найти(xmlНомерЗаказа,":")>0 Тогда
				тxmlНомерЗаказа = СокрЛП(Лев(xmlНомерЗаказа,12));
			Иначе
				тxmlНомерЗаказа = СокрЛП(xmlНомерЗаказа);
			КонецЕсли;
			
			
			СтруктураДокумента.Вставить("НомерЗаказа", тxmlНомерЗаказа);
			
			ДатаЗаказа = Неопределено;
			СтруктураДокумента.Свойство("ДатаЗаказа",ДатаЗаказа);
			
			Если  ДатаЗаказа = Неопределено Тогда
				ДатаЗаказНачало = НачалоДня(СтруктураДокумента.ДатаДокумента)-60*60*24*7;
				ДатаЗаказКонец = КонецДня(СтруктураДокумента.ДатаДокумента);
				
			Иначе
				 ДатаЗаказНачало  = НачалоДня(ДатаЗаказа)-60*60*24*7; 
				 ДатаЗаказКонец   = КонецДня(ДатаЗаказа);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаказПоставщику.Ссылка
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ЗаказПоставщику.Номер = &Номер";
			
			Запрос.УстановитьПараметр("КонецПериода", ДатаЗаказКонец);
			Запрос.УстановитьПараметр("НачалоПериода", ДатаЗаказНачало);
			Запрос.УстановитьПараметр("Номер", тxmlНомерЗаказа);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				//ВсеОк = Ложь;
				//ДобавитьОшибкуВСтруктуруДокумента("Не найден заказ поставщику по номеру: "+СокрЛП(xmlНомерЗаказа)+Символы.ПС+"Дата заказа: "+ДатаЗаказа,СтруктураДокумента,ОшибкиДокумента);
			Иначе
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВыборкаДетальныеЗаписи.Следующий();	
				СтруктураДокумента.Вставить("ЗаказПоставщику", ВыборкаДетальныеЗаписи.Ссылка);
			КонецЕсли;
			
			
		ИначеЕсли СтруктураДокумента.Свойство("НастройкиКонтрагента") И СтруктураДокумента.НастройкиКонтрагента.ФормироватьЗаказИзПрихода Тогда
			
			СтруктураДокумента.Вставить("ЗаказПоставщику", Документы.ЗаказПоставщику.ПустаяСсылка());
		Иначе
			
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""ORDERNUMBER / Номер заказа""",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "DELIVERYNOTENUMBER" Тогда  // Номер накладной(обязательное поле)
		
		xmlНомерНакладной = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерНакладной = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерНакладной", СокрЛП(xmlНомерНакладной));
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYNOTENUMBER / Номер накладной""",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "CURRENCY"  Тогда //Валюта  (опциональное поле)
		
		//xmlВалюта = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
			//	
			СтруктураДокумента.Вставить("Валюта",  ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		//КонецЕсли;
		
	ИначеЕсли Имя = "VAT" Тогда		// Ставка НДС(%)(опциональное поле)
		
		xmlСтавкаНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlСтавкаНДС = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("СтавкаНДС", Число(xmlСтавкаНДС));
			Исключение
				СтруктураДокумента.Вставить("СтавкаНДС", 20);
			КонецПопытки;       
		КонецЕсли;
	ИначеЕсли Имя = "BUYER" ИЛИ  Имя ="Buyer" Тогда 	// Поставщик(организация)(обязательное поле)

		Если Имя ="Buyer" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlОрганизацияGLN = Неопределено;
			Иначе
				
			xmlОрганизацияGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
			
		Иначе
			xmlОрганизацияGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		КонецЕсли;
		
		текОрганизация = Неопределено;
		
		Если НЕ xmlОрганизацияGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("BUYER", xmlОрганизацияGLN);
			Если ТипДокумента = "ORDER" Тогда
				текКонтрагент =	КонтрагентПоGLN(xmlОрганизацияGLN,СтруктураДокумента);
				Если текКонтрагент <> Неопределено Тогда
					СтруктураДокумента.Вставить("Контрагент", текКонтрагент);

				Иначе
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найдена покупатель с GLN " + xmlОрганизацияGLN,СтруктураДокумента,ОшибкиДокумента);
				КонецЕсли;
				
			Иначе
				текОрганизация = Справочники.Организации.ПолучитьОрганизациюПоGLN(xmlОрганизацияGLN);
				Если текОрганизация  <> Неопределено   Тогда
					СтруктураДокумента.Вставить("Организация", текОрганизация);
					СтруктураДокумента.Вставить("ОрганизацияКонтрагент", текОрганизация.Контрагент);
				//Иначе
				//	ВсеОк = Ложь;
				//	ДобавитьОшибкуВСтруктуруДокумента("Не найдена организация с GLN " + xmlОрганизацияGLN,СтруктураДокумента,ОшибкиДокумента);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""BUYER / Покупатель""",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;

	ИначеЕсли Имя ="SUPPLIER" ИЛИ Имя = "Seller" Тогда   // Покупатель(контрагент)(обязательное поле)
		
		Если Имя ="Seller" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlПоставщикGLN = Неопределено;
			Иначе
				xmlПоставщикGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlПоставщикGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		КонецЕсли;
		
		Если НЕ xmlПоставщикGLN = Неопределено Тогда
			Если ТипДокумента = "ORDER" Тогда
				текОрганизация = Справочники.Организации.ПолучитьОрганизациюПоGLN(xmlПоставщикGLN);
				Если текОрганизация  <> Неопределено   Тогда
					СтруктураДокумента.Вставить("Организация", текОрганизация);
					СтруктураДокумента.Вставить("ОрганизацияКонтрагент", текОрганизация.Контрагент);

				Иначе
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найдена организация с GLN " + xmlПоставщикGLN,СтруктураДокумента,ОшибкиДокумента);
				КонецЕсли;
			Иначе
				
				
				КонтрагентСсылка  = КонтрагентПоGLN(xmlПоставщикGLN,СтруктураДокумента);
				Если КонтрагентСсылка = Неопределено Тогда
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найден поставщик с GLN " + xmlПоставщикGLN,СтруктураДокумента,ОшибкиДокумента);
				Иначе		
					СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
				КонецЕсли;
			КонецЕсли;
		СтруктураДокумента.Вставить("SUPPLIER", xmlПоставщикGLN);	
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""SUPPLIER / Контрагент""",СтруктураДокумента,ОшибкиДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя ="DELIVERYPLACE" ИЛИ Имя = "DeliveryPoint" Тогда   // Место доставки
		
		
		Если Имя ="DeliveryPoint" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlАдресДоставкиGLN = Неопределено;
			Иначе
				xmlАдресДоставкиGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlАдресДоставкиGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		КонецЕсли;
		
		Если ТипДокумента = "ORDER" Тогда
			текПокупатель = Неопределено; 
			СтруктураДокумента.Свойство("Контрагент",текПокупатель);
		
			Если xmlАдресДоставкиGLN <> Неопределено Тогда
				
				Если текПокупатель <> Неопределено Тогда
					текАдресДоставки = Справочники.ТочкиДоставки.НайтиАдресДоставкиПоGLN(текПокупатель,xmlАдресДоставкиGLN);
					Если текАдресДоставки <> Неопределено Тогда 
						СтруктураДокумента.Вставить("АдресДоставки", текАдресДоставки);
					Иначе
						ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для контрагента: " + Строка(текПокупатель),СтруктураДокумента,ОшибкиДокумента);
					КонецЕсли;
				Иначе
					ВсеОк = Ложь;
				КонецЕсли;
				
			Иначе
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки""",СтруктураДокумента,ОшибкиДокумента);
			КонецЕсли;
			
		Иначе
			
			Если xmlАдресДоставкиGLN = Неопределено  Тогда
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки, не определен.",СтруктураДокумента,ОшибкиДокумента);
			Иначе
				 СтруктураДокумента.Вставить("АдресДоставкиGLN", xmlАдресДоставкиGLN);
				 
					 ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоGLN(xmlАдресДоставкиGLN);
					 Если ТорговаяПлощадка = Неопределено Тогда
						ТорговаяПлощадка = Справочники.СкладыКомпании.НайтиТорговуюПлощадкуСкладаПоGLN(xmlАдресДоставкиGLN);
					 КонецЕсли;
					 Если ТорговаяПлощадка = Неопределено Тогда
						 ВсеОк = Ложь;
						 ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN,СтруктураДокумента,ОшибкиДокумента);
					 Иначе
						 СтруктураДокумента.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
						 СкладСсылка = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадкиGLN(ТорговаяПлощадка,xmlАдресДоставкиGLN);
						 СтруктураДокумента.Вставить("СкладКомпании", СкладСсылка);
						 СтруктураДокумента.Вставить("ПодразделениеКомпании", ТорговаяПлощадка.ПодразделениеКомпании);
						 
						 Если НЕ СтруктураДокумента.Свойство("Организация") Тогда 
							 текОрганизация =  Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(ТорговаяПлощадка, СтруктураДокумента.ДатаДокумента);
							 Если ЗначениеЗаполнено(текОрганизация) Тогда
								 СтруктураДокумента.Вставить("Организация", текОрганизация);
								 СтруктураДокумента.Вставить("ОрганизацияКонтрагент", текОрганизация.Контрагент);
							 Иначе
								 ВсеОк = Ложь;
								 ДобавитьОшибкуВСтруктуруДокумента("Не найдена организация с GLN " + СтруктураДокумента.BUYER,СтруктураДокумента,ОшибкиДокумента);
							 КонецЕсли;
						 КонецЕсли;
					 КонецЕсли;
			КонецЕсли;
			
		//	текЗаказ = Неопределено;
		//	СтруктураДокумента.Свойство("ЗаказПоставщику",текЗаказ);
		//	
		//	Если  xmlАдресДоставкиGLN = Неопределено  Тогда
		//		
		//		Если текЗаказ <> Неопределено  Тогда
		//			АдресДоставкиСсылка = текЗаказ.СкладКомпании.ТочкаДоставки;
		//			Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//				СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//				СтруктураДокумента.Вставить("СкладКомпании", текЗаказ.СкладКомпании);
		//			Иначе
		//				ВсеОк = Ложь;
		//				ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки, не определен адрес доставки по заказу: " + Строка(текЗаказ),СтруктураДокумента,ОшибкиДокумента);
		//			КонецЕсли;
		//		Иначе
		//			ВсеОк = Ложь;
		//			ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки""",СтруктураДокумента,ОшибкиДокумента);
		//		КонецЕсли
		//	Иначе
		//		Если текЗаказ <> Неопределено  Тогда
		//			Если текЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПоставщикуКонсолидированный Тогда
		//				текОрганизация = Неопределено;
		//				СтруктураДокумента.Свойство("Организация",текОрганизация);
		//				
		//				Если текОрганизация <> Неопределено Тогда
		//					КонтрагентОрганизации   = текОрганизация.Контрагент;
		//					
		//					АдресДоставкиСсылка = Справочники.ТочкиДоставки.НайтиАдресДоставкиПоGLN(КонтрагентОрганизации, xmlАдресДоставкиGLN);
		//					
		//					Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//						СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//						СкладДоставки = ПолучитьСкладДоставки(АдресДоставкиСсылка,текОрганизация);
		//						СтруктураДокумента.Вставить("СкладКомпании",СкладДоставки);
		//					Иначе
		//						ВсеОк = Ложь;
		//						ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для организации: " + Строка(текОрганизация),СтруктураДокумента,ОшибкиДокумента);
		//					КонецЕсли;
		//				КонецЕсли;
		//			Иначе
		//				АдресДоставкиСсылка = текЗаказ.СкладКомпании.ТочкаДоставки;
		//				Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//					СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//					СтруктураДокумента.Вставить("СкладКомпании", текЗаказ.СкладКомпании);
		//				Иначе
		//					ВсеОк = Ложь;
		//					ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки, не определен адрес доставки по заказу: " + Строка(текЗаказ),СтруктураДокумента,ОшибкиДокумента);
		//				КонецЕсли;
		//				
		//			КонецЕсли
		//		Иначе
		//			текОрганизация = Неопределено;
		//			СтруктураДокумента.Свойство("Организация",текОрганизация);
		//			
		//			Если текОрганизация <> Неопределено Тогда
		//				КонтрагентОрганизации   = текОрганизация.Контрагент;
		//				
		//				АдресДоставкиСсылка = Справочники.ТочкиДоставки.НайтиАдресДоставкиПоGLN(КонтрагентОрганизации, xmlАдресДоставкиGLN);
		//				
		//				Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//					СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//				Иначе
		//					ВсеОк = Ложь;
		//					ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для организации: " + Строка(текОрганизация),СтруктураДокумента,ОшибкиДокумента);
		//				КонецЕсли;
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		КонецЕсли;
	ИначеЕсли Имя = "SENDER" Тогда //отправителя (обязательное поле)
		
		xmlОтправительGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlОтправительGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("Отправитель", xmlОтправительGLN);
		КонецЕсли;
		
	ИначеЕсли Имя = "RECIPIENT" ИЛИ Имя = "UltimateConsignee" Тогда   //Получатель(обязательное поле)
		
		Если Имя ="UltimateConsignee" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlПолучательGLN = Неопределено;
			Иначе
				xmlПолучательGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlПолучательGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева,Имя, Истина);
		КонецЕсли;
		
		Если НЕ xmlПолучательGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("Получатель", xmlПолучательGLN);
			
			Если ТипДокумента = "ORDER" Тогда
				// //Это все переделать""!!!
				//Если СтруктураДокумента.BUYER = "9864232359616" ИЛИ  СтруктураДокумента.BUYER ="9863521022934" Тогда
				//	 //Харьков

				//	 СкладСсылка = Справочники.СкладыКомпании.НайтиПоКоду("AC000021");
				//	 ТорговаяПлощадка = СкладСсылка.ТорговаяПлощадка;
				//	 Подразделение = ТорговаяПлощадка.ПодразделениеКомпании;

				// Иначе
				//	//Сумы
				//	 СкладСсылка = Справочники.СкладыКомпании.НайтиПоКоду("AC000024");
				//	 ТорговаяПлощадка = СкладСсылка.ТорговаяПлощадка;
				//	 Подразделение = ТорговаяПлощадка.ПодразделениеКомпании;
				//КонецЕсли;
				
				//СтруктураДокумента.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
				//СтруктураДокумента.Вставить("СкладКомпании", СкладСсылка);
				//СтруктураДокумента.Вставить("ПодразделениеКомпании", Подразделение);
				
				Если СтруктураДокумента.Отправитель = "9864066862047"
					ИЛИ СтруктураДокумента.Отправитель = "9864232359616" Тогда
					xmlПолучательGLN = "9864232369271";
				ИначеЕсли СтруктураДокумента.Отправитель = "9864232478041" Тогда
					xmlПолучательGLN ="9864232378839";
				ИначеЕсли СтруктураДокумента.SUPPLIER = "9864232725169" Тогда   //Получать организация фабрика сыра
					xmlПолучательGLN ="9864232725176";
				КонецЕсли;
				ТорговаяПлощадка = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоGLN(xmlПолучательGLN);
				Если ТорговаяПлощадка = Неопределено Тогда
					
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес отгрузки с GLN " + xmlПолучательGLN,СтруктураДокумента,ОшибкиДокумента);
					
				Иначе
					СтруктураДокумента.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
					СкладСсылка = Справочники.СкладыКомпании.ОсновнойСкладТорговойПлощадкиGLN(ТорговаяПлощадка,xmlПолучательGLN);
					Если СкладСсылка =  Справочники.СкладыКомпании.ПустаяСсылка() Тогда
						ВсеОк = Ложь;
						ДобавитьОшибкуВСтруктуруДокумента("Не найден склад отгрузки с GLN " + xmlПолучательGLN,СтруктураДокумента,ОшибкиДокумента);
					КонецЕсли;
					СтруктураДокумента.Вставить("СкладКомпании", СкладСсылка);
					СтруктураДокумента.Вставить("ПодразделениеКомпании", ТорговаяПлощадка.ПодразделениеКомпании);
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли  Имя = "EDIINTERCHANGEID" Тогда	// Номер транзакции
		
		xmlEDIINTERCHANGEID = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlEDIINTERCHANGEID = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерТранзакции", xmlEDIINTERCHANGEID);
		КонецЕсли;
	ИначеЕсли  Имя = "ACTION" Тогда	
		
		xmlACTION = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlEDIINTERCHANGEID = Неопределено Тогда
			СтруктураДокумента.Вставить("Действия", xmlEDIINTERCHANGEID);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

Функция ОбработатьПолеТабличнойЧасти(Имя,Строка,СтрокаДерева,ТипДокумента)
	ВсеОк = Истина;	
	
	Если Имя = "POSITIONNUMBER" ИЛИ Имя = "LineNumber" Тогда  //Номер строки
		
		xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
			Попытка
				Строка.НомерСтрокиТЧ = Число(xmlНомерСтрокиТЧ);
				Если ТипДокумента = "DESADV" Тогда
					Строка.НомерСтрокиДокументаПоставщика = Строка.НомерСтрокиТЧ;	
				КонецЕсли;
			Исключение
				Строка.НомерСтрокиТЧ = 0;
				Если ТипДокумента = "DESADV" Тогда
					Строка.НомерСтрокиДокументаПоставщика = 0;	
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли Имя = "ORDERUNIT"	Тогда
		xmlORDERUNITСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlORDERUNITСтрока = Неопределено Тогда
			Строка.ORDERUNIT = СокрЛП(xmlORDERUNITСтрока);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCT" ИЛИ Имя = "EAN" Тогда   // Штрих - код номенклатуры
		
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено Тогда
			Строка.ШтрихКод = СокрЛП(xmlШтрихКодНоменклатуры);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTIDSUPPLIER" Тогда   // Артикул поставщика(опциональное поле)
		
		xmlАртикулПоставщикаСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlАртикулПоставщикаСтрока = Неопределено Тогда
			Строка.АртикулПоставщика = СокрЛП(xmlАртикулПоставщикаСтрока);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTIDBUYER" ИЛИ Имя = "BuyerItemCode" Тогда   // Артикул покупателя(опциональное поле)
		
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			
			Если СтрДлина(xmlАртикулПокупателяСтрока) = 13 И Лев(xmlАртикулПокупателяСтрока,2) = "20" Тогда
				Строка.АртикулПокупателя = Сред(xmlАртикулПокупателяСтрока,3,6);
			Иначе
				Строка.АртикулПокупателя = xmlАртикулПокупателяСтрока;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "ORDRSPUNIT" ИЛИ Имя ="UnitOfMeasure"  Тогда    //Еденица измерения (опциональное поле)
		
		xmlЕденица = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlЕденица = Неопределено Тогда
			Строка.ЕденицаПоКлассификатору = xmlЕденица;
		КонецЕсли;
		
	ИначеЕсли Имя ="DELIVEREDUNIT" Тогда // Еденица по классификатору(опциональное поле)
		
		xmlЕденица = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlЕденица = Неопределено Тогда
			Строка.ЕденицаПоКлассификатору = xmlЕденица;
		КонецЕсли;
	ИначеЕсли Имя = "DELIVEREDQUANTITY" ИЛИ Имя = "QuantityDespatched" Тогда // Поставляемое количество(обязательное поле)
		
		xmlКоличествоПоставляемое = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlКоличествоПоставляемое = Неопределено Тогда
			Попытка
				Строка.Количество = Число(xmlКоличествоПоставляемое);
				Строка.КоличествоБазовое = Строка.Количество;
			Исключение
				Строка.Количество = 0;
				Строка.КоличествоБазовое = 0;
				ВсеОк = Ложь;
			КонецПопытки;
		Иначе
			Строка.Количество = 0;
			Строка.КоличествоБазовое = 0;
			//Если СтрокаДерева.Найти("DELIVEREDQUANTITY", "Элемент", Ложь)  = Неопределено Тогда
			//КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "DESCRIPTION" ИЛИ Имя = "ItemDescription" Тогда	  //Описание товара(опциональное поле)
		xmlОписание = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlОписание = Неопределено Тогда
			Строка.НоменклатураНаименование = xmlОписание;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRICE"  Тогда        //Цена товара(опциональное поле)
		xmlЦена = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlЦена = Неопределено Тогда
			Попытка 
				Строка.PRICE = Число(xmlЦена);
			Исключение
				Строка.PRICE = 0;
			КонецПопытки;
		Иначе
			Строка.PRICE = 0;
		КонецЕсли;
	ИначеЕсли Имя = "ADVICEPRICE" Тогда // Значение МРЦ
		xmlМРЦ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);

		Если НЕ xmlМРЦ = Неопределено Тогда
			Попытка 
				Строка.МРЦ = Число(xmlМРЦ);
			Исключение
				Строка.МРЦ = 0;
			КонецПопытки;
		Иначе
			Строка.МРЦ = 0;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRICEWITHVAT" ИЛИ Имя = "UnitGrossPrice" Тогда   //Цена товара с НДС (опциональное поле)
		
		xmlЦенаСНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlЦенаСНДС = Неопределено Тогда
			Попытка 
				Строка.PRICEWITHVAT = Число(xmlЦенаСНДС);
				Строка.ЦенаСНДС = Число(xmlЦенаСНДС);
			Исключение
				Строка.PRICEWITHVAT = 0;
				Строка.ЦенаСНДС = 0;
			КонецПопытки;
			
		Иначе
			Строка.PRICEWITHVAT =0;
		КонецЕсли;

	ИначеЕсли Имя = "VAT" Тогда            //Ставка НДС  (опциональное поле)
		
		xmlНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlНДС = Неопределено Тогда
			Строка.TAXRATE = xmlНДС;
			Попытка 
				Строка.TAXRATE = Число(xmlНДС);
			Исключение
				Строка.TAXRATE = 1000;
			КонецПопытки;
		Иначе 
			Строка.TAXRATE = 1000;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTTYPE" Тогда        //Статусы   1 — товар будет поставлен без изменений, 2 — изменение заказанного количества, 3 — отказано в поставке   
			
		xmlДействия = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlДействия = Неопределено Тогда
			Строка.Действия = xmlДействия;
		КонецЕсли;

	ИначеЕсли Имя = "ORDEREDQUANTITY" ИЛИ Имя = "QuantityOrdered" Тогда    // Заказанное количество
		
		xmlКоличествоЗаказанное = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		ПолеТаблицы = "КоличествоВЗаказе";
		Если ТипДокумента = "ORDRSP" Тогда
			ПолеТаблицы = "КоличествоЗаказанное";
		ИначеЕсли ТипДокумента = "ORDER" Тогда
			ПолеТаблицы = "Количество";
		КонецЕсли;
		
		Если НЕ xmlКоличествоЗаказанное = Неопределено Тогда
			Попытка
				Строка[ПолеТаблицы] = Число(xmlКоличествоЗаказанное);
			Исключение
				Строка[ПолеТаблицы] = 0;
			КонецПопытки;
		Иначе
			Строка[ПолеТаблицы] = 0;
		КонецЕсли;
		
	ИначеЕсли Имя = "ACCEPTEDQUANTITY" Тогда   //Имеющееся количество
		
		xmlКоличествоИмеющееся = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlКоличествоИмеющееся = Неопределено Тогда
			Попытка
				Строка.КоличествоИмеющееся = Число(xmlКоличествоИмеющееся);
				Строка.Количество = Строка.КоличествоИмеющееся;
			Исключение
				Строка.КоличествоИмеющееся = 0;
			КонецПопытки
		КонецЕсли;
		
	ИначеЕсли Имя = "COUNTRYORIGIN" Тогда  // Страна производитель(опциональное поле)
		
		xmlСтранаПроизводитель = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "COUNTRYORIGIN", Ложь);
		Если НЕ xmlСтранаПроизводитель = Неопределено Тогда
			Строка.СтранаПроизводитель = СокрЛП(xmlСтранаПроизводитель);
		КонецЕсли;
		
	ИначеЕсли Имя = "CUSTOMSTARIFFNUMBER" Тогда  // Номер ГТД (опциональное поле)
		
		xmlНомерГТД = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "CUSTOMSTARIFFNUMBER", Ложь);
		Если НЕ xmlНомерГТД = Неопределено Тогда
			Строка.НомерГТД = СокрЛП(xmlНомерГТД);
		КонецЕсли;
		
	ИначеЕсли Имя = "INFO" Тогда
		
		xmlПримечание = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlПримечание = Неопределено Тогда
			Строка.Примечание = xmlПримечание;
		КонецЕсли;

	ИначеЕсли Имя = "CONDITIONSTATUS" Тогда   //Статус кондиции
		
	ИначеЕсли Имя = "PACKAGEID" Тогда         //Идентификатор упаковки 
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

#КонецОбласти


#Область ПрограммныйИнтерфейс


Функция РабочийКаталог() Экспорт
	
	ИмяКаталога = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
	СоздатьКаталог(ИмяКаталога);
	Возврат ИмяКаталога;
	
КонецФункции


Функция СтруктураЭлектронногоДокумента(СсылкаНаОбъект,НастройкиОбмена)
	Структура = Новый Структура;
	Структура.Вставить("Владелец",                СсылкаНаОбъект);
	Структура.Вставить("Направление",           Перечисления.ТК_НаправлениеEDI.Исходящий);
	Структура.Вставить("ДатаЭД",                  ТекущаяДатаСеанса());
	Структура.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	Структура.Вставить("Отправитель",             НастройкиОбмена.Организация);
	Структура.Вставить("Получатель",              НастройкиОбмена.Контрагент);
	Структура.Вставить("УчетнаяЗаписьEDI",        НастройкиОбмена.УчетнаяЗаписьEDI);
	Структура.Вставить("ПровайдерEDI",        НастройкиОбмена.УчетнаяЗаписьEDI.ПоставщикEDI);

	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(СсылкаНаОбъект);
	Структура.Вставить("ДокументыОснования",      ДокументыОснования);
	

	Возврат Структура;
КонецФункции


Функция ОтправитьСообщениеFTP(ДокументОтправки)
	Отказ = Ложь;
	тдОщибки = Новый ТекстовыйДокумент;
	
	ТипЗначенияДокумента = ТипЗнч(ДокументОтправки);
	Если ТипЗначенияДокумента = Тип("ДокументСсылка.ТК_СообщениеEDIИсходящие") тогда
		ДокументОбъект = ДокументОтправки.Получитьобъект();
	ИначеЕсли ТипЗначенияДокумента = Тип("ДокументОбъект.ТК_СообщениеEDIИсходящие") тогда
		ДокументОбъект =  ДокументОтправки;
	Иначе
		Отказ = Истина;
		тдОщибки.ДобавитьСтроку("Неверный тип входящего параметра!");
	КонецЕсли;
	
	Если ДокументОтправки.ПометкаУдаления Тогда
		тдОщибки.ДобавитьСтроку("Нельзя отправлять помеченный на удаление документ");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Новый Структура("СообщениеОтправлено,Ошибки",Ложь,тдОщибки);
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.ТК_СообщениеEDIИсходящие");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументОтправки);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

	ДокументОбъект.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.Отправлен; 
	НоваяСтрокаСтатуса = ДокументОбъект.СтатусыСообщения.Добавить();
	НоваяСтрокаСтатуса.Период = ТекущаяДатаСеанса();
	НоваяСтрокаСтатуса.Пользователь = Пользователи.ТекущийПользователь();
	НоваяСтрокаСтатуса.Статус = Перечисления.СтатусыДокументовEDI.Отправлен;
	
	//Если ДокументОтправки.
		
	//	УстановитьСсылкуДляВладельцаВРегистреСостояний(ДокументОтправки.ДокументОснование,ДокументОтправки
	
	Попытка
		ДокументОбъект.Записать();
		Если НЕ (ДокументОбъект.ВидСообщения = Перечисления.ВидыСообщенийEDI.ORDER ИЛИ  ДокументОбъект.ВидСообщения = Перечисления.ВидыСообщенийEDI.INVRPT) Тогда
			УстановитьСсылкуДляВладельцаВРегистреСостояний(ДокументОтправки.ДокументОснование,ДокументОтправки);
		КонецЕсли;
		
		
	Исключение
		Отказ = Истина;
		тдОщибки.ДобавитьСтроку(ОписаниеОшибки());
	КонецПопытки;
	
	//Если не Отказ Тогда
		имяФайлаFTP = ДокументОбъект.ИмяФайлаСообщения;
		//	ИмяВремФайла = ПолучитьИмяВременногоФайла();
		//Попытка
		ДВ_Данные = ДокументОбъект.ФайлСообщения.Получить();
		//	ДВ_Данные.Записать(ИмяВремФайла);	
		//	Исключение
		//		Отказ = Истина;
		//		текстОшибки = "Файл сообщения в документе " + ДокументОтправки + " поврежден или отсутствует! " + Символы.ПС + ОписаниеОшибки();
		//		тдОщибки.ДобавитьСтроку(текстОшибки);
		//	КонецПопытки;
	//КонецЕсли;
	
	Если Не Отказ тогда
		ПараметрыПодключения = Справочники.ТК_УчетныеЗаписиEDI.ПолучитьПараметрыПодключения(ДокументОбъект.УчетнаяЗаписьEDI);
		Если ПараметрыПодключения = Неопределено Тогда 
			Отказ = Истина;
			текстОшибки = "Не удалось получить параметры подключения к FTP-серверу!";
			тдОщибки.ДобавитьСтроку(текстОшибки);
		Иначе
			
			Если ПустаяСтрока(ПараметрыПодключения.ТекущийКаталогFTP) Тогда
				ПараметрыПодключения.ТекущийКаталогFTP = ТК_ОбменEDI_ПовтИсп.КаталогВыгрузкиFTP(ПараметрыПодключения.ПоставщикEDI,ДокументОтправки.ПодразделениеКомпании);
			КонецЕсли;
			//ПараметрыПодключения.КаталогНахожденияФайла = ИмяВремФайла;
			ПараметрыПодключения.ИмяФайлаСообщения = имяФайлаFTP;
			ПараметрыПодключения.Удалять = Истина;
			ПараметрыПодключения.Вставить("Данные",ДВ_Данные);
			
			Попытка
				Отказ = НЕ ПередатьНаFTP(ПараметрыПодключения);
			Исключение
				Отказ = Истина;
				тдОщибки.ДобавитьСтроку(ОписаниеОшибки());
			КонецПопытки;
			
			Если Отказ тогда
				текстОшибки = "Не удалось отправить на FTP-сервер!";
				тдОщибки.ДобавитьСтроку(текстОшибки);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	
	
	Если Не Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе 
		ОтменитьТранзакцию();
	КонецЕсли;
	
	результат = Новый Структура("СообщениеОтправлено, Ошибки",Не Отказ, тдОщибки);
	
	Возврат результат;
	
	
КонецФункции

Функция ЗагрузитьСообщениеFTP(ДокументFTP,ПараметрыFTP) 
	Отказ = Ложь;
	тдОщибки = Новый ТекстовыйДокумент;
	
	ДокВоходящее = Документы.ТК_СообщениеEDIВходящее.СоздатьДокумент();
	ДокВоходящее.Дата = ТекущаяДатаСеанса();
	ДокВоходящее.Провайдер = ПараметрыFTP.Параметры.ПоставщикEDI;
	ДокВоходящее.ИмяФайлаСообщения = ДокументFTP.ИмяФайл;
	ДокВоходящее.УчетнаяЗаписьEDI = ПараметрыFTP.Учетка; 
	Файл = Новый Файл(ДокументFTP.ИмяВременногоФайла);
	Если НЕ Файл.Существует() Тогда
		тдОщибки.ДобавитьСтроку("Не удалось получить Файл "+ДокументFTP.ИмяФайл);
		Возврат  Новый Структура("СообщениеЗагружено, Ошибки",Не Отказ, тдОщибки);
	КонецЕсли;
	
	ДанныеФайла = Новый ДвоичныеДанные (ДокументFTP.ИмяВременногоФайла);
	ДокВоходящее.ФайлСообщения = Новый ХранилищеЗначения (ДанныеФайла);
	
	ВидСообщения = ПолучитьВидСообщенияДокумента(ДокументFTP.ШапкаФайла);

	Если ВидСообщения = Неопределено Тогда
		тдОщибки.ДобавитьСтроку("Не удалось определить вид документа "+ДокументFTP.ИмяФайл);
		тдОщибки.ДобавитьСтроку("Первые строки документа для анализа!" + Символы.ПС + ДокументFTP.ШапкаФайла);
		Возврат  Новый Структура("СообщениеЗагружено, Ошибки",Не Отказ, тдОщибки);
	КонецЕсли;
	ДокВоходящее.ВидСообщения = ВидСообщения;
	
	Попытка
		ДокВоходящее.Записать();
	Исключение
		тдОщибки.ДобавитьСтроку("Не удалось записать Входящее сообщение EDI "+Символы.ПС + ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
	
	результат = Новый Структура("СообщениеЗагружено, Ошибки",Не Отказ, тдОщибки);
	
	Возврат результат;

	
КонецФункции

Функция ОбработатьВходящийДокументEDI(ДокументСсылка,ОтключитьПроверку)
	
	Отказ = Ложь;
	тдОщибки = Новый ТекстовыйДокумент;

	Если ДокументСсылка.Обработан И НЕ ОтключитьПроверку Тогда
		
		Возврат Новый Структура("ДокументОбработан, Ошибки", Истина, тдОщибки);
	КонецЕсли;
	
	ДокументОбъект   = ДокументСсылка.ПолучитьОбъект();

	Попытка
		ДокументОбъект.Заблокировать()
	Исключение
		тдОщибки.ДобавитьСтроку("Не удалось заблокировать документ для изменения: "+ Строка(ДокументСсылка));
		Возврат Новый Структура("ДокументОбработан, Ошибки", Ложь, тдОщибки);
	КонецПопытки;
	
	
	
	ВидСообщения   = ДокументСсылка.ВидСообщения;
	ДвоичныеДанные = ДокументСсылка.ФайлСообщения.Получить();
	Провайдер 	   = ДокументСсылка.Провайдер;
	
	ИмяФайлаСообщения = ДокументСсылка.ИмяФайлаСообщения;

	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml"); 
	
	Файл = Новый Файл (ИмяФайла);
	ПолноеИмяФайла = Файл.ПолноеИмя;
	ДвоичныеДанные.Записать(ПолноеИмяФайла); 
	
	чтФайла = Новый ЧтениеТекста(ПолноеИмяФайла, КодировкаТекста.UTF8);
	ДокументОбъект.Сообщение = чтФайла.Прочитать();
	чтФайла.Закрыть();
	
	
	Чтение = Новый ЧтениеXML();
	ДеревоЗначений = Новый ДеревоЗначений();

	
	Попытка                                                                
		Чтение.УстановитьСтроку(ДокументОбъект.Сообщение);
		Чтение.Прочитать();
	Исключение
		
		Чтение.Закрыть();
		
		тдОщибки.ДобавитьСтроку("Документ XML поврежден");
		ДокументОбъект.Комментарий = "Документ XML поврежден"; 
		Отказ = Истина
	КонецПопытки;
	
	Если не Отказ  Тогда
		ДеревоЗначений.Колонки.Добавить("Элемент");
		ДеревоЗначений.Колонки.Добавить("Текст");
		Корень         = ДеревоЗначений.Строки.Добавить();
		Корень.Элемент = Чтение.Имя;
		РекурсияЧтенияXML(Корень, Чтение);
		ДеревоЗначенийXML = ДеревоЗначений;
		
		Если ВидСообщения = Перечисления.ВидыСообщенийEDI.DESADV Тогда
			
			Рез = ОбработатьВходящий_DESADV(ДокументОбъект,ДеревоЗначенийXML,тдОщибки,ОтключитьПроверку);
			Отказ = НЕ Рез;
			
		ИначеЕсли ВидСообщения = Перечисления.ВидыСообщенийEDI.ORDER Тогда
			
			Рез = ОбработатьВходящий_ORDER(ДокументОбъект,ДеревоЗначенийXML,тдОщибки);
			Отказ = НЕ Рез;
		
		Иначе
			текстСообщения = "Парсинг сообщения " + ВидСообщения + "  еще не описан!";	
			тдОщибки.ДобавитьСтроку(текстСообщения);
		//	ДокументОбъект.Комментарий = текстСообщения; 
			Отказ = Истина
			
		КонецЕсли;
		
		//Если Отказ Тогда
			ДокументОбъект.Комментарий = тдОщибки.ПолучитьТекст();	
		//Иначе
		//	ДокументОбъект.Комментарий = "";
		//КонецЕсли;
		

	КонецЕсли;
	
	
	
	ДокументОбъект.Обработан = Истина;
	ДокументОбъект.ДатаОбработки = ТекущаяДата();
	
	ДокументОбъект.Отклонен = Отказ;

	Попытка 
		ДокументОбъект.Записать();
		ДокументОбъект.Разблокировать();
	Исключение
		тдОщибки.ДобавитьСтроку("Не удалось записать документ: " + ДокументСсылка + "!"+ Символы.ПС + ИнформацияОбОшибке());
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ПолноеИмяФайла);
	Исключение
		тдОщибки.ДобавитьСтроку("Не удалось удалить временный файл! " + ПолноеИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	результат = Новый Структура("ДокументОбработан, Ошибки",Не Отказ, тдОщибки);
	
	Возврат результат;

КонецФункции


Функция ОбработатьВходящий_DESADV(СообщениеОбъект,ДеревоЗначенийXML,ОшибкиДокумента,ОтключитьПроверку=Ложь)
	
	
	Если СообщениеОбъект.Провайдер = Перечисления.ПоставщикиEDI.COMARCH Тогда
		СтруктураДокумента = ПолучитьСтруктуруДокумента_COMARCH_DESADV(СообщениеОбъект,ДеревоЗначенийXML,ОшибкиДокумента)
	Иначе
		СтруктураДокумента = ПолучитьСтруктуруДокумента_EXITE_DESADV(СообщениеОбъект,ДеревоЗначенийXML,ОшибкиДокумента) 
	КонецЕсли;
	
	Если НЕ СтруктураДокументаВерна(СтруктураДокумента) И НЕ ОтключитьПроверку Тогда
		Если СтруктураДокумента.Свойство("НомерДокумента") Тогда
			СообщениеОбъект.НомерEDI       = СтруктураДокумента.НомерДокумента;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("ДатаДокумента") Тогда
			СообщениеОбъект.ДатаEDI       = СтруктураДокумента.ДатаДокумента;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("Контрагент") Тогда
			СообщениеОбъект.Отправитель    = СтруктураДокумента.Контрагент;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("SUPPLIER") Тогда
			СообщениеОбъект.ОтправительGLN = СтруктураДокумента.SUPPLIER;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("ОрганизацияКонтрагент") Тогда
			СообщениеОбъект.Получатель     = СтруктураДокумента.ОрганизацияКонтрагент;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("BUYER") Тогда
			СообщениеОбъект.ПолучательGLN  = СтруктураДокумента.BUYER;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ТорговаяПлощадка") Тогда
			СообщениеОбъект.ТорговаяПлощадкаПолучатель  = СтруктураДокумента.ТорговаяПлощадка;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("АдресДоставкиGLN") Тогда
			СообщениеОбъект.ТорговаяПлощадкаПолучательGLN  = СтруктураДокумента.АдресДоставкиGLN;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ЗаказПоставщику") Тогда
			СообщениеОбъект.ДокументОснование  = СтруктураДокумента.ЗаказПоставщику;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	СообщениеОбъект.НомерEDI       = СтруктураДокумента.НомерДокумента;
	СообщениеОбъект.ДатаEDI        = СтруктураДокумента.ДатаДокумента;
	СообщениеОбъект.Отправитель    = СтруктураДокумента.Контрагент;
	СообщениеОбъект.ОтправительGLN = СтруктураДокумента.SUPPLIER;
	СообщениеОбъект.Получатель     = СтруктураДокумента.ОрганизацияКонтрагент;
	СообщениеОбъект.ПолучательGLN  =  СтруктураДокумента.BUYER;
	СообщениеОбъект.ТорговаяПлощадкаПолучатель    = СтруктураДокумента.ТорговаяПлощадка;
	СообщениеОбъект.ТорговаяПлощадкаПолучательGLN = СтруктураДокумента.АдресДоставкиGLN;
	СообщениеОбъект.Подразделение = СтруктураДокумента.ПодразделениеКомпании;
	
	Если СтруктураДокумента.Свойство("ЗаказПоставщику") И ЗначениеЗаполнено(СтруктураДокумента.ЗаказПоставщику) Тогда
		СообщениеОбъект.ДокументОснование = СтруктураДокумента.ЗаказПоставщику;
	ИначеЕсли СтруктураДокумента.Свойство("НастройкиКонтрагента") И СтруктураДокумента.НастройкиКонтрагента.ФормироватьЗаказИзПрихода Тогда
		Попытка 
			Документы.ЗаказПоставщику.СоздатьЗаказПоставщикуНаОснованииDESADV(СообщениеОбъект,СтруктураДокумента);
		Исключение
		КонецПопытки;
	Иначе
		СообщениеОбъект.ДокументОснование = Документы.ЗаказПоставщику.ПустаяСсылка();
	КонецЕсли;
	
	СообщениеОбъект.Документ1С = СтруктураДокумента.ПредварительныйДокумент;
	
	Если  ЗначениеЗаполнено(СообщениеОбъект.Документ1С) И СообщениеОбъект.Документ1С.Проведен Тогда
		ОшибкиДокумента.ДобавитьСтроку("Докукумент поступления проведен!");
		Возврат Ложь
		
	Иначе
		Если ЗначениеЗаполнено(СообщениеОбъект.Документ1С)Тогда
			ДокументПоступления = СообщениеОбъект.Документ1С.ПолучитьОбъект();
			ДокументПоступления.Заблокировать();
			ДокументПоступления.РаспределениеПоставки.Очистить();
			ДокументПоступления.Товары.Очистить();

		Иначе
			ДокументПоступления = Документы.ПоступлениеТоваров.СоздатьДокумент();
		КонецЕсли;
		
	КонецЕсли;
	///ДокументПоступления = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ДокументПоступления.Дата = ТекущаяДатаСеанса();
	ДокументПоступления.ВхДокНомер = СтруктураДокумента.НомерНакладной;
	ДокументПоступления.ВхДокДата =  СтруктураДокумента.ДатаНакладной;
	ДокументПоступления.Автор =  Пользователи.ТекущийПользователь();
	ДокументПоступления.ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ДокументПоступления.ВалютаДокумента);
	ДокументПоступления.КурсДокумента         = 1;
	ДокументПоступления.РегламентированныйУчет = Истина;
	ДокументПоступления.ПодразделениеКомпании = СтруктураДокумента.ПодразделениеКомпании;
	ДокументПоступления.ТорговаяПлощадка      = СтруктураДокумента.ТорговаяПлощадка;
	ДокументПоступления.СкладКомпании         = СтруктураДокумента.СкладКомпании;
	ДокументПоступления.Организация = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(СтруктураДокумента.ТорговаяПлощадка,ДокументПоступления.Дата);
	ДокументПоступления.Контрагент	= СтруктураДокумента.Контрагент;
	
	Если СтруктураДокумента.Свойство("НастройкиКонтрагента") И  СтруктураДокумента.НастройкиКонтрагента.НеИспользоватьПротоколыЦен Тогда
		ДокументПоступления.ИспользоватьЦеныИзПротоколов = Ложь;
	Иначе
		ДокументПоступления.ИспользоватьЦеныИзПротоколов = ЗначениеНастроекПовтИсп.ПолучитьНастройкуПодразделения(ДокументПоступления.ПодразделениеКомпании);
	КонецЕсли;
	Если СтруктураДокумента.Свойство("НастройкиКонтрагента") И СтруктураДокумента.НастройкиКонтрагента.ФормироватьЗаказИзПрихода Тогда
		ДокументПоступления.ЗакрытиеЗаказовПоставщикам = 1;
	Иначе
		ДокументПоступления.ЗакрытиеЗаказовПоставщикам = 2;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СообщениеОбъект.ДокументОснование) И ЗначениеЗаполнено(СообщениеОбъект.ДокументОснование.ДоговорВзаиморасчетов) Тогда
		 ДокументПоступления.ДоговорВзаиморасчетов =  СообщениеОбъект.ДокументОснование.ДоговорВзаиморасчетов;
	 Иначе
		 ВидыДоговоров = Новый Массив;
		 ВидыДоговоров.Добавить(Справочники.ВидыДоговоров.Поставка);
		ДокументПоступления.ДоговорВзаиморасчетов  = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(ДокументПоступления.Контрагент,ДокументПоступления.Организация,ДокументПоступления.ПодразделениеКомпании,ВидыДоговоров,,ТекущаяДатаСеанса());
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументПоступления.Организация) И ЗначениеЗаполнено(ДокументПоступления.ДоговорВзаиморасчетов) Тогда
		Если ДокументПоступления.Организация = ДокументПоступления.ДоговорВзаиморасчетов.Организация Тогда
			ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
		Иначе
			ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровТранзиты;
		КонецЕсли;
	Иначе
		ДокументПоступления.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	КонецЕсли;
	ДокументПоступления.ТипЦен = ДокументПоступления.СкладКомпании.ТипЦенСебестоимости;
	
	ДокументПоступления.ДокументОснование = СообщениеОбъект.ДокументОснование;
	Если ЗначениеЗаполнено(СообщениеОбъект.ДокументОснование) Тогда
		нРаспределения = ДокументПоступления.РаспределениеПоставки.Добавить();
		нРаспределения.ЗаказПоставщику        = СообщениеОбъект.ДокументОснование;
	КонецЕсли;
	
	
	 Для Каждого СтрТабТовары Из  СтруктураДокумента.ДокументТЧ Цикл 
		 Если СтрТабТовары.КоличествоБазовое = 0 Тогда
			 Продолжить;
		 КонецЕсли;
		 
		 НоваяСтрока = ДокументПоступления.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТабТовары);
		
	КонецЦикла;
	
	ТоварыДокумента = ДокументПоступления.Товары.Выгрузить();
	ТоварыДокумента.Колонки.Добавить("ХарактеристикиИспользуются");
	ТоварыДокумента.Колонки.Добавить("ЗначениеМРЦ");

	СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу");
	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействий.Вставить("ЗаполнитьЗначениеМРЦ",Новый Структура("ХарактеристикаНоменклатуры", "ЗначениеМРЦ"));
	
	//СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре",Новый Структура("Контрагент,Организация,ТорговаяПлощадка,ТипСтавкиНДС",ДокументПоступления.Контрагент,ДокументПоступления.Организация,ДокументПоступления.ТорговаяПлощадка,"Закупка"));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьЦенуСНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуВсего");

	
	
	Если ДокументПоступления.ИспользоватьЦеныИзПротоколов  Тогда
		СтруктураДействий.Удалить("ПересчитатьЦенуСНДС");	
		СтруктураДействий.Вставить("ЗаполнитьЦены", Новый Структура("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокументПоступления, "СогласованиеЦен",ДокументПоступления.Дата)));
		СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");

		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		
		СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ТоварыДокумента,СтруктураДействий,Неопределено);
	
	ДокументПоступления.Товары.Загрузить(ТоварыДокумента);
	
	Попытка 
		ДокументПоступления.Записать();
		СообщениеОбъект.Документ1С = ДокументПоступления.Ссылка;
	Исключение
		ОшибкиДокумента.ДобавитьСтроку("Не удалось записать документ ""Поступление товаров"""+Символы.ПС+ОписаниеОшибки());

		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьВходящий_ORDER(СообщениеОбъект,ДеревоЗначенийXML,ОшибкиДокумента)
	
	
	Если СообщениеОбъект.Провайдер = Перечисления.ПоставщикиEDI.COMARCH Тогда
        Возврат Ложь;
	Иначе
		СтруктураДокумента = ПолучитьСтруктуруДокумента_EXITE_ORDER(СообщениеОбъект,ДеревоЗначенийXML,ОшибкиДокумента) 
	КонецЕсли;
	
	Если НЕ СтруктураДокументаВерна(СтруктураДокумента) Тогда
		Если СтруктураДокумента.Свойство("НомерДокумента") Тогда
			СообщениеОбъект.НомерEDI       = СтруктураДокумента.НомерДокумента;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("ДатаНакладной") Тогда
			СообщениеОбъект.ДатаEDI       = СтруктураДокумента.ДатаНакладной;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("Контрагент") Тогда
			СообщениеОбъект.Отправитель    = СтруктураДокумента.Контрагент;
		КонецЕсли;
		Если СтруктураДокумента.Свойство("BUYER") Тогда    //Покупатель
			СообщениеОбъект.ОтправительGLN  = СтруктураДокумента.BUYER;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ОрганизацияКонтрагент") Тогда
			СообщениеОбъект.Отправитель     = СтруктураДокумента.ОрганизацияКонтрагент;
		КонецЕсли;

		Если СтруктураДокумента.Свойство("SUPPLIER") Тогда     //Организация
			СообщениеОбъект.ПолучательGLN = СтруктураДокумента.SUPPLIER;
		КонецЕсли;
				Если СтруктураДокумента.Свойство("ТорговаяПлощадка") Тогда
			СообщениеОбъект.ТорговаяПлощадкаПолучатель  = СтруктураДокумента.ТорговаяПлощадка;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("АдресДоставкиGLN") Тогда
			СообщениеОбъект.ТорговаяПлощадкаПолучательGLN  = СтруктураДокумента.АдресДоставкиGLN;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ЗаказПоставщику") Тогда
			СообщениеОбъект.ДокументОснование  = СтруктураДокумента.ЗаказПоставщику;
		КонецЕсли;

		Возврат Ложь;
	КонецЕсли;
	
	СообщениеОбъект.НомерEDI       = СтруктураДокумента.НомерДокумента;
	СообщениеОбъект.ДатаEDI        = СтруктураДокумента.ДатаДокумента;
	СообщениеОбъект.Отправитель    = СтруктураДокумента.Контрагент;
	СообщениеОбъект.ОтправительGLN = СтруктураДокумента.BUYER;
	СообщениеОбъект.Получатель     = СтруктураДокумента.ОрганизацияКонтрагент;
	СообщениеОбъект.ПолучательGLN  =  СтруктураДокумента.SUPPLIER;
	СообщениеОбъект.ТорговаяПлощадкаПолучатель    = СтруктураДокумента.ТорговаяПлощадка;
	СообщениеОбъект.ТорговаяПлощадкаПолучательGLN = СтруктураДокумента.Получатель;
	СообщениеОбъект.Подразделение			      = СтруктураДокумента.ПодразделениеКомпании;

	
	СообщениеОбъект.Документ1С = СтруктураДокумента.ВходящийДокумент;
	//
	Если  ЗначениеЗаполнено(СообщениеОбъект.Документ1С) И СообщениеОбъект.Документ1С.Проведен Тогда
		ОшибкиДокумента.ДобавитьСтроку("Докукумент Заказ покупателя проведен!");
		Возврат Ложь
		
	Иначе
		Если ЗначениеЗаполнено(СообщениеОбъект.Документ1С)Тогда
			ДокументЗагрузки = СообщениеОбъект.Документ1С.ПолучитьОбъект();
			ДокументЗагрузки.Заблокировать();
			ДокументЗагрузки.РаспределениеЗаказовПоставщиков.Очистить();
			ДокументЗагрузки.Товары.Очистить();

		Иначе
			ДокументЗагрузки = Документы.ЗаказПокупателя.СоздатьДокумент();
		КонецЕсли;
		
	КонецЕсли;
//	ДокументЗагрузки = Документы.ЗаказПокупателя.СоздатьДокумент();
	ДокументЗагрузки.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	ДокументЗагрузки.Дата = ТекущаяДатаСеанса();
	ДокументЗагрузки.Автор =  Пользователи.ТекущийПользователь();
	ДокументЗагрузки.ВалютаДокумента 	  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ДокументЗагрузки.ВалютаДокумента);
	ДокументЗагрузки.КурсДокумента         = 1;
	ДокументЗагрузки.РегламентированныйУчет = Истина;
	ДокументЗагрузки.ПодразделениеКомпании = СтруктураДокумента.ПодразделениеКомпании;
	ДокументЗагрузки.ТорговаяПлощадка      = СтруктураДокумента.ТорговаяПлощадка;
	ДокументЗагрузки.СкладКомпании         = СтруктураДокумента.СкладКомпании;
	ДокументЗагрузки.Организация   = СтруктураДокумента.Организация;
	//ДокументЗагрузки.Организация   = Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(СтруктураДокумента.ТорговаяПлощадка,ДокументЗагрузки.Дата);
	ДокументЗагрузки.Контрагент	   = СтруктураДокумента.Контрагент;
	ДокументЗагрузки.ТочкаДоставки = СтруктураДокумента.АдресДоставки;
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Справочники.ВидыДоговоров.Продажа);
	ДокументЗагрузки.ДоговорВзаиморасчетов  = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(ДокументЗагрузки.Контрагент,ДокументЗагрузки.Организация,ДокументЗагрузки.ПодразделениеКомпании,ВидыДоговоров,,ТекущаяДатаСеанса(),,ДокументЗагрузки.ТорговаяПлощадка);
	ДокументЗагрузки.ИДДокументаОтгрузки    = СтруктураДокумента.НомерДокумента;
	ДокументЗагрузки.ДатаСоздания           = НачалоДня(СтруктураДокумента.ДатаДокумента);
	Если СтруктураДокумента.Свойство("ДатаПоставки") Тогда
		ДокументЗагрузки.СрокПоставки = СтруктураДокумента.ДатаПоставки;
	КонецЕсли;
	
	тчТовары = ДокументЗагрузки.Товары.Выгрузить();
	тчТовары.Колонки.Добавить("ГруппаЦенообразования");
	тчТовары.Колонки.Добавить("ТипЦен");
	
	 Для Каждого СтрТабТовары Из  СтруктураДокумента.ДокументТЧ Цикл 
		 Если СтрТабТовары.КоличествоБазовое = 0 Тогда
			 Продолжить;
		 КонецЕсли;
		 
		 НоваяСтрока = тчТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТабТовары);
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));	
	СтруктураДействий.Вставить("ЗаполнитьГруппуЦенообразования",	Новый Структура("Номенклатура","ГруппаЦенообразования"));
	СтруктураДействий.Вставить("ЦеныИзДоговора",ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровТипаЦенПоДоговору(ДокументЗагрузки));
	СтруктураПолейДляЗаполненияЦен = Новый Структура;	
	
	СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокументЗагрузки));
	
	СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);
	СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);


	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(тчТовары,СтруктураДействий,Неопределено);
	ДокументЗагрузки.Товары.Загрузить(тчТовары);
	Рез = ДокументЗагрузки.ПроверитьЗаполнение();
	Попытка 
		ДокументЗагрузки.Записать(РежимЗаписиДокумента.Проведение);
		СообщениеОбъект.Документ1С = ДокументЗагрузки.Ссылка;
	Исключение
		ОшибкиДокумента.ДобавитьСтроку("Не удалось записать документ ""Заказ покупателя"""+Символы.ПС+ОписаниеОшибки());

		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции




Процедура СформироватьИсходящийДокумент(СтруктураПараметров) Экспорт 
	
	ТаблицаДокументов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "ТаблицаДокументов", Неопределено);
	
	Если ТаблицаДокументов = Неопределено Тогда 
		
		
		
		
	Иначе
		Для Каждого СтрДок Из ТаблицаДокументов Цикл 
			
			Если Не ЗначениеЗаполнено(СтрДок.УчетнаяЗаписьЭлектронногоОбмена) Тогда
				СтруктураПараметров.Вставить("ЕстьОшибки",1);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'ВНИМАНИЕ! Ошибка обмена EDI - не передана учетная запись!'; uk = 'УВАГА! Помилка обміну EDI - не переданий обліковий запис!'"));
			КонецЕсли;
			
			Если ПустаяСтрока(СтрДок.КонтрагентGLN) Тогда
				СтруктураПараметров.Вставить("ЕстьОшибки",1);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'ВНИМАНИЕ! Ошибка обмена EDI - не указан GLN Контрагента!'; uk = 'УВАГА! Помилка обміну EDI - не вказано GLN Контрагента!'"));
			КонецЕсли;
			
			Если ПустаяСтрока(СтрДок.ОрганизацияGLN) тогда
				СтруктураПараметров.Вставить("ЕстьОшибки",1);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'ВНИМАНИЕ! Ошибка обмена EDI - не указан GLN Организации!'; uk = 'УВАГА! Помилка обміну EDI - не вказано GLN Організації!'"));
			КонецЕсли;
			ДокументТип = ТипЗнч(СтрДок.ДокументСсылка);
			
			ОшибкиДокумента = "";
			Если ДокументТип = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Рез = СоздатьИсходящийORDERS(СтрДок,ОшибкиДокумента);
				Если Рез Тогда
					Если ПустаяСтрока(ОшибкиДокумента) Тогда 
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ "+Строка(СтрДок.ДокументСсылка)+" выгружен!'; uk = 'Документ "+Строка(СтрДок.ДокументСсылка)+" вивантажено!'"));
					КонецЕсли;
					ДокОбъект = СтрДок.ДокументСсылка.ПолучитьОбъект();
					ДокОбъект.СтатусЗаказаВеб = Перечисления.СтатусыЗаказовВеб.НеПодтвержден;
					ДокОбъект.Записать();
				КонецЕсли;
			ИначеЕсли ДокументТип = Тип("Неопределено") Тогда
				ВидСообщения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "ВидСообщения", Неопределено);
				Если ВидСообщения = Перечисления.ВидыСообщенийEDI.INVRPT Тогда
					Рез = СоздатьИсходящийINVRPT(СтрДок,ОшибкиДокумента);
					Если Рез Тогда
						Если ПустаяСтрока(ОшибкиДокумента) Тогда 
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ "+СтрДок.ФайлИмя+" выгружен!'; uk = 'Документ "+СтрДок.ФайлИмя+" вивантажено!'"));
						КонецЕсли;
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'ВНИМАНИЕ! Ошибка обмена EDI - неизвестный тип документа!'; uk = 'УВАГА! Помилка обміну EDI - невідомий тип документа!'"));
				КонецЕсли;

			КонецЕсли;
			
			Если Не ПустаяСтрока(ОшибкиДокумента) тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиДокумента);
			КонецЕсли;

			
		КонецЦикла;

	КонецЕсли;
	
	
КонецПроцедуры

Функция НайтиИсходящийДокумент(ВидСообщения,ДокументОснование,ТорговаяПлощадка = неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТК_СообщениеEDIИсходящие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТК_СообщениеEDIИсходящие КАК ТК_СообщениеEDIИсходящие
	|ГДЕ
	|	ТК_СообщениеEDIИсходящие.ДокументОснование = &ДокументОснование
	|	И НЕ ТК_СообщениеEDIИсходящие.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ТорговаяПлощадка = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТК_СообщениеEDIИсходящие.ТорговаяПлощадкаПолучатель = &ТорговаяПлощадка
	|		КОНЕЦ
	|	И ТК_СообщениеEDIИсходящие.ВидСообщения = &ВидСообщения";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.УстановитьПараметр("ВидСообщения", ВидСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьФайлORDERS(Параметры,СтруктураДокумента) Экспорт
	
	//пКаталог = КаталогВременныхФайлов() +"EDI\";
	//фКаталог = Новый Файл(пКаталог);
	//Если НЕ фКаталог.Существует() Тогда
	//	СоздатьКаталог(пКаталог);
	//КонецЕсли;
	//
	//ФайлВыгрузки =   пКаталог+ СтруктураДокумента.EDIMESSAGE + "_ORDERS.xml";
	
	ФайлИмя = СтруктураДокумента.EDIMESSAGE + "_ORDERS.xml";
	ФайлТип = ".xml";
	ВсеОК = Истина;
	ТекстОшибки = "";
	Попытка
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку("UTF-8");
		//	ЗаписьXML.ОткрытьФайл(ФайлВыгрузки, "UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		Если Параметры.ПоставщикEDI = Перечисления.ПоставщикиEDI.COMARCH Тогда
			СформироватьXML_ORDERS_COMARCH(ЗаписьXML,Параметры,СтруктураДокумента);
		Иначе
			СформироватьXML_ORDERS_EXITE(ЗаписьXML,Параметры,СтруктураДокумента);
		КонецЕсли;
		тXML = ЗаписьXML.Закрыть();
		
		ПотокДанных = Новый ПотокВПамяти();
		
		ЗаписьДанных = Новый ЗаписьДанных(ПотокДанных,КодировкаТекста.UTF8);
		ЗаписьДанных.ЗаписатьСтроку(тXML,КодировкаТекста.UTF8);
		ЗаписьДанных.Закрыть();
		
		ДВ = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();
		ФайлВыгрузки =  Новый ХранилищеЗначения(ДВ,Новый СжатиеДанных(9));
	Исключение
		ВсеОК = Ложь;
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;


	Возврат Новый Структура("ФайлИмя,ФайлТип,ТекстXML,Файл,ВсеОК,ТекстОшибки",ФайлИмя,ФайлТип,тXML,ФайлВыгрузки,ВсеОК,ТекстОшибки);
	
	
КонецФункции


Функция ЗаписатьФайлОбмена(СтруктураЭД)Экспорт
	
	Попытка
		ПолноеИмяФайла   = СтруктураЭД.ПолноеИмяФайла;
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла, "UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		Если СтруктураЭД.ПровайдерEDI = Перечисления.ПоставщикиEDI.COMARCH Тогда
			
			Если  СтруктураЭД.ВидСообщения = Перечисления.ВидыСообщенийEDI.COMDOC007 Тогда
				
			Иначе
				
				ВызватьИсключение("Метод выгрузки "+Строка(СтруктураЭД.ВидСообщения)+" не реализован");
				
			КонецЕсли;
			
		Иначе
			Если СтруктураЭД.ВидСообщения = Перечисления.ВидыСообщенийEDI.DESADV Тогда
				СформироватьXML_DESADV_EXITE(ЗаписьXML,СтруктураЭД);
			ИначеЕсли  СтруктураЭД.ВидСообщения = Перечисления.ВидыСообщенийEDI.ORDRSP Тогда
				СформироватьXML_ORDRSP_EXITE(ЗаписьXML,СтруктураЭД);
			ИначеЕсли  СтруктураЭД.ВидСообщения = Перечисления.ВидыСообщенийEDI.COMDOC007 Тогда
				
			Иначе
				
				ВызватьИсключение("Метод выгрузки "+Строка(СтруктураЭД.ВидСообщения)+" не реализован");
				
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьXML.Закрыть();
		
		ФайлСформирован = Истина;
		
	Исключение
		ФайлСформирован = Ложь;
	КонецПопытки;
	
	Возврат ФайлСформирован;

КонецФункции


Функция СоздатьИсходящийORDERS(Параметры,Ошибки)
	ВсеОК = Истина;
	
	МассивДокументов = Документы.ЗаказПоставщику.СвормироватьСтруктуру_ORDER(Параметры.ДокументСсылка);
	ЛогОшибок = Новый ТекстовыйДокумент;
	
	Для Каждого СтруктураДокумента Из МассивДокументов Цикл 
		
		СтруктураДанных =  ЗаписатьФайлORDERS(Параметры,СтруктураДокумента);
		Если СтруктураДанных.ВсеОК = Ложь Тогда
			тОшибка = "Заказ "+СтруктураДокумента.NUMBER+" от "+СтруктураДокумента.DATE+" получатель "+ Строка(СтруктураДокумента.ТорговаяПлощадкаПолучатель)+" не удалось записать файл обмена xml, "+СтруктураДанных.ТекстОшибки;
			ВсеОк = Ложь;
			ЛогОшибок.ДобавитьСтроку(тОшибка);
			Продолжить;
		КонецЕсли;
		
		//ФайлORDERS = Новый Файл(ФайлВыгрузкиXML);
		//Если НЕ ФайлORDERS.Существует() тогда
		//	тОшибка = Ошибки +"|Заказ "+СтруктураДокумента.NUMBER+" от "+СтруктураДокумента.DATE+" получатель "+ Строка(СтруктураДокумента.ТорговаяПлощадкаПолучатель)+" не удалось записать файл обмена xml";
		//	Если ПустаяСтрока(Ошибки) Тогда
		//		Ошибки = тОшибка;
		//	Иначе 
		//		Ошибки = Ошибки + тОшибка + Символы.ПС;
		//	КонецЕсли;
		//	ВсеОк = Ложь;
		//	Продолжить;
		//КонецЕсли;
		
		НачатьТранзакцию();
		
		ИсходящийДокументСсылка =  НайтиИсходящийДокумент(Перечисления.ВидыСообщенийEDI.ORDER,Параметры.ДокументСсылка,СтруктураДокумента.ТорговаяПлощадкаПолучатель);
		Если ИсходящийДокументСсылка = Неопределено тогда
			ИсходящийДокумент = Документы.ТК_СообщениеEDIИсходящие.СоздатьДокумент();
		Иначе
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ТК_СообщениеEDIИсходящие");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ИсходящийДокументСсылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Если ИсходящийДокументСсылка.ТекущийСтатус <> Перечисления.СтатусыДокументовEDI.Создан Тогда
				ОтменитьТранзакцию();
				тОшибка = "Пропускаем документ Заказ "+СтруктураДокумента.NUMBER+" от "+СтруктураДокумента.DATE+" получатель "+ Строка(СтруктураДокумента.ТорговаяПлощадкаПолучатель)+" со статусом " + Строка(ИсходящийДокументСсылка.ТекущийСтатус);
				ЛогОшибок.ДобавитьСтроку(тОшибка);

				//Если ПустаяСтрока(Ошибки) Тогда
				//	Ошибки = тОшибка;
				//Иначе 
				//	Ошибки = Ошибки + тОшибка + Символы.ПС;
				//КонецЕсли;
				Продолжить;
			Иначе
				ИсходящийДокумент = ИсходящийДокументСсылка.ПолучитьОбъект();
			КонецЕсли;
		КонецЕсли;
		ИсходящийДокумент.Дата = ТекущаяДатаСеанса();
		ИсходящийДокумент.Автор = Пользователи.ТекущийПользователь();
		ИсходящийДокумент.Провайдер 			= Параметры.ПоставщикEDI;
		ИсходящийДокумент.ПодразделениеКомпании = Параметры.ПодразделениеКомпании;
		ИсходящийДокумент.Отправитель 			= Параметры.Организация;
		ИсходящийДокумент.Получатель 			= Параметры.Контрагент;
		ИсходящийДокумент.УчетнаяЗаписьEDI 		= Параметры.УчетнаяЗаписьЭлектронногоОбмена;
		ИсходящийДокумент.ОтправительGLN 		= Параметры.ОрганизацияGLN;
		ИсходящийДокумент.ПолучательGLN 		= Параметры.КонтрагентGLN;
		ИсходящийДокумент.ДокументОснование 	= Параметры.ДокументСсылка;
		ИсходящийДокумент.ВидСообщения		 	= Перечисления.ВидыСообщенийEDI.ORDER;
		ИсходящийДокумент.ТекущийСтатус		 	= Перечисления.СтатусыДокументовEDI.Создан;
		
		//ЧтениеТД = Новый ТекстовыйДокумент;
		//ЧтениеТД.Прочитать(ФайлВыгрузкиXML);
		//ТекстXML = ЧтениеТД.ПолучитьТекст();
		
		ИсходящийДокумент.Сообщение		 		= СтруктураДанных.ТекстXML;
		ИсходящийДокумент.ИмяФайлаСообщения		= СтруктураДанных.ФайлИмя;
		ИсходящийДокумент.ТорговаяПлощадкаПолучатель    = СтруктураДокумента.ТорговаяПлощадкаПолучатель;
		ИсходящийДокумент.ТорговаяПлощадкаПолучательGLN = СтруктураДокумента.DELIVERYPLACE;
		ИсходящийДокумент.ФайлСообщения         = СтруктураДанных.Файл;//Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлВыгрузкиXML),Новый СжатиеДанных(9));
		
		НоваяСтрока = ИсходящийДокумент.СтатусыСообщения.Добавить();
		НоваяСтрока.Период = ТекущаяДатаСеанса();
		НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
		НоваяСтрока.Статус = Перечисления.СтатусыДокументовEDI.Создан;
		НоваяСтрока.ИмяДокумента = СтруктураДанных.ФайлИмя;
		НоваяСтрока.Расширение   = СтруктураДанных.ФайлТип;
		НоваяСтрока.Документ     = ИсходящийДокумент.ФайлСообщения;
		
		ИсходящийДокумент.Записать();
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
	Ошибки = ЛогОшибок.ПолучитьТекст();
	
	Возврат ВсеОК;
	
КонецФункции

Функция СоздатьИсходящийINVRPT(Параметры,Ошибки)  //Инвентаризация
	ВсеОК = Истина;
	
	
	НачатьТранзакцию();
	Попытка
		
		ИсходящийДокумент = Документы.ТК_СообщениеEDIИсходящие.СоздатьДокумент();
		ИсходящийДокумент.Дата = ТекущаяДатаСеанса();
		ИсходящийДокумент.Автор = Пользователи.ТекущийПользователь();
		ИсходящийДокумент.Провайдер 			= Параметры.ПоставщикEDI;
		ИсходящийДокумент.ПодразделениеКомпании = Параметры.ПодразделениеКомпании;
		ИсходящийДокумент.Отправитель 			= Параметры.Организация;
		ИсходящийДокумент.Получатель 			= Параметры.Контрагент;
		ИсходящийДокумент.УчетнаяЗаписьEDI 		= Параметры.УчетнаяЗаписьЭлектронногоОбмена;
		ИсходящийДокумент.ОтправительGLN 		= Параметры.ОрганизацияGLN;
		ИсходящийДокумент.ПолучательGLN 		= Параметры.КонтрагентGLN;
		ИсходящийДокумент.ВидСообщения		 	= Перечисления.ВидыСообщенийEDI.INVRPT;
		ИсходящийДокумент.ТекущийСтатус		 	= Перечисления.СтатусыДокументовEDI.Создан;
		//	
		ИсходящийДокумент.ИмяФайлаСообщения		= Параметры.ФайлИмя;
		ИсходящийДокумент.ФайлСообщения         = Новый ХранилищеЗначения(Параметры.XML_ДвоичныеДанные,Новый СжатиеДанных(9));
		
		
		НоваяСтрока = ИсходящийДокумент.СтатусыСообщения.Добавить();
		НоваяСтрока.Период = ТекущаяДатаСеанса();
		НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
		НоваяСтрока.Статус = Перечисления.СтатусыДокументовEDI.Создан;
		НоваяСтрока.ИмяДокумента = Параметры.ФайлИмя;
		НоваяСтрока.Расширение   = Параметры.ФайлТип;
		НоваяСтрока.Документ     = ИсходящийДокумент.ФайлСообщения;
		
		ИсходящийДокумент.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	
	Возврат ВсеОК;
	
КонецФункции


Процедура ПроверитьМассивДокументовДляОтправки(МассивДокументов)
	НовыйМассив = Новый Массив;
	
	СтатусСоздан = Перечисления.СтатусыДокументовEDI.Создан;
	Для Каждого Документ Из МассивДокументов Цикл 
		Если Документ.ТекущийСтатус = СтатусСоздан И НЕ Документ.ПометкаУдаления тогда
			НовыйМассив.Добавить(Документ);
		КонецЕсли;
		
		
	КонецЦикла;
	
	МассивДокументов = НовыйМассив;
	
КонецПроцедуры


Функция ПолучитьТаблицуЗаказовПоставщику(Параметры) Экспорт 
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказПоставщику.Ссылка КАК ДокументСсылка,
	               |	ЗаказПоставщику.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ЗаказПоставщику.ДоговорВзаиморасчетов.Организация КАК Организация,
	               |	ПараметрыОбмена.Контрагент КАК Контрагент,
	               |	ЗаказПоставщику.ДоговорВзаиморасчетов.Организация.GLN КАК ОрганизацияGLN,
	               |	ПараметрыОбмена.УчетнаяЗаписьEDI.ПоставщикEDI КАК ПоставщикEDI,
	               |	ПараметрыОбмена.GLN КАК КонтрагентGLN,
	               |	ПараметрыОбмена.УчетнаяЗаписьEDI КАК УчетнаяЗаписьЭлектронногоОбмена
	               |ИЗ
	               |	РегистрСведений.ТК_ПараметрыОбменаEDI КАК ПараметрыОбмена
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |		ПО (ЗаказПоставщику.Проведен)
	               |			И (ЗаказПоставщику.СтатусЗаказаВеб = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовВеб.Неотправлен))
	               |			И (ВЫБОР
	               |				КОГДА &ЗаказПоставщику = НЕОПРЕДЕЛЕНО
	               |					ТОГДА НАЧАЛОПЕРИОДА(ЗаказПоставщику.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НаДату, ДЕНЬ)
	               |				ИНАЧЕ ЗаказПоставщику.Ссылка = &ЗаказПоставщику
	               |			КОНЕЦ)
	               |			И ПараметрыОбмена.Контрагент = ЗаказПоставщику.Контрагент
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ &Контрагент = ПараметрыОбмена.Контрагент
	               |		КОНЕЦ
	               |	И НЕ ПараметрыОбмена.УчетнаяЗаписьEDI.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА &УчетнаяЗапись = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ &УчетнаяЗапись = ПараметрыОбмена.УчетнаяЗаписьEDI
	               |		КОНЕЦ
	               |	И НЕ ПараметрыОбмена.УчетнаяЗаписьEDI.Отключен
	               |	И НЕ ПараметрыОбмена.УчетнаяЗаписьEDI.ТолькоЗагрузка";	
	
	
	ЗаказПоставщику = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка", Неопределено);
	
	Запрос.УстановитьПараметр("НаДату", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НаДату", ТекущаяДата()));
	Запрос.УстановитьПараметр("УчетнаяЗапись", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "УчетнаяЗапись", Неопределено));
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.УстановитьПараметр("Контрагент", ?(ЗаказПоставщику = Неопределено, Неопределено, ЗаказПоставщику.Контрагент));
	Запрос.УстановитьПараметр("Организация", ?(ЗаказПоставщику = Неопределено, Неопределено, ЗаказПоставщику.ДоговорВзаиморасчетов.Организация));
	

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьРеализациюТоваровПоДкументу(СсылкаНаОбъект, НастройкиОбмена)
	
	ВозвращаемоеЗначение = Неопределено;
	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок
	Отказ = Ложь;

	СтруктураЭД =  СтруктураЭлектронногоДокумента(СсылкаНаОбъект,НастройкиОбмена);
	Если НастройкиОбмена.ВидЭД = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда
		СтруктураДокумента = Документы.ВыпускПродукции.СформироватьСтруктуру_DESADV(СсылкаНаОбъект);
	Иначе
		СтруктураДокумента = Документы.РеализацияТоваров.СформироватьСтруктуру_DESADV(СсылкаНаОбъект);
	КонецЕсли;
	СтруктураЭД.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.DESADV);
	СтруктураЭД.Вставить("ОтправительGLN",СтруктураДокумента.SENDER);
	СтруктураЭД.Вставить("ПолучательGLN",СтруктураДокумента.RECIPIENT);
	СтруктураЭД.Вставить("ТекущийСтатус",Перечисления.СтатусыДокументовEDI.Создан);

	
	АдресКаталога  = РабочийКаталог();
	ПолноеИмяФайла =  АдресКаталога + "desadv_"+Формат(СтруктураДокумента.Дата, "ДФ=yyyyMMddЧЧммсс") + "-OUT-" + СтроковыеФункции.СтрокаЛатиницей(СтруктураДокумента.NUMBER)+".xml";
	СтруктураЭД.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	СтруктураЭД.Вставить("СтруктураДокумента",СтруктураДокумента);
	Если ЗаписатьФайлОбмена(СтруктураЭД) Тогда

		СтруктураПараметров  = Новый Структура;
		СтруктураПараметров.Вставить("СтруктураЭД",    СтруктураЭД);
		СтруктураПараметров.Вставить("ВидЭД",НастройкиОбмена.ВидЭД);
		СтруктураПараметров.Вставить("ПолноеИмяФайла",ПолноеИмяФайла);
		СтруктураПараметров.Вставить("Наименование",АдресКаталога);
		ВозвращаемоеЗначение = СтруктураПараметров;

	КонецЕсли;
	
	
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция СформироватьПодтверждениеЗаказаПоДокументу(СсылкаНаОбъект, НастройкиОбмена)
	
	ВозвращаемоеЗначение = Неопределено;
	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок
	Отказ = Ложь;

	СтруктураЭД =  СтруктураЭлектронногоДокумента(СсылкаНаОбъект,НастройкиОбмена);
	
	
	СтруктураДокумента = Документы.РезервированиеЗаказовПокупателя.СформироватьСтруктуру_ORDRSP(СсылкаНаОбъект);
	СтруктураЭД.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.ORDRSP);
	СтруктураЭД.Вставить("ОтправительGLN",СтруктураДокумента.SENDER);
	СтруктураЭД.Вставить("ПолучательGLN",СтруктураДокумента.RECIPIENT);
	СтруктураЭД.Вставить("ТекущийСтатус",Перечисления.СтатусыДокументовEDI.Создан);

	
	АдресКаталога  = РабочийКаталог();
	ПолноеИмяФайла =  АдресКаталога + "ordrsp_"+Формат(СтруктураДокумента.Дата, "ДФ=yyyyMMddЧЧммсс") + "-OUT-" + СтруктураДокумента.NUMBER+".xml";
	СтруктураЭД.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	СтруктураЭД.Вставить("СтруктураДокумента",СтруктураДокумента);
	Если ЗаписатьФайлОбмена(СтруктураЭД) Тогда

		СтруктураПараметров  = Новый Структура;
		СтруктураПараметров.Вставить("СтруктураЭД",    СтруктураЭД);
		СтруктураПараметров.Вставить("ВидЭД",НастройкиОбмена.ВидЭД);
		СтруктураПараметров.Вставить("ПолноеИмяФайла",ПолноеИмяФайла);
		СтруктураПараметров.Вставить("Наименование",АдресКаталога);
		ВозвращаемоеЗначение = СтруктураПараметров;

	КонецЕсли;
	
	
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция СформироватьCOMDOCПоступлениеТоваровПоДкументу(СсылкаНаОбъект, НастройкиОбмена)
	
	ВозвращаемоеЗначение = Неопределено;
	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок
	Отказ = Ложь;

	СтруктураЭД =  СтруктураЭлектронногоДокумента(СсылкаНаОбъект,НастройкиОбмена);
	
	СтруктураДокумента = Документы.ПоступлениеТоваров.СтруктураДокументаCOMDOC(СсылкаНаОбъект);
	СтруктураЭД.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.COMDOC007);
	СтруктураЭД.Вставить("ОтправительGLN",СтруктураДокумента.КодGLNОрганизации);
	СтруктураЭД.Вставить("ПолучательGLN",СтруктураДокумента.КодGLNКонтрагента);
	СтруктураЭД.Вставить("ТекущийСтатус",Перечисления.СтатусыДокументовEDI.НаПодписи);
	
	
	АдресКаталога  = РабочийКаталог();
	ПолноеИмяФайла =  АдресКаталога + "comdoc_"+Формат(СтруктураДокумента.Дата, "ДФ=yyyyMMddЧЧммсс") + "_prihodnaya-out-" + СтруктураДокумента.НомерДокумента+".xml";
	СтруктураЭД.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	СтруктураЭД.Вставить("СтруктураДокумента",СтруктураДокумента);
	Если ЗаписатьФайлОбмена(СтруктураЭД) Тогда

		СтруктураПараметров  = Новый Структура;
		СтруктураПараметров.Вставить("СтруктураЭД",    СтруктураЭД);
		СтруктураПараметров.Вставить("ВидЭД",НастройкиОбмена.ВидЭД);
		СтруктураПараметров.Вставить("ПолноеИмяФайла",ПолноеИмяФайла);
		СтруктураПараметров.Вставить("Наименование",АдресКаталога);
		ВозвращаемоеЗначение = СтруктураПараметров;

	КонецЕсли;
	
	
	
	Возврат ВозвращаемоеЗначение;

КонецФункции


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидСообщенияДокумента(ШапкаФайла)
	ВидДокумента = Неопределено;
	СтрокаПоиска = ВРег(ШапкаФайла);
	
	Если СтрНайти(СтрокаПоиска,ВРег("<Document-DespatchAdvice>"),НаправлениеПоиска.СНачала)>0 Тогда
		ВидДокумента = Перечисления.ВидыСообщенийEDI.DESADV;
	ИначеЕсли СтрНайти(СтрокаПоиска,"<DESADV>",НаправлениеПоиска.СНачала)>0 Тогда
		ВидДокумента = Перечисления.ВидыСообщенийEDI.DESADV;
	ИначеЕсли СтрНайти(СтрокаПоиска,"<ORDER>",НаправлениеПоиска.СНачала)>0 Тогда
		ВидДокумента = Перечисления.ВидыСообщенийEDI.ORDER;
	КонецЕсли;
	
	Возврат ВидДокумента;
	
	
КонецФункции

Функция ПолучитьМассивДокументовДляОтправки(МаксимальноеКоличествоСообщений = 100)
	
	Попытка
		МаксКолСообщений = Формат(Число(МаксимальноеКоличествоСообщений),"ЧН=0; ЧГ=");
	Исключение
		МаксКолСообщений = "100";
	КонецПопытки;
	
	Запрос = Новый Запрос;
		ТекстЗапроса =	"ВЫБРАТЬ ПЕРВЫЕ 100
		              	|	ТК_СообщениеEDIИсходящие.Ссылка КАК Ссылка
		              	|ИЗ
		              	|	Документ.ТК_СообщениеEDIИсходящие КАК ТК_СообщениеEDIИсходящие
		              	|ГДЕ
		              	|	НЕ ТК_СообщениеEDIИсходящие.ПометкаУдаления
		              	|	И ТК_СообщениеEDIИсходящие.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.Статусыдокументовedi.создан)
		              	|	И ТК_СообщениеEDIИсходящие.УчетнаяЗаписьEDI.Отключен = ЛОЖЬ";
	
	Запрос.Текст =  СтрЗаменить(ТекстЗапроса,"100",МаксКолСообщений);

	РезультатЗапроса = Запрос.Выполнить();
	
	таблицаДокументов = РезультатЗапроса.Выгрузить();
	
	Возврат таблицаДокументов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьМассивВходящихДокументовДляОбработки(МаксимальноеКоличествоСообщений = 100)
	
	Попытка
		МаксКолСообщений = Формат(Число(МаксимальноеКоличествоСообщений),"ЧН=0; ЧГ=");
	Исключение
		МаксКолСообщений = "100";
	КонецПопытки;
	
	Запрос = Новый Запрос;
		ТекстЗапроса =	"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ТК_СообщениеEDIВходящее.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТК_СообщениеEDIВходящее КАК ТК_СообщениеEDIВходящее
		|ГДЕ
		|	НЕ ТК_СообщениеEDIВходящее.ПометкаУдаления
		|	И НЕ ТК_СообщениеEDIВходящее.Обработан";
	
	Запрос.Текст =  СтрЗаменить(ТекстЗапроса,"100",МаксКолСообщений);

	РезультатЗапроса = Запрос.Выполнить();
	
	таблицаДокументов = РезультатЗапроса.Выгрузить();
	
	Возврат таблицаДокументов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции


Процедура СформироватьXML_ORDERS_EXITE(ЗаписьXML,Параметры,СтруктураДокумента)
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER");//ORDERS

	//DOCUMENTNAME
	ЗаписатьXML(ЗаписьXML, 220, "DOCUMENTNAME");
	
	//NUMBER
	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.NUMBER, "NUMBER");
	
	//DATE
	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DATE, "DATE");
	
	//DELIVERYDATE
	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYDATE, "DELIVERYDATE");
	
	//DELIVERYTIME
	Если СтруктураДокумента.Свойство("DELIVERYTIME") И ЗначениеЗаполнено(СтруктураДокумента.DELIVERYTIME) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYTIME, "DELIVERYTIME");
	КонецЕсли;
	
	//CAMPAIGNNUMBER
	Если СтруктураДокумента.Свойство("CAMPAIGNNUMBER") И ЗначениеЗаполнено(СтруктураДокумента.CAMPAIGNNUMBER) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.CAMPAIGNNUMBER, "CAMPAIGNNUMBER");
	КонецЕсли;
	
	//CURRENCY
	Если СтруктураДокумента.Свойство("CURRENCY") И ЗначениеЗаполнено(СтруктураДокумента.CURRENCY) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.CURRENCY, "CURRENCY");
	КонецЕсли;
	ЗаписатьXML(ЗаписьXML,"20", "VAT");

	//
	////INFO
	//Если СтруктураДокумента.Свойство("INFO") И ЗначениеЗаполнено(СтруктураДокумента.INFO) Тогда
	//	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.INFO, "INFO");
	//КонецЕсли;
	//
	ЗаписатьXML(ЗаписьXML,"", "INFO");
	
	//HEAD
	ЗаписьXML.ЗаписатьНачалоЭлемента("HEAD");//HEAD
	
	//SUPPLIER
	Если ПустаяСтрока(СтруктураДокумента.SUPPLIER) Тогда
		ЗаписатьXML(ЗаписьXML, Параметры.КонтрагентGLN, "SUPPLIER");
	Иначе	
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.SUPPLIER, "SUPPLIER");
	КонецЕсли;
	
	//BUYER
	Если ПустаяСтрока(СтруктураДокумента.BUYER) Тогда
		ЗаписатьXML(ЗаписьXML, Параметры.ОрганизацияGLN, "BUYER");
	Иначе
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.BUYER, "BUYER");
	КонецЕсли;
	
	//DELIVERYPLACE
	Если СтруктураДокумента.Свойство("DELIVERYPLACE") И ЗначениеЗаполнено(СтруктураДокумента.DELIVERYPLACE) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYPLACE, "DELIVERYPLACE");
	КонецЕсли;
	
	////INVOICEPARTNER
	//Если СтруктураДокумента.Свойство("INVOICEPARTNER") И ЗначениеЗаполнено(СтруктураДокумента.INVOICEPARTNER) Тогда
	//	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.INVOICEPARTNER, "INVOICEPARTNER");
	//Иначе
	//	ЗаписатьXML(ЗаписьXML, Параметры.ОрганизацияGLN, "INVOICEPARTNER");
	//КонецЕсли;
	
	//SENDER
	
	Если СтруктураДокумента.Свойство("Идентификатор") И ЗначениеЗаполнено(СтруктураДокумента.Идентификатор) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.Идентификатор, "SENDER");
	Иначе		
		//Пока так, Идентификатор аттики
		ЗаписатьXML(ЗаписьXML, "9864066893447", "SENDER");
	КонецЕсли;
	//Если ПустаяСтрока(СтруктураДокумента.SENDER) Тогда
	//	ЗаписатьXML(ЗаписьXML, Параметры.ОрганизацияGLN, "SENDER");
	//Иначе
	//	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.SENDER, "SENDER");
	//КонецЕсли;
	//
	//RECIPIENT
	Если ПустаяСтрока(СтруктураДокумента.RECIPIENT) Тогда
		ЗаписатьXML(ЗаписьXML, Параметры.КонтрагентGLN, "RECIPIENT");
	Иначе
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.RECIPIENT, "RECIPIENT");
	КонецЕсли;
	
	//EDIINTERCHANGEID
	
	Если СтруктураДокумента.Свойство("EDIINTERCHANGEID") И ЗначениеЗаполнено(СтруктураДокумента.EDIINTERCHANGEID) Тогда
		ЗаписатьXML(ЗаписьXML, СтруктураДокумента.EDIINTERCHANGEID, "EDIINTERCHANGEID");
	КонецЕсли;

			
	Для Каждого ТекСтрока Из СтруктураДокумента.POSITION Цикл 
		//POSITION
		ЗаписьXML.ЗаписатьНачалоЭлемента("POSITION");//POSITION
		
		//POSITIONNUMBER
		ЗаписатьXML(ЗаписьXML, ТекСтрока.POSITIONNUMBER, "POSITIONNUMBER");
		
		//PRODUCT
		ЗаписатьXML(ЗаписьXML, ТекСтрока.PRODUCT, "PRODUCT");
		//
		//PRODUCTIDSUPPLIER
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("PRODUCTIDSUPPLIER") = Неопределено И ЗначениеЗаполнено(ТекСтрока.PRODUCTIDSUPPLIER) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.PRODUCTIDSUPPLIER, "PRODUCTIDSUPPLIER");
		КонецЕсли;
		
		//PRODUCTIDBUYER
		Если  НЕ СтруктураДокумента.POSITION.Колонки.Найти("PRODUCTIDBUYER") = Неопределено И ЗначениеЗаполнено(ТекСтрока.PRODUCTIDBUYER) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.PRODUCTIDBUYER, "PRODUCTIDBUYER");
		КонецЕсли;
		
		//ORDEREDQUANTITY
		ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDEREDQUANTITY, "ORDEREDQUANTITY");
		
		//QUANTITYOFCUINTU
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("QUANTITYOFCUINTU") = Неопределено И ЗначениеЗаполнено(ТекСтрока.QUANTITYOFCUINTU) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.QUANTITYOFCUINTU, "QUANTITYOFCUINTU");
		КонецЕсли;
		
		//ORDEREDUNIT  ->  ORDERUNIT
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("ORDERUNIT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.ORDERUNIT) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDERUNIT, "ORDERUNIT");
		КонецЕсли;
	
		//ORDERPRICE
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("ORDERPRICE") = Неопределено И ЗначениеЗаполнено(ТекСтрока.ORDERPRICE) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDERPRICE, "ORDERPRICE");
		КонецЕсли;
		
		//PRICEWITHVAT
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("PRICEWITHVAT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.PRICEWITHVAT) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.PRICEWITHVAT, "PRICEWITHVAT");
		КонецЕсли;
		
		//VAT
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("VAT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.VAT) Тогда
			ЗаписатьXML(ЗаписьXML, ТекСтрока.VAT, "VAT");
		КонецЕсли;
		
		//
		////ORDERPRICEUNIT
		//Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("ORDERPRICEUNIT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.ORDERPRICEUNIT) Тогда
		//	ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDERPRICEUNIT, "ORDERPRICEUNIT");
		//КонецЕсли;
		
		Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("DESCRIPTION") = Неопределено И ЗначениеЗаполнено(ТекСтрока.DESCRIPTION) Тогда
			//CHARACTERISTIC
			ЗаписьXML.ЗаписатьНачалоЭлемента("CHARACTERISTIC");//CHARACTERISTIC
			//DESCRIPTION
			ЗаписатьXML(ЗаписьXML, ТекСтрока.DESCRIPTION, "DESCRIPTION");
			ЗаписьXML.ЗаписатьКонецЭлемента();//CHARACTERISTIC
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//POSITION
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//HEAD
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //ORDERS

КонецПроцедуры

Процедура СформироватьXML_ORDERS_COMARCH(ЗаписьXML,Параметры,СтруктураДокумента)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Document-Order");//Document-Order
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Order-Header");//Order-Header
			//OrderNumber
			ЗаписатьXML(ЗаписьXML, СтруктураДокумента.NUMBER, "OrderNumber");
			//OrderDate
			ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DATE, "OrderDate");
			//ExpectedDeliveryDate
			ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYDATE, "ExpectedDeliveryDate");
			//ExpectedDeliveryTime
			Если СтруктураДокумента.Свойство("DELIVERYTIME") И ЗначениеЗаполнено(СтруктураДокумента.DELIVERYTIME) Тогда
				ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYTIME, "ExpectedDeliveryTime");
			КонецЕсли;
			//Currency
			Если СтруктураДокумента.Свойство("CURRENCY") И ЗначениеЗаполнено(СтруктураДокумента.CURRENCY) Тогда
				ЗаписатьXML(ЗаписьXML, СтруктураДокумента.CURRENCY, "Currency");
			КонецЕсли;
			ЗаписатьXML(ЗаписьXML, "O", "DocumentFunctionCode");
			//Remarks
			Если СтруктураДокумента.Свойство("INFO") И ЗначениеЗаполнено(СтруктураДокумента.INFO) Тогда
				ЗаписатьXML(ЗаписьXML, СтруктураДокумента.INFO, "Remarks");
			КонецЕсли;
			
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Order-Header
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Order-Parties");//Order-Parties
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("Buyer");//Buyer
				//BUYER
				Если СтруктураДокумента.Свойство("Идентификатор") И ЗначениеЗаполнено(СтруктураДокумента.Идентификатор) Тогда
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.Идентификатор, "ILN");
				ИначеЕсли ПустаяСтрока(СтруктураДокумента.BUYER) Тогда
					ЗаписатьXML(ЗаписьXML, Параметры.ОрганизацияGLN, "ILN");
				Иначе
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.BUYER, "ILN");
				КонецЕсли;

			ЗаписьXML.ЗаписатьКонецЭлемента(); //Buyer

			ЗаписьXML.ЗаписатьНачалоЭлемента("Seller");//Seller
			
				//ILN
				Если ПустаяСтрока(СтруктураДокумента.SUPPLIER) Тогда
					ЗаписатьXML(ЗаписьXML, Параметры.КонтрагентGLN, "ILN");
				Иначе	
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.SUPPLIER, "ILN");
				КонецЕсли;
				//CodeByBuyer
				Если СтруктураДокумента.Свойство("ПоставщикОКПО") И ЗначениеЗаполнено(СтруктураДокумента.ПоставщикОКПО) Тогда
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.ПоставщикОКПО, "CodeByBuyer");
				КонецЕсли;

			ЗаписьXML.ЗаписатьКонецЭлемента(); //Seller

		   	ЗаписьXML.ЗаписатьНачалоЭлемента("DeliveryPoint");//DeliveryPoint
				//DELIVERYPLACE
				Если СтруктураДокумента.Свойство("DELIVERYPLACE") И ЗначениеЗаполнено(СтруктураДокумента.DELIVERYPLACE) Тогда
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.DELIVERYPLACE, "ILN");
				КонецЕсли;
				//DeliveryPlace
				Если СтруктураДокумента.Свойство("ТорговаяПлощадкаПолучатель") И ЗначениеЗаполнено(СтруктураДокумента.ТорговаяПлощадкаПолучатель) Тогда
					ЗаписатьXML(ЗаписьXML, Строка(СтруктураДокумента.ТорговаяПлощадкаПолучатель), "DeliveryPlace");
				КонецЕсли;

			ЗаписьXML.ЗаписатьКонецЭлемента(); //DeliveryPoint
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Invoicee");//Invoicee
			     //BUYER
				Если ПустаяСтрока(СтруктураДокумента.BUYER) Тогда
					ЗаписатьXML(ЗаписьXML, Параметры.ОрганизацияGLN, "ILN");
				Иначе
					ЗаписатьXML(ЗаписьXML, СтруктураДокумента.BUYER, "ILN");
				КонецЕсли;

			ЗаписьXML.ЗаписатьКонецЭлемента(); //Invoicee

		ЗаписьXML.ЗаписатьКонецЭлемента(); //Order-Parties
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Order-Lines");//Order-Lines
		  	ВсегоСтрок = 0;
			Для Каждого ТекСтрока Из СтруктураДокумента.POSITION Цикл 
				 ВсегоСтрок = ВсегоСтрок +1;
				 ЗаписьXML.ЗаписатьНачалоЭлемента("Line");//Line
				 ЗаписьXML.ЗаписатьНачалоЭлемента("Line-Item");//Line-Item

				//LineNumber
				ЗаписатьXML(ЗаписьXML, ТекСтрока.POSITIONNUMBER, "LineNumber");
				//EAN
				ЗаписатьXML(ЗаписьXML, ТекСтрока.PRODUCT, "EAN");
				//BuyerItemCode
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("PRODUCTIDBUYER") = Неопределено И ЗначениеЗаполнено(ТекСтрока.PRODUCTIDBUYER) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.PRODUCTIDBUYER, "BuyerItemCode");
				КонецЕсли;
				 //ItemDescription
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("DESCRIPTION") = Неопределено И ЗначениеЗаполнено(ТекСтрока.DESCRIPTION) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.DESCRIPTION, "ItemDescription");
				КонецЕсли;
				//OrderedQuantity
				ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDEREDQUANTITY, "OrderedQuantity");
				
				//OrderedUnitPacksize
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("QUANTITYOFCUINTU") = Неопределено И ЗначениеЗаполнено(ТекСтрока.QUANTITYOFCUINTU) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.QUANTITYOFCUINTU, "OrderedUnitPacksize");
				КонецЕсли;
				
				//UnitOfMeasure
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("ORDERUNIT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.ORDERUNIT) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDERUNIT, "UnitOfMeasure");
				КонецЕсли;
				

				//OrderedUnitNetPrice
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("ORDERPRICE") = Неопределено И ЗначениеЗаполнено(ТекСтрока.ORDERPRICE) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.ORDERPRICE, "OrderedUnitNetPrice");
				КонецЕсли;
				
				////ORDERPRICE
				//Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("PRICEWITHVAT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.PRICEWITHVAT) Тогда
				//	ЗаписатьXML(ЗаписьXML, ТекСтрока.PRICEWITHVAT, "PRICEWITHVAT");
				//КонецЕсли;
				
				//VAT
				Если НЕ СтруктураДокумента.POSITION.Колонки.Найти("VAT") = Неопределено И ЗначениеЗаполнено(ТекСтрока.VAT) Тогда
					ЗаписатьXML(ЗаписьXML, ТекСтрока.VAT, "TaxRate");
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьКонецЭлемента();//Line
				ЗаписьXML.ЗаписатьКонецЭлемента();//Line-Item
				
			КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Order-Lines
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Order-Summary");//Order-Summary
		      ЗаписатьXML(ЗаписьXML, Формат(ВсегоСтрок,"ЧЦ=10; ЧГ="), "TotalLines");
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Order-Summary
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Document-Order
	
КонецПроцедуры


Процедура СформироватьXML_DESADV_EXITE(ЗаписьXML,Параметры)
	
	СтруктураДокумента = Параметры.СтруктураДокумента;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DESADV");//DESADV
	
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.NUMBER,"NUMBER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DATE,"DATE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYDATE,"DELIVERYDATE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.ORDERNUMBER,"ORDERNUMBER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.ORDERDATE,"ORDERDATE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYNOTENUMBER,"DELIVERYNOTENUMBER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYNOTEDATE,"DELIVERYNOTEDATE");
	
	
	//HEAD
	ЗаписьXML.ЗаписатьНачалоЭлемента("HEAD");//HEAD
	
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.SUPPLIER,"SUPPLIER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.BUYER,"BUYER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYPLACE,"DELIVERYPLACE");
		//Пока так, Идентификатор аттики Дистрибуция
	//ЗаписатьXML(ЗаписьXML, "9864232378839", "SENDER");

	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.SUPPLIER,"SENDER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.RECIPIENT,"RECIPIENT");
	
	//PACKINGSEQUENCE 
	ЗаписьXML.ЗаписатьНачалоЭлемента("PACKINGSEQUENCE");//PACKINGSEQUENCE
	
	//HIERARCHICALID 
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.HIERARCHICALID,"HIERARCHICALID");
	
	Для Каждого ТекСтрока Из СтруктураДокумента.POSITION Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("POSITION");//POSITION
		ЗаписатьXML(ЗаписьXML,ТекСтрока.POSITIONNUMBER,"POSITIONNUMBER");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRODUCT,"PRODUCT");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRODUCTIDSUPPLIER,"PRODUCTIDSUPPLIER"); 
		ЗаписатьXML(ЗаписьXML,ТекСтрока.DELIVEREDQUANTITY,"DELIVEREDQUANTITY");
		
		Если ЗначениеЗаполнено(ТекСтрока.ADVICEPRICE) Тогда
			ЗаписатьXML(ЗаписьXML,ТекСтрока.ADVICEPRICE,"ADVICEPRICE");
		КонецЕсли;
		
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRICEWITHVAT,"PRICEWITHVAT"); 
		ЗаписатьXML(ЗаписьXML,ТекСтрока.DESCRIPTION,"DESCRIPTION");
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//POSITION
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PACKINGSEQUENCE
	ЗаписьXML.ЗаписатьКонецЭлемента();//HEAD
	ЗаписьXML.ЗаписатьКонецЭлемента(); //DESADV

КонецПроцедуры

Процедура СформироватьXML_ORDRSP_EXITE(ЗаписьXML,Параметры)
	
	СтруктураДокумента = Параметры.СтруктураДокумента;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDRSP");//ORDRSP
	
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.NUMBER,"NUMBER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DATE,"DATE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.TIME,"TIME");

	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.ORDERNUMBER,"ORDERNUMBER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.ORDERDATE,"ORDERDATE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYDATE,"DELIVERYDATE");

	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.CURRENCY,"CURRENCY");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.ACTION,"ACTION");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DOCTYPE,"DOCTYPE");

	
	//HEAD
	ЗаписьXML.ЗаписатьНачалоЭлемента("HEAD");//HEAD
	
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.BUYER,"BUYER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.SUPPLIER,"SUPPLIER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.DELIVERYPLACE,"DELIVERYPLACE");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.INVOICEPARTNER,"INVOICEPARTNER");

		//Пока так, Идентификатор аттики Дистрибуция
//	ЗаписатьXML(ЗаписьXML, "9864232378839", "SENDER");
	ЗаписатьXML(ЗаписьXML, СтруктураДокумента.SUPPLIER, "SENDER");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.RECIPIENT,"RECIPIENT");
	ЗаписатьXML(ЗаписьXML,СтруктураДокумента.EDIINTERCHANGEID,"EDIINTERCHANGEID");
	
	Для Каждого ТекСтрока Из СтруктураДокумента.POSITION Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("POSITION");//POSITION
		
		ЗаписатьXML(ЗаписьXML,ТекСтрока.POSITIONNUMBER,"POSITIONNUMBER");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRODUCT,"PRODUCT");
		ЗаписатьXML(ЗаписьXML,"","PRODUCTIDBUYER");

		ЗаписатьXML(ЗаписьXML,ТекСтрока.ORDRSPUNIT,"ORDRSPUNIT");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.DESCRIPTION,"DESCRIPTION");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRICE,"PRICE");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRICEWITHVAT,"PRICEWITHVAT");
		ЗаписатьXML(ЗаписьXML,ТекСтрока.VAT,"VAT");
		
		ЗаписатьXML(ЗаписьXML,ТекСтрока.PRODUCTTYPE,"PRODUCTTYPE");
		
		ЗаписатьXML(ЗаписьXML,ТекСтрока.ORDEREDQUANTITY,"ORDEREDQUANTITY"); 
		ЗаписатьXML(ЗаписьXML,ТекСтрока.ACCEPTEDQUANTITY,"ACCEPTEDQUANTITY");
		
		ЗаписьXML.ЗаписатьКонецЭлемента();//POSITION
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента();//HEAD
	ЗаписьXML.ЗаписатьКонецЭлемента(); //

КонецПроцедуры


Функция СформироватьXMLФайлыДокументов(МассивОбъектовДляВыгрузки, ПараметрыОбмена, ДопПараметры = "") Экспорт
	
	МассивСтруктурВозврата = Новый Массив;
	СтруктураВидовЭД = Новый Соответствие;
	
	Для Каждого ТекЭлемент Из МассивОбъектовДляВыгрузки Цикл
		ВидЭД = "";
		Если НЕ ЗначениеЗаполнено(ДопПараметры) ИЛИ НЕ ДопПараметры.Свойство("ВидЭД", ВидЭД) Тогда
			ПараметрыЭД = ПараметрыОбмена.Получить(ТекЭлемент.Ссылка);
			ПараметрыЭД.Свойство("ВидЭД", ВидЭД);
		КонецЕсли;
	
		МассивОбъектовПоВидуЭД = СтруктураВидовЭД.Получить(ВидЭД);
		Если МассивОбъектовПоВидуЭД = Неопределено Тогда
			МассивОбъектовПоВидуЭД = Новый Массив;
		КонецЕсли;
		МассивОбъектовПоВидуЭД.Добавить(ТекЭлемент);
		СтруктураВидовЭД.Вставить(ВидЭД, МассивОбъектовПоВидуЭД);
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из СтруктураВидовЭД Цикл
		СформироватьXMLФайл(ТекЭлемент, МассивСтруктурВозврата, ПараметрыОбмена, ДопПараметры);
	КонецЦикла;
	
	Возврат МассивСтруктурВозврата;

	
КонецФункции

Процедура СформироватьXMLФайл(ТекЭлемент, МассивСтруктурВозврата, ПараметрыОбмена, ДопПараметры)

	МассивОбъектовДляВыгрузки = ТекЭлемент.Значение;
	
	Для Каждого ОбъектДляВыгрузки Из МассивОбъектовДляВыгрузки Цикл
		
		НастройкиОбмена = ПараметрыОбмена.Получить(ОбъектДляВыгрузки);
		
		Если Не ЗначениеЗаполнено(НастройкиОбмена) Тогда
			Продолжить
		КонецЕсли;

		 УстановитьНовуюВерсиюДокументаEDI(ОбъектДляВыгрузки,,Истина);
		
		 Если ТекЭлемент.Ключ = Справочники.ХозОперации.РеализацияТоваров ИЛИ ТекЭлемент.Ключ = Справочники.ХозОперации.РеализацияТоваровРозница 
				 ИЛИ ТекЭлемент.Ключ = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда
			 Результат = СформироватьРеализациюТоваровПоДкументу(ОбъектДляВыгрузки,НастройкиОбмена);
		ИначеЕсли ТекЭлемент.Ключ = Справочники.ХозОперации.ПоступлениеТоваров ИЛИ	ТекЭлемент.Ключ = Справочники.ХозОперации.ПоступлениеТоваровТранзиты Тогда 
			 Результат = СформироватьCOMDOCПоступлениеТоваровПоДкументу(ОбъектДляВыгрузки,НастройкиОбмена);
		 ИначеЕсли ТекЭлемент.Ключ = Справочники.ХозОперации.РезервированиеПокупателя Тогда
			 Результат = СформироватьПодтверждениеЗаказаПоДокументу(ОбъектДляВыгрузки,НастройкиОбмена);
 
		 Иначе
			 Результат = Неопределено;
		 КонецЕсли;
		 
		 
		 
		//
		Если ЗначениеЗаполнено(Результат) Тогда
			
			МассивСтруктурВозврата.Добавить(Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	

	
КонецПроцедуры

Функция ПолучитьСтруктуруДокумента_COMARCH_DESADV(СообщениеОбъект,Дерево,ОшибкиДокумента) 
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен",1);
	СтруктураДокумента.Вставить("УчетнаяЗаписьEDI",СообщениеОбъект.УчетнаяЗаписьEDI);
	СтруктураДокумента.Вставить("Провайдер",СообщениеОбъект.Провайдер);
	
	Попытка
		
		//Определяем реквизиты документа
		Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "Document-DespatchAdvice");
		
		Если НЕ Узел = Неопределено Тогда
			СтрокаДерева = Узел.Строки;
		Иначе
			ОшибкиДокумента.ДобавитьСтроку("Файл не является DESADV-файлом!");
			СтруктураДокумента.Вставить("ДокументКорректен",0);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
				
		УзелHeader =  ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Header");
		Если Не УзелHeader = Неопределено Тогда
			СтрокиHeader = 	УзелHeader.Строки;
		Иначе
			ОшибкиДокумента.ДобавитьСтроку("Нет обязательного узла DespatchAdvice-Header");
			СтруктураДокумента.Вставить("ДокументКорректен",0);
			Возврат СтруктураДокумента;
		КонецЕсли;

		
		УзелParties =  ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Parties");
		Если Не УзелParties = Неопределено Тогда
			СтрокиParties = 	УзелParties.Строки;
		Иначе
			ОшибкиДокумента.ДобавитьСтроку("Нет обязательного узла DespatchAdvice-Parties");
			СтруктураДокумента.Вставить("ДокументКорректен",0);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		
		Рез =  ОбработатьПоле("DespatchAdviceNumber",СтруктураДокумента,СтрокиHeader,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DespatchAdviceDate",СтруктураДокумента,СтрокиHeader,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("EstimatedDeliveryDate",СтруктураДокумента,СтрокиHeader,"DESADV",ОшибкиДокумента);


		
		Рез =  ОбработатьПоле("Buyer",СтруктураДокумента,СтрокиParties,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("Seller",СтруктураДокумента,СтрокиParties,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DeliveryPoint",СтруктураДокумента,СтрокиParties,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("UltimateConsignee",СтруктураДокумента,СтрокиParties,"DESADV",ОшибкиДокумента);
		
		Рез =  ОбработатьПоле("OrderDate",СтруктураДокумента,СтрокиHeader,"DESADV",ОшибкиДокумента);	
		Рез =  ОбработатьПоле("BuyerOrderNumber",СтруктураДокумента,СтрокиHeader,"DESADV",ОшибкиДокумента);
		
			
		Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
			
			ТекстЗапроса = 	"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			|ИЗ
			|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			|ГДЕ
			|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			|	И ПоступлениеТоваров.Контрагент = &Контрагент
			|	И ПоступлениеТоваров.ВхДокДата МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			|	И ПоступлениеТоваров.ВхДокНомер = &НомерВходящегоДокумента";
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("НачДатаВходящегоДокумента", СтруктураДокумента.Датапоставки-60*60*24*14);
			Запрос.УстановитьПараметр("КонДатаВходящегоДокумента", СтруктураДокумента.Датапоставки+60*60*24*14);
			
			Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтруктураДокумента.НомерНакладной);
			Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				СтруктураДокумента.Вставить("ПредварительныйДокумент", Документы.ПоступлениеТоваров.ПустаяСсылка());
			Иначе
				Выборка =РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				СтруктураДокумента.Вставить("ПредварительныйДокумент", Выборка.ПредварительныйДокумент);
			КонецЕсли;
		КонецЕсли;
		
		Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Lines");
		Если Узел = Неопределено Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DespatchAdvice-Lines""",СтруктураДокумента,ОшибкиДокумента);
			Возврат СтруктураДокумента;
		Иначе
			ТабличнаяЧасть = Узел.Строки;
		КонецЕсли;
		
		ДокументТЧ = ПолучитьТаблицуТоваров("DESADV");	
		
		СписокШтрихКодов = Новый СписокЗначений;
		
		Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
			
			СтрокаДереваLineItem	= ПолучитьУзелДерева(Узел.Строки, "Строка", "Line-Item");
			
			СтрокаДерева = СтрокаДереваLineItem.Строки;
			НоваяСтрокаТЧ = ДокументТЧ.Добавить();
			Рез =  ОбработатьПолеТабличнойЧасти("LineNumber",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("EAN",НоваяСтрокаТЧ,СтрокаДерева,"DESADV"); 
			Рез =  ОбработатьПолеТабличнойЧасти("BuyerItemCode",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("QuantityOrdered",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("QuantityDespatched",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("UnitOfMeasure",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("UnitGrossPrice",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");   //TAXRATE
			Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			
			Рез =  ОбработатьПолеТабличнойЧасти("ItemDescription",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
				СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
			КонецЕсли;
			
		КонецЦикла;
		
		//
		
		Если СтруктураДокумента.ДокументКорректен = 1 Тогда
			ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов);
			СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
			ПроверитьТаблицуТоваров(СтруктураДокумента,ОшибкиДокумента);

		КонецЕсли;	
		
	Исключение
		ДобавитьОшибкуВСтруктуруДокумента("Ошибка инициализации данных загрузки "+Символы.ПС+ОписаниеОшибки(),СтруктураДокумента,ОшибкиДокумента);
	КонецПопытки;
	
	Возврат СтруктураДокумента;	
	
КонецФункции

Функция ПолучитьСтруктуруДокумента_EXITE_DESADV(СообщениеОбъект,Дерево,ОшибкиДокумента) 
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен",1);
	СтруктураДокумента.Вставить("УчетнаяЗаписьEDI",СообщениеОбъект.УчетнаяЗаписьEDI);
	СтруктураДокумента.Вставить("Провайдер",СообщениеОбъект.Провайдер);
	
	
	Попытка
		
		//Определяем реквизиты документа
		Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "DESADV");
		
		Если НЕ Узел = Неопределено Тогда
			СтрокаДерева = Узел.Строки;
		Иначе
			ОшибкиДокумента.ДобавитьСтроку("Файл не является DESADV-файлом!");
			СтруктураДокумента.Вставить("ДокументКорректен",0);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		Рез =  ОбработатьПоле("DATE",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("NUMBER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DELIVERYDATE",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("ORDERDATE",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);	
		Рез =  ОбработатьПоле("ORDERNUMBER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DELIVERYNOTENUMBER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DELIVERYNOTEDATE",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		
		
		
		//HEAD
		Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
		Если НЕ Узел = Неопределено Тогда
			СтрокаДерева = Узел.Строки;
		Иначе
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""HEAD""",СтруктураДокумента,ОшибкиДокумента);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		
		Рез =  ОбработатьПоле("BUYER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("SUPPLIER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("DELIVERYPLACE",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("SENDER",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		Рез =  ОбработатьПоле("EDIINTERCHANGEID",СтруктураДокумента,СтрокаДерева,"DESADV",ОшибкиДокумента);
		
		
		Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
			
			ТекстЗапроса = 	"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			|ИЗ
			|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			|ГДЕ
			|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			|	И ПоступлениеТоваров.Контрагент = &Контрагент
			|	И ПоступлениеТоваров.ВхДокДата МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			|	И ПоступлениеТоваров.ВхДокНомер = &НомерВходящегоДокумента";
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("НачДатаВходящегоДокумента", СтруктураДокумента.Датапоставки-60*60*24*14);
			Запрос.УстановитьПараметр("КонДатаВходящегоДокумента", СтруктураДокумента.Датапоставки+60*60*24*14);
			
			Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтруктураДокумента.НомерНакладной);
			Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				СтруктураДокумента.Вставить("ПредварительныйДокумент", Документы.ПоступлениеТоваров.ПустаяСсылка());
			Иначе
				Выборка =РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				СтруктураДокумента.Вставить("ПредварительныйДокумент", Выборка.ПредварительныйДокумент);
				ДобавитьОшибкуВСтруктуруДокумента("Документ уже загружен "+Строка(Выборка.ПредварительныйДокумент),СтруктураДокумента,ОшибкиДокумента);
			КонецЕсли;
		КонецЕсли;
		
		
		
		Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "PACKINGSEQUENCE");
		Если Узел = Неопределено Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""PACKINGSEQUENCE""",СтруктураДокумента,ОшибкиДокумента);
			Возврат СтруктураДокумента;
		Иначе
			СтрокаДерева = Узел.Строки;
		КонецЕсли;
		
		// Табличная часть
		ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION");
		Если ТабличнаяЧасть = Неопределено Тогда
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""POSITION""",СтруктураДокумента,ОшибкиДокумента);
			Возврат СтруктураДокумента;
		КонецЕсли;
		
		
		
		ДокументТЧ = ПолучитьТаблицуТоваров("DESADV");	
		
		СписокШтрихКодов = Новый СписокЗначений;
		
		Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
			
			СтрокаДерева = Узел.Строки;
			НоваяСтрокаТЧ = ДокументТЧ.Добавить();
			Рез =  ОбработатьПолеТабличнойЧасти("POSITIONNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("PRODUCT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDSUPPLIER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDBUYER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("DELIVEREDUNIT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("ORDEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("DELIVEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");   //TAXRATE
			Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("DESCRIPTION",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			
			Рез =  ОбработатьПолеТабличнойЧасти("COUNTRYORIGIN",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("CUSTOMSTARIFFNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
			Рез =  ОбработатьПолеТабличнойЧасти("ADVICEPRICE",НоваяСтрокаТЧ,СтрокаДерева,"DESADV"); // МРЦ
			
			Если СтрокаДерева.Найти("ORDEREDQUANTITY", "Элемент", Ложь) <> Неопределено Тогда
				НоваяСтрокаТЧ.КоличествоРасхождение = НоваяСтрокаТЧ.КоличествоВЗаказе-НоваяСтрокаТЧ.Количество;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
				СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
			КонецЕсли;
			
		КонецЦикла;
		
		
		//Если СтруктураДокумента.ДокументКорректен = 1 Тогда
			ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов);
			СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
			ПроверитьТаблицуТоваров(СтруктураДокумента,ОшибкиДокумента);
		//КонецЕсли;	
		
	Исключение
		ДобавитьОшибкуВСтруктуруДокумента("Ошибка инициализации данных загрузки "+Символы.ПС+ОписаниеОшибки(),СтруктураДокумента,ОшибкиДокумента);
		
	КонецПопытки;
	
	Возврат СтруктураДокумента;	

	
КонецФункции

Функция ПолучитьСтруктуруДокумента_EXITE_ORDER(СообщениеОбъект,Дерево,ОшибкиДокумента)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен",1);
	СтруктураДокумента.Вставить("УчетнаяЗаписьEDI",СообщениеОбъект.УчетнаяЗаписьEDI);
	СтруктураДокумента.Вставить("Провайдер",СообщениеОбъект.Провайдер);

	
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "ORDER");
	
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ДобавитьОшибкуВСтруктуруДокумента("Файл не является ORDER-файлом!",СтруктураДокумента,ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
	Рез =  ОбработатьПоле("DATE",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("NUMBER",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
//	Рез =  ОбработатьПоле("ORDERDATE",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("DELIVERYDATE",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("CURRENCY",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
//	Рез =  ОбработатьПоле("VAT",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);


	
	
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""HEAD""",СтруктураДокумента,ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;

	
	Рез =  ОбработатьПоле("BUYER",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("SUPPLIER",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("DELIVERYPLACE",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("SENDER",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);
	Рез =  ОбработатьПоле("RECIPIENT",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);	
	Рез =  ОбработатьПоле("EDIINTERCHANGEID",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);	
//	Рез =  ОбработатьПоле("ACTION",СтруктураДокумента,СтрокаДерева,"ORDER",ОшибкиДокумента);		
	
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION");
	Если ТабличнаяЧасть = Неопределено Тогда
		
		ДобавитьОшибкуВСтруктуруДокумента("Нет табличной части поле ""POSITION""",СтруктураДокумента,ОшибкиДокумента);
		
		Возврат СтруктураДокумента;
		
	КонецЕсли;
	
	
	
	Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК ВходящийДокумент
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЗаказПокупателя.ИДДокументаОтгрузки = &ИДДокументаОтгрузки
		|	И ЗаказПокупателя.ДатаСоздания = &ДатаСоздания";
		
		Запрос.УстановитьПараметр("ИДДокументаОтгрузки", СтруктураДокумента.НомерДокумента);
		Запрос.УстановитьПараметр("ДатаСоздания", НачалоДня(СтруктураДокумента.ДатаДокумента));
		Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);

		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ЗаказПокупателя.ПустаяСсылка());
		Иначе
			Выборка =РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("ВходящийДокумент", Выборка.ВходящийДокумент);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ЗаказПокупателя.ПустаяСсылка());
	КонецЕсли;

	//
	ДокументТЧ = ПолучитьТаблицуТоваров("ORDER");	
	//
	СписокШтрихКодов = Новый СписокЗначений;
	
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
		СтрокаДерева = Узел.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		Рез =  ОбработатьПолеТабличнойЧасти("POSITIONNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDBUYER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDSUPPLIER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDERUNIT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("DESCRIPTION",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTTYPE",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("ACCEPTEDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("INFO",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
			СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
		КонецЕсли;
		
	КонецЦикла;

	Если СтруктураДокумента.ДокументКорректен = 1 Тогда
	   ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов,"ORDER");
	   ЗаполнитьНоменклатуруПоставщика(ДокументТЧ,СтруктураДокумента.Контрагент);
	   ПроверитьТЧ_ТоварыДокумента(ДокументТЧ,СтруктураДокумента,ОшибкиДокумента);
	   Если ЗначениеНастроекПовтИсп.ДоступноРазделениеТоваровПоОрганизациям(СтруктураДокумента.ТорговаяПлощадка) Тогда
		   
		   МассивТоваровПроверки = ДокументТЧ.ВыгрузитьКолонку("Номенклатура");
		   СписокТоварОрганизация = РегистрыСведений.ТК_РазделениеНоменклатурыПоОрганизациям.ПолучитьОрганизациюСпискаНоменклатуры(СтруктураДокумента.Организация,МассивТоваровПроверки,СтруктураДокумента.ТорговаяПлощадка);
		   МассивДляУдаления = Новый Массив;
		   Для Каждого стТовар Из ДокументТЧ Цикл 
			   Если Не ЗначениеЗаполнено(стТовар.Номенклатура) Тогда
				   Продолжить;
			   КонецЕсли;
			   
			   Если СтруктураДокумента.Организация <> СписокТоварОрганизация.Получить(стТовар.Номенклатура).Организация Тогда
				   МассивДляУдаления.Добавить(стТовар);
				   ДобавитьОшибкуВСтруктуруДокумента("не соответствие организации документа и организации товара "+Строка(стТовар.Номенклатура),СтруктураДокумента,ОшибкиДокумента,Ложь);
			   КонецЕсли;
		   КонецЦикла;
		   Для Каждого стрУд из МассивДляУдаления Цикл 
			   ДокументТЧ.Удалить(стрУд);
		   КонецЦикла;
		   
	   КонецЕсли;
	   
	   
	   СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	КонецЕсли;	
			
	Возврат СтруктураДокумента;	
КонецФункции




#КонецОбласти


Процедура СформироватьНовыйФайлОбмена(СообщениеОбмена)Экспорт
	
	ТипДокумента = ТипЗнч(СообщениеОбмена);
	Если ТипДокумента = Тип("ДокументСсылка.ТК_СообщениеEDIИсходящие") И СообщениеОбмена.ВидСообщения = Перечисления.ВидыСообщенийEDI.ORDER Тогда
		Если ЗначениеЗаполнено(СообщениеОбмена.ДокументОснование) И ЗначениеЗаполнено(СообщениеОбмена.ТорговаяПлощадкаПолучатель) Тогда
			МассивДокументов = Документы.ЗаказПоставщику.СвормироватьСтруктуру_ORDER(СообщениеОбмена.ДокументОснование,СообщениеОбмена.ТорговаяПлощадкаПолучатель);
			Если МассивДокументов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			СтруктураДокумента = МассивДокументов[0];
			Параметры = Новый Структура("ПоставщикEDI,ОрганизацияGLN,КонтрагентGLN",СообщениеОбмена.Провайдер,СообщениеОбмена.ОтправительGLN,СообщениеОбмена.ПолучательGLN);
			ФайлВыгрузкиXML =  ЗаписатьФайлORDERS(Параметры,СтруктураДокумента);
			ФайлORDERS = Новый Файл(ФайлВыгрузкиXML);
			Если Не ФайлВыгрузкиXML.ВсеОК Тогда
				Возврат;
			КОнецЕсли;
			
			//Если НЕ ФайлORDERS.Существует() тогда
			//	Возврат;
			//КонецЕсли;
			
			НачатьТранзакцию();

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ТК_СообщениеEDIИсходящие");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СообщениеОбмена);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ИсходящийДокумент = СообщениеОбмена.ПолучитьОбъект();

			ИсходящийДокумент.ТекущийСтатус	= Перечисления.СтатусыДокументовEDI.Создан;
			
			//ЧтениеТД = Новый ТекстовыйДокумент;
			//ЧтениеТД.Прочитать(ФайлВыгрузкиXML);
			//ТекстXML = ЧтениеТД.ПолучитьТекст();
			ИсходящийДокумент.Сообщение		 		= ФайлВыгрузкиXML.ТекстXML;
			ИсходящийДокумент.ИмяФайлаСообщения		= ФайлВыгрузкиXML.ФайлИмя;
			ИсходящийДокумент.ТорговаяПлощадкаПолучательGLN = СтруктураДокумента.DELIVERYPLACE;
			ИсходящийДокумент.ФайлСообщения         = ФайлВыгрузкиXML.Файл;//Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлВыгрузкиXML),Новый СжатиеДанных(9));

			
			
			НоваяСтрока = ИсходящийДокумент.СтатусыСообщения.Добавить();
			НоваяСтрока.Период = ТекущаяДатаСеанса();
			НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
			НоваяСтрока.Статус = Перечисления.СтатусыДокументовEDI.Создан;
			НоваяСтрока.ИмяДокумента = ФайлВыгрузкиXML.ФайлИмя;
			НоваяСтрока.Расширение   = ФайлВыгрузкиXML.ФайлТип;
			НоваяСтрока.Документ     = ФайлВыгрузкиXML.Файл;
			
			ИсходящийДокумент.Записать();
			ЗафиксироватьТранзакцию();
			
			//УдалитьФайлы(ФайлВыгрузкиXML);

		КонецЕсли;
	ИначеЕсли  ТипДокумента = Тип("ДокументСсылка.ТК_СообщениеEDIИсходящие") И СообщениеОбмена.ВидСообщения = Перечисления.ВидыСообщенийEDI.DESADV Тогда
	     	МассивДокументов = Документы.РеализацияТоваров.СформироватьСтруктуру_DESADV(СообщениеОбмена.ДокументОснование);
			Если МассивДокументов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры





Процедура ОтправкаFTPСообщенийПровайдеровЕDI(МассивДокументов=Неопределено)Экспорт
	
	Если МассивДокументов = Неопределено Тогда
		МассивДокументов = ПолучитьМассивДокументовДляОтправки();
	Иначе
		ПроверитьМассивДокументовДляОтправки(МассивДокументов);
	КонецЕсли;
	
	ВсегоДокументов = МассивДокументов.Количество();
	ОтправленоДокументов = 0;	
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ОтправкаFTPСообщенийEDI";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;

	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки. Документов на выгрузку = " + Формат(ВсегоДокументов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);

	Для Каждого ДокументСсылка Из МассивДокументов Цикл 
		
		рез =  ОтправитьСообщениеFTP(ДокументСсылка);
		
		Если Не рез.СообщениеОтправлено Тогда
	
			РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
			РезультатыВыполнения.ДобавитьКомментарий(Рез.Ошибки.ПолучитьТекст(), СтруктураЗаписиЖурнала);

		Иначе
			ОтправленоДокументов = ОтправленоДокументов +1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий( "Завершено. Отправлено " + Формат(ОтправленоДокументов,"ЧН=0; ЧГ=") + "  сообщений.", СтруктураЗаписиЖурнала);
	
	Попытка // нужно зафиксировать результат импорта, уже окончательный
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Истина);
	Исключение
		//
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузкаFTPСобщенийEDI(МассивFTP=Неопределено)Экспорт
	
	Если МассивFTP = Неопределено Тогда
		МассивFTP = Справочники.ТК_УчетныеЗаписиEDI.ПолучитьМассивУчетныхЗаписейEDI(Ложь);
	КонецЕсли;
	
	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ЗагрузкаFTPСообщенийEDI";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало загрузки. Количество FTP на загрузку - "+Формат(МассивFTP.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);

	
	Для Каждого ТекСтрокаFTP Из МассивFTP Цикл 
		ПараметрыПередачи = ТекСтрокаFTP.Параметры;
		
		Если ПустаяСтрока(ПараметрыПередачи.ТекущийКаталогFTP) Тогда
			ПараметрыПередачи.ТекущийКаталогFTP = ТК_ОбменEDI_ПовтИсп.КаталогЗагрузкиFTP(ПараметрыПередачи.ПоставщикEDI,ТекСтрокаFTP.Подразделение);
		КонецЕсли;
		
		СоединениеFTP = ПолучитьСоединениеFTP(ПараметрыПередачи);
		
		Если СоединениеFTP = Неопределено Тогда
			РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
			РезультатыВыполнения.ДобавитьКомментарий("Ошибка установки соединения FTP, учетная запись "+ Строка(ТекСтрокаFTP.Учетка), СтруктураЗаписиЖурнала);
			Продолжить;
		КонецЕсли;
		
		
		Попытка
			ТаблицаДокументов = ПолучитьСписокФайловНаFTP(СоединениеFTP,ПараметрыПередачи);
		Исключение
			РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
			РезультатыВыполнения.ДобавитьКомментарий("Ошибка получения файлов FTP, учетная запись "+ Строка(ТекСтрокаFTP.Учетка), СтруктураЗаписиЖурнала);
			Продолжить;
		КонецПопытки;
		
		Если Не ТипЗнч(ТаблицаДокументов) = Тип("ТаблицаЗначений") Тогда
			РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
			РезультатыВыполнения.ДобавитьКомментарий("Ошибка получения файлов FTP, учетная запись "+ Строка(ТекСтрокаFTP.Учетка), СтруктураЗаписиЖурнала);
			Продолжить;
		КонецЕсли;
		
		ВсегоДокументов = ТаблицаДокументов.Количество();
		ОбработаноФайлов = 0;
		РезультатыВыполнения.ДобавитьКомментарий("Загружаем документы FTP "+ Строка(ТекСтрокаFTP.Учетка), СтруктураЗаписиЖурнала);

		Для Каждого ДокументFTP Из ТаблицаДокументов Цикл 
			
			НачатьТранзакцию();
			
			Попытка
				
				рез =  ЗагрузитьСообщениеFTP(ДокументFTP,ТекСтрокаFTP);
				Если рез.СообщениеЗагружено Тогда
					СоединениеFTP.Удалить(ДокументFTP.ПолноеИмяФайла);
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
				РезультатыВыполнения.ДобавитьКомментарий("Ошибка загрузки документа "+ОписаниеОшибки(), СтруктураЗаписиЖурнала);
				ОтменитьТранзакцию();
			КонецПопытки;
			
			Если Не рез.СообщениеЗагружено Тогда
				
				РезультатыВыполнения.ДобавитьКомментарий("", СтруктураЗаписиЖурнала, СтатусСообщения.Важное);
				РезультатыВыполнения.ДобавитьКомментарий(Рез.Ошибки.ПолучитьТекст(), СтруктураЗаписиЖурнала);
				
			Иначе 
				ОбработаноФайлов = ОбработаноФайлов +1;
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		
	КонецЦикла;
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец загрузки. Количество обработанных фалов - "+Формат(ОбработаноФайлов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Истина);
	Исключение
		//
	КонецПопытки;
	

	
КонецПроцедуры

Процедура ОбработатьВходящиеСообщенияEDI(МассивДокументов = Неопределено,ОтключитьПроверку = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	РезультатыВыполнения = РегистрыСведений.РезультатыВыполненияОбработок;
	СтруктураЗаписиЖурнала = РезультатыВыполнения.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = "ОбработатьВходящиеСообщенияEDI";
	СтруктураЗаписиЖурнала.РегистрироватьРезультаты = Истина;

	Если МассивДокументов = Неопределено Тогда
		МассивДокументоДляОбработки = ПолучитьМассивВходящихДокументовДляОбработки()
	ИначеЕсли ТипЗнч(МассивДокументов) = Тип("Массив") Тогда
		МассивДокументоДляОбработки = МассивДокументов;
	Иначе
		МассивДокументоДляОбработки = Новый Массив;
	КонецЕсли;
	
	РезультатыВыполнения.ДобавитьКомментарий("Начало обработки. Количество документов - "+Формат(МассивДокументоДляОбработки.Количество(),"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);

	ОбработаноДокументов = 0;
	Для Каждого ДокДляОбработки Из МассивДокументоДляОбработки Цикл 
		
		
		Рез = ОбработатьВходящийДокументEDI(ДокДляОбработки,ОтключитьПроверку);
		
		
		Если Рез.ДокументОбработан Тогда
			
			ОбработаноДокументов = ОбработаноДокументов + 1;
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
	
	РезультатыВыполнения.ДобавитьКомментарий("Конец обработки. Количество обработанных документов - "+Формат(ОбработаноДокументов,"ЧН=0; ЧГ="), СтруктураЗаписиЖурнала);
	Попытка 
		РезультатыВыполнения.ЗаписатьЖурналВыполненияОбработок(СтруктураЗаписиЖурнала, Истина);
	Исключение
		//
	КонецПопытки;
	

	
КонецПроцедуры

Процедура ОбработатьЖурналДокументовEDI()Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_СостояниеEDI.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.ТК_СостояниеEDI КАК ТК_СостояниеEDI
		|ГДЕ
		|	ТК_СостояниеEDI.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТК_СостояниеEDI.СостояниеВерсии = &СостояниеВерсии
		|	И ТК_СостояниеEDI.СсылкаНаОбъект ССЫЛКА Документ.РеализацияТоваров
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТК_СостояниеEDI.СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.ТК_СостояниеEDI КАК ТК_СостояниеEDI
		|ГДЕ
		|	ТК_СостояниеEDI.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТК_СостояниеEDI.СостояниеВерсии = &СостояниеВерсии
		|	И ТК_СостояниеEDI.СсылкаНаОбъект ССЫЛКА Документ.РезервированиеЗаказовПокупателя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТК_СостояниеEDI.СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.ТК_СостояниеEDI КАК ТК_СостояниеEDI
		|ГДЕ
		|	ТК_СостояниеEDI.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТК_СостояниеEDI.СостояниеВерсии = &СостояниеВерсии
		|	И ТК_СостояниеEDI.СсылкаНаОбъект ССЫЛКА Документ.ВыпускПродукции";
	
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДата()-60*60*24*3);
	Запрос.УстановитьПараметр("СостояниеВерсии", Перечисления.СтатусыДокументовEDI.НеСформирован);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДокументов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	     МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
	КонецЦикла;
	
	ТК_ОбменEDI.ВыполнитьДействияПоЭД(МассивДокументов, Неопределено, "Сформировать", Новый Структура, Неопределено,  Новый Соответствие);

	
КонецПроцедуры






#Область СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

Функция СвойствоСтруктуры(Структура, Знач ИерархияСвойств, Знач ЗначениеПоУмолчанию = Неопределено) 
	
	Если ТипЗнч(ИерархияСвойств) = Тип("Строка") Тогда
		ИерархияСвойств = СтрРазделить(ИерархияСвойств, ".");
	КонецЕсли;
	
	ТекущееСвойство = ИерархияСвойств[0];
	
	Если ИерархияСвойств.Количество() = 1 Тогда
		
		Если Структура.Свойство(ТекущееСвойство) Тогда
			Возврат Структура[ТекущееСвойство];
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		
	Иначе
		
		ТекущееЗначение = Неопределено;
		Если Не Структура.Свойство(ТекущееСвойство, ТекущееЗначение) Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		ИерархияСвойств.Удалить(0);
		Возврат СвойствоСтруктуры(ТекущееЗначение, ИерархияСвойств, ЗначениеПоУмолчанию);
		
	КонецЕсли;
	
КонецФункции

Процедура УстановитьСвойствоСтруктуры(Структура, Знач ИерархияСвойств, Знач Значение) 
	
	Если ТипЗнч(ИерархияСвойств) = Тип("Строка") Тогда
		ИерархияСвойств = СтрРазделить(ИерархияСвойств, ".");
	КонецЕсли;
	
	ТекущееСвойство = ИерархияСвойств[0];
	
	Если ИерархияСвойств.Количество() = 1 Тогда
		
		Структура.Вставить(ТекущееСвойство, Значение);
		
	Иначе
		
		ТекущееЗначение = Неопределено;
		Если Не Структура.Свойство(ТекущееСвойство, ТекущееЗначение) Тогда
			ТекущееЗначение = Новый Структура;
		КонецЕсли;
		ИерархияСвойств.Удалить(0);
		УстановитьСвойствоСтруктуры(ТекущееЗначение, ИерархияСвойств, Значение);
		Структура.Вставить(ТекущееСвойство, ТекущееЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

Функция КомандыEDIФормы(Форма, МодульПодсистемы, Направление, ТолькоВМенюЕще) Экспорт
	
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		ИмяФормы = Форма.ИмяФормы;
	Иначе
		ИмяФормы = Форма;
	КонецЕсли;
	
	КомандыEDI = СоздатьКоллекциюКомандEDI();
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяФормы);
	Если ОбъектМетаданных <> Неопределено 
		И Не Метаданные.ОбщиеФормы.Содержит(ОбъектМетаданных) Тогда
		ОбъектМетаданных = ОбъектМетаданных.Родитель();
	КонецЕсли;
	
	ДобавляемыеКомандыEDI = СоздатьКоллекциюКомандEDI();
	МодульФормирования = ОбщегоНазначения.ОбщийМодуль(МодульПодсистемы);
	МодульФормирования.СформироватьКомандыEDI(ОбъектМетаданных.ПолноеИмя(), ДобавляемыеКомандыEDI, Направление, ТолькоВМенюЕще);
	
	Для Каждого КомандаEDI Из ДобавляемыеКомандыEDI Цикл
		Если КомандыEDI.Найти(КомандаEDI.Идентификатор, "Идентификатор") = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(КомандыEDI.Добавить(), КомандаEDI);	
		КонецЕсли;
	КонецЦикла;
	
	КомандыEDI.Сортировать("Порядок Возр, Представление Возр");
	
	ЧастиИмени = СтрРазделить(ИмяФормы, ".");
	КраткоеИмяФормы = ЧастиИмени[ЧастиИмени.Количество()-1];
	
	// фильтр по именам форм
	Для НомерСтроки = -КомандыEDI.Количество() + 1 По 0 Цикл
		КомандаEDI = КомандыEDI[-НомерСтроки];
		СписокФорм = СтрРазделить(КомандаEDI.СписокФорм, ",", Ложь);
		Если СписокФорм.Количество() > 0 И СписокФорм.Найти(КраткоеИмяФормы) = Неопределено Тогда
			КомандыEDI.Удалить(КомандаEDI);
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат КомандыEDI;
	
КонецФункции



Процедура ОбменEDIВладелецПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ГрупповоеПерепроведение = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповоеПерепроведение", ГрупповоеПерепроведение)
		И ГрупповоеПерепроведение = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если (Не Источник.ДополнительныеСвойства.Свойство("ЕстьСоглашение") ИЛИ НЕ Источник.ДополнительныеСвойства.ЕстьСоглашение) Тогда
		ПараметрыДокумента = ЗаполнитьПараметрыEDIПоИсточнику(Источник);
		
		НастройкаEDIСуществует = ТК_ОбменEDIВызовСервера.НастройкаEDIСуществует(Источник.Ссылка, ПараметрыДокумента);
		Если Не НастройкаEDIСуществует Тогда
			Возврат;
		КонецЕсли;
		
		Источник.ДополнительныеСвойства.Вставить("ЕстьСоглашение", Истина);
		Источник.ДополнительныеСвойства.Вставить("ВидСообщения", ПараметрыДокумента.ВидСообщения);
	КонецЕсли;
	
	ДанныеСостояния = ДанныеСостоянияДокументаEDI(Источник.Ссылка);
	ТекущееСостояние = ДанныеСостояния.СостояниеВерсии;
	ПризнакИзменения = Источник.ЭтоНовый();
	ПризнакУчастияВОбмене = Истина;
	Если Не ЗначениеЗаполнено(ТекущееСостояние) Тогда
		ПризнакИзменения = Истина;
	КонецЕсли;
	
	УстановитьСвойствоСтруктуры(Источник.ДополнительныеСвойства, "ОбменСКонтрагентами.ИзмененыКлючевыеРеквизиты", ПризнакИзменения);
	УстановитьСвойствоСтруктуры(Источник.ДополнительныеСвойства, "ОбменСКонтрагентами.УчаствуетВОбмене", ПризнакУчастияВОбмене);
	

КонецПроцедуры

Процедура ОбменEDIВладелецПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ГрупповоеПерепроведение = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ГрупповоеПерепроведение", ГрупповоеПерепроведение)
		И ГрупповоеПерепроведение = Истина Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Источник.ДополнительныеСвойства.Свойство("ЕстьСоглашение")
		ИЛИ НЕ Источник.ДополнительныеСвойства.ЕстьСоглашение Тогда
		
		ПроверитьНаличиеИУдалитьСостояниеДокумента(Источник.Ссылка);
		Возврат;
	КонецЕсли;

	ПризнакИзменения = СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ОбменСКонтрагентами.ИзмененыКлючевыеРеквизиты", Ложь);
	ПризнакУчастияВОбмене = СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ОбменСКонтрагентами.УчаствуетВОбмене", Ложь);
	
	Если ПризнакИзменения ИЛИ Не ПризнакУчастияВОбмене Тогда
		УстановитьНовуюВерсиюДокументаEDI(Источник.Ссылка,, Истина, ПризнакУчастияВОбмене)
	Иначе
		ОбновитьОписаниеОснованияЭлектронногоДокументаEDI(Источник);

	КонецЕсли;

КонецПроцедуры


#КонецОбласти




Функция НастройкаEDIСуществует(СсылкаНаВладельца, ПараметрыДокумента = Неопределено)Экспорт
	

	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь;
	
	Если ПараметрыДокумента = Неопределено Тогда
		ПараметрыДокумента = ЗаполнитьПараметрыEDIПоИсточнику(СсылкаНаВладельца);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыДокумента.Контрагент) И ЗначениеЗаполнено(ПараметрыДокумента.ВидЭД) Тогда
		
		ПараметрВидЭД = ПараметрыДокумента.ВидЭД;
		УсловиеОтбора = "";
		Если ПараметрВидЭД = Справочники.ХозОперации.РеализацияТоваров ИЛИ ПараметрВидЭД  = Справочники.ХозОперации.РеализацияТоваровРозница
			ИЛИ ПараметрВидЭД  = Справочники.ХозОперации.ВыпускПродукцииСРеализацией Тогда
			УсловиеОтбора ="И Рег.ИсходящаяРеализация";
			ПараметрыДокумента.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.DESADV);

		ИначеЕсли ПараметрВидЭД = Справочники.ХозОперации.ПоступлениеТоваров ИЛИ ПараметрВидЭД  = Справочники.ХозОперации.ПоступлениеТоваровТранзиты Тогда
			УсловиеОтбора ="И Рег.ИсходящееПоступлениеТоваров";
			ПараметрыДокумента.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.COMDOC007);
		ИначеЕсли ПараметрВидЭД	= Справочники.ХозОперации.РезервированиеПокупателя Тогда
			УсловиеОтбора ="И Рег.ИсходящееПодтверждениеЗаказа";
			ПараметрыДокумента.Вставить("ВидСообщения",Перечисления.ВидыСообщенийEDI.ORDRSP);
		Иначе
			УсловиеОтбора ="И Ложь";
		КонецЕсли;
		
			
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", ПараметрыДокумента.Контрагент);

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Рег.УчетнаяЗаписьEDI КАК УчетнаяЗаписьEDI,
		|	Рег.GLN КАК GLN
		|ИЗ
		|	РегистрСведений.ТК_ПараметрыОбменаEDI КАК Рег
		|ГДЕ
		|	Рег.Контрагент = &Контрагент
		|	И НЕ Рег.УчетнаяЗаписьEDI.Отключен
		|	И &Парам";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И &Парам",УсловиеОтбора);
	Запрос.Текст = ТекстЗапроса;
	
		
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ПараметрыДокумента.Вставить("УчетнаяЗаписьEDI",ВыборкаДетальныеЗаписи.УчетнаяЗаписьEDI);
		
		Результат = Истина;

	КонецЕсли;

	КонецЕсли;
	
	
	Возврат Результат
	
КонецФункции

Функция СтруктураПараметровДокумента()
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ВидЭД",                 Неопределено);
	Параметры.Вставить("Направление",           Неопределено);
	Параметры.Вставить("Контрагент",            Неопределено);
	Параметры.Вставить("ДоговорКонтрагента",    Неопределено);
	Параметры.Вставить("Организация",           Неопределено);
	
	Возврат Параметры;

КонецФункции

Функция ЗаполнитьПараметрыEDIПоИсточнику(Источник,ВидЭД = Неопределено)Экспорт
	
	ПараметрыДокумента = СтруктураПараметровДокумента();
	
	ТипИсточника = ТипЗнч(Источник);

	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваров")
		ИЛИ ТипИсточника = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		ПараметрыДокумента.ВидЭД              = Источник.ХозОперация;
		ПараметрыДокумента.Направление        = Перечисления.ТК_НаправлениеEDI.Исходящий;
		ПараметрыДокумента.Контрагент         = Источник.Контрагент;
		ПараметрыДокумента.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		ПараметрыДокумента.Организация        = Источник.Организация;
	ИначеЕсли  ТипИсточника = Тип("ДокументОбъект.ПоступлениеТоваров")	
		     ИЛИ ТипИсточника = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		ПараметрыДокумента.ВидЭД              = Источник.ХозОперация;
		ПараметрыДокумента.Направление        = Перечисления.ТК_НаправлениеEDI.Исходящий;
		ПараметрыДокумента.Контрагент         = Источник.Контрагент;
		ПараметрыДокумента.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		ПараметрыДокумента.Организация        = Источник.ДоговорВзаиморасчетов.Организация;
	ИначеЕсли  ТипИсточника = Тип("ДокументОбъект.РезервированиеЗаказовПокупателя")
				ИЛИ ТипИсточника = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
		ПараметрыДокумента.ВидЭД              = Источник.ХозОперация;
		ПараметрыДокумента.Направление        = Перечисления.ТК_НаправлениеEDI.Исходящий;
		ПараметрыДокумента.Контрагент         = Источник.Контрагент;
		ПараметрыДокумента.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		ПараметрыДокумента.Организация        = Источник.ДоговорВзаиморасчетов.Организация;
	ИначеЕсли  ТипИсточника = Тип("ДокументОбъект.ВыпускПродукции")
				ИЛИ ТипИсточника = Тип("ДокументСсылка.ВыпускПродукции") Тогда
		ПараметрыДокумента.ВидЭД              = Источник.ХозОперация;
		ПараметрыДокумента.Направление        = Перечисления.ТК_НаправлениеEDI.Исходящий;
		ПараметрыДокумента.Контрагент         = Источник.Контрагент;
		ПараметрыДокумента.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		ПараметрыДокумента.Организация        = Источник.ДоговорВзаиморасчетов.Организация;
	
	 КонецЕсли;
	
	Возврат ПараметрыДокумента;
	
КонецФункции

Функция ОпределитьНастройкиОбменаEDIПоИсточнику(Источник,ВыводитьСообщения = Истина,ВидЭД = Неопределено) Экспорт
	
	Параметры = ЗаполнитьПараметрыEDIПоИсточнику(Источник);
	Если ЗначениеЗаполнено(ВидЭД) Тогда
		Параметры.ВидЭД = ВидЭД;
	КонецЕсли;

	Результат = НастройкаEDIСуществует(Источник,Параметры);

	Параметры.Вставить("НастройкаСуществует",Результат);
	
	Если Результат = Ложь Тогда
		СообщитьОбОтсутствииНастройкиEDI(Параметры,Источник);
	КонецЕсли;
	
	
	Возврат Параметры;
	
КонецФункции



Функция ДанныеСостоянияДокументаEDI(СсылкаНаВладельца)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СостояниеДокумента = Новый Структура;
	СостояниеДокумента.Вставить("СостояниеВерсии", Перечисления.СтатусыДокументовEDI.ПустаяСсылка());
	СостояниеДокумента.Вставить("КомментарийРС", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТК_СостояниеEDI.СостояниеВерсии КАК СостояниеВерсии,
	|	ТК_СостояниеEDI.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ТК_СостояниеEDI КАК ТК_СостояниеEDI
	|ГДЕ
	|	ТК_СостояниеEDI.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаВладельца);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СостояниеДокумента.Вставить("СостояниеВерсии", Выборка.СостояниеВерсии);
		СостояниеДокумента.Вставить("КомментарийРС", Выборка.Комментарий);
	КонецЕсли;
	
	Возврат СостояниеДокумента;

КонецФункции

Функция ПолучитьПервоеСостояниеВерсииEDIДляВладельца(СсылкаНаВладельца, ПризнакПолучения = Ложь) Экспорт
	
	Параметры = ЗаполнитьПараметрыEDIПоИсточнику(СсылкаНаВладельца);
	
	СостояниеВерсииEDI = Перечисления.СтатусыДокументовEDI.ПустаяСсылка();
	Направление = "";
	Если Параметры.Свойство("Направление", Направление) И ЗначениеЗаполнено(Направление) Тогда
		Если Направление = Перечисления.ТК_НаправлениеEDI.Исходящий Тогда 
			
			СостояниеВерсииEDI = Перечисления.СтатусыДокументовEDI.НеСформирован;
			
		ИначеЕсли Направление = Перечисления.ТК_НаправлениеEDI.Входящий Тогда
			Если ПризнакПолучения Тогда 
				СостояниеВерсииEDI = Перечисления.СтатусыДокументовEDI.НаУтверждении;
			Иначе
				СостояниеВерсииEDI = Перечисления.СтатусыДокументовEDI.НеПолучен;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СостояниеВерсииEDI;
	
КонецФункции

Функция ОписаниеОснованияЭлектронногоДокумента(Знач Основание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОснованиеОбъект = Неопределено;
	ОснованиеСсылка = Неопределено;
	
	ТипОснования = ТипЗнч(Основание);
	Если ОбщегоНазначения.ЭтоСсылка(ТипОснования) Тогда
		ОснованиеОбъект = Основание.ПолучитьОбъект();
		ОснованиеСсылка = Основание;
	Иначе
		ОснованиеОбъект = Основание;
		ОснованиеСсылка = Основание.Ссылка;
	КонецЕсли;

	МетаданныеОснования = Основание.Метаданные();
	ИмяОснования = МетаданныеОснования.Имя;
	СинонимОснования = МетаданныеОснования.Синоним;

	Описание = Новый Структура;
	Описание.Вставить("Вид", СинонимОснования);
	Описание.Вставить("Организация", Неопределено);
	Описание.Вставить("Контрагент", Неопределено);
	Описание.Вставить("Дата", Дата(1, 1, 1));
	Описание.Вставить("Номер", "");
	Описание.Вставить("СуммаДокумента", 0);

	
	
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	&Псевдоним.ДоговорВзаиморасчетов.Организация КАК Организация,
	|	&Псевдоним.Контрагент КАК Контрагент,
	|	&Псевдоним.СуммаДокумента КАК СуммаДокумента,
	|	&Псевдоним.Дата КАК Дата,
	|	&Псевдоним.Номер КАК Номер
	|ИЗ
	|	&ОснованиеЭД КАК &Псевдоним
	|ГДЕ
	|	&Псевдоним.Ссылка = &Ссылка";

	РеквизитыОснования = Новый Массив;
	РеквизитыОснования.Добавить("Организация");
	РеквизитыОснования.Добавить("Контрагент");
	РеквизитыОснования.Добавить("СуммаДокумента");
	РеквизитыОснования.Добавить("Дата");
	РеквизитыОснования.Добавить("Номер");

	ПсевдонимТаблицы = "Документ";
	
	
	
	Для Каждого ИмяРеквизита Из РеквизитыОснования Цикл
			
		ЗаменяемыйШаблон = "&Псевдоним."+ ИмяРеквизита;
		
		//ПрикладноеИмяРеквизита = ЭлектронноеВзаимодействиеСлужебныйПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении(
		//	ИмяОснования + "." + ИмяРеквизита);
		//
		//Если ЗначениеЗаполнено(ПрикладноеИмяРеквизита) Тогда
		//	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, ЗаменяемыйШаблон, ПрикладноеИмяРеквизита);
		//	Если ПсевдонимТаблицы = "Документ" Тогда
		//		СтрокиВМассиве = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПрикладноеИмяРеквизита, ".");
		//		ПсевдонимТаблицы = СтрокиВМассиве[0];
		//	КонецЕсли;
		//ИначеЕсли 
		Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОснования)
			И Не ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОснования.СтандартныеРеквизиты, ИмяРеквизита) Тогда 
			
			ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, ЗаменяемыйШаблон, "NULL");
		КонецЕсли;
		
	КонецЦикла;
	
	ВидОснования = ОбщегоНазначения.ВидОбъектаПоСсылке(ОснованиеСсылка);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&ОснованиеЭД", ВидОснования + "." + ИмяОснования);
	ШаблонЗапроса = СтрЗаменить(ШаблонЗапроса, "&Псевдоним", ПсевдонимТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ШаблонЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ОснованиеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый ФиксированнаяСтруктура(Описание);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(Описание);

	
	
	//Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
	//	
	//	
	//	Описание.Организация = ОснованиеОбъект.Организация;
	//	Описание.Контрагент  = ОснованиеОбъект.Контрагент;
	//	Описание.Дата  = ОснованиеОбъект.Дата;
	//	Описание.Номер = ОснованиеОбъект.Номер;
	//	Описание.СуммаДокумента = ОснованиеОбъект.СуммаДокумента;

	//	Описание.Вид = СтрШаблон(НСтр("ru = '%1 (%2)'"),
	//		СинонимОснования, ОснованиеОбъект.ХозОперация);
	//ИначеЕсли  ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.РеализацияТоваров")
	//		
	//КонецЕсли;
	//
	
	//Возврат Новый ФиксированнаяСтруктура(Описание);
	
КонецФункции


Процедура ПроверитьНаличиеИУдалитьСостояниеДокумента(СсылкаНаОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ТК_СостояниеEDI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНовуюВерсиюДокументаEDI(СсылкаНаОбъект, ЭлектронныйДокумент = Неопределено, УдалятьСтаруюВерсию = Ложь, Знач СоздатьНовуюВерсию = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	НаборЗаписей = РегистрыСведений.ТК_СостояниеEDI.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	
	ЗаписатьИзменения = Истина;

	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗаписьНабора = НаборЗаписей.Добавить();
		НоваяЗаписьНабора.СсылкаНаОбъект = СсылкаНаОбъект;
		НоваяЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
		НоваяЗаписьНабора.СостояниеВерсии = ПолучитьПервоеСостояниеВерсииEDIДляВладельца(СсылкаНаОбъект, ЗначениеЗаполнено(ЭлектронныйДокумент));

	   Если НоваяЗаписьНабора.СостояниеВерсии = Перечисления.СтатусыДокументовEDI.НаУтверждении Тогда
			НоваяЗаписьНабора.ДействияСНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
		КонецЕсли;
		ЗаписатьИзменения = СоздатьНовуюВерсию;

	Иначе
		НоваяЗаписьНабора = НаборЗаписей.Получить(0);
		
		НоваяЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
		
		//Если УдалятьСтаруюВерсию Тогда
		//	УдалитьСтаруюВерсиюЭД(НоваяЗаписьНабора);
		//КонецЕсли;
		
		НоваяЗаписьНабора.СостояниеВерсии = ПолучитьПервоеСостояниеВерсииEDIДляВладельца(СсылкаНаОбъект, ЗначениеЗаполнено(ЭлектронныйДокумент));
		НоваяЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;

		
	КонецЕсли;

	Если НоваяЗаписьНабора.СостояниеВерсии = Перечисления.СтатусыДокументовEDI.НеСформирован Тогда
		НоваяЗаписьНабора.ДействияСНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
		НоваяЗаписьНабора.ДействияСоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
	ИначеЕсли НоваяЗаписьНабора.СостояниеВерсии = Перечисления.СтатусыДокументовEDI.НеПолучен Тогда
		НоваяЗаписьНабора.ДействияСНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ПустаяСсылка();
		НоваяЗаписьНабора.ДействияСоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ПустаяСсылка();
	КонецЕсли;
	
	ОписаниеОснования = Неопределено;
	Для каждого Запись Из НаборЗаписей Цикл
		Если Запись.СостояниеВерсии <> Перечисления.СтатусыДокументовEDI.НеСформирован Тогда
			Продолжить;
		КонецЕсли;
		Если ОписаниеОснования = Неопределено Тогда
			ОписаниеОснования = ОписаниеОснованияЭлектронногоДокумента(Запись.СсылкаНаОбъект);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, ОписаниеОснования);
	КонецЦикла;
	
	Если Не СоздатьНовуюВерсию Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	Если ЗаписатьИзменения Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьОписаниеОснованияЭлектронногоДокументаEDI(Знач ОснованиеЭД)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОснованиеОбъект = Неопределено;
	ОснованиеСсылка = Неопределено;
	
	ТипОснования = ТипЗнч(ОснованиеЭД);
	Если ОбщегоНазначения.ЭтоСсылка(ТипОснования) Тогда
		ОснованиеОбъект = ОснованиеЭД.ПолучитьОбъект();
		ОснованиеСсылка = ОснованиеЭД;
	Иначе
		ОснованиеОбъект = ОснованиеЭД;
		ОснованиеСсылка = ОснованиеЭД.Ссылка;
	КонецЕсли;
	
	Набор = РегистрыСведений.ТК_СостояниеEDI.СоздатьНаборЗаписей();
	Набор.Отбор.СсылкаНаОбъект.Установить(ОснованиеСсылка);
	Набор.Прочитать();
	
	Описание = Неопределено;
	ОписаниеИзменено = Ложь;
	
	Для каждого Запись Из Набор Цикл
		
		Если Запись.СостояниеВерсии <> Перечисления.СтатусыДокументовEDI.НеСформирован Тогда
			Продолжить;
		КонецЕсли;
		
		Если Описание = Неопределено Тогда
			Описание = ОписаниеОснованияЭлектронногоДокумента(ОснованиеОбъект);
		КонецЕсли;
		
		// Обновление описания.
		Если ОписаниеИзменено Тогда
			ЗаполнитьЗначенияСвойств(Запись, Описание);
			Продолжить;
		КонецЕсли;
		
		// Проверка изменения описания.
		Для каждого КлючЗначение Из Описание Цикл
			
			ТекущееЗначение = Запись[КлючЗначение.Ключ];
			НовоеЗначение = КлючЗначение.Значение;
			
			Если ТекущееЗначение <> НовоеЗначение Тогда
				ОписаниеИзменено = Истина;
				ЗаполнитьЗначенияСвойств(Запись, Описание);
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Если ОписаниеИзменено Тогда
		Набор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьСводнуюИнформациюПоСтатусуЭД(ЭлектронныйДокумент)
	
	СтруктураДействий = Новый Структура("СНашейСтороны, СоСтороныДругогоУчастника",
	Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется, Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется);
	
	Если ТипЗнч(ЭлектронныйДокумент) = Тип("ДокументСсылка.ТК_СообщениеEDIИсходящие") Тогда
		
		Если ЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.Создан Тогда
			СтруктураДействий.СНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
			СтруктураДействий.СоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
		ИначеЕсли ЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.Отправлен Тогда
			СтруктураДействий.СНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
			СтруктураДействий.СоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
		ИначеЕсли ЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.НаПодписи Тогда
	        СтруктураДействий.СНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
			СтруктураДействий.СоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
		КонецЕсли;
		

		
	Иначе
		
		Если ЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.Создан Тогда
			СтруктураДействий.СНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ТребуютсяДействия;
			СтруктураДействий.СоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
		ИначеЕсли  ЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.ОбменЗавершен Тогда
			СтруктураДействий.СНашейСтороны = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
			СтруктураДействий.СоСтороныДругогоУчастника = Перечисления.ТК_СводныеСостоянияEDI.ДействийНеТребуется;
			
		КонецЕсли;

		
	КонецЕсли;
	
	
	Возврат СтруктураДействий;
	
КонецФункции



Процедура УстановитьСсылкуДляВладельцаВРегистреСостояний(СсылкаНаОбъект, ЭлектронныйДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
			
	НаборЗаписей = РегистрыСведений.ТК_СостояниеEDI.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()=0 Тогда
		НоваяЗаписьНабора = НаборЗаписей.Добавить();
		НоваяЗаписьНабора.СсылкаНаОбъект = СсылкаНаОбъект;
	Иначе
		НоваяЗаписьНабора = НаборЗаписей.Получить(0);
	КонецЕсли;
	
	СтруктураИнформации = ОпределитьСводнуюИнформациюПоСтатусуЭД(ЭлектронныйДокумент);
	
	НоваяЗаписьНабора.ЭлектронныйДокумент = ЭлектронныйДокумент;
	НоваяЗаписьНабора.СостояниеВерсии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент,"ТекущийСтатус");
	НоваяЗаписьНабора.ДействияСНашейСтороны = СтруктураИнформации.СНашейСтороны;
	НоваяЗаписьНабора.ДействияСоСтороныДругогоУчастника = СтруктураИнформации.СоСтороныДругогоУчастника;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСостояниеEDI(ПараметрыПриСозданииНаСервере)
	
	Форма = ПараметрыПриСозданииНаСервере.Форма;
	ДокументСсылка = ПараметрыПриСозданииНаСервере.ДокументСсылка;
	ДекорацияСостояниеEDI = ПараметрыПриСозданииНаСервере.ДекорацияСостояниеEDI;
	ГруппаСостояниеEDI = ПараметрыПриСозданииНаСервере.ГруппаСостояниеEDI;
	
	ТК_ОбменEDIКлиентСервер.ЗаполнитьСостояниеEDI(Форма, ДокументСсылка, ДекорацияСостояниеEDI, ГруппаСостояниеEDI);
	
КонецПроцедуры

Функция СоздатьКоллекциюКомандEDI()
	
	Результат = Новый ТаблицаЗначений;
	
	// описание
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	//////////
	// Опции (необязательные параметры).
	
	// Альтернативный обработчик команды.
	Результат.Колонки.Добавить("Обработчик", Новый ОписаниеТипов("Строка"));
	
	// представление
	Результат.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Картинка", Новый ОписаниеТипов("Картинка"));
	Результат.Колонки.Добавить("Отображение", Новый ОписаниеТипов("ОтображениеКнопки"));
	
	// Имена форм для размещения команд, разделитель - запятая.
	Результат.Колонки.Добавить("СписокФорм", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("МестоРазмещения", Новый ОписаниеТипов("Строка"));
	// Имена функциональных опций, влияющих на видимость команды, разделитель - запятая.
	Результат.Колонки.Добавить("ФункциональныеОпции", Новый ОписаниеТипов("Строка"));
	
	Результат.Колонки.Добавить("РежимИспользованияПараметра", Новый ОписаниеТипов("РежимИспользованияПараметраКоманды"));
	
	// дополнительные параметры
	Результат.Колонки.Добавить("ДополнительныеПараметры", Новый ОписаниеТипов("Структура"));
	
	// Специальный режим выполнения команды
	// по умолчанию выполняется запись модифицированного объекта перед выполнением команды.
	Результат.Колонки.Добавить("НеВыполнятьЗаписьВФорме", Новый ОписаниеТипов("Булево"));
	
	// Для служебного использования.
	Результат.Колонки.Добавить("СкрытаФункциональнымиОпциями", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отключена", Новый ОписаниеТипов("Булево"));
	
	Результат.Колонки.Добавить("ТолькоВоВсехДействиях", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Недоступна", Новый ОписаниеТипов("Булево"));
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьКомандыEDI(ПолноеИмя, КомандыEDI, Направление = Неопределено, ТолькоВМенюЕще = Ложь) Экспорт
	
	СоставКоманд = КомандыEDI();
	
	ПодготовитьСтруктуруОбъектовКомандEDI(СоставКоманд);
	
	
	ЕстьПравоПросмотраEDI = ТК_ОбменEDIВызовСервера.ЕстьПравоЧтенияEDI();
	ЕстьПравоОбработкиEDI = ТК_ОбменEDIВызовСервера.ЕстьПравоОбработкиEDI();
	ЕстьПравоОбменаEDI    = ТК_ОбменEDIВызовСервера.ЕстьПравоВыполненияОбмена();
		
	ЕстьПравоВывода = ПравоДоступа("Вывод", Метаданные);
		
	Если СоставКоманд.Исходящие.Найти(ПолноеИмя) <> Неопределено 
		И Направление <> Перечисления.ТК_НаправлениеEDI.Входящий Тогда
		
		Команда = КомандыEDI.Добавить();
		Команда.Обработчик    = "ТК_ОбменEDIКлиент.СформироватьДокументEDI";
		Команда.СписокФорм    = "";
		Команда.Идентификатор = "СформироватьЭД";
		Команда.Представление = НСтр("ru = 'Создать электронный документ'");
		Команда.Порядок       = 1;
		Команда.Картинка      = БиблиотекаКартинок.СоздатьЭлементСписка;
		Команда.РежимИспользованияПараметра = РежимИспользованияПараметраКоманды.Множественный;
		Команда.МестоРазмещения = "КомандыEDIВажное";
		Команда.Недоступна    = Не ЕстьПравоОбменаEDI;
		
		
		
	КонецЕсли;
	
	Если СоставКоманд.Входящие.Найти(ПолноеИмя) <> Неопределено 
		И Направление <> Перечисления.ТК_НаправлениеEDI.Исходящий Тогда
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция КомандыEDI() Экспорт
	
	Команды = Новый Структура;
	Команды.Вставить("Исходящие", Новый Массив);
	Команды.Вставить("Входящие", Новый Массив);
	Команды.Вставить("БезПодписи", Новый Массив);
	
	Возврат Команды;
	
КонецФункции

Процедура ПодготовитьСтруктуруОбъектовКомандEDI(СоставКоманд)
	СоставКоманд.Исходящие.Добавить("Документ.РеализацияТоваров");
	СоставКоманд.Исходящие.Добавить("Документ.РезервированиеЗаказовПокупателя");
	СоставКоманд.Исходящие.Добавить("Документ.ПоступлениеТоваров");
	СоставКоманд.БезПодписи.Добавить("Документ.ЗаказПокупателя");
КонецПроцедуры



Функция ЕстьПравоОбработкиEDI(ВыводитьСообщение = Ложь) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьПраво = Истина;
	
	// Основные объекты метаданных, доступ к которым определяет доступ к элементарной функции.
	ОбъектыЭлементарнойФункции = Новый Массив;
	ОбъектыЭлементарнойФункции.Добавить(Метаданные.Документы.ТК_СообщениеEDIВходящее);
	ОбъектыЭлементарнойФункции.Добавить(Метаданные.Документы.ТК_СообщениеEDIИсходящие);
	
	Для каждого Объект Из ОбъектыЭлементарнойФункции Цикл
		
		Если Не ПравоДоступа("Изменение", Объект) Тогда
			ЕстьПраво = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	
	//Если Не ЕстьПраво И ВыводитьСообщение Тогда
	//	
	//	СообщитьПользователюОНарушенииПравДоступа();
	//	
	//КонецЕсли;
		
	Возврат ЕстьПраво;
	
КонецФункции

Функция ЕстьПравоВыполненияОбмена(ВыводитьСообщение = Ложь) Экспорт
	
	ЕстьПраво = Пользователи.РолиДоступны("ТК_ВыполнениеОбменаEDI")
		И ЕстьПравоОбработкиEDI();
	
	//Если Не ЕстьПраво И ВыводитьСообщение Тогда
	//	
	//	СообщитьПользователюОНарушенииПравДоступа();
	//	
	//КонецЕсли;
		
	Возврат ЕстьПраво;
	
КонецФункции


Функция ВыполнитьДействияПоЭД(Знач МассивСсылокНаОбъект, Знач МассивОтпечатковСертификатов, Знач Действия, ДопПараметры, Знач ЭД, Знач СоотвСертификатовИПаролей) Экспорт
	
	
	Если НЕ ЕстьПравоВыполненияОбмена() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	
	ПроверитьГотовностьИсточников(МассивСсылокНаОбъект);
	
	Если МассивСсылокНаОбъект.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("СообщенияПользователю", Новый Массив);
	
	МассивНеОбрабатываемыхОбъектов = Новый Массив;
	
	КолНовыхЭД = 0;
	
	
	Если ТК_ОбменEDIКлиентСервер.ЕстьДействие(Действия,"Сформировать") Тогда
		
		Если Действия = "Сформировать" 	Или Действия = "СформироватьПоказать" Тогда
			УдалитьНедоступныеДляФормированияEDIбъекты(МассивСсылокНаОбъект);
		КонецЕсли;
		
		НастройкиОбъектов = Новый Соответствие;
		
		Для Сч = -МассивСсылокНаОбъект.Количество() + 1 По 0 Цикл
			СсылкаНаОбъект = МассивСсылокНаОбъект[-Сч];
			
			ВидЭД = "";
			Если ЗначениеЗаполнено(ДопПараметры) Тогда
				ДопПараметры.Свойство("ВидЭД", ВидЭД);
			КонецЕсли;
			
			НастройкиОбмена = ОпределитьНастройкиОбменаEDIПоИсточнику(СсылкаНаОбъект,,ВидЭД);
			
			Если НастройкиОбмена.Свойство("НастройкаСуществует") И  НастройкиОбмена.НастройкаСуществует = Ложь Тогда
				МассивСсылокНаОбъект.Удалить(-Сч);
			Иначе
				НастройкиОбъектов.Вставить(СсылкаНаОбъект, НастройкиОбмена);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивСсылокНаОбъект.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	МассивСсылок.ОбъектСсылка КАК ОбъектСсылка
		|ПОМЕСТИТЬ МассивСсылок
		|ИЗ
		|	&МассивСсылок КАК МассивСсылок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МассивСсылок.ОбъектСсылка КАК ВладелецЭД
		|ИЗ
		|	МассивСсылок КАК МассивСсылок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_СостояниеEDI КАК ТК_СостояниеEDI
		|		ПО МассивСсылок.ОбъектСсылка = ТК_СостояниеEDI.СсылкаНаОбъект
		|ГДЕ
		|	(ТК_СостояниеEDI.СсылкаНаОбъект ЕСТЬ NULL
		|			ИЛИ ТК_СостояниеEDI.СостояниеВерсии = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.НеСформирован)
		|			ИЛИ ТК_СостояниеEDI.СостояниеВерсии = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.ЗакрытПринудительно))";
		
		
		Измерение = Метаданные.РегистрыСведений.ТК_СостояниеEDI.Измерения.Найти("СсылкаНаОбъект");
		ТЗ_Ссылки = Новый ТаблицаЗначений;
		КолонкаТЗ = ТЗ_Ссылки.Колонки.Добавить("ОбъектСсылка", Измерение.Тип);
		Для Каждого Элемент Из МассивСсылокНаОбъект Цикл
			Строка = ТЗ_Ссылки.Добавить();
			Строка.ОбъектСсылка = Элемент;
		КонецЦикла;
		
		
		Запрос.УстановитьПараметр("МассивСсылок", ТЗ_Ссылки);
		ТЗ_ЭД = Запрос.Выполнить().Выгрузить();
		
		МассивНовыхЭД = Новый Массив;
		
		Если ТЗ_ЭД.Количество() > 0 Тогда
			МассивНовыхЭД = СформироватьЭлектронныеДокументы(ТЗ_ЭД.ВыгрузитьКолонку("ВладелецЭД"),
			НастройкиОбъектов,
			ДопПараметры);
			
			КолНовыхЭД = МассивНовыхЭД.Количество();
		КонецЕсли;
		
		СтруктураВозврата.Вставить("КоличествоНовыхЭД", КолНовыхЭД);
		
		Если Действия = "Сформировать" 
			Или Действия = "СформироватьПоказать" Тогда
			СтруктураВозврата.Вставить("МассивНовыхЭД", МассивНовыхЭД);
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если ТипЗнч(ЭД) <> Тип("Массив")
		И МассивСсылокНаОбъект.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	
	
	Возврат СтруктураВозврата;

	
	
КонецФункции


Функция СформироватьЭлектронныеДокументы(МассивОбъектов,ПараметрыОбмена,ДопПараметры = "")
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСтруктурОбмена = СформироватьXMLФайлыДокументов(МассивОбъектов, ПараметрыОбмена, ДопПараметры);
	МассивСформированныхЭД = Новый Массив;
	
	Для Каждого СтруктураОбмена Из МассивСтруктурОбмена Цикл
		
		ПолноеИмяФайла = СтруктураОбмена.ПолноеИмяФайла;
		
		Если НЕ ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		ДвоичныеДанные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		//АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ЧтениеТД = Новый ТекстовыйДокумент;
		ЧтениеТД.Прочитать(ПолноеИмяФайла);
		ТекстXML = ЧтениеТД.ПолучитьТекст();

		
		
		НовыйЭлектронныйДокументОбъект = СоздатьЭлектронныйДокумент(СтруктураОбмена.СтруктураЭД);
		НовыйЭлектронныйДокументОбъект.ФайлСообщения 	 = Новый ХранилищеЗначения(ДвоичныеДанные,Новый СжатиеДанных(9));
		НовыйЭлектронныйДокументОбъект.Сообщение     	 = ТекстXML;
		НовыйЭлектронныйДокументОбъект.ИмяФайлаСообщения = Файл.Имя;
		НоваяСтрока = НовыйЭлектронныйДокументОбъект.СтатусыСообщения.Добавить();
		НоваяСтрока.Период = ТекущаяДатаСеанса();
		НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
		НоваяСтрока.Статус = НовыйЭлектронныйДокументОбъект.ТекущийСтатус;
		НоваяСтрока.ИмяДокумента = Файл.Имя;
		НоваяСтрока.Расширение   = Файл.Расширение;
		НоваяСтрока.Документ     = НовыйЭлектронныйДокументОбъект.ФайлСообщения;
		
		
		
		
		НовыйЭлектронныйДокументОбъект.Записать();
		НовыйЭлектронныйДокумент = НовыйЭлектронныйДокументОбъект.Ссылка;
		
		Для каждого Строка Из СтруктураОбмена.СтруктураЭД.ДокументыОснования Цикл
			УстановитьСсылкуДляВладельцаВРегистреСостояний(Строка, НовыйЭлектронныйДокумент);
		КонецЦикла;
		МассивСформированныхЭД.Добавить(НовыйЭлектронныйДокумент);

		
	КонецЦикла;
	
	Возврат МассивСформированныхЭД
	
КонецФункции

Функция СоздатьЭлектронныйДокумент(СтруктураЭД)
	
	Если СтруктураЭД.Свойство("Входящий") И СтруктураЭД.Входящий Тогда
		НовыйЭлектронныйДокумент = Документы.ТК_СообщениеEDIВходящее.СоздатьДокумент();
	Иначе
		НовыйЭлектронныйДокумент = Документы.ТК_СообщениеEDIИсходящие.СоздатьДокумент();
	КонецЕсли;
	
	Если СтруктураЭД.Свойство("ДатаЭД") Тогда
		НовыйЭлектронныйДокумент.Дата = СтруктураЭД.ДатаЭД;
	Иначе
		НовыйЭлектронныйДокумент.Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	
	Если СтруктураЭД.Свойство("Владелец") Тогда
		НовыйЭлектронныйДокумент.ДокументОснование = СтруктураЭД.Владелец;
	КонецЕсли;

	Если СтруктураЭД.Свойство("Отправитель") Тогда
		НовыйЭлектронныйДокумент.Отправитель = СтруктураЭД.Отправитель;
	КонецЕсли;
	Если СтруктураЭД.Свойство("Получатель") Тогда
		НовыйЭлектронныйДокумент.Получатель = СтруктураЭД.Получатель;
	КонецЕсли;
		Если СтруктураЭД.Свойство("ПровайдерEDI") Тогда
		НовыйЭлектронныйДокумент.Провайдер = СтруктураЭД.ПровайдерEDI;
	КонецЕсли;
	
	Если СтруктураЭД.Свойство("ВидСообщения") Тогда
		НовыйЭлектронныйДокумент.ВидСообщения = СтруктураЭД.ВидСообщения;
	КонецЕсли;
	
	Если СтруктураЭД.Свойство("УчетнаяЗаписьEDI") Тогда
		НовыйЭлектронныйДокумент.УчетнаяЗаписьEDI = СтруктураЭД.УчетнаяЗаписьEDI;
	КонецЕсли;
	
	Если СтруктураЭД.Свойство("ОтправительGLN") Тогда
		НовыйЭлектронныйДокумент.ОтправительGLN = СтруктураЭД.ОтправительGLN;
	КонецЕсли;
	
	Если СтруктураЭД.Свойство("ПолучательGLN") Тогда
		НовыйЭлектронныйДокумент.ПолучательGLN = СтруктураЭД.ПолучательGLN;
	КонецЕсли;

	Если СтруктураЭД.Свойство("ТекущийСтатус") Тогда
		НовыйЭлектронныйДокумент.ТекущийСтатус = СтруктураЭД.ТекущийСтатус;
	Иначе
		НовыйЭлектронныйДокумент.ТекущийСтатус = Перечисления.СтатусыДокументовEDI.Создан;
	КонецЕсли;

	
	


	
	//НовыйЭлектронныйДокумент.Записать();
	//НовыйЭлектронныйДокументСсылка = НовыйЭлектронныйДокумент.Ссылка; 
	
	Возврат НовыйЭлектронныйДокумент;


КонецФункции



Процедура ПроверитьГотовностьИсточников(ДокументыМассив) Экспорт
	
	// Проверим проведенность документов.
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияТипаИзМассива(
										ДокументыМассив,
										Тип("СтрокаГруппировкиДинамическогоСписка"));
	
	МассивНепроведенныхДокументов = ОбщегоНазначения.ПроверитьПроведенностьДокументов(ДокументыМассив);
	Если МассивНепроведенныхДокументов.Количество() <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Документ %1 не проведен. Электронный документ не сформирован.'");
		Для Каждого НеПроведенныйДокумент Из МассивНепроведенныхДокументов Цикл
			Найденный = ДокументыМассив.Найти(НеПроведенныйДокумент.Ссылка);
			Если Найденный <> Неопределено Тогда
				
				ДокументыМассив.Удалить(Найденный);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
					Строка(НеПроведенныйДокумент.Ссылка));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНедоступныеДляФормированияEDIбъекты(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияEDI.СсылкаНаОбъект КАК СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.ТК_СостояниеEDI КАК СостоянияEDI
	|ГДЕ
	|	СостоянияEDI.СсылкаНаОбъект В(&МассивСсылок)
	|	И (НЕ СостоянияEDI.ЭлектронныйДокумент.ТекущийСтатус В (ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.НеСформирован), ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.ОшибкаПередачи), ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.ТребуетсяУточнитьДокумент), ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовEDI.ЗакрытПринудительно))
	|			И НЕ СостоянияEDI.ЭлектронныйДокумент.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Индекс = МассивСсылок.Найти(Результат.СсылкаНаОбъект);
		МассивСсылок.Удалить(Индекс);
		ШаблонСообщения = НСтр("ru='Для документа %1 уже есть актуальный электронный документ.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Результат.СсылкаНаОбъект);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти



#Область Прочее
Процедура СообщитьОбОтсутствииНастройкиEDI(Параметры, Источник)
	
	ШаблонСообщения = НСтр("ru = 'Обработка %1.
	|Операция не выполнена.
	|Необходимо создать ""Настройку EDI"" с реквизитами:'");
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Источник);
	
	Текст = Текст + Символы.ПС + НСтр("ru = '<%1>: %2'");
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, "Контрагент", Строка(Параметры.Контрагент));

	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
КонецПроцедуры

#КонецОбласти
