

Функция ТекстЗапросаПоОплатам(Вариант)
	
	Если не ЗначениеЗаполнено(Вариант) Или Вариант ="1" Тогда	
		
		ЗапросТекст = 
		"ВЫБРАТЬ
		|	ДоговорыВзаиморасчетов.Контрагент КАК СсылкаКонтрагент,
		|	ДоговорыВзаиморасчетов.Ссылка КАК СсылкаДоговор,
		|	ВЫБОР
		|		КОГДА &РегламентированныйУчет
		|			ТОГДА ЕСТЬNULL(СрокиОплатПоДоговорамСрезПоследних.Дней, 0)
		|		ИНАЧЕ ЕСТЬNULL(СрокиОплатПоДоговорамСрезПоследних.Дней2, 0)
		|	КОНЕЦ КАК ДнейОтсрочки,
		|	СрокиОплатПоДоговорамСрезПоследних.ТипОплаты КАК ТипОплаты,
		|	ДоговорыВзаиморасчетов.ТоварныйКредит КАК ТоварныйКредит
		|ПОМЕСТИТЬ ВТ_ДоговораПоставка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатПоДоговорам.СрезПоследних(, ) КАК СрокиОплатПоДоговорамСрезПоследних
		|		ПО ДоговорыВзаиморасчетов.Ссылка = СрокиОплатПоДоговорамСрезПоследних.ДоговорКонтрагента
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Менеджер = &Менеджер
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Организация = &Организация
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Контрагент = &Контрагент
		|		КОНЕЦ
		|	И ДоговорыВзаиморасчетов.ВидДоговора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Покупка)
		|	И ВЫБОР
		|			КОГДА &СсылкаПодразделение = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Подразделение = &СсылкаПодразделение
		|		КОНЕЦ
		|	И ДоговорыВзаиморасчетов.Контрагент.ВидКонтрагента <> ЗНАЧЕНИЕ(перечисление.ВидыКонтрагентов.Внутренний)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСПоставщикамиПоДокументамОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыСПоставщикамиПоДокументамОстатки.Сделка КАК Сделка
		|ПОМЕСТИТЬ ВТ_Взаиморасчеты
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|			&ДатаОстатков,
		|			ДоговорВзаиморасчетов В
		|					(ВЫБРАТЬ
		|						ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|					ИЗ
		|						ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|					СГРУППИРОВАТЬ ПО
		|						ВТ_ДоговораПоставка.СсылкаДоговор)
		|				И РегламентированныйУчет = &РегламентированныйУчет) КАК РасчетыСПоставщикамиПоДокументамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Взаиморасчеты.Контрагент КАК Контрагент,
		|	ВТ_Взаиморасчеты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_Взаиморасчеты.СуммаОстаток КАК СуммаВзаиморасчетов,
		|	ВТ_ДоговораПоставка.ДнейОтсрочки КАК ДнейОтсрочки,
		|	ВЫБОР
		|		КОГДА ВТ_Взаиморасчеты.Сделка ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ВТ_Взаиморасчеты.Сделка КАК Документ.ПоступлениеТоваров).Дата, ДЕНЬ, ВТ_ДоговораПоставка.ДнейОтсрочки)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОтсрочка, ДЕНЬ, -ВТ_ДоговораПоставка.ДнейОтсрочки)
		|	КОНЕЦ КАК ДатаСделки
		|ПОМЕСТИТЬ ВТ_ДолгиОтсрочка
		|ИЗ
		|	ВТ_Взаиморасчеты КАК ВТ_Взаиморасчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|		ПО ВТ_Взаиморасчеты.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ КАК ДоговорВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РегламентированныйУчет,
		|	СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток) КАК СуммаУпрОстаток,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ПартииВсе
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки КАК ПартииТоваровКомпанииОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании,
		|	ПартииТоваровКомпанииОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|	ВТ_ПартииВсе.СуммаУпрОстаток КАК СуммаУпрОстаток
		|ПОМЕСТИТЬ ВТ_Партии
		|ИЗ
		|	ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|ГДЕ
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|			(ВЫБРАТЬ
		|				ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|			ИЗ
		|				ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_ДоговораПоставка.СсылкаДоговор)
		|	И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.РегламентированныйУчет КАК РегламентированныйУчет,
		|	СУММА(ВложенныйЗапрос.СуммаОС) КАК СуммаОС
		|ПОМЕСТИТЬ ВТ_ПартииОС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|		СУММА(ВТ_ПартииВсе.СуммаУпрОстаток) КАК СуммаОС
		|	ИЗ
		|		ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|	ГДЕ
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ДоговораПоставка.СсылкаДоговор)
		|		И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|		И ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ПартииВсе.Контрагент,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		СУММА(ВТ_ПартииВсе.СуммаУпрОстаток)
		|	ИЗ
		|		ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|	ГДЕ
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ДоговораПоставка.СсылкаДоговор)
		|		И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|		И ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.Возвратный)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.Контрагент) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.РегламентированныйУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
		|	СкладыКомпании.Ссылка КАК Склад
		|ПОМЕСТИТЬ Вт_ТоварыВнеМатрицы
		|ИЗ
		|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&ДатаОстатков, ) КАК ОграничениеАссортиментаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
		|		ПО ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка = СкладыКомпании.ТорговаяПлощадка
		|ГДЕ
		|	ЕСТЬNULL(ОграничениеАссортиментаСрезПоследних.Состояние, 9) <> 1
		|
		|СГРУППИРОВАТЬ ПО
		|	ОграничениеАссортиментаСрезПоследних.Номенклатура,
		|	СкладыКомпании.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|	СУММА(ВТ_ПартииВсе.СуммаУпрОстаток) КАК СуммаВнеМатрицы
		|ПОМЕСТИТЬ ВтВнеМатрицы
		|ИЗ
		|	Вт_ТоварыВнеМатрицы КАК Вт_ТоварыВнеМатрицы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|		ПО Вт_ТоварыВнеМатрицы.Номенклатура = ВТ_ПартииВсе.Номенклатура
		|			И Вт_ТоварыВнеМатрицы.Склад = ВТ_ПартииВсе.СкладКомпании
		|ГДЕ
		|	ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|	И ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|			(ВЫБРАТЬ
		|				ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|			ИЗ
		|				ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_ДоговораПоставка.СсылкаДоговор)
		|	И (ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|			ИЛИ ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет,
		|	ВТ_ПартииВсе.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТБД.Поставщик КАК Контрагент,
		|	ТаблицаТБД.Договор КАК ДоговорВзаиморасчетов,
		|	ТаблицаТБД.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ Вт_ТБД
		|ИЗ
		|	&ТаблицаТБД КАК ТаблицаТБД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ТБД.Контрагент КАК Контрагент,
		|	Вт_ТБД.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	СУММА(Вт_ТБД.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ Вт_ИтогТБД
		|ИЗ
		|	Вт_ТБД КАК Вт_ТБД
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ТБД.Контрагент,
		|	Вт_ТБД.ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_Платежи
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент КАК Контрагент,
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		МАКСИМУМ(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата) КАК Дата
		|	ИЗ
		|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент, СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаКонтрагент,
		|					ВТ_ДоговораПоставка.СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка)
		|		И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|		И &РегламентированныйУчет = ИСТИНА
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов,
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасходныйКассовыйОрдер.Контрагент,
		|		РасходныйКассовыйОрдер.ДоговорВзаиморасчетов,
		|		МАКСИМУМ(РасходныйКассовыйОрдер.Дата)
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|	ГДЕ
		|		РасходныйКассовыйОрдер.Проведен
		|		И РасходныйКассовыйОрдер.РегламентированныйУчет = ЛОЖЬ
		|		И (РасходныйКассовыйОрдер.Контрагент, РасходныйКассовыйОрдер.ДоговорВзаиморасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаКонтрагент,
		|					ВТ_ДоговораПоставка.СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасходныйКассовыйОрдер.Контрагент,
		|		РасходныйКассовыйОрдер.ДоговорВзаиморасчетов) КАК ВложенныйЗапрос
		|ГДЕ
		|	&РегламентированныйУчет = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	ВложенныйЗапрос.ВзаиморасчетОтсрочка КАК ВзаиморасчетОтсрочка,
		|	ВложенныйЗапрос.СуммаПартий КАК СуммаПартий,
		|	ЕСТЬNULL(ВТ_Платежи.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК Оплата,
		|	ВТ_ДоговораПоставка.ТоварныйКредит КАК ТоварныйКредит,
		|	ВложенныйЗапрос.Контрагент.Код КАК КонтрагентID,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Код КАК ДоговорID,
		|	ВТ_ДоговораПоставка.ДнейОтсрочки КАК СрокОплаты,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер) КАК Менеджер,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер.Код КАК МенеджерID,
		|	ВЫБОР
		|		КОГДА ВТ_ДоговораПоставка.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыПоДоговору.СОтстрочкойПоРеализации)
		|			ТОГДА ""РО""
		|		КОГДА ВТ_ДоговораПоставка.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыПоДоговору.ПоРеализации)
		|			ТОГДА ""Р""
		|		ИНАЧЕ ""Д""
		|	КОНЕЦ КАК ТипОплаты,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер КАК МенеджерСсылка,
		|	ЕСТЬNULL(ВтВнеМатрицы.СуммаВнеМатрицы, 0) КАК СуммаВнеМатрицы,
		|	ЕСТЬNULL(ВТ_ПартииОС.СуммаОС, 0) КАК СуммаОС,
		|	ЕСТЬNULL(Вт_ИтогТБД.СуммаКонечныйОстаток, 0) КАК ТБД
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Контрагент КАК Контрагент,
		|		ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		СУММА(ВложенныйЗапрос.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|		СУММА(ВложенныйЗапрос.ВзаиморасчетОтсрочка) КАК ВзаиморасчетОтсрочка,
		|		СУММА(ВложенныйЗапрос.СуммаПартий) КАК СуммаПартий
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВТ_ДолгиОтсрочка.Контрагент КАК Контрагент,
		|			ВТ_ДолгиОтсрочка.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|			СУММА(ВТ_ДолгиОтсрочка.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|			СУММА(ВЫБОР
		|					КОГДА ВТ_ДолгиОтсрочка.ДатаСделки <= &ДатаОтсрочка
		|						ТОГДА ВТ_ДолгиОтсрочка.СуммаВзаиморасчетов
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ВзаиморасчетОтсрочка,
		|			СУММА(0) КАК СуммаПартий
		|		ИЗ
		|			ВТ_ДолгиОтсрочка КАК ВТ_ДолгиОтсрочка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ДолгиОтсрочка.ДоговорВзаиморасчетов,
		|			ВТ_ДолгиОтсрочка.Контрагент
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВТ_Партии.Контрагент,
		|			ВТ_Партии.ДоговорВзаиморасчетов,
		|			0,
		|			0,
		|			ВТ_Партии.СуммаУпрОстаток
		|		ИЗ
		|			ВТ_Партии КАК ВТ_Партии) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Контрагент,
		|		ВложенныйЗапрос.ДоговорВзаиморасчетов) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Платежи КАК ВТ_Платежи
		|		ПО ВложенныйЗапрос.Контрагент = ВТ_Платежи.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВТ_Платежи.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|		ПО ВложенныйЗапрос.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартииОС КАК ВТ_ПартииОС
		|		ПО ВложенныйЗапрос.Контрагент = ВТ_ПартииОС.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВТ_ПартииОС.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВнеМатрицы КАК ВтВнеМатрицы
		|		ПО ВложенныйЗапрос.Контрагент = ВтВнеМатрицы.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВтВнеМатрицы.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИтогТБД КАК Вт_ИтогТБД
		|		ПО ВложенныйЗапрос.Контрагент = Вт_ИтогТБД.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = Вт_ИтогТБД.ДоговорВзаиморасчетов
		|ГДЕ
		|	НЕ(ВложенныйЗапрос.СуммаВзаиморасчетов = 0
		|				И ВложенныйЗапрос.ВзаиморасчетОтсрочка = 0
		|				И ВложенныйЗапрос.СуммаПартий = 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МенеджерСсылка,
		|	Контрагент,
		|	ДоговорВзаиморасчетов";
	Иначе
		///новый запрос
		ЗапросТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыВзаиморасчетов.Контрагент КАК СсылкаКонтрагент,
		|	ДоговорыВзаиморасчетов.Ссылка КАК СсылкаДоговор,
		|	ВЫБОР
		|		КОГДА &РегламентированныйУчет
		|			ТОГДА ЕСТЬNULL(СрокиОплатПоДоговорам.Дней, 0)
		|		ИНАЧЕ ЕСТЬNULL(СрокиОплатПоДоговорам.Дней2, 0)
		|	КОНЕЦ КАК ДнейОтсрочки,
		|	СрокиОплатПоДоговорам.ТипОплаты КАК ТипОплаты,
		|	ДоговорыВзаиморасчетов.ТоварныйКредит КАК ТоварныйКредит,
		|	СрокиОплатПоДоговорам.Период КАК ПериодНачалаОтсрочки
		|ПОМЕСТИТЬ ВТ_ДоговораПоставка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатПоДоговорам КАК СрокиОплатПоДоговорам
		|		ПО ДоговорыВзаиморасчетов.Ссылка = СрокиОплатПоДоговорам.ДоговорКонтрагента
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Менеджер = &Менеджер
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Организация = &Организация
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Контрагент = &Контрагент
		|		КОНЕЦ
		|	И ДоговорыВзаиморасчетов.ВидДоговора.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Покупка)
		|	И ВЫБОР
		|			КОГДА &СсылкаПодразделение = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыВзаиморасчетов.Подразделение = &СсылкаПодразделение
		|		КОНЕЦ
		|	И ДоговорыВзаиморасчетов.Контрагент.ВидКонтрагента <> ЗНАЧЕНИЕ(перечисление.ВидыКонтрагентов.Внутренний)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСПоставщикамиПоДокументамОстатки.Контрагент КАК Контрагент,
		|	РасчетыСПоставщикамиПоДокументамОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	РасчетыСПоставщикамиПоДокументамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыСПоставщикамиПоДокументамОстатки.Сделка КАК Сделка,
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщикамиПоДокументамОстатки.Сделка ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументамОстатки.Сделка КАК Документ.ПоступлениеТоваров).Дата
		|		ИНАЧЕ &ДатаОтсрочка
		|	КОНЕЦ КАК ДатаПоставки
		|ПОМЕСТИТЬ ВТ_Взаиморасчеты
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
		|			&ДатаОстатков,
		|			ДоговорВзаиморасчетов В
		|					(ВЫБРАТЬ
		|						ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|					ИЗ
		|						ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|					СГРУППИРОВАТЬ ПО
		|						ВТ_ДоговораПоставка.СсылкаДоговор)
		|				И РегламентированныйУчет = &РегламентированныйУчет) КАК РасчетыСПоставщикамиПоДокументамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Взаиморасчеты.Контрагент КАК Контрагент,
		|	ВТ_Взаиморасчеты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_Взаиморасчеты.СуммаОстаток КАК СуммаВзаиморасчетов,
		|	ВТ_ДоговораПоставка.ДнейОтсрочки КАК ДнейОтсрочки,
		|	ВЫБОР
		|		КОГДА ВТ_Взаиморасчеты.Сделка ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_Взаиморасчеты.ДатаПоставки, ДЕНЬ, ВТ_ДоговораПоставка.ДнейОтсрочки)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаОтсрочка, ДЕНЬ, -ВТ_ДоговораПоставка.ДнейОтсрочки)
		|	КОНЕЦ КАК ДатаСделки,
		|	ВТ_ДоговораПоставка.ПериодНачалаОтсрочки КАК ПериодНачалаОтсрочки,
		|	ВТ_ДоговораПоставка.ТипОплаты КАК ТипОплаты,
		|	ЕСТЬNULL(ВТ_ДоговораПоставка.ТоварныйКредит, 0) КАК ТоварныйКредит
		|ПОМЕСТИТЬ ВТ_ДолгиОтсрочка
		|ИЗ
		|	ВТ_Взаиморасчеты КАК ВТ_Взаиморасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|		ПО ВТ_Взаиморасчеты.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|			И (ВТ_ДоговораПоставка.ПериодНачалаОтсрочки В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ВТ_ДоговораПоставка.ПериодНачалаОтсрочки КАК ПериодНачалаОтсрочки
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				ГДЕ
		|					ВТ_Взаиморасчеты.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|					И ВТ_Взаиморасчеты.ДатаПоставки >= ВТ_ДоговораПоставка.ПериодНачалаОтсрочки
		|				УПОРЯДОЧИТЬ ПО
		|					ПериодНачалаОтсрочки УБЫВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ КАК ДоговорВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РегламентированныйУчет,
		|	СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток) КАК СуммаУпрОстаток,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Дата
		|		ИНАЧЕ ДАТАВРЕМЯ(2000, 1, 1, 0, 0, 0)
		|	КОНЕЦ КАК ДатаПоставки,
		|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании
		|ПОМЕСТИТЬ ВТ_ПартииВсе
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки КАК ПартииТоваровКомпанииОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).ДоговорВзаиморасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).РегламентированныйУчет
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		|			ТОГДА ВЫРАЗИТЬ(ПартииТоваровКомпанииОстатки.Партия КАК Документ.ПоступлениеТоваров).Дата
		|		ИНАЧЕ ДАТАВРЕМЯ(2000, 1, 1, 0, 0, 0)
		|	КОНЕЦ,
		|	ПартииТоваровКомпанииОстатки.Номенклатура,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|	ВТ_ПартииВсе.СуммаУпрОстаток КАК СуммаУпрОстаток,
		|	ВТ_ПартииВсе.ДатаПоставки КАК ДатаПоставки,
		|	ВТ_ДоговораПоставка.ДнейОтсрочки КАК ДнейОтсрочки,
		|	ВТ_ДоговораПоставка.ТипОплаты КАК ТипОплаты,
		|	ЕСТЬNULL(ВТ_ДоговораПоставка.ТоварныйКредит, 0) КАК ТоварныйКредит
		|ПОМЕСТИТЬ ВТ_Партии
		|ИЗ
		|	ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|		ПО ВТ_ПартииВсе.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|			И (ВТ_ДоговораПоставка.ПериодНачалаОтсрочки В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ВТ_ДоговораПоставка.ПериодНачалаОтсрочки КАК ПериодНачалаОтсрочки
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				ГДЕ
		|					ВТ_ПартииВсе.ДоговорВзаиморасчетов = ВТ_ДоговораПоставка.СсылкаДоговор
		|					И ВТ_ПартииВсе.ДатаПоставки >= ВТ_ДоговораПоставка.ПериодНачалаОтсрочки
		|				УПОРЯДОЧИТЬ ПО
		|					ПериодНачалаОтсрочки УБЫВ))
		|ГДЕ
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|			(ВЫБРАТЬ
		|				ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|			ИЗ
		|				ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_ДоговораПоставка.СсылкаДоговор)
		|	И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.РегламентированныйУчет КАК РегламентированныйУчет,
		|	СУММА(ВложенныйЗапрос.СуммаОС) КАК СуммаОС
		|ПОМЕСТИТЬ ВТ_ПартииОС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|		СУММА(ВТ_ПартииВсе.СуммаУпрОстаток) КАК СуммаОС
		|	ИЗ
		|		ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|	ГДЕ
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ДоговораПоставка.СсылкаДоговор)
		|		И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|		И ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТНП)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ПартииВсе.Контрагент,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		СУММА(ВТ_ПартииВсе.СуммаУпрОстаток)
		|	ИЗ
		|		ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|	ГДЕ
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|				СГРУППИРОВАТЬ ПО
		|					ВТ_ДоговораПоставка.СсылкаДоговор)
		|		И ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|		И ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.Возвратный)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_ПартииВсе.РегламентированныйУчет,
		|		ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|		ВТ_ПартииВсе.Контрагент) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.РегламентированныйУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
		|	СкладыКомпании.Ссылка КАК Склад
		|ПОМЕСТИТЬ Вт_ТоварыВнеМатрицы
		|ИЗ
		|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&ДатаОстатков, ) КАК ОграничениеАссортиментаСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
		|		ПО ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка = СкладыКомпании.ТорговаяПлощадка
		|ГДЕ
		|	ЕСТЬNULL(ОграничениеАссортиментаСрезПоследних.Состояние, 9) <> 1
		|
		|СГРУППИРОВАТЬ ПО
		|	ОграничениеАссортиментаСрезПоследних.Номенклатура,
		|	СкладыКомпании.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПартииВсе.Контрагент КАК Контрагент,
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет КАК РегламентированныйУчет,
		|	СУММА(ВТ_ПартииВсе.СуммаУпрОстаток) КАК СуммаВнеМатрицы
		|ПОМЕСТИТЬ ВтВнеМатрицы
		|ИЗ
		|	Вт_ТоварыВнеМатрицы КАК Вт_ТоварыВнеМатрицы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПартииВсе КАК ВТ_ПартииВсе
		|		ПО Вт_ТоварыВнеМатрицы.Номенклатура = ВТ_ПартииВсе.Номенклатура
		|			И Вт_ТоварыВнеМатрицы.Склад = ВТ_ПартииВсе.СкладКомпании
		|ГДЕ
		|	ВТ_ПартииВсе.РегламентированныйУчет = &РегламентированныйУчет
		|	И ВТ_ПартииВсе.ДоговорВзаиморасчетов В
		|			(ВЫБРАТЬ
		|				ВТ_ДоговораПоставка.СсылкаДоговор КАК СсылкаДоговор
		|			ИЗ
		|				ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_ДоговораПоставка.СсылкаДоговор)
		|	И (ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйЗал)
		|			ИЛИ ВТ_ПартииВсе.СкладКомпании.ВидСклада = ЗНАЧЕНИЕ(Справочник.ВидыСкладов.ТорговыйПавильон))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПартииВсе.ДоговорВзаиморасчетов,
		|	ВТ_ПартииВсе.РегламентированныйУчет,
		|	ВТ_ПартииВсе.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТБД.Поставщик КАК Поставщик,
		|	ТаблицаТБД.Договор КАК ДоговорВзаиморасчетов,
		|	ТаблицаТБД.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ПОМЕСТИТЬ Вт_ТБД
		|ИЗ
		|	&ТаблицаТБД КАК ТаблицаТБД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ТБД.Поставщик КАК Поставщик,
		|	Вт_ТБД.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	СУММА(Вт_ТБД.СуммаКонечныйОстаток) КАК ТБД
		|ПОМЕСТИТЬ Вт_ИтогТБД
		|ИЗ
		|	Вт_ТБД КАК Вт_ТБД
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ТБД.ДоговорВзаиморасчетов,
		|	Вт_ТБД.Поставщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_Платежи
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент КАК Контрагент,
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		МАКСИМУМ(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата) КАК Дата
		|	ИЗ
		|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент, СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаКонтрагент,
		|					ВТ_ДоговораПоставка.СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка)
		|		И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|		И &РегламентированныйУчет = ИСТИНА
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ДоговорВзаиморасчетов,
		|		СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Контрагент
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасходныйКассовыйОрдер.Контрагент,
		|		РасходныйКассовыйОрдер.ДоговорВзаиморасчетов,
		|		МАКСИМУМ(РасходныйКассовыйОрдер.Дата)
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|	ГДЕ
		|		РасходныйКассовыйОрдер.Проведен
		|		И РасходныйКассовыйОрдер.РегламентированныйУчет = ЛОЖЬ
		|		И (РасходныйКассовыйОрдер.Контрагент, РасходныйКассовыйОрдер.ДоговорВзаиморасчетов) В
		|				(ВЫБРАТЬ
		|					ВТ_ДоговораПоставка.СсылкаКонтрагент,
		|					ВТ_ДоговораПоставка.СсылкаДоговор
		|				ИЗ
		|					ВТ_ДоговораПоставка КАК ВТ_ДоговораПоставка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РасходныйКассовыйОрдер.Контрагент,
		|		РасходныйКассовыйОрдер.ДоговорВзаиморасчетов) КАК ВложенныйЗапрос
		|ГДЕ
		|	&РегламентированныйУчет = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВложенныйЗапрос.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	ВложенныйЗапрос.ВзаиморасчетОтсрочка КАК ВзаиморасчетОтсрочка,
		|	ВложенныйЗапрос.СуммаПартий КАК СуммаПартий,
		|	ЕСТЬNULL(ВТ_Платежи.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК Оплата,
		|	ВложенныйЗапрос.ТоварныйКредит КАК ТоварныйКредит,
		|	ВложенныйЗапрос.Контрагент.Код КАК КонтрагентID,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Код КАК ДоговорID,
		|	ВложенныйЗапрос.ДнейОтсрочки КАК СрокОплаты,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер) КАК Менеджер,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер.Код КАК МенеджерID,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыПоДоговору.СОтстрочкойПоРеализации)
		|			ТОГДА ""РО""
		|		КОГДА ВложенныйЗапрос.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыПоДоговору.ПоРеализации)
		|			ТОГДА ""Р""
		|		ИНАЧЕ ""Д""
		|	КОНЕЦ КАК ТипОплаты,
		|	ВложенныйЗапрос.ДоговорВзаиморасчетов.Менеджер КАК МенеджерСсылка,
		|	ВложенныйЗапрос.ДнейОтсрочки КАК ДнейОтсрочки,
		|	ЕСТЬNULL(ВтВнеМатрицы.СуммаВнеМатрицы, 0) КАК СуммаВнеМатрицы,
		|	ЕСТЬNULL(ВТ_ПартииОС.СуммаОС, 0) КАК СуммаОС,
		|	ЕСТЬNULL(Вт_ИтогТБД.ТБД, 0) КАК ТБД
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Контрагент КАК Контрагент,
		|		ВложенныйЗапрос.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|		СУММА(ВложенныйЗапрос.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|		СУММА(ВложенныйЗапрос.ВзаиморасчетОтсрочка) КАК ВзаиморасчетОтсрочка,
		|		СУММА(ВложенныйЗапрос.СуммаПартий) КАК СуммаПартий,
		|		ВложенныйЗапрос.ДнейОтсрочки КАК ДнейОтсрочки,
		|		ВложенныйЗапрос.ТипОплаты КАК ТипОплаты,
		|		ВложенныйЗапрос.ТоварныйКредит КАК ТоварныйКредит
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВТ_ДолгиОтсрочка.Контрагент КАК Контрагент,
		|			ВТ_ДолгиОтсрочка.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|			СУММА(ВТ_ДолгиОтсрочка.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|			СУММА(ВЫБОР
		|					КОГДА ВТ_ДолгиОтсрочка.ДатаСделки <= &ДатаОтсрочка
		|						ТОГДА ВТ_ДолгиОтсрочка.СуммаВзаиморасчетов
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ВзаиморасчетОтсрочка,
		|			СУММА(0) КАК СуммаПартий,
		|			ВТ_ДолгиОтсрочка.ДнейОтсрочки КАК ДнейОтсрочки,
		|			ВТ_ДолгиОтсрочка.ТипОплаты КАК ТипОплаты,
		|			ВТ_ДолгиОтсрочка.ТоварныйКредит КАК ТоварныйКредит
		|		ИЗ
		|			ВТ_ДолгиОтсрочка КАК ВТ_ДолгиОтсрочка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ДолгиОтсрочка.ДоговорВзаиморасчетов,
		|			ВТ_ДолгиОтсрочка.Контрагент,
		|			ВТ_ДолгиОтсрочка.ДнейОтсрочки,
		|			ВТ_ДолгиОтсрочка.ТипОплаты,
		|			ВТ_ДолгиОтсрочка.ТоварныйКредит
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВТ_Партии.Контрагент,
		|			ВТ_Партии.ДоговорВзаиморасчетов,
		|			0,
		|			0,
		|			ВТ_Партии.СуммаУпрОстаток,
		|			ВТ_Партии.ДнейОтсрочки,
		|			ВТ_Партии.ТипОплаты,
		|			ВТ_Партии.ТоварныйКредит
		|		ИЗ
		|			ВТ_Партии КАК ВТ_Партии) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Контрагент,
		|		ВложенныйЗапрос.ДоговорВзаиморасчетов,
		|		ВложенныйЗапрос.ДнейОтсрочки,
		|		ВложенныйЗапрос.ТипОплаты,
		|		ВложенныйЗапрос.ТоварныйКредит) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Платежи КАК ВТ_Платежи
		|		ПО ВложенныйЗапрос.Контрагент = ВТ_Платежи.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВТ_Платежи.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВнеМатрицы КАК ВтВнеМатрицы
		|		ПО ВложенныйЗапрос.Контрагент = ВтВнеМатрицы.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВтВнеМатрицы.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПартииОС КАК ВТ_ПартииОС
		|		ПО ВложенныйЗапрос.Контрагент = ВТ_ПартииОС.Контрагент
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = ВТ_ПартииОС.ДоговорВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИтогТБД КАК Вт_ИтогТБД
		|		ПО ВложенныйЗапрос.Контрагент = Вт_ИтогТБД.Поставщик
		|			И ВложенныйЗапрос.ДоговорВзаиморасчетов = Вт_ИтогТБД.ДоговорВзаиморасчетов
		|ГДЕ
		|	НЕ(ВложенныйЗапрос.СуммаВзаиморасчетов = 0
		|				И ВложенныйЗапрос.ВзаиморасчетОтсрочка = 0
		|				И ВложенныйЗапрос.СуммаПартий = 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МенеджерСсылка,
		|	Контрагент,
		|	ДоговорВзаиморасчетов";
	КонецЕсли;
	Возврат ЗапросТекст
	
	
КонецФункции

Функция ТекстЗапросаПоАренде()
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	УсловияАрендыПоДоговорам.Период КАК ПериодТекущий,
	|	УсловияАрендыПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	УсловияАрендыПоДоговорам.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	МАКСИМУМ(ЕСТЬNULL(УсловияАрендыПоДоговорамПредыдущие.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ПериодПредудущая,
	|	УсловияАрендыПоДоговорам.СуммаФ1 КАК СуммаФ1,
	|	УсловияАрендыПоДоговорам.СуммаФ2 КАК СуммаФ2,
	|	УсловияАрендыПоДоговорам.ГарантийныйПлатеж КАК ГарантийныйПлатеж
	|ПОМЕСТИТЬ Вт_Договора
	|ИЗ
	|	РегистрСведений.УсловияАрендыПоДоговорам КАК УсловияАрендыПоДоговорам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияАрендыПоДоговорам КАК УсловияАрендыПоДоговорамПредыдущие
	|		ПО УсловияАрендыПоДоговорам.ДоговорКонтрагента = УсловияАрендыПоДоговорамПредыдущие.ДоговорКонтрагента
	|			И УсловияАрендыПоДоговорам.ТорговаяПлощадка = УсловияАрендыПоДоговорамПредыдущие.ТорговаяПлощадка
	|			И УсловияАрендыПоДоговорам.Период > УсловияАрендыПоДоговорамПредыдущие.Период
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УсловияАрендыПоДоговорам.ДоговорКонтрагента.Организация = &Организация
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СсылкаПодразделение = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УсловияАрендыПоДоговорам.ДоговорКонтрагента.Подразделение = &СсылкаПодразделение
	|		КОНЕЦ
	|	И УсловияАрендыПоДоговорам.ДоговорКонтрагента.ДатаОкончанияДействия > &ДатаОкончанияДействия
	|	И ВЫБОР
	|			КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ УсловияАрендыПоДоговорам.ДоговорКонтрагента.Контрагент = &Контрагент
	|		КОНЕЦ
	|	И УсловияАрендыПоДоговорам.ТорговаяПлощадка <> ЗНАЧЕНИЕ(Справочник.ТорговыеПлощадки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УсловияАрендыПоДоговорам.Период,
	|	УсловияАрендыПоДоговорам.ДоговорКонтрагента,
	|	УсловияАрендыПоДоговорам.ТорговаяПлощадка,
	|	УсловияАрендыПоДоговорам.СуммаФ1,
	|	УсловияАрендыПоДоговорам.СуммаФ2,
	|	УсловияАрендыПоДоговорам.ГарантийныйПлатеж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Договора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВЫБОР
	|			КОГДА Вт_Договора.ТорговаяПлощадка.ДатаОткрытия > &ДатаОтсчета
	|					И Вт_Договора.ТорговаяПлощадка.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодТекущий, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|						КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								И Вт_Договора.ПериодТекущий < Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ТорговаяПлощадка.ДатаОткрытия, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|						КОГДА Вт_Договора.ПериодПредудущая < Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ТорговаяПлощадка.ДатаОткрытия, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|						КОГДА Вт_Договора.ПериодПредудущая > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодПредудущая, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодТекущий, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|					КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И Вт_Договора.ПериодТекущий < &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|					КОГДА Вт_Договора.ПериодПредудущая < &ДатаОтсчета
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|					КОГДА Вт_Договора.ПериодПредудущая > &ДатаОтсчета
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодПредудущая, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаФ1,
	|	СУММА(ВЫБОР
	|			КОГДА Вт_Договора.ТорговаяПлощадка.ДатаОткрытия > &ДатаОтсчета
	|					И Вт_Договора.ТорговаяПлощадка.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА Вт_Договора.ПериодПредудущая <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодТекущий, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|						КОГДА Вт_Договора.ПериодПредудущая <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								И Вт_Договора.ПериодТекущий < Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ТорговаяПлощадка.ДатаОткрытия, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|						КОГДА Вт_Договора.ПериодПредудущая < Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ТорговаяПлощадка.ДатаОткрытия, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|						КОГДА Вт_Договора.ПериодПредудущая > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|								И Вт_Договора.ПериодТекущий > Вт_Договора.ТорговаяПлощадка.ДатаОткрытия
	|							ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодПредудущая, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодТекущий, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|					КОГДА Вт_Договора.ПериодПредудущая = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И Вт_Договора.ПериодТекущий < &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, &ДатаОкончанияДействия, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|					КОГДА Вт_Договора.ПериодПредудущая < &ДатаОтсчета
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаОтсчета, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|					КОГДА Вт_Договора.ПериодПредудущая > &ДатаОтсчета
	|							И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|						ТОГДА РАЗНОСТЬДАТ(Вт_Договора.ПериодПредудущая, Вт_Договора.ПериодТекущий, МЕСЯЦ) * Вт_Договора.СуммаФ2
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаФ2,
	|	Вт_Договора.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ПОМЕСТИТЬ Вт_Долг
	|ИЗ
	|	Вт_Договора КАК Вт_Договора
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_Договора.ДоговорКонтрагента,
	|	Вт_Договора.ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА Вт_Договора.ПериодПредудущая <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И Вт_Договора.ПериодТекущий > &ДатаОтсчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Вт_Договора.ПериодПредудущая <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И Вт_Договора.ПериодТекущий < &ДатаОтсчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Долг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Вт_Долг.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	СУММА(Вт_Долг.СуммаФ1) КАК СуммаФ1,
	|	СУММА(Вт_Долг.СуммаФ2) КАК СуммаФ2
	|ПОМЕСТИТЬ Вт_Общее
	|ИЗ
	|	Вт_Долг КАК Вт_Долг
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_Долг.ДоговорКонтрагента,
	|	Вт_Долг.ТорговаяПлощадка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УсловияАрендыПоДоговорамСрезПоследних.ДоговорКонтрагента,
	|	УсловияАрендыПоДоговорамСрезПоследних.ТорговаяПлощадка,
	|	УсловияАрендыПоДоговорамСрезПоследних.СуммаФ1,
	|	УсловияАрендыПоДоговорамСрезПоследних.СуммаФ2
	|ИЗ
	|	РегистрСведений.УсловияАрендыПоДоговорам.СрезПоследних(
	|			&ДатаОкончанияДействия,
	|			(ДоговорКонтрагента, ТорговаяПлощадка) В
	|				(ВЫБРАТЬ
	|					Вт_Договора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|					Вт_Договора.ТорговаяПлощадка КАК ТорговаяПлощадка
	|				ИЗ
	|					Вт_Договора КАК Вт_Договора)) КАК УсловияАрендыПоДоговорамСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_Общее.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Вт_Общее.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	СУММА(Вт_Общее.СуммаФ1) КАК СуммаФ1,
	|	СУММА(Вт_Общее.СуммаФ2) КАК СуммаФ2
	|ПОМЕСТИТЬ Вт_ОбщееИтог
	|ИЗ
	|	Вт_Общее КАК Вт_Общее
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_Общее.ТорговаяПлощадка,
	|	Вт_Общее.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""ПлощадьОбщая""
	|				ТОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТорговаяПлощадь,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""ВидПлощадки""
	|				ТОГДА ТорговыеПлощадкиДополнительныеРеквизиты.Значение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТипОбьекта,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК ТорговаяПлощадка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.Код КАК Код,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ТерриторияПоКОАТУУ.Наименование КАК Район,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия КАК ДатаНачалаСотрудничества
	|ПОМЕСТИТЬ Вт_ТП
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.Ссылка В
	|			(ВЫБРАТЬ
	|				Вт_Договора.ТорговаяПлощадка КАК ТорговаяПлощадка
	|			ИЗ
	|				Вт_Договора КАК Вт_Договора)
	|	И (ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""ПлощадьОбщая""
	|			ИЛИ ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""ВидПлощадки"")
	|
	|СГРУППИРОВАТЬ ПО
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.Код,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ТерриторияПоКОАТУУ.Наименование,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ДатаОткрытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ОбщееИтог.ДоговорКонтрагента.Контрагент.Код КАК Контрагент_ИД,
	|	Вт_ОбщееИтог.ДоговорКонтрагента.Код КАК Договор_ИД,
	|	Вт_ОбщееИтог.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.ПравоСобственности, """") КАК ПравоСобственности,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.Контрагент.ИННПлательщикаНДС, """") КАК ИНН,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.КонтактАренда, """") КАК Телефон,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.КонтактноеЛицоАренда, """") КАК КонтактноеЛицо,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.АдресЭлектронныйАренда, """") КАК Емайл,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.Номер, """") КАК НомерДоговора,
	|	Вт_ОбщееИтог.ДоговорКонтрагента.ДатаОкончанияДействия КАК СрокДействияДоговора,
	|	ЕСТЬNULL(Вт_ОбщееИтог.ДоговорКонтрагента.ВариантПродления, """") КАК Пролонгирование,
	|	ВЫБОР
	|		КОГДА Вт_ОбщееИтог.ДоговорКонтрагента.ВариантПродления = ЗНАЧЕНИЕ(Перечисление.ВариантыПродленияДоговоров.НеПродлевается)
	|			ТОГДА ""-""
	|		ИНАЧЕ ""+""
	|	КОНЕЦ КАК ПунктОПролонгировании,
	|	ЕСТЬNULL(Вт_ОбщееИтог.СуммаФ1, 0) КАК КОплатеСуммаФ1,
	|	ЕСТЬNULL(Вт_ОбщееИтог.СуммаФ2, 0) КАК КОплатеСуммаФ2,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаФ1, 0) КАК СуммаФ1,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаФ2, 0) КАК СуммаФ2,
	|	ЕСТЬNULL(ВложенныйЗапрос.ГарантийныйПлатеж, """") КАК ГарантийныйПлатеж,
	|	ЕСТЬNULL(Вт_ТП.ТорговаяПлощадь, """") КАК ТорговаяПлощадь,
	|	ЕСТЬNULL(Вт_ТП.ТипОбьекта, """") КАК ТипОбьекта,
	|	ЕСТЬNULL(Вт_ТП.Код, """") КАК НомерТТ,
	|	ЕСТЬNULL(Вт_ТП.Район, """") КАК Район,
	|	ЕСТЬNULL(Вт_ТП.ДатаНачалаСотрудничества, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаНачалаСотрудничества,
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаФ1, 0) + ЕСТЬNULL(ВложенныйЗапрос.СуммаФ2, 0) КАК ОбщаяСумма,
	|	ВЫБОР
	|		КОГДА Вт_ОбщееИтог.ДоговорКонтрагента.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФОП,
	|	Вт_ОбщееИтог.ДоговорКонтрагента.ВыдачаСКассы КАК ВыдачаСКассы
	|ИЗ
	|	Вт_ОбщееИтог КАК Вт_ОбщееИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Вт_Договора.ПериодТекущий КАК ПериодТекущий,
	|			Вт_Договора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|			Вт_Договора.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|			Вт_Договора.СуммаФ1 КАК СуммаФ1,
	|			Вт_Договора.СуммаФ2 КАК СуммаФ2,
	|			Вт_Договора.ГарантийныйПлатеж КАК ГарантийныйПлатеж
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Вт_Договора.ПериодТекущий) КАК ПериодТекущий,
	|				Вт_Договора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|				Вт_Договора.ТорговаяПлощадка КАК ТорговаяПлощадка
	|			ИЗ
	|				Вт_Договора КАК Вт_Договора
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Вт_Договора.ДоговорКонтрагента,
	|				Вт_Договора.ТорговаяПлощадка) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ Вт_Договора КАК Вт_Договора
	|				ПО ВложенныйЗапрос.ДоговорКонтрагента = Вт_Договора.ДоговорКонтрагента
	|					И ВложенныйЗапрос.ТорговаяПлощадка = Вт_Договора.ТорговаяПлощадка
	|					И ВложенныйЗапрос.ПериодТекущий = Вт_Договора.ПериодТекущий) КАК ВложенныйЗапрос
	|		ПО Вт_ОбщееИтог.ДоговорКонтрагента = ВложенныйЗапрос.ДоговорКонтрагента
	|			И Вт_ОбщееИтог.ТорговаяПлощадка = ВложенныйЗапрос.ТорговаяПлощадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ТП КАК Вт_ТП
	|		ПО Вт_ОбщееИтог.ТорговаяПлощадка = Вт_ТП.ТорговаяПлощадка";
	
	Возврат ЗапросТекст
	
	
КонецФункции

Функция ПодготовитьданныеДляОплат(НаДату,Менеджер_ID="",Контрагент_ID="", Организация_ID, Подразделение_ID, РеглУчет,variant)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезИтог =  ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnTabPK"));
	РезИтог.Status = Истина;
	РезИтог.Description = "";
	
	
	ПодразделениеСсылка = Справочники.ПодразделенияКомпании.НайтиПоКоду(Подразделение_ID); 
	Если ПодразделениеСсылка.Пустая() Тогда
		
		РезИтог.Status = Ложь;
		РезИтог.Description = "Формирование данных по подразделению с кодом: "+Подразделение_ID+" не возможно!";
		Возврат РезИтог;
		
	КонецЕсли;	
	//
	Если Не ПустаяСтрока(Менеджер_ID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Код
		|	И Сотрудники.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Код", СокрЛП(Менеджер_ID));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			РезИтог.Status = Ложь;
			РезИтог.Description = "Не нейден менеджер по ID "+СокрЛП(Менеджер_ID)+Символы.ПС+"Получение данных не возможно!";
			Возврат РезИтог;
		КонецЕсли;
		
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		МенеджерСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		МенеджерСсылка = Неопределено;
	КонецЕсли;
	
	
	Если Не ПустаяСтрока(Контрагент_ID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодПоЕДРПОУ = &Код
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Код", СокрЛП(Контрагент_ID));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			РезИтог.Status = Ложь;
			РезИтог.Description = "Не нейден контрагент по ID "+СокрЛП(Контрагент_ID)+Символы.ПС+"Получение данных не возможно!";
			Возврат РезИтог;
		КонецЕсли;
		
		
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		КонтрагентСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		КонтрагентСсылка = Неопределено;
	КонецЕсли;
	
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Код = &Код
	|	И Организации.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", СокрЛП(Организация_ID));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОрганизацияСсылка = Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ОрганизацияСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	//
	//
	ТаблицаТБД = ВернутьТаблицуТБД(ПодразделениеСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ТекстЗапросаПоОплатам(variant);
	
	Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(НаДату));
	Запрос.УстановитьПараметр("ДатаОтсрочка", НачалоДня(НаДату)+60*60*24); //Нужно учитывать дату поставки 
	Запрос.УстановитьПараметр("Менеджер", МенеджерСсылка);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	Запрос.УстановитьПараметр("РегламентированныйУчет", РеглУчет);
	Запрос.УстановитьПараметр("СсылкаПодразделение", ПодразделениеСсылка);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("ТаблицаТБД", ТаблицаТБД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрокаТаблицаТип = РезИтог.Свойства().Получить("List").Тип;
	
	МедежерСтр = Строка(МенеджерСсылка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТаблица = ФабрикаXDTO.Создать(СтрокаТаблицаТип);
		СтрокаТаблица.Менеджер = ВыборкаДетальныеЗаписи.Менеджер;
		СтрокаТаблица.Менеджер_ИД = СокрЛП(ВыборкаДетальныеЗаписи.МенеджерID);
		СтрокаТаблица.Контрагент_ИД = СокрЛП(ВыборкаДетальныеЗаписи.КонтрагентID);
		СтрокаТаблица.Договор_ИД = СокрЛП(ВыборкаДетальныеЗаписи.ДоговорID);
		СтрокаТаблица.ДнейОтсрочки = Строка(ВыборкаДетальныеЗаписи.СрокОплаты) +" " +ВыборкаДетальныеЗаписи.ТипОплаты;
		СтрокаТаблица.ТоварныйКредит = ВыборкаДетальныеЗаписи.ТоварныйКредит;
		СтрокаТаблица.Задолженность = ВыборкаДетальныеЗаписи.СуммаВзаиморасчетов;
		СтрокаТаблица.ЗадолженностьПоОтсрочке = ВыборкаДетальныеЗаписи.ВзаиморасчетОтсрочка;
		СтрокаТаблица.ТоварныйЗапас = ВыборкаДетальныеЗаписи.СуммаПартий;
		СтрокаТаблица.ДатаПоследнегоПлатежа = ВыборкаДетальныеЗаписи.Оплата;
		СтрокаТаблица.СуммаОС = СокрЛП(ВыборкаДетальныеЗаписи.СуммаОС);
		СтрокаТаблица.СуммаВнеМатрицы = СокрЛП(ВыборкаДетальныеЗаписи.СуммаВнеМатрицы);
		СтрокаТаблица.ТБД = СокрЛП(ВыборкаДетальныеЗаписи.ТБД);
		
		РезИтог.List.Добавить(СтрокаТаблица);
		
	КонецЦикла;
	
	
	//Если Подразделение_ID = "000000001" Тогда	
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 	"ВЫБРАТЬ
	//	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВзаиморасчетыКомпанииОстатки.Сделка.Менеджер) КАК Менеджер,
	//	|	ВзаиморасчетыКомпанииОстатки.Сделка.Менеджер.Код КАК МенеджерID,
	//	|	ВзаиморасчетыКомпанииОстатки.Контрагент.Код КАК КонтрагентID,
	//	|	ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток КАК СуммаВзаиморасчетов
	//	|ИЗ
	//	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	//	|			&ДатаОстатков,
	//	|			ДоговорВзаиморасчетов В
	//	|					(ВЫБРАТЬ
	//	|						ДоговорыВзаиморасчетов.Ссылка
	//	|					ИЗ
	//	|						Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	//	|					ГДЕ
	//	|						ВЫБОР
	//	|							КОГДА &Организация = НЕОПРЕДЕЛЕНО
	//	|								ТОГДА ИСТИНА
	//	|							ИНАЧЕ ДоговорыВзаиморасчетов.Организация = &Организация
	//	|						КОНЕЦ
	//	|						И ДоговорыВзаиморасчетов.ВидДоговораСправочник = &ВидДоговора
	//	|						И ВЫБОР
	//	|							КОГДА &СсылкаПодразделение = НЕОПРЕДЕЛЕНО
	//	|								ТОГДА ИСТИНА
	//	|							ИНАЧЕ ДоговорыВзаиморасчетов.Подразделение В ИЕРАРХИИ (&СсылкаПодразделение)
	//	|						КОНЕЦ)
	//	|				И Сделка.РегламентированныйУчет = &РеглУчет
	//	|				И Контрагент.ВидКонтрагента <> &ВидКонтрагента
	//	|				И ВЫБОР
	//	|					КОГДА &Менеджер = НЕОПРЕДЕЛЕНО
	//	|						ТОГДА ИСТИНА
	//	|					ИНАЧЕ Сделка.Менеджер = &Менеджер
	//	|				КОНЕЦ) КАК ВзаиморасчетыКомпанииОстатки";
	//	
	//	Запрос.УстановитьПараметр("ВидКонтрагента",Перечисления.ВидыКонтрагентов.Внутренний);
	//	Запрос.УстановитьПараметр("ВидДоговора",Справочники.ВидыДоговоров.Маркетинг);
	//	Запрос.УстановитьПараметр("РеглУчет", РеглУчет); 
	//	Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(НаДату));
	//	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	//	Запрос.УстановитьПараметр("СсылкаПодразделение", ПодразделениеСсылка);
	//	Запрос.УстановитьПараметр("Менеджер", МенеджерСсылка); 
	//	
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	
	//	
	//	СтрокаТаблицаТип = РезИтог.Свойства().Получить("ListBonus").Тип;
	//	
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		
	//		
	//		
	//		СтрокаТаблица = ФабрикаXDTO.Создать(СтрокаТаблицаТип);
	//		
	//		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Менеджер) Тогда
	//			СтрокаТаблица.Менеджер = ВыборкаДетальныеЗаписи.Менеджер;
	//			СтрокаТаблица.Менеджер_ИД = СокрЛП(ВыборкаДетальныеЗаписи.МенеджерID);
	//		Иначе
	//			СтрокаТаблица.Менеджер = "";
	//			СтрокаТаблица.Менеджер_ИД = "";
	//		КонецЕсли;
	//	//	СтрокаТаблица.Менеджер = ВыборкаДетальныеЗаписи.Менеджер;
	//	//	СтрокаТаблица.Менеджер_ИД = СокрЛП(ВыборкаДетальныеЗаписи.МенеджерID);
	//		СтрокаТаблица.Контрагент_ИД = СокрЛП(ВыборкаДетальныеЗаписи.КонтрагентID);
	//		СтрокаТаблица.Задолженность = ВыборкаДетальныеЗаписи.СуммаВзаиморасчетов;
	//		
	//		РезИтог.ListBonus.Добавить(СтрокаТаблица);
	//		
	//	КонецЦикла;
	//	
	//	
	//КонецЕсли;
	//
	//
	
	Возврат РезИтог;
	
КонецФункции

Функция ВернутьТаблицуТБД(Подразделение) Экспорт 	
	
	ТабТБД = Новый ТаблицаЗначений;
	ТабТБД.Колонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТабТБД.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТабТБД.Колонки.Добавить("СуммаКонечныйОстаток",Новый ОписаниеТипов("Число"));
	
	Вариант = "Товары без продаж новый (плоский) - платежный календарь";
	
	Если Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000008") Тогда
		НастройкаПредставление = "ТС Buffet";
	ИначеЕсли Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000002") Тогда
		НастройкаПредставление = "ТС Аттика";
	ИначеЕсли Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("AT000009") Тогда
		НастройкаПредставление = "ТС Табак-Дигма";
	КонецЕсли;
	
	ВариантОтчета = Справочники.ВариантыОтчетов.НайтиПоНаименованию(Вариант,Истина);
	
	Настройки = ВариантОтчета.Настройки.Получить();
	
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Период.Значение.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	
	ОбъектОтчет = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВариантОтчета.Отчет.Наименование).Ссылка);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	тзОборачиваемость = ОбъектОтчет.ЗаполнитьСрокиПоТБД();
	
	ОбъектОтчет.ПолучитьТаблицуОстатков(тзОборачиваемость,МенеджерВТ,Период.Значение.Дата);
	
	СхемаКомпоновкиДанных = ОбъектОтчет.СхемаКомпоновкиДанных;
	
	// Загрузка настроек
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
	
	УстановитьОтборСКД("ПодразделениеКомпании", ВидСравненияКомпоновкиДанных.Равно, Подразделение,КомпоновщикНастроекКомпоновкиДанных);			
	
	// Компоновка макета
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,,, МенеджерВТ);
	
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТаблицуЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТаблицуЗначений.УстановитьОбъект(ТабТБД);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТаблицуЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	ТабТБД.Свернуть("Поставщик, Договор","СуммаКонечныйОстаток");
	Возврат ТабТБД;
	
КонецФункции

Процедура УстановитьОтборСКД(ИмяПоля, ВидОтбора, Значение, КомпоновщикНастроек)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборыКомпановщика = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого Стр Из ОтборыКомпановщика Цикл
		Если Стр.ЛевоеЗначение = ПолеОтбора Тогда
			Отбор = Стр;
		КонецЕсли;
	КонецЦикла;
	Если Отбор = Неопределено Тогда
		Отбор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение  = ПолеОтбора;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Отбор.ВидСравнения   = ВидОтбора;
		Отбор.Использование  = Истина;
		Отбор.ПравоеЗначение  = Значение;
	Иначе
		Отбор.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры


Функция ПодготовитьданныеДляОплатАренды(НаДату,Контрагент_ID="", Организация_ID, Подразделение_ID, РеглУчет)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезИтог =  ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnTabAR"));
	РезИтог.Status = Истина;
	РезИтог.Description = "";
	
	ПодразделениеСсылка = Справочники.ПодразделенияКомпании.НайтиПоКоду(Подразделение_ID); 
	Если ПодразделениеСсылка.Пустая() Тогда
		
		РезИтог.Status = Ложь;
		РезИтог.Description = "Формирование данных по подразделению с кодом: "+Подразделение_ID+" не возможно!";
		Возврат РезИтог;
		
	КонецЕсли;	
	
	Если Не ПустаяСтрока(Контрагент_ID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодПоЕДРПОУ = &Код
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Код", СокрЛП(Контрагент_ID));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			РезИтог.Status = Ложь;
			РезИтог.Description = "Не нейден контрагент по ID "+СокрЛП(Контрагент_ID)+Символы.ПС+"Получение данных не возможно!";
			Возврат РезИтог;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		КонтрагентСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		КонтрагентСсылка = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Код = &Код
	|	И Организации.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", СокрЛП(Организация_ID));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОрганизацияСсылка = Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ОрганизацияСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ТекстЗапросаПоАренде();
	
	Запрос.УстановитьПараметр("ДатаОтсчета", '20240401');
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", НачалоДня(НаДату));
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	Запрос.УстановитьПараметр("СсылкаПодразделение", ПодразделениеСсылка);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрокаТаблицаТип = РезИтог.Свойства().Получить("ListArenda").Тип;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТаблица = ФабрикаXDTO.Создать(СтрокаТаблицаТип);
		//ЗаполнитьЗначенияСвойств(СтрокаТаблица, ВыборкаДетальныеЗаписи);
		СтрокаТаблица.Контрагент_ИД 			= СокрЛП(ВыборкаДетальныеЗаписи.Контрагент_ИД);
		СтрокаТаблица.Договор_ИД 				= СокрЛП(ВыборкаДетальныеЗаписи.Договор_ИД);
		СтрокаТаблица.ТипОбьекта 				= СокрЛП(ВыборкаДетальныеЗаписи.ТипОбьекта);
		СтрокаТаблица.НомерТТ 					= СокрЛП(ВыборкаДетальныеЗаписи.НомерТТ);
		СтрокаТаблица.ТорговаяПлощадка  		= СокрЛП(ВыборкаДетальныеЗаписи.ТорговаяПлощадка);
		СтрокаТаблица.Район 					= СокрЛП(ВыборкаДетальныеЗаписи.Район);
		СтрокаТаблица.ПравоСобственности		= СокрЛП(ВыборкаДетальныеЗаписи.ПравоСобственности);
		СтрокаТаблица.ИНН 						= СокрЛП(ВыборкаДетальныеЗаписи.ИНН);
		СтрокаТаблица.Телефон 					= СокрЛП(ВыборкаДетальныеЗаписи.Телефон);
		СтрокаТаблица.КонтактноеЛицо 			= СокрЛП(ВыборкаДетальныеЗаписи.КонтактноеЛицо);
		СтрокаТаблица.Емайл 					= СокрЛП(ВыборкаДетальныеЗаписи.Емайл);
		СтрокаТаблица.НомерДоговора 			= СокрЛП(ВыборкаДетальныеЗаписи.НомерДоговора);
		СтрокаТаблица.СрокДействияДоговора 		= Формат(ВыборкаДетальныеЗаписи.СрокДействияДоговора,"ДФ=dd.MM.yyyy");
		СтрокаТаблица.Пролонгирование 			= СокрЛП(ВыборкаДетальныеЗаписи.Пролонгирование);
		СтрокаТаблица.ПунктОПролонгировании 	= ВыборкаДетальныеЗаписи.ПунктОПролонгировании;
		СтрокаТаблица.ДатаНачалаСотрудничества  = ВыборкаДетальныеЗаписи.ДатаНачалаСотрудничества;
		СтрокаТаблица.ТорговаяПлощадь 			= СокрЛП(ВыборкаДетальныеЗаписи.ТорговаяПлощадь);
		СтрокаТаблица.ГарантийныйПлатеж 		= СокрЛП(ВыборкаДетальныеЗаписи.ГарантийныйПлатеж);
		СтрокаТаблица.СуммаФ1 		 			= СокрЛП(ВыборкаДетальныеЗаписи.СуммаФ1);
		СтрокаТаблица.СуммаФ2 		 			= СокрЛП(ВыборкаДетальныеЗаписи.СуммаФ2);
		СтрокаТаблица.КОплатеСуммаФ1 			= СокрЛП(ВыборкаДетальныеЗаписи.КОплатеСуммаФ1);
		СтрокаТаблица.КОплатеСуммаФ2 			= СокрЛП(ВыборкаДетальныеЗаписи.КОплатеСуммаФ2);
		СтрокаТаблица.ОбщаяСумма 	 			= СокрЛП(ВыборкаДетальныеЗаписи.ОбщаяСумма);
		СтрокаТаблица.ФОП 			 			= ВыборкаДетальныеЗаписи.ФОП;
		СтрокаТаблица.ВыдачаСКассы 			 	= ВыборкаДетальныеЗаписи.ВыдачаСКассы;
		
		Если НЕ Число(ВыборкаДетальныеЗаписи.ТорговаяПлощадь) = 0 Тогда
			СтрокаТаблица.СтроимостьМ2= ВыборкаДетальныеЗаписи.ОбщаяСумма/ВыборкаДетальныеЗаписи.ТорговаяПлощадь;
		Иначе
			СтрокаТаблица.СтроимостьМ2 = "";
		КонецЕсли;
		
		РезИтог.ListArenda.Добавить(СтрокаТаблица);
		
	КонецЦикла;
	
	Возврат РезИтог;
	
КонецФункции


Функция НачисленияПоКоммунальнымУслугам(Месяц, Отчет = Ложь)	Экспорт
	
	Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("ЦБ813221");
	ХарьковЭнергоСбыт = Новый СписокЗначений;
	ХарьковЭнергоСбыт.Добавить(Справочники.КоммунальныеУслуги.НайтиПоКоду("000000012"));		//	ХарьковЭнергоСбыт (банк)
	ХарьковЭнергоСбыт.Добавить(Справочники.КоммунальныеУслуги.НайтиПоКоду("000000019"));		//	ХарьковЭнергоСбыт Безучетка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТорговыеПлощадкиПотребители.Ссылка КАК Донар,
	|	ТорговыеПлощадкиПотребители.Ссылка КАК Потребитель
	|ПОМЕСТИТЬ ВТ_Потребители
	|ИЗ
	|	Справочник.ТорговыеПлощадки.Потребители КАК ТорговыеПлощадкиПотребители
	|ГДЕ
	|	ТорговыеПлощадкиПотребители.Потребитель ССЫЛКА Справочник.ТорговыеПлощадки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТорговыеПлощадкиПотребители.Ссылка,
	|	ТорговыеПлощадкиПотребители.Потребитель
	|ИЗ
	|	Справочник.ТорговыеПлощадки.Потребители КАК ТорговыеПлощадкиПотребители
	|ГДЕ
	|	ТорговыеПлощадкиПотребители.Потребитель ССЫЛКА Справочник.ТорговыеПлощадки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияКоммунальныхУслуг.Регистратор КАК Регистратор,
	|	НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.ВидКоммунальнойУслуги) КАК ВидКоммунальнойУслуги,
	|	НачисленияКоммунальныхУслуг.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	НачисленияКоммунальныхУслуг.ПотреблениеИтого КАК ПотреблениеИтого,
	|	НачисленияКоммунальныхУслуг.Начислено КАК Начислено,
	|	НачисленияКоммунальныхУслуг.СуммаКОплате КАК СуммаКОплате,
	|	ВТ_Потребители.Потребитель ЕСТЬ НЕ NULL  КАК ЕстьПотребитель,
	|	ВЫРАЗИТЬ(ВТ_Потребители.Потребитель КАК Справочник.ТорговыеПлощадки) КАК Потребитель,
	|	НачисленияКоммунальныхУслуг.Абонплата КАК Абонплата,
	|	НачисленияКоммунальныхУслуг.Комиссия КАК Комиссия,
	|	1 КАК Признак
	|ПОМЕСТИТЬ ВТ_Начисления1
	|ИЗ
	|	РегистрНакопления.НачисленияКоммунальныхУслуг КАК НачисленияКоммунальныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребители КАК ВТ_Потребители
	|		ПО НачисленияКоммунальныхУслуг.ТорговаяПлощадка = ВТ_Потребители.Донар
	|ГДЕ
	|	НачисленияКоммунальныхУслуг.ОтчетныйМесяц = &ОтчетныйМесяц
	|	И НачисленияКоммунальныхУслуг.Абонплата > 0
	|	И НачисленияКоммунальныхУслуг.КоммунальнаяУслуга В ИЕРАРХИИ(&КоммунальнаяУслуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияКоммунальныхУслуг.Регистратор КАК Регистратор,
	|	НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.ВидКоммунальнойУслуги) КАК ВидКоммунальнойУслуги,
	|	НачисленияКоммунальныхУслуг.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	НачисленияКоммунальныхУслуг.ПотреблениеИтого КАК ПотреблениеИтого,
	|	НачисленияКоммунальныхУслуг.Начислено КАК Начислено,
	|	НачисленияКоммунальныхУслуг.СуммаКОплате КАК СуммаКОплате,
	|	ВТ_Потребители.Потребитель ЕСТЬ НЕ NULL  КАК ЕстьПотребитель,
	|	ВЫБОР
	|		КОГДА ВТ_Потребители.Потребитель ЕСТЬ NULL
	|			ТОГДА НачисленияКоммунальныхУслуг.ТорговаяПлощадка
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Потребители.Потребитель КАК Справочник.ТорговыеПлощадки)
	|	КОНЕЦ КАК Потребитель,
	|	НачисленияКоммунальныхУслуг.Абонплата КАК Абонплата,
	|	НачисленияКоммунальныхУслуг.Комиссия КАК Комиссия,
	|	2 КАК Признак
	|ПОМЕСТИТЬ ВТ_Начисления2
	|ИЗ
	|	РегистрНакопления.НачисленияКоммунальныхУслуг КАК НачисленияКоммунальныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Потребители КАК ВТ_Потребители
	|		ПО НачисленияКоммунальныхУслуг.ТорговаяПлощадка = ВТ_Потребители.Донар
	|ГДЕ
	|	НачисленияКоммунальныхУслуг.ОтчетныйМесяц = &ОтчетныйМесяц
	|	И НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления1.ТорговаяПлощадка.ПодразделениеКомпании.Код КАК КодПодразделение,
	|	ВТ_Начисления1.Регистратор КАК Регистратор,
	|	""00000000-0000-0000-0000-000000000000"" КАК ГуидДок,
	|	ВТ_Начисления1.Признак КАК Признак,
	|	ВТ_Начисления1.Договор КАК Договор,
	|	ВТ_Начисления1.ВидКоммунальнойУслуги КАК ВидКоммунальнойУслуги,
	|	ВТ_Начисления1.Договор.Код КАК КодДоговор,
	|	ВТ_Начисления1.Договор.Организация.Код КАК КодОрганизация,
	|	ВТ_Начисления1.Договор.Контрагент.Код КАК КодКонтрагент,
	|	ВТ_Начисления1.ЕстьПотребитель КАК ЕстьПотребитель,
	|	ВТ_Начисления1.ТорговаяПлощадка КАК ТорговаяПлощадкаСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления1.ТорговаяПлощадка) КАК ТорговаяПлощадка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления1.Потребитель) КАК Потребитель,
	|	ВЫБОР
	|		КОГДА ВТ_Начисления1.ЕстьПотребитель
	|			ТОГДА ВТ_Начисления1.Потребитель.Код
	|		ИНАЧЕ ВТ_Начисления1.ТорговаяПлощадка.Код
	|	КОНЕЦ КАК КодТорговаяПлощадка,
	|	ВТ_Начисления1.ПотреблениеИтого КАК ПотреблениеИтого,
	|	ВТ_Начисления1.Начислено КАК Начислено,
	|	ВТ_Начисления1.Абонплата КАК Абонплата,
	|	ВТ_Начисления1.СуммаКОплате КАК СуммаКОплате,
	|	ЕСТЬNULL(ЗатратыОбъектов.ПотреблениеФакт, 0) КАК ПотреблениеФакт,
	|	ВТ_Начисления1.Комиссия КАК Комиссия,
	|	ЕСТЬNULL(ЗатратыОбъектов.СуммаЗатрат, 0) КАК СуммаЗатрат
	|ИЗ
	|	ВТ_Начисления1 КАК ВТ_Начисления1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыОбъектов КАК ЗатратыОбъектов
	|		ПО ВТ_Начисления1.Потребитель = ЗатратыОбъектов.ТорговаяПлощадка
	|			И ВТ_Начисления1.Регистратор = ЗатратыОбъектов.Регистратор
	|ИТОГИ
	|	МАКСИМУМ(ЕстьПотребитель),
	|	СУММА(ПотреблениеФакт)
	|ПО
	|	КодПодразделение,
	|	Регистратор,
	|	Признак,
	|	ТорговаяПлощадкаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления2.ТорговаяПлощадка.ПодразделениеКомпании.Код КАК КодПодразделение,
	|	ВТ_Начисления2.Регистратор КАК Регистратор,
	|	""00000000-0000-0000-0000-000000000000"" КАК ГуидДок,
	|	ВТ_Начисления2.Признак КАК Признак,
	|	ВТ_Начисления2.Договор КАК Договор,
	|	ВТ_Начисления2.ВидКоммунальнойУслуги КАК ВидКоммунальнойУслуги,
	|	ВТ_Начисления2.Договор.Код КАК КодДоговор,
	|	ВТ_Начисления2.Договор.Организация.Код КАК КодОрганизация,
	|	ВТ_Начисления2.Договор.Контрагент.Код КАК КодКонтрагент,
	|	ВТ_Начисления2.ЕстьПотребитель КАК ЕстьПотребитель,
	|	ВТ_Начисления2.ТорговаяПлощадка КАК ТорговаяПлощадкаСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления2.ТорговаяПлощадка) КАК ТорговаяПлощадка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления2.Потребитель) КАК Потребитель,
	|	ВЫБОР
	|		КОГДА ВТ_Начисления2.ЕстьПотребитель
	|			ТОГДА ВТ_Начисления2.Потребитель.Код
	|		ИНАЧЕ ВТ_Начисления2.ТорговаяПлощадка.Код
	|	КОНЕЦ КАК КодТорговаяПлощадка,
	|	ВТ_Начисления2.ПотреблениеИтого КАК ПотреблениеИтого,
	|	ВТ_Начисления2.Начислено КАК Начислено,
	|	ВТ_Начисления2.Абонплата КАК Абонплата,
	|	ВТ_Начисления2.СуммаКОплате КАК СуммаКОплате,
	|	ЕСТЬNULL(ЗатратыОбъектов.ПотреблениеФакт, 0) КАК ПотреблениеФакт,
	|	ВТ_Начисления2.Комиссия КАК Комиссия,
	|	ЕСТЬNULL(ЗатратыОбъектов.СуммаЗатрат, 0) КАК СуммаЗатрат
	|ИЗ
	|	ВТ_Начисления2 КАК ВТ_Начисления2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыОбъектов КАК ЗатратыОбъектов
	|		ПО ВТ_Начисления2.Потребитель = ЗатратыОбъектов.ТорговаяПлощадка
	|			И ВТ_Начисления2.Регистратор = ЗатратыОбъектов.Регистратор
	|ГДЕ
	|	ЕСТЬNULL(ЗатратыОбъектов.СуммаЗатрат, 0) > 0
	|ИТОГИ
	|	МАКСИМУМ(ЕстьПотребитель),
	|	СУММА(ПотреблениеФакт)
	|ПО
	|	КодПодразделение,
	|	Регистратор,
	|	Признак,
	|	ТорговаяПлощадкаСсылка";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КоммунальнаяУслуга", ХарьковЭнергоСбыт);
	Запрос.УстановитьПараметр("ОтчетныйМесяц", Месяц);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если Отчет Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	ДЗ1 = РезультатЗапроса[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого стрПодразделение Из ДЗ1.Строки Цикл
		Для Каждого стрДок Из стрПодразделение.Строки Цикл
			стрДок.ГуидДок = Строка(стрДок.Регистратор.УникальныйИдентификатор());
		КонецЦикла;
	КонецЦикла;
	
	ДЗ1.Колонки.Удалить("Регистратор");
	ДЗ1.Колонки.Удалить("ТорговаяПлощадкаСсылка");
	
	ДЗ2 = РезультатЗапроса[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого стрПодразделение Из ДЗ2.Строки Цикл
		Для Каждого стрДок Из стрПодразделение.Строки Цикл
			стрДок.ГуидДок = Строка(стрДок.Регистратор.УникальныйИдентификатор());
		КонецЦикла;
	КонецЦикла;
	
	ДЗ2.Колонки.Удалить("Регистратор");
	ДЗ2.Колонки.Удалить("ТорговаяПлощадкаСсылка");
	
	МассивДЗ = Новый Массив;
	МассивДЗ.Добавить(ДЗ1);
	МассивДЗ.Добавить(ДЗ2);
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(МассивДЗ);	
	
	Возврат СтрокаXML;
	
КонецФункции
