




Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТочкиДоставки.Global_ID КАК Global_ID
		|ИЗ
		|	Справочник.ТочкиДоставки КАК ТочкиДоставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Global_ID УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Global_ID = 1;	
		Иначе	
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			Global_ID = 1 + ВыборкаДетальныеЗаписи.Global_ID;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
