

#Область ПолученияСтруктурКэшируемыхЗначений

Функция ПолучитьСтруктуруКэшируемыеЗначения() Экспорт
	КэшированныеЗначения = Новый Структура;
	КэшированныеЗначения.Вставить("КоэффициентыУпаковок",	Новый Соответствие);
	
	Возврат КэшированныеЗначения;
	
КонецФункции // ПолучитьСтруктуруКэшируемыеЗначения()

Функция ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, ИмяРегистра = Неопределено, Дата = Неопределено, ГраницаИсклюая = Ложь, ТипЦен = Неопределено, Контрагент = Неопределено, ДоговорВзаиморасчетов = Неопределено) Экспорт
	СтруктураЗаполненияЦен = Новый Структура;
	
	//Параметр ИмяРегистра
	Если ЗначениеЗаполнено(ИмяРегистра) Тогда
		СтруктураЗаполненияЦен.Вставить("ИмяРегистра", ИмяРегистра);
	//ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда 
	//	СтруктураЗаполненияЦен.Вставить("ИмяРегистра", "СогласованиеЦен");
	КонецЕсли;
	
	//Параметр Дата
	Если ЗначениеЗаполнено(Дата) Тогда
		СтруктураЗаполненияЦен.Вставить("Дата", Дата);
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Дата") Тогда
			Попытка
				Если Объект.ЭтоНовый() Тогда
					Дата = ТекущаяДата();
				Иначе
					Дата = Объект.Дата;
				КонецЕсли;
			Исключение
				Дата = Объект.Дата;
			КонецПопытки;
		
		Иначе
			Дата = ТекущаяДата();
		КонецЕсли;
		СтруктураЗаполненияЦен.Вставить("Дата", Дата);
	КонецЕсли;
	
	//Параметр ГраницаИсклюая
	СтруктураЗаполненияЦен.Вставить("ГраницаИсклюая", ГраницаИсклюая);
	
	
	//Параметр Контрагент
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СтруктураЗаполненияЦен.Вставить("Контрагент", Контрагент);	
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Контрагент") Тогда	
			СтруктураЗаполненияЦен.Вставить("Контрагент", Объект.Контрагент);	
		КонецЕсли;
	КонецЕсли;
		
	//Параметр ДоговорВзаиморасчетов
	Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
		СтруктураЗаполненияЦен.Вставить("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);			
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДоговорВзаиморасчетов") Тогда	
			СтруктураЗаполненияЦен.Вставить("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		КонецЕсли;
	КонецЕсли;	
	
		//Параметр ТипЦен
	Если ЗначениеЗаполнено(ТипЦен) Тогда
		СтруктураЗаполненияЦен.Вставить("ТипЦен", ТипЦен);
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ТипЦен") Тогда
			СтруктураЗаполненияЦен.Вставить("ТипЦен", Объект.ТипЦен);				
		КонецЕсли;		
	КонецЕсли;

	
	
	Возврат СтруктураЗаполненияЦен;
КонецФункции

Функция ПолучитьСтруктуруПараметровТипаЦенПоДоговору(Объект, ВидУчета = Неопределено, Дата = Неопределено, ГраницаИсклюая = Ложь, ТипЦен = Неопределено, Контрагент = Неопределено, ДоговорВзаиморасчетов = Неопределено)Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	
	
	//Параметр Дата
	Если ЗначениеЗаполнено(Дата) Тогда
		СтруктураЗаполнения.Вставить("Дата", Дата);
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Дата") Тогда
			
			Попытка
				Если Объект.ЭтоНовый() Тогда
					Дата = ТекущаяДата();
				Иначе
					Дата = Объект.Дата;
				КонецЕсли;
			Исключение
				Дата = Объект.Дата;
			КонецПопытки;
		Иначе
			Дата = ТекущаяДата();
		КонецЕсли;
		СтруктураЗаполнения.Вставить("Дата", Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
		СтруктураЗаполнения.Вставить("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);			
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДоговорВзаиморасчетов") Тогда	
			СтруктураЗаполнения.Вставить("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидУчета) Тогда
		СтруктураЗаполнения.Вставить("ВидУчета", ВидУчета);			
	Иначе
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "РегламентированныйУчет") Тогда	
			СтруктураЗаполнения.Вставить("ВидУчета", Объект.РегламентированныйУчет);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураЗаполнения
	
КонецФункции


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

#Область ПрочиеПроцедуры


Функция НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, ЕдиницаИзмерения) Экспорт
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		
		Номенклатура = ТекущаяСтрока.Номенклатура;
		ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;
	//	
	//ИначеЕсли ТипЗнч(УпаковкаНоменклатура) = Тип("Структура") Тогда
	//	
	//	Если УпаковкаНоменклатура.Свойство("Упаковка") Тогда
	//		Упаковка = УпаковкаНоменклатура.Упаковка;
	//	Иначе
	//		Упаковка = ТекущаяСтрока.Упаковка;
	//	КонецЕсли;
	//	
	//	Если УпаковкаНоменклатура.Свойство("Номенклатура") Тогда
	//		Номенклатура = УпаковкаНоменклатура.Номенклатура;
	//	Иначе
	//		Номенклатура = ТекущаяСтрока.Номенклатура;
	//	КонецЕсли;
	//	
	//	Если УпаковкаНоменклатура.Свойство("НужноОкруглять") Тогда
	//		НужноОкруглять = УпаковкаНоменклатура.НужноОкруглять;
	//	Иначе
	//		НужноОкруглять = Истина;
	//	КонецЕсли;
		
	Иначе
		ЕдиницаИзмерения = ЕдиницаИзмерения;	
		Номенклатура = ТекущаяСтрока.Номенклатура;
	КонецЕсли;

	Возврат Новый Структура("Номенклатура,ЕдиницаИзмерения", Номенклатура, ЕдиницаИзмерения); 
	
КонецФункции

Функция КлючКэшаУпаковки(Номенклатура, ЕдиницаИзмерения) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		КлючНоменклатура = Строка(Номенклатура.УникальныйИдентификатор());
	Иначе
		КлючНоменклатура = "ПустоеЗначение";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		КлючУпаковка = Строка(ЕдиницаИзмерения.УникальныйИдентификатор());
	Иначе
		КлючУпаковка = "ПустоеЗначение";
	КонецЕсли;
	
	Возврат КлючНоменклатура + КлючУпаковка;
	
КонецФункции

Функция ПолучитьКоэффициентЕдиницыИзмерения(ЕдиницаИзмерения, КэшированныеЗначения, ТекНоменклатура = Неопределено) Экспорт

	Результат = Новый Структура("Коэффициент,НужноОкруглятьКоличество");
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		КлючКоэффициента = КлючКэшаУпаковки(ТекНоменклатура, ЕдиницаИзмерения); 
		Кэш = КэшированныеЗначения.КоэффициентыУпаковок[КлючКоэффициента];
		Если Кэш = Неопределено Тогда
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ЗначенияРеквизитов = ОбработкаТабличнойЧастиСервер.ДанныеОбЕдиницеИзмерения(ТекНоменклатура, ЕдиницаИзмерения, КэшированныеЗначения);
				Результат.Коэффициент    		   =  ЗначенияРеквизитов.Коэффициент;
				Результат.НужноОкруглятьКоличество =  ЗначенияРеквизитов.НужноОкруглятьКоличество;

			#Иначе
				ТекстИсключения = НСтр("ru='Попытка получения коэффициента упаковки на клиенте.';uk='Спроба отримання коефіцієнта упаковки на клієнті.'");
				ВызватьИсключение ТекстИсключения;
			#КонецЕсли
		Иначе
			Результат = Кэш;
		КонецЕсли;
	Иначе
		Результат.Коэффициент = 1;
		Результат.НужноОкруглятьКоличество = Ложь;

	КонецЕсли;

	Возврат Результат;

КонецФункции


#КонецОбласти

#КонецОбласти


Процедура ЗаполнитьПроцентНаценкиИзРекомендованныхВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПроцентНаценкиИзРекомендованных") Тогда
		РекомендуемаяНаценка = 0;
				
		Если ТекущаяСтрока.РекомендуемыйПроцентНаценкиНоменклатура <> 0 Тогда
			РекомендуемаяНаценка = ТекущаяСтрока.РекомендуемыйПроцентНаценкиНоменклатура;
		ИначеЕсли ТекущаяСтрока.РекомендуемыйПроцентНаценкиРодитель <> 0 Тогда
			РекомендуемаяНаценка = ТекущаяСтрока.РекомендуемыйПроцентНаценкиРодитель;
		ИначеЕсли ТекущаяСтрока.РекомендуемыйПроцентНаценкиТип <> 0 Тогда
			РекомендуемаяНаценка = ТекущаяСтрока.РекомендуемыйПроцентНаценкиТип;
		ИначеЕсли ТекущаяСтрока.РекомендуемыйПроцентНаценкиГруппаЦенообразования <> 0 Тогда
			РекомендуемаяНаценка = ТекущаяСтрока.РекомендуемыйПроцентНаценкиГруппаЦенообразования;
		КонецЕсли;
		
		ТекущаяСтрока.ПроцентНаценки = РекомендуемаяНаценка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьКоличествоЕдиницВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 

	Перем ЕдиницаИзмерения;
	
	ПересчитатьКоличествоЕдиниц = СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц", ЕдиницаИзмерения);
	ЗаполнитьКоэффициентЕдиницыИзмерения = СтруктураДействий.Свойство("ЗаполнитьКоэффициентЕдиницыИзмерения", ЕдиницаИзмерения);
	
	Если ПересчитатьКоличествоЕдиниц ИЛИ ЗаполнитьКоэффициентЕдиницыИзмерения Тогда
		ПараметрыПересчета = НормализоватьПараметрыПересчетаЕдиниц(ТекущаяСтрока, ЕдиницаИзмерения);
		ДанныеЕдиницыИзмерения = ПолучитьКоэффициентЕдиницыИзмерения(ПараметрыПересчета.ЕдиницаИзмерения, КэшированныеЗначения, ПараметрыПересчета.Номенклатура);
		
		ТекущаяСтрока.Коэффициент = ДанныеЕдиницыИзмерения.Коэффициент;
		
		
		Если ДанныеЕдиницыИзмерения.НужноОкруглятьКоличество Тогда
			ТекущаяСтрока.Количество = Окр(ТекущаяСтрока.Количество, 0 ,РежимОкругления.Окр15как20);	
		КонецЕсли;
		
		Если ПересчитатьКоличествоЕдиниц Тогда 
			ТекущаяСтрока.КоличествоБазовое = ТекущаяСтрока.Количество * ДанныеЕдиницыИзмерения.Коэффициент;
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Перем ИмяКолонкиКоличество;
		
	Если СтруктураДействий.Свойство("ПересчитатьСумму", ИмяКолонкиКоличество) Тогда		
		Если Не ЗначениеЗаполнено(ИмяКолонкиКоличество) Тогда 
			ИмяКолонкиКоличество = "КоличествоБазовое";
		КонецЕсли;
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКолонкиКоличество];
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуВсего", ИмяКолонкиКоличество) Тогда
		Если Не ЗначениеЗаполнено(ИмяКолонкиКоличество) Тогда 
			ИмяКолонкиКоличество = "КоличествоБазовое";
		КонецЕсли;		
		
		ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКолонкиКоличество];
	КонецЕсли;
	

КонецПроцедуры

Процедура ПересчитатьЦенуБезНалога(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ПересчитатьЦенаБезНалога")Тогда
		
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		
			
		Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС_МРЦ") И ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) И ОбщегоНазначенияТККлиентСервер.ЕстьРеквизитУОбъекта(ТекущаяСтрока,"ЗначениеМРЦ") Тогда
			СуммаБаз =  ТекущаяСтрока.КоличествоБазовое * ТекущаяСтрока.ЗначениеМРЦ; 
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СуммаБаз, ТекПроцентНДС)/?(ТекущаяСтрока.КоличествоБазовое=0,1,ТекущаяСтрока.КоличествоБазовое);
		Иначе
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Цена, ТекПроцентНДС);
		КонецЕсли;

		
		ТекущаяСтрока.ЦенаБезНалогов = ТекущаяСтрока.Цена - СуммаНДС//ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Цена, ТекПроцентНДС)
		
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьЦенуСНДСВстрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСНДС")Тогда
		
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);

		
		Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС_МРЦ") И ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) И ОбщегоНазначенияТККлиентСервер.ЕстьРеквизитУОбъекта(ТекущаяСтрока,"ЗначениеМРЦ") Тогда
			СуммаБаз =  ТекущаяСтрока.КоличествоБазовое * ТекущаяСтрока.ЗначениеМРЦ; 
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СуммаБаз, ТекПроцентНДС)/?(ТекущаяСтрока.КоличествоБазовое=0,1,ТекущаяСтрока.КоличествоБазовое);
		Иначе
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.ЦенаБезНалогов, ТекПроцентНДС, Ложь);
		КонецЕсли;
		
		ТекущаяСтрока.Цена = ТекущаяСтрока.ЦенаБезНалогов + СуммаНДС; // ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.ЦенаБезНалогов, ТекПроцентНДС, Ложь)
		
	КонецЕсли;
	
	ИмяКолонкиКоличество = Неопределено;
	Если СтруктураДействий.Свойство("ПересчитатьЦенуИзСуммы", ИмяКолонкиКоличество) Тогда
		
		Если Не ЗначениеЗаполнено(ИмяКолонкиКоличество) Тогда 
			ИмяКолонкиКоличество = "КоличествоБазовое";
		КонецЕсли;
		
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока[ИмяКолонкиКоличество];
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьНовуюЦенуИПроцентНаценки(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 
	
	
	Перем ПравилоРасчета;
	ПересчитатьНовуюЦенуПоПроцентуНаценки =  СтруктураДействий.Свойство("ПересчитатьНовуюЦенуПоПроцентуНаценки", ПравилоРасчета);

	Если ПересчитатьНовуюЦенуПоПроцентуНаценки И ПравилоРасчета = 1 Тогда
		ТекущаяСтрока.НоваяЦена = ТекущаяСтрока.ЦенаБазовая / (100 - ТекущаяСтрока.ПроцентНаценки)*100;	
	ИначеЕсли ПересчитатьНовуюЦенуПоПроцентуНаценки Тогда
		ТекущаяСтрока.НоваяЦена = ТекущаяСтрока.ЦенаБазовая * (ТекущаяСтрока.ПроцентНаценки / 100 + 1);		
	КонецЕсли;
	
	ПараметрыОкругления = Неопределено;
	Если СтруктураДействий.Свойство("ПересчитатьНовуюЦенуСУчетомОкругления", ПараметрыОкругления) Тогда		
		Если ПараметрыОкругления.Свойство("ОкруглятьДо") Тогда 
			ТекущаяСтрока.НоваяЦена = ОбщегоНазначенияТККлиентСервер.ОкруглитьКратно(ТекущаяСтрока.НоваяЦена, ПараметрыОкругления.ОкруглятьДо);
		Иначе
			СтруктураОкругления = Новый Структура("ВариантОкругления, Точность", Неопределено, 0);
			ЗаполнитьЗначенияСвойств(СтруктураОкругления, ПараметрыОкругления);
			
			Если СтруктураОкругления.ВариантОкругления = ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ПоАрифметическимПравилам") 
				ИЛИ СтруктураОкругления.ВариантОкругления = ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ВсегдаВПользуПредприятия") Тогда 
								
				ТекущаяСтрока.НоваяЦена = Окр(ТекущаяСтрока.НоваяЦена, СтруктураОкругления.Точность);
			ИначеЕсли СтруктураОкругления.ВариантОкругления = ПредопределенноеЗначение("Перечисление.ВариантыОкругления.ВсегдаВПользуКлиента") Тогда 
				ТекущаяСтрока.НоваяЦена = Окр(ТекущаяСтрока.НоваяЦена, СтруктураОкругления.Точность, РежимОкругления.Окр15как10);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьПроцентНаценкиИзНовойЦены") Тогда
		Если ТекущаяСтрока.ЦенаБазовая <> 0 Тогда
			ТекущаяСтрока.ПроцентНаценки = (ТекущаяСтрока.НоваяЦена / ТекущаяСтрока.ЦенаБазовая - 1) * 100;
		Иначе 
			ТекущаяСтрока.ПроцентНаценки = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьПроцентНаценкиИзНовойЦеныВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	
КонецПроцедуры

Процедура ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 
	
	Перем ИмяКолонкиСумма;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", ИмяКолонкиСумма) Тогда
		
		Сумма = 0;
		СуммаПФ = 0;
		
		Если Не ЗначениеЗаполнено(ИмяКолонкиСумма) Тогда 
			ИмяКолонкиСумма = "Сумма";
		КонецЕсли;				
		
		Сумма = ТекущаяСтрока[ИмяКолонкиСумма];
		
		//Если ТипЗнч(ТекущаяСтрока) = Тип("Структура") Тогда 
		//	СуммаПФ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяСтрока, "СуммаПФ", 0);
		//Иначе
		//	Попытка
		//		СуммаПФ = ТекущаяСтрока.СуммаПФ;
		//	Исключение
		//		СуммаПФ = 0;
		//	КонецПопытки;
		//КонецЕсли;
		
		СтруктураПФ = Новый Структура("СуммаПФ", 0);
		ЗаполнитьЗначенияСвойств(СтруктураПФ, ТекущаяСтрока);
		СуммаПФ = СтруктураПФ.СуммаПФ;
		Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС_МРЦ") И ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) И ОбщегоНазначенияТККлиентСервер.ЕстьРеквизитУОбъекта(ТекущаяСтрока,"ЗначениеМРЦ") Тогда
			Сумма =  ТекущаяСтрока.КоличествоБазовое * ТекущаяСтрока.ЗначениеМРЦ; 
		КонецЕсли;
		
		
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Сумма - СуммаПФ, ТекПроцентНДС);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПересчитатьСуммуНДСиАкцизногоНалогаВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт 
	
	Перем СтруктураПараметровДействия;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСиАкцизногоНалога") Тогда
			
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаАкцизногоНалога = УчетАкцизногоНалога.РассчитатьСуммуАкцизногоНалога(ТекущаяСтрока.СуммаВсего,Истина,ТекущаяСтрока.СтавкаНДС);
		ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаВсего - ТекущаяСтрока.СуммаАкцизногоНалога, ТекПроцентНДС);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомРучнойСкидки", СтруктураПараметровДействия) Тогда
		
		Очищать 						= Неопределено;
		ПересчитыватьСуммуРучнойСкидки  = Неопределено;		
		ПересчитыватьПроцентСкидки		= Неопределено;
		ПересчитатьСумму 				= Неопределено;
		ИмяКоличества 					= Неопределено;
		СуммаПФ							= 0;
		
		Если СтруктураПараметровДействия <> Неопределено Тогда
			
			СтруктураПараметровДействия.Свойство("Очищать", Очищать);
			СтруктураПараметровДействия.Свойство("ПересчитыватьСуммуРучнойСкидки", ПересчитыватьСуммуРучнойСкидки);
			СтруктураПараметровДействия.Свойство("ПересчитыватьПроцентСкидки", ПересчитыватьПроцентСкидки);
			СтруктураПараметровДействия.Свойство("ИмяКоличества", ИмяКоличества);
			
			Если НЕ ЗначениеЗаполнено(ИмяКоличества) Тогда
				ИмяКоличества = "КоличествоБазовое";
			КонецЕсли;
			
			Если Очищать = Истина Тогда
				
				ТекущаяСтрока.СуммаСкидки = 0;
				ТекущаяСтрока.ПроцентСкидки = 0;
				
			КонецЕсли;
			
		КонецЕсли;
				
		Если ПересчитыватьПроцентСкидки = Истина Тогда
			
			Если ТекущаяСтрока.Сумма <> 0 Тогда
				ТекущаяСтрока.ПроцентСкидки = (ТекущаяСтрока.СуммаСкидки / ТекущаяСтрока.Сумма)*100;
			Иначе
				ТекущаяСтрока.ПроцентСкидки = 0;
			КонецЕсли;
			
		ИначеЕсли НЕ ПересчитыватьСуммуРучнойСкидки = Ложь Тогда
			
			ТекущаяСтрока.СуммаСкидки = Окр(ТекущаяСтрока[ИмяКоличества] * ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентСкидки / 100, 2);
			
		КонецЕсли;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("Структура") Тогда 
			СуммаПФ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяСтрока, "СуммаПФ", 0);
		Иначе
			Попытка
				СуммаПФ = ТекущаяСтрока.СуммаПФ;
			Исключение
				СуммаПФ = 0;
			КонецПопытки;
		КонецЕсли;
			
		ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаСкидки + СуммаПФ;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПересчитатьСуммуСНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ?(СтруктураПараметровДействия.ЦенаВключаетНДС, 0, ТекущаяСтрока.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСуммуБезНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуБезНДС") Тогда	
		
		ТекущаяСтрока.СуммаБезНалогов = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаНДС;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПересчитатьСуммуВсегоНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуВсегоНДС") Тогда	
		
		ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.СуммаБезНалогов + ТекущаяСтрока.СуммаНДС;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьПризнакВозваратаВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакВозврата") Тогда	
		
		ТекущаяСтрока.Возврат = ТекущаяСтрока.Количество<0 ;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПересчитатьСуммуИзСуммыБезНДСВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуИзСуммыБезНДС") Тогда	
		
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		
		
		Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС_МРЦ") И ЗначениеЗаполнено(ТекущаяСтрока.ХарактеристикаНоменклатуры) И ОбщегоНазначенияТККлиентСервер.ЕстьРеквизитУОбъекта(ТекущаяСтрока,"ЗначениеМРЦ") Тогда
			СуммаБаз =  ТекущаяСтрока.КоличествоБазовое * ТекущаяСтрока.ЗначениеМРЦ; 
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СуммаБаз, ТекПроцентНДС);
		Иначе
			СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаБезНалогов, ТекПроцентНДС, Ложь);
		КонецЕсли;

		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.СуммаБезНалогов + СуммаНДС;//ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаБезНалогов, ТекПроцентНДС, Ложь);
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПересчитатьРазностьВСтрокеТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	МассивПолейРазности = Неопределено;
	
	Если НЕ СтруктураДействий.Свойство("ПересчитатьРазность", МассивПолейРазности) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МассивПолейРазности) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Для Каждого Поля Из МассивПолейРазности Цикл
		СтруктураИмен = Новый Структура("Уменьшаемое, Вычетаемое, Разница",0,0,0);
		ЗаполнитьЗначенияСвойств(СтруктураИмен, Поля);
		
		Результат.Вставить(СтруктураИмен.Разница, ТекущаяСтрока[СтруктураИмен.Уменьшаемое] - ТекущаяСтрока[СтруктураИмен.Вычетаемое]);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Результат);
КонецПроцедуры

//Миша!!!!!!!!    13.03.19   Задача № 8740 
Процедура ПересчитатьСуммуВсегоОкругление(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	Перем РеглУчет;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуВсегоОкругление",РеглУчет) Тогда
		Если РеглУчет = Ложь Тогда  Возврат; КонецЕсли;
		
		СуммаВсего = ТекущаяСтрока.СуммаВсего;
		ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(ТекущаяСтрока.СтавкаНДС);

		СуммаВсего = Окр(СуммаВсего/(ТекПроцентНДС+1),2)*(ТекПроцентНДС+1);
		ТекущаяСтрока.СуммаВсего = СуммаВсего;
		Если ТекущаяСтрока.ПроцентСкидки = 100 Тогда
			ТекущаяСтрока.СуммаВсего = 0; СуммаВсего=0;
			СуммаБезСкидки = ТекущаяСтрока.СуммаСкидки;
		Иначе
			СуммаБезСкидки = (СуммаВсего*100)/(100-ТекущаяСтрока.ПроцентСкидки);
			ТекущаяСтрока.СуммаСкидки = СуммаБезСкидки-СуммаВсего;
		КонецЕсли; 
		СуммаСкидки = ТекущаяСтрока.СуммаСкидки;

		
		СуммаБезСкидкиБезНДС   = (100*СуммаБезСкидки)/(100+ТекПроцентНДС*100);
		СуммаБезНДС			   = (100*СуммаВсего)/(100+ТекПроцентНДС*100);
		СуммаНДСБезСкидки 	   = СуммаБезСкидки-СуммаБезСкидкиБезНДС;
		ТекущаяСтрока.СуммаНДС = СуммаВсего-СуммаБезНДС;

		ТекущаяСтрока.Сумма = СуммаБезСкидки;

		ТекущаяСтрока.СуммаБезНалогов =   ТекущаяСтрока.Сумма - СуммаНДСБезСкидки;
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.КоличествоБазовое=0,1,ТекущаяСтрока.КоличествоБазовое);
		ТекущаяСтрока.ЦенаБезНалогов = ТекущаяСтрока.СуммаБезНалогов / ?(ТекущаяСтрока.КоличествоБазовое=0,1,ТекущаяСтрока.КоличествоБазовое);
		
	КонецЕсли;
	
КонецПроцедуры

