


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КодФормы = "Справочник_Номенклатура_ФормаПодбора";
	
	СкладКомпании = Неопределено;
	Параметры.Свойство("СкладКомпании",СкладКомпании);  
	
	Параметры.Свойство("НайтиПоТочномуСоответствию",НайтиНоменклатуруПоТочномуСоответствию);
	
	СписокНоменклатура.Параметры.УстановитьЗначениеПараметра("СкладКомпании",СкладКомпании);
	
	ТК_ПодборТоваровСервер.ПриСозданииНаСервере(ЭтаФорма);
	
	

КонецПроцедуры





&НаКлиенте
Процедура Поиск(Команда)
	ТекущееСообщениеПользователю = "";
КонецПроцедуры



&НаКлиенте
Процедура СтрокаПоискаНоменклатураПриИзменении(Элемент)
	ВыполнитьПоискНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаПоискаНоменклатура = "";
	
	СнятьОтборПоСтрокеПоискаНоменклатурыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуруПоТочномуСоответствиюПриИзменении(Элемент)
	ВыполнитьПоискНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНоменклатурыПриИзменении(Элемент)
	ТК_ПодборТоваровКлиент.ПриАктивизацииСтрокиИерархииНоменклатуры(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФильтрыПриИзменении(Элемент)
	
	ИспользоватьФильтрыПриИзмененииНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ИспользоватьФильтрыПриИзмененииНаСервере()
	
	ТК_ПодборТоваровСервер.ПриИзмененииИспользованияФильтров(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтроки(Элемент)
	ТК_ПодборТоваровКлиент.ПриАктивизацииСтрокиИерархииНоменклатуры(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокРасширенныйПоискНоменклатураПриАктивизацииСтроки(Элемент)
	ТК_ПодборТоваровКлиент.ПриАктивизацииСтрокиСпискаНоменклатуры(ЭтаФорма);
КонецПроцедуры











#Область Поиск

&НаКлиенте
Процедура ВыполнитьПоискНоменклатуры()
	
	ТК_ПодборТоваровКлиент.ВыполнениеРасширенногоПоискаВозможно(ЭтаФорма, 
		Новый ОписаниеОповещения("ВыполнитьПоискНоменклатурыЗавершение", ЭтотОбъект));
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПоискНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	ВыполнитьПоискНоменклатурыНаСервере();
	
	ТК_ПодборТоваровКлиент.ПослеВыполненияПоискаНоменклатуры(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНоменклатурыНаСервере()
	
	ТК_ПодборТоваровСервер.ВыполнитьПоискНоменклатуры(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтборПоСтрокеПоискаНоменклатурыНаСервере()
	
	ТК_ПодборТоваровКлиентСервер.СнятьОтборПоСтрокеПоискаНоменклатуры(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиОжидания

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТК_ПодборТоваровКлиент.УстановитьТекущуюСтрокуИерархииНоменклатуры(ЭтаФорма);
	
КонецПроцедуры



&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтрокиОбработчикОжидания()
	
	ТК_ПодборТоваровКлиент.ОбработчикАктивизацииСтрокиИерархииНоменклатуры(ЭтаФорма);
	
КонецПроцедуры




#КонецОбласти



&НаКлиенте
Процедура СписокРасширенныйПоискНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("НоменклатураВыборПродолжение", ЭтаФорма, Новый Структура("ВыбраннаяСтрока", ВыбраннаяСтрока));
	
	Если ВводКоличества Тогда 
		ПоказатьВводЧисла(ОписаниеОповещения, 1, НСтр("ru = 'Количество'; uk = 'Кількість'"), 15, 3);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыборПродолжение(тКоличество, ДопПараметры) Экспорт
	
	Перем ВыбраннаяСтрока;
	
	Если тКоличество = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не (ДопПараметры.Свойство("ВыбраннаяСтрока", ВыбраннаяСтрока) И тКоличество > 0) Тогда 
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Номенклатура",ВыбраннаяСтрока));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + тКоличество;
		
	Иначе
		
		НоваяСтрока = Корзина.Добавить();
		НоваяСтрока.Номенклатура = ВыбраннаяСтрока;
		НоваяСтрока.Количество = тКоличество;
		
	КонецЕсли;	
	
	ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоискаНоменклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Адрес =	ПоместитьВХранилище();
	ОповеститьОВыборе(Адрес);
КонецПроцедуры


&НаСервере
Функция ПоместитьВХранилище();
	Возврат ПоместитьВоВременноеХранилище(Корзина.Выгрузить());
КонецФункции
