
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Перем СписокФайловСОшибками;
//Перем СписокДоступныхОрганизаций;
//Перем ПравилоУведомления;
//Перем СтавкиНДС;
//Перем Валюты;
//Перем ДопПараметровЗагрузки;

	
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьТоварыПоСкладу(Параметры) Экспорт

	НаДату = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НаДату", ТекущаяДата());		
	УчетнаяЗапись = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "УчетнаяЗапись", ПредопределенноеЗначение("Справочник.ТК_УчетныеЗаписиEDI.ПустаяСсылка"));		
	ТаблицаЗаказовПоставщику = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаЗаказовПоставщику", Неопределено);		
	
	Если ТаблицаЗаказовПоставщику = Неопределено ИЛИ ТаблицаЗаказовПоставщику.Количество() = 0 тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказы.Обрабатывать КАК Обрабатывать,
	|	Заказы.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(Заказы.УчетнаяЗаписьЭлектронногоОбмена КАК Справочник.ТК_УчетныеЗаписиEDI) КАК УчетнаяЗаписьЭлектронногоОбмена,
	|	Заказы.Идентификатор КАК RECIPIENT,
	|	Заказы.GLN КАК SUPPLIER,
	|	ВЫРАЗИТЬ(Заказы.Заказ КАК Документ.ЗаказПоставщику) КАК Заказ
	|ПОМЕСТИТЬ втЗаказы
	|ИЗ
	|	&тзЗаказы КАК Заказы
	|ГДЕ
	|	Заказы.Обрабатывать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT КАК ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT,
	|	ШтрихКоды.Штрихкод КАК ШтрихКод,
	|	ВЫБОР
	|		КОГДА ШтрихКоды.Штрихкод ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 2) = ЗаказПоставщикуТовары.Номенклатура.Артикул
	|						ТОГДА ""200000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
	|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 3) = ЗаказПоставщикуТовары.Номенклатура.Артикул
	|						ТОГДА ""20000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
	|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 4) = ЗаказПоставщикуТовары.Номенклатура.Артикул
	|						ТОГДА ""2000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
	|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 5) = ЗаказПоставщикуТовары.Номенклатура.Артикул
	|						ТОГДА ""200"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
	|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 6) = ЗаказПоставщикуТовары.Номенклатура.Артикул
	|						ТОГДА ""20"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		ИНАЧЕ ШтрихКоды.Штрихкод
	|	КОНЕЦ КАК ТШтрихкод
	|ПОМЕСТИТЬ ПодготовкаШтрихКодов
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	|		ПО (ШтрихКоды.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
	|			И (ШтрихКоды.Характеристика = ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры)
	|			И (ШтрихКоды.Упаковка.ЕдиницаПоКлассификатору.ORDERUNIT = ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT)
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				втЗаказы.Заказ
	|			ИЗ
	|				втЗаказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодготовкаШтрихКодов.Номенклатура КАК Номенклатура,
	|	ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT КАК ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT,
	|	МАКСИМУМ(ПодготовкаШтрихКодов.ТШтрихкод) КАК ШтрихКод
	|ПОМЕСТИТЬ МаксимальныйШтрихКод
	|ИЗ
	|	ПодготовкаШтрихКодов КАК ПодготовкаШтрихКодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодготовкаШтрихКодов КАК ПодготовкаШтрихКодов1
	|		ПО ПодготовкаШтрихКодов.Номенклатура = ПодготовкаШтрихКодов1.Номенклатура
	|			И ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры = ПодготовкаШтрихКодов1.ХарактеристикаНоменклатуры
	|			И ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT = ПодготовкаШтрихКодов1.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT
	|			И ПодготовкаШтрихКодов.ТШтрихкод > ПодготовкаШтрихКодов1.ТШтрихкод
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодготовкаШтрихКодов.Номенклатура,
	|	ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры,
	|	ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныйШтрихКод.Номенклатура КАК Номенклатура,
	|	МаксимальныйШтрихКод.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МаксимальныйШтрихКод.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT КАК ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(МаксимальныйШтрихКод.ШтрихКод, 1, 3) = ""ЯЯЯ""
	|			ТОГДА ПОДСТРОКА(МаксимальныйШтрихКод.ШтрихКод, 4, 20)
	|		ИНАЧЕ МаксимальныйШтрихКод.ШтрихКод
	|	КОНЕЦ КАК ШтрихКод
	|ПОМЕСТИТЬ РабочиеПозиции
	|ИЗ
	|	МаксимальныйШтрихКод КАК МаксимальныйШтрихКод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.СкладКомпании КАК СкладКомпании,
	|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|	""220"" КАК DOCUMENTNAME,
	|	ЗаказПоставщикуТовары.Ссылка.Номер КАК NUMBER,
	|	ЗаказПоставщикуТовары.Ссылка.Дата КАК DATE,
	|	ЗаказПоставщикуТовары.Ссылка.СрокПоставки КАК СрокПоставки,
	|	ЗаказПоставщикуТовары.Ссылка.ВалютаДокумента.Наименование КАК CURRENCY,
	|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Ссылка.Комментарий КАК СТРОКА(100)) КАК INFO,
	|	ЗаказПоставщикуТовары.СкладКомпании.ТорговаяПлощадка.GLN КАК DELIVERYPLACE,
	|	ЗаказПоставщикуТовары.НомерСтроки КАК POSITIONNUMBER,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК PRODUCTIDBUYER,
	|	0 КАК PRODUCTIDSUPPLIER,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.Коэффициент КАК QUANTITYOFCUINTU,
	|	ЗаказПоставщикуТовары.КоличествоБазовое КАК ORDEREDQUANTITY,
	|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Цена КАК ЧИСЛО(7, 3)) КАК PRICEWITHVAT,
	|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Цена / (1 + ЗаказПоставщикуТовары.СтавкаНДС.Ставка / 100) КАК ЧИСЛО(7, 3)) КАК ORDERPRICE,
	|	ЗаказПоставщикуТовары.СтавкаНДС.Ставка КАК VAT,
	|	РабочиеПозиции.ШтрихКод КАК PRODUCT,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT КАК ORDERUNIT,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказПоставщикуТовары.Номенклатура.Наименование, """") + "" "" + ЕСТЬNULL(ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры.Наименование, """") КАК СТРОКА(75)) КАК DESCRIPTION,
	|	втЗаказы.SUPPLIER КАК SUPPLIER,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(втЗаказы.RECIPIENT, """") = """"
	|			ТОГДА втЗаказы.SUPPLIER
	|		КОГДА втЗаказы.RECIPIENT = НЕОПРЕДЕЛЕНО
	|			ТОГДА втЗаказы.SUPPLIER
	|		ИНАЧЕ втЗаказы.SUPPLIER
	|	КОНЕЦ КАК RECIPIENT,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.GLN КАК BUYER,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.GLN КАК INVOICEPARTNER,
	|	втЗаказы.УчетнаяЗаписьЭлектронногоОбмена.Идентификатор КАК SENDER,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент.Код КАК CAMPAIGNNUMBER,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
	|	втЗаказы.УчетнаяЗаписьЭлектронногоОбмена КАК УчетнаяЗаписьЭлектронногоОбмена,
	|	ЗаказПоставщикуТовары.СкладКомпании.Код КАК КодСклада,
	|	ЗаказПоставщикуТовары.СкладКомпании.ТорговаяПлощадка.Global_ID КАК ID_Площадки
	|ИЗ
	|	втЗаказы КАК втЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО втЗаказы.Заказ = ЗаказПоставщикуТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеПозиции КАК РабочиеПозиции
	|		ПО (ЗаказПоставщикуТовары.Номенклатура = РабочиеПозиции.Номенклатура)
	|			И (ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры = РабочиеПозиции.ХарактеристикаНоменклатуры)
	|			И (ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT = РабочиеПозиции.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	СкладКомпании,
	|	ЗаказПоставщикуТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПодготовкаШтрихКодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальныйШтрихКод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РабочиеПозиции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втЗаказы";

	Запрос.УстановитьПараметр("тзЗаказы", ТаблицаЗаказовПоставщику);
	Результат = Запрос.Выполнить();
		
	Каталог = КаталогВременныхФайлов();
	
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Макет = ПолучитьМакет("Order");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
	НовыйПостроительДом = Новый ПостроительDOM;
	НовыйДокументДом = НовыйПостроительДом.Прочитать(Чтение);
	
	НовыйПостроительСхем = Новый ПостроительСхемXML;
	НоваяСхема = НовыйПостроительСхем.СоздатьСхемуXML(НовыйДокументДом);
	
	НаборСхем = Новый НаборСхемXML; 
	НаборСхем.Добавить(НоваяСхема); 
	
	НоваяФабрика = Новый ФабрикаXDTO(НаборСхем);
	OrderType = НоваяФабрика.Тип("http://www.edi.su","ORDER");	
	HEADType = НоваяФабрика.Тип("http://www.edi.su","HEAD");	
	
	POSITIONType = НоваяФабрика.Тип("http://www.edi.su","POSITION");	
	CHARACTERISTICType = НоваяФабрика.Тип("http://www.edi.su","CHARACTERISTIC");
	
	МассивФайловДляОтправки = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		EDIMESSAGE = Формат(ВыборкаДетальныеЗаписи.DATE, "ДФ=""ггггММддЧЧммсс000""") + "-OUT-" + ВыборкаДетальныеЗаписи.NUMBER;
		
		//	EDIMESSAGE = Формат(ВыборкаДетальныеЗаписи.DATE, "ДФ=""ггггММддЧЧммсс000""") + "-OUT-" + ВыборкаДетальныеЗаписи.NUMBER+"-"+СокрЛП(СтрЗаменить(ВыборкаДетальныеЗаписи.КодСклада,ВыборкаДетальныеЗаписи.СпецПрефикс,""));
		
		Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("СкладКомпании") Цикл 
			//Попытка
			//	КодСклада =  СокрЛП(СтрЗаменить(ВыборкаДетальныеЗаписи.КодСклада,ВыборкаДетальныеЗаписи.СпецПрефикс,""));
			//Исключение
			//	КодСклада = "300";
			//КонецПопытки;
			
			ФайлXML = Каталог+"\"+EDIMESSAGE+"-"+ВыборкаДетальныеЗаписи.DELIVERYPLACE+"_ORDERS.xml";
			Запись = Новый ЗаписьXML;
			Пока БезопасныйРежим() Цикл ЗаписьЖурналаРегистрации("ОбменСEDI",УровеньЖурналаРегистрации.Информация,,,"Отключаем безопасный режим..."); // на всяк случай - говорят когда юзаешь внешнюю оработку в тонком клиенте - автоматом включается
				УстановитьБезопасныйРежим(Ложь);
			КонецЦикла;
			Запись.ОткрытьФайл(ФайлXML);
			Запись.ЗаписатьОбъявлениеXML();
			ЭлементЗаказа = НоваяФабрика.Создать(OrderType);
			ЭлементЗаказа.DOCUMENTNAME = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","order-type"),ВыборкаДетальныеЗаписи.DOCUMENTNAME);
			Попытка
				ЭлементЗаказа.NUMBER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","number"),Строка(ВыборкаДетальныеЗаписи.NUMBER+":"+Формат(ВыборкаДетальныеЗаписи.ID_Площадки,"ЧЦ=10; ЧГ=")));
			Исключение
				ЭлементЗаказа.NUMBER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","number"),Строка(ВыборкаДетальныеЗаписи.NUMBER+":300"));
			КонецПопытки;
			
			ЭлементЗаказа.DATE = Формат(ВыборкаДетальныеЗаписи.DATE,"ДФ=yyyy-MM-dd");
			ЭлементЗаказа.DELIVERYDATE = Формат(ВыборкаДетальныеЗаписи.СрокПоставки,"ДФ=yyyy-MM-dd");
			ЭлементЗаказа.DELIVERYTIME = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","time"),Формат(ВыборкаДетальныеЗаписи.СрокПоставки,"ДФ=HH:mm")); 
			ЭлементЗаказа.CAMPAIGNNUMBER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","number"),Строка(ВыборкаДетальныеЗаписи.CAMPAIGNNUMBER)); 
			ЭлементЗаказа.CURRENCY = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","currency"),Строка(ВыборкаДетальныеЗаписи.CURRENCY));
			ЭлементЗаказа.VAT = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","percentage"),Строка(ВыборкаДетальныеЗаписи.VAT));
			ЭлементЗаказа.INFO = ВыборкаДетальныеЗаписи.INFO;
			
			ЭлементШапки = НоваяФабрика.Создать(HEADType);
			ЭлементШапки.SUPPLIER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","gln"),ВыборкаДетальныеЗаписи.SUPPLIER);
			ЭлементШапки.BUYER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","gln"),ВыборкаДетальныеЗаписи.BUYER);
			ЭлементШапки.DELIVERYPLACE = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","gln"),ВыборкаДетальныеЗаписи.DELIVERYPLACE);
			ЭлементШапки.SENDER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","mailbox"),ВыборкаДетальныеЗаписи.SENDER);
			ЭлементШапки.RECIPIENT = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","mailbox"),ВыборкаДетальныеЗаписи.RECIPIENT);
			ЭлементЗаказа.HEAD=ЭлементШапки;		
			
			//Сообщить(EDIMESSAGE);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				ЭлементСтроки =  НоваяФабрика.Создать(POSITIONType);
				ЭлементСтроки.POSITIONNUMBER = ВыборкаДетальныеЗаписи.POSITIONNUMBER;
				ЭлементСтроки.PRODUCT = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","gln"),СокрЛП(ВыборкаДетальныеЗаписи.PRODUCT));
				ЭлементСтроки.PRODUCTIDSUPPLIER =  НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","number"),Строка(ВыборкаДетальныеЗаписи.PRODUCTIDSUPPLIER));
				ЭлементСтроки.PRODUCTIDBUYER = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","number"),ВыборкаДетальныеЗаписи.PRODUCTIDBUYER);
				ЭлементСтроки.ORDEREDQUANTITY = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","amount"),ВыборкаДетальныеЗаписи.ORDEREDQUANTITY);
				ЭлементСтроки.QUANTITYOFCUINTU = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","amount"),ВыборкаДетальныеЗаписи.QUANTITYOFCUINTU);
				ЭлементСтроки.ORDERUNIT =  НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","measurement-unit"),ВыборкаДетальныеЗаписи.ORDERUNIT);
				ЭлементСтроки.ORDERPRICE = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","amount"),ВыборкаДетальныеЗаписи.ORDERPRICE); // попросили писать нулевую цену... /Данченко О.Ю.  29.03.13 Теперь надо выгружать...
				//	ЭлементСтроки.ORDERPRICE = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","amount"), 0);
				ЭлементСтроки.PRICEWITHVAT = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","amount"),ВыборкаДетальныеЗаписи.PRICEWITHVAT);
				ЭлементСтроки.VAT = НоваяФабрика.Создать(НоваяФабрика.Тип("http://www.edi.su","percentage"),Строка(ВыборкаДетальныеЗаписи.VAT));
				ЭлементХарактеристики = НоваяФабрика.Создать(CHARACTERISTICType);
				ЭлементХарактеристики.DESCRIPTION = ВыборкаДетальныеЗаписи.DESCRIPTION;
				ЭлементСтроки.CHARACTERISTIC = ЭлементХарактеристики;
				ЭлементШапки.POSITION.Добавить(ЭлементСтроки);
				//Сообщить(ВыборкаДетальныеЗаписи.POSITIONNUMBER);		
			КонецЦикла;
			ЭлементЗаказа.HEAD=ЭлементШапки;
			НоваяФабрика.ЗаписатьXML(Запись,ЭлементЗаказа,,,,НазначениеТипаXML.Неявное);
			
			Запись.Закрыть();
			
			ДляИзменения = Новый ЧтениеТекста(ФайлXML,КодировкаТекста.UTF8);
			НовыйФайл = Новый ЗаписьТекста(ФайлXML+"A",КодировкаТекста.UTF8);
			Стр = ДляИзменения.ПрочитатьСтроку();
			Пока НЕ Стр=Неопределено Цикл
				НовыйФайл.ЗаписатьСтроку(ЗаменитьТеги(Стр));
				Стр = ДляИзменения.ПрочитатьСтроку();
			КонецЦикла;
			НовыйФайл.Закрыть();
			ДляИзменения.Закрыть();
			ПереместитьФайл(ФайлXML+"A",ФайлXML);
			МассивФайловДляОтправки.Добавить(ФайлXML);
		КонецЦикла;		
		
	КонецЦикла;

	//
	Если МассивФайловДляОтправки.Количество()>0 Тогда
		Если УчетнаяЗапись.СпособОтправки = Перечисления.СпособОтправкиЭлектронногоДокумента.ОтправлятьНаСервер тогда
			
			ПараметрыПодключения = ПолучитьПараметрыУчетки(УчетнаяЗапись);
			Если ПараметрыПодключения.Провайдер = Перечисления.ПоставщикиEDI.Edisoft Тогда
				ТекущийКаталогFTP = "/outbox/";
			Иначе
				ТекущийКаталогFTP = "/outbox/";
			КонецЕсли;
			
			Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
			
			Если Сервер = Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось установить соединение с сервером EDI, повторите отправку.'; uk = 'Не вдалося встановити з''єднання з сервером EDI, повторіть відправку.'"));
				
			Иначе
				Сервер.УстановитьТекущийКаталог(ТекущийКаталогFTP);
				ВсеОк = Истина;
				Для Каждого ФайЗаказа Из МассивФайловДляОтправки Цикл 
					Попытка
						ИмяФайла = НайтиФайлы(ФайЗаказа)[0].Имя;
						Сервер.Записать(ФайЗаказа,ИмяФайла);
					Исключение
						ВсеОк = Ложь;
					КонецПопытки;
				КонецЦикла;
				
				Если ВсеОк тогда
					Для Каждого СтрЗаказы Из  ТаблицаЗаказовПоставщику Цикл 
						ЗаказыПоставщику = СтрЗаказы.Заказ.ПолучитьОбъект();				
						ЗаказыПоставщику.УстановитьСтатусЗаказаВеб(Перечисления.СтатусыЗаказовВеб.НеПодтвержден);
						ЗаказыПоставщику.Записать(РЕжимЗаписиДокумента.Запись);
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Документ %1 выгружен успешно!'; uk = 'Документ %1 вивантажений успішно!'"),
								ЗаказыПоставщику));													
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЕсли;
		
		Для Каждого  Файл_у Из МассивФайловДляОтправки Цикл 
			УдалитьФайлы(Файл_у);	
		КонецЦикла;
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ВыгрузитьКонсолидированныйЗаказКомарх(Параметры) Экспорт
	                 
	Попытка 
		//ОМ.ВывестиСостояние("Выгружаем заказы поставщику...");
		
		НаДату = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НаДату", ТекущаяДата());		
		УчетнаяЗапись = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "УчетнаяЗапись", ПредопределенноеЗначение("Справочник.ТК_УчетныеЗаписиEDI.ПустаяСсылка"));		
		ТаблицаЗаказовПоставщику = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаЗаказовПоставщику", Неопределено);		
		
		Если ТаблицаЗаказовПоставщику = Неопределено тогда
			ТаблицаЗаказовПоставщику = Документы.ЗаказПоставщику.ПолучитьТаблицуЗаказовПоставщику(Параметры);
			//ТК_ОбменEDI.ПолучитьТаблицуЗаказовПоставщику(Параметры);
		КонецЕсли;
		
		Если ТаблицаЗаказовПоставщику.Количество()=0 тогда
			//ОМ.Информировать("Исходящих заказов не обнаружено - выгружать нечего");
			Возврат;
		КонецЕсли;
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТбСЗаказами.Обрабатывать,
		|	ТбСЗаказами.Контрагент,
		|	ВЫРАЗИТЬ(ТбСЗаказами.УчетнаяЗаписьЭлектронногоОбмена КАК Справочник.УчетныеЗаписиЭлектронногоОбмена) КАК УчетнаяЗаписьЭлектронногоОбмена,
		|	ТбСЗаказами.Идентификатор КАК RECIPIENT,
		|	ТбСЗаказами.GLN КАК SUPPLIER,
		|	ВЫРАЗИТЬ(ТбСЗаказами.Заказ КАК Документ.ЗаказПоставщику) КАК Заказ
		|ПОМЕСТИТЬ ТаблицаСЗаказами
		|ИЗ
		|	&ТЗаказы КАК ТбСЗаказами
		|ГДЕ
		|	ТбСЗаказами.Обрабатывать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры,
		|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT,
		|	ШтрихКоды.ШтрихКод КАК ШтрихКод,
		|	ШтрихКоды.ОсновнойШтрихкод,
		|	ВЫБОР
		|		КОГДА ШтрихКоды.ОсновнойШтрихкод
		|			ТОГДА ""ЯЯЯ"" + ШтрихКоды.ШтрихКод
		|		КОГДА ШтрихКоды.ШтрихКод ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 2) = ЗаказПоставщикуТовары.Номенклатура.Артикул
		|						ТОГДА ""200000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
		|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 3) = ЗаказПоставщикуТовары.Номенклатура.Артикул
		|						ТОГДА ""20000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
		|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 4) = ЗаказПоставщикуТовары.Номенклатура.Артикул
		|						ТОГДА ""2000"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
		|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 5) = ЗаказПоставщикуТовары.Номенклатура.Артикул
		|						ТОГДА ""200"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
		|					КОГДА ПОДСТРОКА(ЗаказПоставщикуТовары.Номенклатура.Артикул, 1, 6) = ЗаказПоставщикуТовары.Номенклатура.Артикул
		|						ТОГДА ""20"" + ЗаказПоставщикуТовары.Номенклатура.Артикул + ""00000""
		|					ИНАЧЕ NULL
		|				КОНЕЦ
		|		ИНАЧЕ ШтрихКоды.ШтрихКод
		|	КОНЕЦ КАК ТШтрихкод
		|ПОМЕСТИТЬ ПодготовкаШтрихКодов
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|		ПО (ШтрихКоды.Объект = ЗаказПоставщикуТовары.Номенклатура)
		|			И (ШтрихКоды.ХарактеристикаНоменклатуры = ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры)
		|			И (ШтрихКоды.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT = ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT)
		|			И (НЕ ШтрихКоды.Запрет)
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ТаблицаСЗаказами.Заказ
		|			ИЗ
		|				ТаблицаСЗаказами)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаШтрихКодов.Номенклатура,
		|	ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры,
		|	ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT,
		|	МАКСИМУМ(ПодготовкаШтрихКодов.ТШтрихкод) КАК ШтрихКод
		|ПОМЕСТИТЬ МаксимальныйШтрихКод
		|ИЗ
		|	ПодготовкаШтрихКодов КАК ПодготовкаШтрихКодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодготовкаШтрихКодов КАК ПодготовкаШтрихКодов1
		|		ПО ПодготовкаШтрихКодов.Номенклатура = ПодготовкаШтрихКодов1.Номенклатура
		|			И ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры = ПодготовкаШтрихКодов1.ХарактеристикаНоменклатуры
		|			И ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT = ПодготовкаШтрихКодов1.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT
		|			И ПодготовкаШтрихКодов.ТШтрихкод > ПодготовкаШтрихКодов1.ТШтрихкод
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодготовкаШтрихКодов.Номенклатура,
		|	ПодготовкаШтрихКодов.ХарактеристикаНоменклатуры,
		|	ПодготовкаШтрихКодов.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныйШтрихКод.Номенклатура,
		|	МаксимальныйШтрихКод.ХарактеристикаНоменклатуры,
		|	МаксимальныйШтрихКод.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(МаксимальныйШтрихКод.ШтрихКод, 1, 3) = ""ЯЯЯ""
		|			ТОГДА ПОДСТРОКА(МаксимальныйШтрихКод.ШтрихКод, 4, 20)
		|		ИНАЧЕ МаксимальныйШтрихКод.ШтрихКод
		|	КОНЕЦ КАК ШтрихКод
		|ПОМЕСТИТЬ РабочиеПозиции
		|ИЗ
		|	МаксимальныйШтрихКод КАК МаксимальныйШтрихКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
		|	ЗаказПоставщикуТовары.Ссылка.Номер КАК OrderNumber,
		|	ЗаказПоставщикуТовары.Ссылка.Дата КАК OrderDate,
		|	ЗаказПоставщикуТовары.Ссылка.СрокПоставки КАК ExpectedDeliveryDate,
		|	ЗаказПоставщикуТовары.Ссылка.ВалютаДокумента.Наименование КАК CURRENCY,
		|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Ссылка.Комментарий КАК СТРОКА(100)) КАК Remarks,
		|	ЗаказПоставщикуТовары.СкладКомпании.ТочкаДоставки КАК ТочкаДоставки,
		|	ЗаказПоставщикуТовары.СкладКомпании.ТочкаДоставки.GLN КАК DeliveryPoint,
		|	ЗаказПоставщикуТовары.НомерСтроки КАК LineNumber,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК BuyerItemCode,
		|	0 КАК PRODUCTIDSUPPLIER,
		|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.Коэффициент КАК OrderedUnitPacksize,
		|	ЗаказПоставщикуТовары.Количество КАК OrderedQuantity,
		|	ЗаказПоставщикуТовары.Цена КАК OrderedUnitGrossPrice,
		|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Цена / (1 + ЗаказПоставщикуТовары.СтавкаНДС.Ставка / 100) КАК ЧИСЛО(7, 3)) КАК OrderedUnitNetPrice,
		|	ЗаказПоставщикуТовары.СтавкаНДС.Ставка КАК TaxRate,
		|	РабочиеПозиции.ШтрихКод КАК EAN,
		|	ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT КАК UnitOfMeasure,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗаказПоставщикуТовары.Номенклатура.Наименование, """") + "" "" + ЕСТЬNULL(ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры.Наименование, """") КАК СТРОКА(75)) КАК ItemDescription,
		|	ТаблицаСЗаказами.УчетнаяЗаписьЭлектронногоОбмена.GLN КАК BUYER,
		|	ТаблицаСЗаказами.УчетнаяЗаписьЭлектронногоОбмена.GLN КАК INVOICEPARTNER,
		|	ТаблицаСЗаказами.УчетнаяЗаписьЭлектронногоОбмена.Идентификатор КАК SENDER,
		|	ЗаказПоставщикуТовары.Ссылка.Контрагент.КодПоОКПО КАК CodeByBuyer,
		|	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
		|	ТаблицаСЗаказами.SUPPLIER,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСЗаказами.RECIPIENT, """") = """"
		|			ТОГДА ТаблицаСЗаказами.SUPPLIER
		|		КОГДА ТаблицаСЗаказами.RECIPIENT = НЕОПРЕДЕЛЕНО
		|			ТОГДА ТаблицаСЗаказами.SUPPLIER
		|		ИНАЧЕ ТаблицаСЗаказами.SUPPLIER
		|	КОНЕЦ КАК RECIPIENT,
		|	ТаблицаСЗаказами.УчетнаяЗаписьЭлектронногоОбмена КАК УчетнаяЗаписьЭлектронногоОбмена,
		|	ЗаказПоставщикуТовары.СкладКомпании.Код КАК КодСклада,
		|	ЗаказПоставщикуТовары.Ссылка.ПодразделениеКомпании.СпецПрефикс КАК СпецПрефикс,
		|	ЗаказПоставщикуТовары.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	ТаблицаСЗаказами КАК ТаблицаСЗаказами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ТаблицаСЗаказами.Заказ = ЗаказПоставщикуТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеПозиции КАК РабочиеПозиции
		|		ПО (ЗаказПоставщикуТовары.Номенклатура = РабочиеПозиции.Номенклатура)
		|			И (ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры = РабочиеПозиции.ХарактеристикаНоменклатуры)
		|			И (ЗаказПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.ORDERUNIT = РабочиеПозиции.ЕдиницаИзмеренияЕдиницаПоКлассификаторуORDERUNIT)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	СкладКомпании,
		|	ЗаказПоставщикуТовары.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПодготовкаШтрихКодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ МаксимальныйШтрихКод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ РабочиеПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаСЗаказами";
			
		
		
		
		Запрос.УстановитьПараметр("ТЗаказы", ТаблицаЗаказовПоставщику);
		Результат = Запрос.Выполнить();
		
		//Запись = Новый ЗаписьXML;
		Каталог = КаталогВременныхФайлов();	
		
		//Каталог = "c:\Comarch";
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Макет = ПолучитьМакет("OrderKomarch");
		//ТестМакета = Макет.ПолучитьТекст();
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
		//Чтение.ОткрытьФайл("C:\exite\order.xsd");
		
		НовыйПостроительДом = Новый ПостроительDOM;
		НовыйДокументДом = НовыйПостроительДом.Прочитать(Чтение);
		
		НовыйПостроительСхем = Новый ПостроительСхемXML;
		НоваяСхема = НовыйПостроительСхем.СоздатьСхемуXML(НовыйДокументДом);
		
		НаборСхем = Новый НаборСхемXML;
		НаборСхем.Добавить(НоваяСхема);
		
		НоваяФабрика = Новый ФабрикаXDTO(НаборСхем);
		Document_OrderType = НоваяФабрика.Тип("http://www.edi.su","Document-Order");
		Order_HeaderType = НоваяФабрика.Тип("http://www.edi.su","Order-Header");
		
		Order_PartiesType = НоваяФабрика.Тип("http://www.edi.su","Order-Parties");
		BuyerType = НоваяФабрика.Тип("http://www.edi.su","Buyer");
		SellerType = НоваяФабрика.Тип("http://www.edi.su","Seller");
		DeliveryPointType = НоваяФабрика.Тип("http://www.edi.su","DeliveryPoint");
		InvoiceeType = НоваяФабрика.Тип("http://www.edi.su","Invoicee");
		
		Order_LinesType = НоваяФабрика.Тип("http://www.edi.su","Order-Lines");
		LineType = НоваяФабрика.Тип("http://www.edi.su","Line");
		Line_ItemType = НоваяФабрика.Тип("http://www.edi.su","Line-Item");
		
		Order_SummaryType = НоваяФабрика.Тип("http://www.edi.su","Order-Summary");
		
		
		МассивФайловДляОтправки = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("Ссылка") Цикл
			
			EDIMESSAGE = Формат(ВыборкаДетальныеЗаписи.OrderDate, "ДФ=""ггггММддЧЧммсс000""") + "-OUT-" + ВыборкаДетальныеЗаписи.OrderNumber;
			
			Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("СкладКомпании") Цикл 
				
				КодСклада =  СокрЛП(СтрЗаменить(ВыборкаДетальныеЗаписи.КодСклада,ВыборкаДетальныеЗаписи.СпецПрефикс,""));
				//	EDIMESSAGE = Формат(ВыборкаДетальныеЗаписи.OrderDate, "ДФ=""ггггММддЧЧммсс000""") + "-OUT-" + ВыборкаДетальныеЗаписи.OrderNumber+"-"+КодСклада;
				//EDIMESSAGE = Формат(ВыборкаДетальныеЗаписи.OrderDate, "ДФ=""ггггММддЧЧммсс000""") + "-OUT-" + ВыборкаДетальныеЗаписи.OrderNumber;
				
				ФайлXML = Каталог+"\"+EDIMESSAGE+"-"+КодСклада+"_ORDERS.xml";
				Запись = Новый ЗаписьXML;
				Запись.ОткрытьФайл(ФайлXML);
				Запись.ЗаписатьОбъявлениеXML();
				ЭлементЗаказа = НоваяФабрика.Создать(Document_OrderType);
				
				ЭлементШапки = НоваяФабрика.Создать(Order_HeaderType);
				ЭлементШапки.OrderNumber = ВыборкаДетальныеЗаписи.OrderNumber+":"+КодСклада;
				ЭлементШапки.OrderDate = Формат(ВыборкаДетальныеЗаписи.OrderDate,"ДФ=yyyy-MM-dd");
				ЭлементШапки.ExpectedDeliveryDate = Формат(ВыборкаДетальныеЗаписи.ExpectedDeliveryDate,"ДФ=yyyy-MM-dd");
				ЭлементШапки.ExpectedDeliveryTime =Формат( ВыборкаДетальныеЗаписи.ExpectedDeliveryDate,"ДФ=ЧЧ:мм");
				//ЭлементШапки.ContractNumber = ВыборкаДетальныеЗаписи.ContractNumber;
				//ЭлементШапки.PromotionReference = ВыборкаДетальныеЗаписи.PromotionReference;
				ЭлементШапки.Currency = ВыборкаДетальныеЗаписи.Currency;
				ЭлементШапки.DocumentFunctionCode = "O";
				//ЭлементШапки.ContractType = ВыборкаДетальныеЗаписи.ContractType;
				ЭлементШапки.Remarks = ВыборкаДетальныеЗаписи.Remarks;
				
				ЭлементЗаказа.Order_Header = ЭлементШапки;
				
				ЭлементOrder_PartiesType =  НоваяФабрика.Создать(Order_PartiesType);
				
				ЭлементBuyerType =  НоваяФабрика.Создать(BuyerType);
				ЭлементBuyerType.ILN = ВыборкаДетальныеЗаписи.BUYER;
				//ЭлементBuyerType.TaxID = ВыборкаДетальныеЗаписи.TaxID;
				//ЭлементBuyerType.VatPayerCertificate = ВыборкаДетальныеЗаписи.VatPayerCertificate;
				//ЭлементBuyerType.CodeByBuyer = ВыборкаДетальныеЗаписи.CodeByBuyer;
				//ЭлементBuyerType.PurchasingContact = ВыборкаДетальныеЗаписи.PurchasingContact;
				//ЭлементBuyerType.Department = ВыборкаДетальныеЗаписи.Department;
				//ЭлементBuyerType.InternalNumber = ВыборкаДетальныеЗаписи.InternalNumber;
				
				ЭлементSellerType =  НоваяФабрика.Создать(SellerType);
				ЭлементSellerType.ILN = ВыборкаДетальныеЗаписи.SUPPLIER; 
				ЭлементSellerType.CodeByBuyer = ВыборкаДетальныеЗаписи.CodeByBuyer;
				
				ЭлементDeliveryPointType =  НоваяФабрика.Создать(DeliveryPointType);
				ЭлементDeliveryPointType.ILN = ВыборкаДетальныеЗаписи.DeliveryPoint; 
				ЭлементDeliveryPointType.DeliveryPlace = ВыборкаДетальныеЗаписи.ТочкаДоставки.ПолучитьОбъект().ПолучитьАдрес(); 
				
				ЭлементInvoiceeType =  НоваяФабрика.Создать(InvoiceeType);
				ЭлементInvoiceeType.ILN =  ВыборкаДетальныеЗаписи.INVOICEPARTNER;
				
				ЭлементOrder_PartiesType.Buyer = ЭлементBuyerType;
				ЭлементOrder_PartiesType.Seller = ЭлементSellerType;
				ЭлементOrder_PartiesType.DeliveryPoint = ЭлементDeliveryPointType;
				ЭлементOrder_PartiesType.Invoicee = ЭлементInvoiceeType;
				
				
				ЭлементЗаказа.Order_Parties=ЭлементOrder_PartiesType;
				
				ЭлементOrder_LinesType = НоваяФабрика.Создать(Order_LinesType);
				ВсегоЛиний=0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
					ВсегоЛиний = ВсегоЛиний + 1;
					ЭлементСтрокиLine =  НоваяФабрика.Создать(LineType);
					ЭлементСтрокиLine_Item =  НоваяФабрика.Создать(Line_ItemType);
					
					ЭлементСтрокиLine_Item.LineNumber = ВыборкаДетальныеЗаписи.LineNumber;
					ЭлементСтрокиLine_Item.EAN = ВыборкаДетальныеЗаписи.EAN;
					ЭлементСтрокиLine_Item.BuyerItemCode = ВыборкаДетальныеЗаписи.BuyerItemCode;
					//ЭлементСтрокиLine_Item.SupplierItemCode = ВыборкаДетальныеЗаписи.SupplierItemCode;
					//ЭлементСтрокиLine_Item.PromotionNumber = ВыборкаДетальныеЗаписи.PromotionNumber;
					ЭлементСтрокиLine_Item.ItemDescription = ВыборкаДетальныеЗаписи.ItemDescription;
					ЭлементСтрокиLine_Item.OrderedQuantity = ВыборкаДетальныеЗаписи.OrderedQuantity;
					ЭлементСтрокиLine_Item.OrderedUnitPacksize = ВыборкаДетальныеЗаписи.OrderedUnitPacksize;
					ЭлементСтрокиLine_Item.UnitOfMeasure = ВыборкаДетальныеЗаписи.UnitOfMeasure;
					//	ЭлементСтрокиLine_Item.OrderedUnitNetPrice = 0; //ВыборкаДетальныеЗаписи.OrderedUnitNetPrice; // попросили писать нулевую цену
					ЭлементСтрокиLine_Item.OrderedUnitNetPrice = ВыборкаДетальныеЗаписи.OrderedUnitNetPrice;    //Данченко О.Ю.  02.04.13
					ЭлементСтрокиLine_Item.TaxRate = ВыборкаДетальныеЗаписи.TaxRate;
					//ЭлементСтрокиLine_Item.TaxCategoryCode = ВыборкаДетальныеЗаписи.TaxCategoryCode;
					//ЭлеменЭлементСтрокиLine_ItemтСтроки.GrossAmount = ВыборкаДетальныеЗаписи.GrossAmount;
					//ЭлементСтрокиLine_Item.NetAmount = ВыборкаДетальныеЗаписи.NetAmount;
					//ЭлементСтрокиLine_Item.OrderedUnitListPrice = ВыборкаДетальныеЗаписи.OrderedUnitListPrice;
					//ЭлементСтрокиLine_Item.FlowType = ВыборкаДетальныеЗаписи.FlowType;
					ЭлементСтрокиLine.Line_Item = ЭлементСтрокиLine_Item;
					ЭлементOrder_LinesType.Line.Добавить(ЭлементСтрокиLine); 
					//Сообщить(ВыборкаДетальныеЗаписи.POSITIONNUMBER);		
				КонецЦикла;
				ЭлементЗаказа.Order_Lines= ЭлементOrder_LinesType;
				
				ЭлементOrder_SummaryType = НоваяФабрика.Создать(Order_SummaryType);
				ЭлементOrder_SummaryType.TotalLines = ВсегоЛиний;
				
				ЭлементЗаказа.Order_Summary = ЭлементOrder_SummaryType;
				НоваяФабрика.ЗаписатьXML(Запись,ЭлементЗаказа,,,,НазначениеТипаXML.Неявное);
				
				Запись.Закрыть();
				
				ДляИзменения = Новый ЧтениеТекста(ФайлXML,КодировкаТекста.UTF8);
				НовыйФайл = Новый ЗаписьТекста(ФайлXML+"A",КодировкаТекста.UTF8);
				Стр = ДляИзменения.ПрочитатьСтроку();
				Пока НЕ Стр=Неопределено Цикл
					НовыйФайл.ЗаписатьСтроку(ЗаменитьТеги(Стр));
					Стр = ДляИзменения.ПрочитатьСтроку();
				КонецЦикла;
				НовыйФайл.Закрыть();
				ДляИзменения.Закрыть();
				ПереместитьФайл(ФайлXML+"A",ФайлXML);
				МассивФайловДляОтправки.Добавить(ФайлXML);
			КонецЦикла;
		КонецЦикла;
		
		
			
		Если МассивФайловДляОтправки.Количество()>0 Тогда
			Если УчетнаяЗапись.СпособОтправки = Перечисления.СпособОтправкиЭлектронногоДокумента.ОтправлятьНаСервер тогда
				
				ПараметрыПодключения = ПолучитьПараметрыУчетки(УчетнаяЗапись);
				ТекущийКаталогFTP = "/IN/ORDERS/";
				
				Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
				
				Если Сервер = Неопределено Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось установить соединение с сервером EDI, повторите отправку.'; uk = 'Не вдалося встановити з''єднання з сервером EDI, повторіть відправку.'"));
					
				Иначе
					Сервер.УстановитьТекущийКаталог(ТекущийКаталогFTP);
					ВсеОк = Истина;
					Для Каждого ФайЗаказа Из МассивФайловДляОтправки Цикл 
						Попытка
							ИмяФайла = НайтиФайлы(ФайЗаказа)[0].Имя;
							Сервер.Записать(ФайЗаказа,ИмяФайла);
						Исключение
							ВсеОк = Ложь;
						КонецПопытки;
					КонецЦикла;
					
					Если ВсеОк тогда
						Для Каждого СтрЗаказы Из  ТаблицаЗаказовПоставщику Цикл 
							
							ЗаказыПоставщику = СтрЗаказы.Заказ.ПолучитьОбъект();				
							ЗаказыПоставщику.УстановитьСтатусЗаказаВеб(Перечисления.СтатусыЗаказовВеб.НеПодтвержден);
							ЗаказыПоставщику.Записать(РЕжимЗаписиДокумента.Запись);
														
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Документ %1 выгружен успешно!'; uk = 'Документ %1 вивантажений успішно!'"),
									ЗаказыПоставщику));	
									
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
			Для Каждого  Файл_у Из МассивФайловДляОтправки Цикл 
				УдалитьФайлы(Файл_у);	
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		СообщениеОшибки = "Внимание ошибка с EDI (Comarche) в базе "+ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Наименование+":"+Символы.ПС+ОписаниеОшибки();
		//ОМ.СоздатьЭлектронноеУведомление(СообщениеОшибки, ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ПодразделениеКомпании, Справочники.ПравилаОтправкиУведомлений.НайтиПоНаименованию("Ошибка обмена EDI"));
		
	КонецПопытки;
	
	
КонецПроцедуры
 
Процедура ПроверитьНаличиеФайлов(ТипДокумента, ПараметрыПодключения, ЗаДату) Экспорт
	
	СписокФайловСОшибками = Новый СписокЗначений;
	
    Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);	
    Если Сервер = Неопределено Тогда
    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствует подключение к FTP!'; uk = 'Відсутнє підключення до FTP!'"));
    	Возврат;
    КонецЕсли;
    
    МаскаФайлов = "*" + НРЕГ(ТипДокумента) + "_*.xml";
    Если ПараметрыПодключения.Провайдер = ПредопределенноеЗначение("Перечисление.ПоставщикиEDI.Edisoft") Тогда
    	
    	МассивФайлов = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP, "" + ВРег(ТипДокумента) + "_"+ЗаДату+"*.xml");
    	
    ИначеЕсли ПараметрыПодключения.Провайдер = ПредопределенноеЗначение("Перечисление.ПоставщикиEDI.COMARCH") Тогда
    	
    	МассивФайлов = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP, "*.xml");
    	МаскаФайлов = "*.xml";
 
    Иначе
    	
    	МассивФайлов = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP, "" + НРЕГ(ТипДокумента) + "_"+ЗаДату+"*.xml");
    	
    КонецЕсли;
    
    Если МассивФайлов.Количество() =  0 Тогда
    	Возврат;
    КонецЕсли;
    
    ///
    //Инициализация(Ложь);	
    
    Для Каждого Файл Из МассивФайлов Цикл

    	Если НЕ Файл.Этофайл() Тогда
    		Продолжить;
    	КонецЕсли;
    	
    	//Сообщить("Файл = " + Файл.ПолучитьВремяИзменения());
    	Сервер.Получить(Файл.ПолноеИмя, ПараметрыПодключения.КаталогВременныхФайлов + "/" + Файл.Имя);		
    КонецЦикла;
    
    Файлы = НайтиФайлы(ПараметрыПодключения.КаталогВременныхФайлов,  МаскаФайлов);
 
 
	Если Файлы.Количество() > 0 Тогда
		
		//Сообщить("Импорт файлов из eXite начат в " + ТекущаяДата() + Символы.ПС);
		НачалоВыполнения = ТекущаяДата();
		//ПолучитьСписокДоступныхОрганизаций();
		КоличествоСозданныхДокументов = 0;
			
		Для Каждого ТекФайл Из Файлы Цикл
			
			Если СписокФайловСОшибками.НайтиПоЗначению(ТекФайл.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обрабатывается файл '; uk = 'Обробка файлу '") + ТекФайл.Имя);
						
			Чтение = Новый ЧтениеXML();
			ДеревоЗначений = Новый ДеревоЗначений();
			
			Попытка
				Чтение.ОткрытьФайл(ТекФайл.ПолноеИмя);
				Чтение.Прочитать();
			Исключение
				Чтение.Закрыть();				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ XML поврежден'; uk = 'Документ XML пошкоджений'"));				
			КонецПопытки;
					
			ДеревоЗначений.Колонки.Добавить("Элемент");
			ДеревоЗначений.Колонки.Добавить("Текст");
			Корень         = ДеревоЗначений.Строки.Добавить();
			Корень.Элемент = Чтение.Имя;
			Рекурсия(Корень, Чтение);
			Дерево = ДеревоЗначений;
			
			Если ТипДокумента = "DESADV" Тогда
				
				СтруктураДокумента = СтруктураДокумента_DESADV(Дерево, ПараметрыПодключения);
				
				Если НЕ СтруктураДокументаВерна(СтруктураДокумента, ТекФайл, СписокФайловСОшибками) Тогда
					
					Чтение.Закрыть();
					
					//ОтправитьПисьмоДляАнализа(СтруктураДокумента, ТекФайл);
					
					Если СтруктураДокумента.ДокументИБ Тогда
						Попытка
							МассивФайловДляУдаления = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP,ТекФайл.Имя);
						Исключение
							Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
							Если Сервер = Неопределено Тогда
								Продолжить;
							Иначе
								Попытка
									МассивФайловДляУдаления = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP,ТекФайл.Имя);	
								Исключение
									Продолжить;	
								КонецПопытки;
							КонецЕсли;	
						КонецПопытки;
						
						Для каждого Файла из МассивФайловДляУдаления Цикл
							Если Файла.ЭтоФайл() тогда
								Попытка
									Сервер.Удалить(Файла.ПолноеИмя); 
								Исключение
									Попытка
										Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
										Если Сервер = Неопределено Тогда
											Продолжить;
										Иначе
											Попытка
												Сервер.Удалить(Файла.ПолноеИмя); 
											Исключение
												Продолжить;
											КонецПопытки;
										КонецЕсли;
									Исключение
										Продолжить;
									КонецПопытки;
								КонецПопытки;
							КонецЕсли;		
						КонецЦикла;
						
					КонецЕсли;
					
					УдалитьФайлы(ПараметрыПодключения.КаталогВременныхФайлов+ТекФайл.Имя);
					Продолжить;
				КонецЕсли;
				
				ТекущееКоличествоСозданныхDESADV = СоздатьЗаписьУведомленияОбОтгрузке(ПараметрыПодключения.КаталогВременныхФайлов+ТекФайл.Имя, СтруктураДокумента,ПараметрыПодключения);
				Если НЕ ПроверитьЗагруженЛиФайл(ТекущееКоличествоСозданныхDESADV, ТекФайл, СписокФайловСОшибками) Тогда
					Продолжить;
				КонецЕсли;
				КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + ТекущееКоличествоСозданныхDESADV;
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не настроена загрузка для типа документа: '; uk = 'Не налаштоване завантаження для типа докумнта: '") + ТипДокумента);
				
			КонецЕсли;
			
			Чтение.Закрыть();
						
			//Удаляем если документ этой базы
			Если СтруктураДокумента.ДокументИБ Тогда
								
				//Удалим файл с фтп
				Попытка
					МассивФайловДляУдаления = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP,ТекФайл.Имя);
				Исключение
					Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
					Если Сервер = Неопределено Тогда
						Продолжить;
					Иначе
						Попытка
							МассивФайловДляУдаления = Сервер.НайтиФайлы(ПараметрыПодключения.ТекущийКаталогFTP,ТекФайл.Имя);	
						Исключение
							Продолжить;	
						КонецПопытки;
					КонецЕсли;	
				КонецПопытки;
			
				Для каждого Файла из МассивФайловДляУдаления Цикл
					Если Файла.ЭтоФайл() тогда
						Попытка
							Сервер.Удалить(Файла.ПолноеИмя); 
						Исключение
							Попытка
								Сервер = ПолучитьFTPСоединение(ПараметрыПодключения);
								Если Сервер = Неопределено Тогда
									Продолжить;
								Иначе
									Попытка
										Сервер.Удалить(Файла.ПолноеИмя); 
									Исключение
										Продолжить;
									КонецПопытки;
								КонецЕсли;
							Исключение
								Продолжить;
							КонецПопытки;
						КонецПопытки;
					КонецЕсли;		
				КонецЦикла;
				
			КонецЕсли;
			УдалитьФайлы(ПараметрыПодключения.КаталогВременныхФайлов+ТекФайл.Имя);

		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Обработка eXite окончена %1. Загружено %2 файлов из %3 возможных. Время выполнения %4 с.'; uk = 'Обробка eXite закінчена %1. Завантажено %2 файлів із %3 можливих Час виконання %4 с.'"),
				ТекущаяДата(),
				КоличествоСозданныхДокументов,
				Файлы.Количество(),
				ТекущаяДата() - НачалоВыполнения));		 
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

 
	
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьFTPСоединение(ПараметрыПодключения)
	
	ИспользуетсяПрокси = ПараметрыПодключения.ИспользуетсяПрокси;
	
	Если ИспользуетсяПрокси Тогда
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ПараметрыПодключения.ПроксиИмяПользователя;
		ПроксиСервер.Пароль = ПараметрыПодключения.ПроксиПароль;
		Попытка
			Сервер = Новый FTPСоединение(ПараметрыПодключения.ИмяСервераFTP, ПараметрыПодключения.ПортFTP, ПараметрыПодключения.ИмяПользователяНаСервере, ПараметрыПодключения.ПарольПользователяНаСервере, ПараметрыПодключения.ПроксиСервер, ПараметрыПодключения.ПассивныйРежим);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе
		Попытка
			Сервер = Новый FTPСоединение(ПараметрыПодключения.ИмяСервераFTP, ПараметрыПодключения.ПортFTP, ПараметрыПодключения.ИмяПользователяНаСервере,  ПараметрыПодключения.ПарольПользователяНаСервере, , ПараметрыПодключения.ПассивныйРежим);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	
	Возврат Сервер;
	
КонецФункции
 
Функция ПолучитьПараметрыУчетки(Учетка)
	
		
	ПараметрыПодключения = Новый Структура("УчеткаEDI,Провайдер, ИспользуетсяПрокси,ПроксиИмяПользователя,ПроксиПароль,ИмяСервераFTP,ПортFTP,ИмяПользователяНаСервере,ПарольПользователяНаСервере,ПассивныйРежим");
	ПараметрыПодключения.УчеткаEDI = Учетка;
	ПараметрыПодключения.Провайдер = Учетка.ПоставщикEDI;
	ПараметрыПодключения.ИмяСервераFTP = Учетка.СоединениеССервером;
	ПараметрыПодключения.ПортFTP = Учетка.ПортСервера;
	ПараметрыПодключения.ИмяПользователяНаСервере = Учетка.ИмяПользователяНаСервере;
	ПараметрыПодключения.ПарольПользователяНаСервере = Учетка.ПарольПользователяНаСервере;
	ПараметрыПодключения.ПассивныйРежим = Учетка.ПассивныйРежим;
	ПараметрыПодключения.ИспользуетсяПрокси = Учетка.ПроксиИспользование;
	//ПараметрыПередачи.Таймаут = 30;
	Если ПараметрыПодключения.ИспользуетсяПрокси тогда
		ПараметрыПодключения.ИмяПроксиСервера = Учетка.ПроксиСервер;
		ПараметрыПодключения.ПортПроксиСервера = Учетка.ПроксиПорт;
		ПараметрыПодключения.ПроксиИмяПользователя = Учетка.ПроксиИмяПользователя;
		ПараметрыПодключения.ПроксиПароль = Учетка.ПроксиПароль;
	КонецЕсли;

	Возврат  ПараметрыПодключения;
	
КонецФункции


Функция СтруктураДокумента_DESADV(Дерево, Параметры)
	
	Если Параметры.Провайдер = ПредопределенноеЗначение("Перечисление.ПоставщикиEDI.COMARCH") Тогда
		Возврат ПолучитьСтруктуруДокумента_COMARCH_DESADV(Дерево,Параметры)
	Иначе
		Возврат ПолучитьСтруктуруДокумента_DESADV(Дерево,Параметры) 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруДокумента_COMARCH_DESADV(Дерево, Параметры)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен", 1);
	СтруктураДокумента.Вставить("Провайдер", Параметры.Провайдер);	
	СтруктураДокумента.Вставить("ДокументИБ", Истина);	
	
	
	//Определяем реквизиты документа
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "Document-DespatchAdvice");
	
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ОшибкиДокумента  = НСтр("ru = 'Файл не является DESADV-файлом!'; uk = 'Файл не є DESADV-файлом!'");
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
	УзелHeader =  ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Header");
	Если Не УзелHeader = Неопределено Тогда
		СтрокиHeader = 	УзелHeader.Строки;
	Иначе
		ОшибкиДокумента  = "Нет обязательного узла DespatchAdvice-Header";
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
		
	
	Рез =  ОбработатьПоле("DespatchAdviceNumber",СтруктураДокумента,СтрокиHeader,"DESADV");
	Рез =  ОбработатьПоле("DespatchAdviceDate",СтруктураДокумента,СтрокиHeader,"DESADV");
	Рез =  ОбработатьПоле("EstimatedDeliveryDate",СтруктураДокумента,СтрокиHeader,"DESADV");
	Рез =  ОбработатьПоле("OrderDate",СтруктураДокумента,СтрокиHeader,"DESADV");	
	Рез =  ОбработатьПоле("BuyerOrderNumber",СтруктураДокумента,СтрокиHeader,"DESADV");
	
	УзелParties =  ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Parties");
	Если Не УзелHeader = Неопределено Тогда
		СтрокиParties = 	УзелParties.Строки;
	Иначе
		ОшибкиДокумента  = "Нет обязательного узла DespatchAdvice-Parties";
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
	Рез =  ОбработатьПоле("Buyer",СтруктураДокумента,СтрокиParties,"DESADV");
	Рез =  ОбработатьПоле("Seller",СтруктураДокумента,СтрокиParties,"DESADV");
	Рез =  ОбработатьПоле("DeliveryPoint",СтруктураДокумента,СтрокиParties,"DESADV");
	Рез =  ОбработатьПоле("UltimateConsignee",СтруктураДокумента,СтрокиParties,"DESADV");

		
	Если НЕ ПроверитьПринадлежностьДокументаИБ(СтруктураДокумента) Тогда
		Возврат СтруктураДокумента;
	КонецЕсли;

	//

	ТипДокумента = ПолучитьТипДокумента(СтруктураДокумента);
	
	Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
		
		Если ТипДокумента = "ПоступлениеТоваров" Тогда
			ТекстЗапроса = 	"ВЫБРАТЬ ПЕРВЫЕ 1
			               	|	ПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			               	|ИЗ
			               	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			               	|ГДЕ
			               	|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			               	|	И ПоступлениеТоваров.Контрагент = &Контрагент
			               	|	И ПоступлениеТоваров.ВхДокДата МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			               	|	И ПоступлениеТоваров.ВхДокНомер = &НомерВходящегоДокумента"
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ПредварительноеПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			               |ИЗ
			               |	Документ.ПредварительноеПоступлениеТоваров КАК ПредварительноеПоступлениеТоваров
			               |ГДЕ
			               |	ПредварительноеПоступлениеТоваров.НомерВходящегоДокумента = &НомерВходящегоДокумента
			               |	И ПредварительноеПоступлениеТоваров.ДатаВходящегоДокумента МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			               |	И ПредварительноеПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			               |	И ПредварительноеПоступлениеТоваров.Контрагент = &Контрагент
			               |	И ПредварительноеПоступлениеТоваров.ПрочитанИзТСД = ЛОЖЬ";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;

		Запрос.УстановитьПараметр("НачДатаВходящегоДокумента", СтруктураДокумента.Датапоставки-60*60*24*14);
		Запрос.УстановитьПараметр("КонДатаВходящегоДокумента", СтруктураДокумента.Датапоставки+60*60*24*14);

		Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтруктураДокумента.НомерДокумента);
		Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СтруктураДокумента.Вставить("ПредварительныйДокумент", Документы[ТипДокумента].ПустаяСсылка());
		Иначе
			Выборка =РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("ПредварительныйДокумент", Выборка.ПредварительныйДокумент);
		КонецЕсли;
	Иначе
		//СтруктураДокумента.Вставить("ПредварительныйДокумент", Документы.ПредварительноеПоступлениеТоваров.ПустаяСсылка());
		СтруктураДокумента.Вставить(ТипДокумента, ПредопределенноеЗначение("Документ."+ТипДокумента+".ПустаяСсылка"));
	КонецЕсли;
	//
	
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "DespatchAdvice-Lines");
	Если Узел = Неопределено Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DespatchAdvice-Lines""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	Иначе
		СтрокаДерева = Узел.Строки;
	КонецЕсли;
	
		
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "Line");
	Если Узел = Неопределено Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""Line""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	Иначе
		СтрокаДерева = Узел.Строки;
	КонецЕсли;
	
	//
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "Line-Item");
	Если ТабличнаяЧасть = Неопределено Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""Line-Item""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;

	//
	//	
	ДокументТЧ = ПолучитьТаблицуТоваров("DESADV");	

	СписокШтрихКодов = Новый СписокЗначений;
	//
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
	//	
		СтрокаДерева = Узел.Строки;
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		Рез =  ОбработатьПолеТабличнойЧасти("LineNumber",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("EAN",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("QuantityOrdered",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("QuantityDespatched",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("UnitOfMeasure",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("UnitGrossPrice",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
	//	Рез =  ОбработатьПолеТабличнойЧасти("DELIVEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");   //TAXRATE
		Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");

	//	Рез =  ОбработатьПолеТабличнойЧасти("COUNTRYORIGIN",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
	//	Рез =  ОбработатьПолеТабличнойЧасти("CUSTOMSTARIFFNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");

	//	
	//	Если СтрокаДерева.Найти("ORDEREDQUANTITY", "Элемент", Ложь) <> Неопределено Тогда
	//		НоваяСтрокаТЧ.КоличествоРасхождение = НоваяСтрокаТЧ.КоличествоВЗаказе-НоваяСтрокаТЧ.Количество;
	//	КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
			СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
		КонецЕсли;
		
	КонецЦикла;
	//
	
	Если СтруктураДокумента.ДокументКорректен = 1 Тогда
	   ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов);
	   СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	КонецЕсли;	
			
	Возврат СтруктураДокумента;	
	
КонецФункции

Функция ПолучитьСтруктуруДокумента_DESADV(Дерево, Параметры)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен", 1);
	СтруктураДокумента.Вставить("Провайдер", Параметры.Провайдер);	
	СтруктураДокумента.Вставить("ДокументИБ", Истина);		
	
	//Определяем реквизиты документа
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "DESADV");
	
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ОшибкиДокумента  = НСтр("ru = 'Файл не является DESADV-файлом!'; uk = 'Файл не є DESADV-файлом!'");
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
	Рез =  ОбработатьПоле("DATE",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("NUMBER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("DELIVERYDATE",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("ORDERDATE",СтруктураДокумента,СтрокаДерева,"DESADV");	
	Рез =  ОбработатьПоле("ORDERNUMBER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("DELIVERYNOTENUMBER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("DELIVERYNOTEDATE",СтруктураДокумента,СтрокаДерева,"DESADV");		
	
	//HEAD
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""HEAD""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;
	
	
	Рез =  ОбработатьПоле("BUYER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("SUPPLIER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("DELIVERYPLACE",СтруктураДокумента,СтрокаДерева,"DESADV"); //#ПодВопросом Что сюда подставить?
	Рез =  ОбработатьПоле("SENDER",СтруктураДокумента,СтрокаДерева,"DESADV");
	Рез =  ОбработатьПоле("EDIINTERCHANGEID",СтруктураДокумента,СтрокаДерева,"DESADV");
	
	
	Если НЕ ПроверитьПринадлежностьДокументаИБ(СтруктураДокумента) Тогда
		Возврат СтруктураДокумента;
	КонецЕсли;

	

	ТипДокумента = ПолучитьТипДокумента(СтруктураДокумента);
	
	Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
		
		Если ТипДокумента = "ПоступлениеТоваров" Тогда
			
			ТекстЗапроса = 	"ВЫБРАТЬ ПЕРВЫЕ 1
			               	|	ПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			               	|ИЗ
			               	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			               	|ГДЕ
			               	|	ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			               	|	И ПоступлениеТоваров.Контрагент = &Контрагент
			               	|	И ПоступлениеТоваров.ВхДокДата МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			               	|	И ПоступлениеТоваров.ВхДокНомер = &НомерВходящегоДокумента"
		Иначе
			
			ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ПредварительноеПоступлениеТоваров.Ссылка КАК ПредварительныйДокумент
			               |ИЗ
			               |	Документ.ПредварительноеПоступлениеТоваров КАК ПредварительноеПоступлениеТоваров
			               |ГДЕ
			               |	ПредварительноеПоступлениеТоваров.НомерВходящегоДокумента = &НомерВходящегоДокумента
			               |	И ПредварительноеПоступлениеТоваров.ДатаВходящегоДокумента МЕЖДУ &НачДатаВходящегоДокумента И &КонДатаВходящегоДокумента
			               |	И ПредварительноеПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
			               |	И ПредварительноеПоступлениеТоваров.Контрагент = &Контрагент
			               |	И ПредварительноеПоступлениеТоваров.ПрочитанИзТСД = ЛОЖЬ";
				
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;

		Запрос.УстановитьПараметр("НачДатаВходящегоДокумента", СтруктураДокумента.ДатаНакладной-60*60*24*14);
		Запрос.УстановитьПараметр("КонДатаВходящегоДокумента", СтруктураДокумента.ДатаНакладной+60*60*24*14);

		Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтруктураДокумента.НомерНакладной);
		//Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецМесяца((СтруктураДокумента.ДатаДокумента))));
		//Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоМесяца(ДобавитьМесяц(СтруктураДокумента.ДатаДокумента,-1))));
		Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СтруктураДокумента.Вставить("ПредварительныйДокумент", Документы[ТипДокумента].ПустаяСсылка());
		Иначе
			Выборка =РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("ПредварительныйДокумент", Выборка.ПредварительныйДокумент);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("ПредварительныйДокумент", ПредопределенноеЗначение("Документ.ПоступлениеТоваров.ПустаяСсылка"));
	КонецЕсли;
	
	
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "PACKINGSEQUENCE");
	Если Узел = Неопределено Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""PACKINGSEQUENCE""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	Иначе
		СтрокаДерева = Узел.Строки;
	КонецЕсли;
	
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION");
	Если ТабличнаяЧасть = Неопределено Тогда
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""POSITION""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;

	
	ДокументТЧ = ПолучитьТаблицуТоваров("DESADV");	

	СписокШтрихКодов = Новый СписокЗначений;
	
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
		
		СтрокаДерева = Узел.Строки;
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		Рез =  ОбработатьПолеТабличнойЧасти("POSITIONNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDSUPPLIER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDBUYER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("DELIVEREDUNIT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("DELIVEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");   //TAXRATE
		Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");

		Рез =  ОбработатьПолеТабличнойЧасти("COUNTRYORIGIN",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");
		Рез =  ОбработатьПолеТабличнойЧасти("CUSTOMSTARIFFNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"DESADV");

		
		Если СтрокаДерева.Найти("ORDEREDQUANTITY", "Элемент", Ложь) <> Неопределено Тогда
			НоваяСтрокаТЧ.КоличествоРасхождение = НоваяСтрокаТЧ.КоличествоВЗаказе-НоваяСтрокаТЧ.Количество;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
			СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
		КонецЕсли;
		
	КонецЦикла;
		
	Если СтруктураДокумента.ДокументКорректен = 1 Тогда
	   ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов);
	   СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	КонецЕсли;	
			
	Возврат СтруктураДокумента;	

	
КонецФункции


#КонецОбласти



#Область ПрочиеПроцедурыИФункции


Процедура Инициализация(ТолькоПравила = Истина)
	
	Если ТолькоПравила Тогда
		ПравилоУведомления = Справочники.ПравилаОтправкиУведомлений.НайтиПоНаименованию("Ошибка обмена EDI");
	Иначе
		СтавкиНДС = Новый Соответствие;
		СтавкиНДС.Вставить(20,Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);
		СтавкиНДС.Вставить(7,Справочники.СтавкиНДС.НДС7);
		СтавкиНДС.Вставить(0,Справочники.СтавкиНДС.БезНДС);
		
		Валюты = Новый Соответствие;
		Валюты.Вставить("UAH", Справочники.Валюты.НайтиПоКоду("980"));
		Валюты.Вставить("RUB", Справочники.Валюты.НайтиПоКоду("643"));
		Валюты.Вставить("USD", Справочники.Валюты.НайтиПоКоду("840"));
		Валюты.Вставить("EUR", Справочники.Валюты.НайтиПоКоду("978"));
		ПравилоУведомления = Справочники.ПравилаОтправкиУведомлений.НайтиПоНаименованию("Ошибка обмена EDI");
	КонецЕсли;
	ДопПараметровЗагрузки = Новый Структура;	
	текИБ =  ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ИнформационнаяБаза;
	ДопПараметровЗагрузки.Вставить("ТекущаяБаза",текИБ);
	Если текИБ = Справочники.СтруктураИнформационныхБаз.НайтиПоКоду("00000031") Тогда
		 ДопПараметровЗагрузки.Вставить("DESADV","ПоступлениеТоваров");
		 ДопПараметровЗагрузки.Вставить("База","АтикаРозница");
	ИначеЕсли  текИБ = Справочники.СтруктураИнформационныхБаз.НайтиПоКоду("00000003") Тогда
		 ДопПараметровЗагрузки.Вставить("DESADV","ПоступлениеТоваров");
		 ДопПараметровЗагрузки.Вставить("База","АтикаКиоски");

	 Иначе
		 ДопПараметровЗагрузки.Вставить("DESADV","ПредварительноеПоступлениеТоваров");
	КонецЕсли;
	
		

	
	
КонецПроцедуры


Функция ЗаменитьТеги(Строка)
	НоваяСтрока	= СтрЗаменить(Строка," xmlns=""http://www.edi.su"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xmlns=""http://www.edi.su/RETANN"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""gln""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""mailbox""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""number""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""amount""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""time""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""order-type""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""currency""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""percentage""","");
	НоваяСтрока	= СтрЗаменить(НоваяСтрока," xsi:type=""measurement-unit""","");
	Возврат НоваяСтрока;
КонецФункции

Процедура Рекурсия(СтрокаДерева, Чтение)
    
    АтрибутыСоответствие = Новый Соответствие();
	
	Пока Чтение.ПрочитатьАтрибут() Цикл
        АтрибутыСоответствие.Вставить(Чтение.Имя, Чтение.Значение);
    КонецЦикла;
	
	Если АтрибутыСоответствие.Количество() > 0 Тогда
        СтрокаДерева.Атрибуты = АтрибутыСоответствие;
    Иначе
        АтрибутыСоответствие = 0;
    КонецЕсли;
	
	Пока Чтение.Прочитать() Цикл
        Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            Прервать;
        ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
            СтрокаДерева.Текст = Чтение.Значение;
        ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            Дочерний         = СтрокаДерева.Строки.Добавить();
            Дочерний.Элемент = Чтение.Имя;
            Рекурсия(Дочерний, Чтение);
        КонецЕсли;        
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьТаблицуТоваров(ДокументТЧ, ШтрихКода,ТипДокумента="")
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ШтрихКоды.Объект КАК Номенклатура,
	//|	ШтрихКоды.ШтрихКод,
	//|	ШтрихКоды.ЕдиницаИзмерения,
	//|	ШтрихКоды.ЕдиницаИзмерения.Коэффициент КАК Коэффициент
	//|ИЗ
	//|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	//|ГДЕ
	//|	ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура
	//|	И ШтрихКоды.ШтрихКод В(&ШтрихКода)";
	
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихКод,
	|	ШтрихкодыНоменклатуры.Упаковка КАК ЕдиницаИзмерения,
	|	ЕстьNull(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 0) КАК Коэффициент
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В(&ШтрихКода)";
	
	Запрос.УстановитьПараметр("ШтрихКода", ШтрихКода);
	
	тзТовары = Запрос.Выполнить().Выгрузить();
	СписокАктиулов = Новый СписокЗначений;
	
	
	Для Каждого СтрТовары Из ДокументТЧ Цикл 
		нСтрока =   тзТовары.Найти(СтрТовары.ШтрихКод,"ШтрихКод");
		Если нСтрока <> Неопределено Тогда
			СтрТовары.Номенклатура     = нСтрока.Номенклатура;
			СтрТовары.ЕдиницаИзмерения = нСтрока.ЕдиницаИзмерения;
			СтрТовары.Коэффициент      = нСтрока.Коэффициент;
		
		ИначеЕсли ЗначениеЗаполнено(СтрТовары.АртикулПокупателя) Тогда
			СписокАктиулов.Добавить(СтрТовары.АртикулПокупателя);
		КонецЕсли;
		Если ТипДокумента <> "ORDER" Тогда
			РасчитатьСтоимостьПоСтроке(СтрТовары,ТипДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокАктиулов.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	сНоменклатура.Артикул,
		|	сНоменклатура.Ссылка КАК Номенклатура,
		|	сНоменклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	сНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент
		|ИЗ
		|	Справочник.Номенклатура КАК сНоменклатура
		|ГДЕ
		|	сНоменклатура.Артикул В(&Артикул)";
		
		Запрос.УстановитьПараметр("Артикул", СписокАктиулов);
		
		тзТовары = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрТовары Из ДокументТЧ Цикл 
			Если ЗначениеЗаполнено(СтрТовары.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			
			нСтрока =   тзТовары.Найти(СтрТовары.АртикулПокупателя,"Артикул");
			Если нСтрока<> Неопределено Тогда
				СтрТовары.Номенклатура     = нСтрока.Номенклатура;
				СтрТовары.ЕдиницаИзмерения = нСтрока.ЕдиницаИзмерения;
				СтрТовары.Коэффициент      = нСтрока.Коэффициент;
				

			Иначе
				СтрТовары.НоменклатураОшибки = "Ошибка поиска номенклатуры по штрих-коду: "+ СтрТовары.ШтрихКод+" и артикулу: "+ СтрТовары.АртикулПокупателя;
			КонецЕсли;
			
			Если ТипДокумента <> "ORDER" Тогда
				РасчитатьСтоимостьПоСтроке(СтрТовары,ТипДокумента);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчитатьСтоимостьПоСтроке(СтрокаТоваров,ТипДокумента)
	
	TAXRATE = 20;
	Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
		
		Если СтрокаТоваров.TAXRATE = 1000 Тогда
			СтрокаТоваров.TAXRATE = СтрокаТоваров.Номенклатура.СтавкаНДС.Ставка;
			TAXRATE = СтрокаТоваров.TAXRATE;
			Попытка
				СтрокаТоваров.СтавкаНДС = ПолучитьСтавкуНДС(Число(СтрокаТоваров.TAXRATE));
			Исключение
				СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
			КонецПопытки;
		Иначе
			TAXRATE = СтрокаТоваров.TAXRATE;
		КонецЕсли;
	КонецЕсли;
	
	ЦенаБезНДС  = 0;
	ЦенаСНДС    = 0;
	Коэффициент = ?(СтрокаТоваров.Коэффициент = Неопределено,1,СтрокаТоваров.Коэффициент);
	
	Если СтрокаТоваров.PRICE <> 0 Тогда
		ЦенаБезНДС = СтрокаТоваров.PRICE;
	ИначеЕсли СтрокаТоваров.PRICEWITHVAT <> 0 Тогда
		ЦенаСНДС = СтрокаТоваров.PRICEWITHVAT;
	КонецЕсли;

	
	Если ЦенаБезНДС <> 0 Тогда
		
		Если СтрокаТоваров.Коэффициент = 0  Тогда
			СтрокаТоваров.Цена = ЦенаБезНДС*(1+TAXRATE/100);
		Иначе
			СтрокаТоваров.Цена = ЦенаБезНДС*(1+TAXRATE/100) / Коэффициент;
		КонецЕсли;
		
	ИначеЕсли ЦенаСНДС <> 0 Тогда
		
		Если СтрокаТоваров.Коэффициент = 0  Тогда
			СтрокаТоваров.Цена = ЦенаСНДС;
		Иначе
			СтрокаТоваров.Цена = ЦенаСНДС / Коэффициент;
		КонецЕсли;
	Иначе
		СтрокаТоваров.Цена = 0;
		
	КонецЕсли;
	


		СтрокаТоваров.КоличествоБазовое = СтрокаТоваров.Количество * Коэффициент;
		СтрокаТоваров.СуммаВсего        =  СтрокаТоваров.КоличествоБазовое * СтрокаТоваров.Цена;// * (1+СтрокаТоваров.TAXRATE/100);
		СтрокаТоваров.Сумма             =  СтрокаТоваров.КоличествоБазовое * СтрокаТоваров.Цена;// * (1+СтрокаТоваров.TAXRATE/100);
	
	
	Попытка
		СуммаБезНДС=(100*СтрокаТоваров.СуммаВсего)/(100+TAXRATE);
		СтрокаТоваров.СуммаНДС = Окр(СтрокаТоваров.СуммаВсего-СуммаБезНДС, 6);
	Исключение
	КонецПопытки; 

	
КонецПроцедуры

Функция ОбработатьПолеТабличнойЧасти(Имя,Строка,СтрокаДерева,ТипДокумента)
	ВсеОк = Истина;	
	
	Если Имя = "POSITIONNUMBER" ИЛИ Имя = "LineNumber" Тогда  //Номер строки
		
		xmlНомерСтрокиТЧ = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерСтрокиТЧ = Неопределено Тогда
			Попытка
				Строка.НомерСтрокиТЧ = Число(xmlНомерСтрокиТЧ);
				Если ТипДокумента = "DESADV" Тогда
					Строка.НомерСтрокиДокументаПоставщика = Строка.НомерСтрокиТЧ;	
				КонецЕсли;
			Исключение
				Строка.НомерСтрокиТЧ = 0;
				Если ТипДокумента = "DESADV" Тогда
					Строка.НомерСтрокиДокументаПоставщика = 0;	
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли Имя = "ORDERUNIT"	Тогда
		xmlORDERUNITСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlORDERUNITСтрока = Неопределено Тогда
			Строка.ORDERUNIT = СокрЛП(xmlORDERUNITСтрока);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCT" ИЛИ Имя = "EAN" Тогда   // Штрих - код номенклатуры
		
		xmlШтрихКодНоменклатуры = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlШтрихКодНоменклатуры = Неопределено Тогда
			Строка.ШтрихКод = СокрЛП(xmlШтрихКодНоменклатуры);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTIDSUPPLIER" Тогда   // Артикул поставщика(опциональное поле)
		
		xmlАртикулПоставщикаСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlАртикулПоставщикаСтрока = Неопределено Тогда
			Строка.АртикулПоставщика = СокрЛП(xmlАртикулПоставщикаСтрока);
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTIDBUYER" Тогда   // Артикул покупателя(опциональное поле)
		
		xmlАртикулПокупателяСтрока = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlАртикулПокупателяСтрока = Неопределено Тогда
			
			Если СтрДлина(xmlАртикулПокупателяСтрока) = 13 И Лев(xmlАртикулПокупателяСтрока,2) = "20" Тогда
				Строка.АртикулПокупателя = Сред(xmlАртикулПокупателяСтрока,3,6);
			Иначе
				Строка.АртикулПокупателя = xmlАртикулПокупателяСтрока;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "ORDRSPUNIT" ИЛИ Имя ="UnitOfMeasure"  Тогда    //Еденица измерения (опциональное поле)
		
		xmlЕденица = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlЕденица = Неопределено Тогда
			Строка.ЕденицаПоКлассификатору = xmlЕденица;
		КонецЕсли;
		
	ИначеЕсли Имя ="DELIVEREDUNIT" Тогда // Еденица по классификатору(опциональное поле)
		
		xmlЕденица = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlЕденица = Неопределено Тогда
			Строка.ЕденицаПоКлассификатору = xmlЕденица;
		КонецЕсли;
	ИначеЕсли Имя = "DELIVEREDQUANTITY" ИЛИ Имя = "QuantityDespatched" Тогда // Поставляемое количество(обязательное поле)
		
		xmlКоличествоПоставляемое = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlКоличествоПоставляемое = Неопределено Тогда
			Попытка
				Строка.Количество = Число(xmlКоличествоПоставляемое);
				Строка.КоличествоБазовое = Строка.Количество;
			Исключение
				Строка.Количество = 0;
				Строка.КоличествоБазовое = 0;
				ВсеОк = Ложь;
			КонецПопытки;
		Иначе
			Строка.Количество = 0;
			Строка.КоличествоБазовое = 0;
			//Если СтрокаДерева.Найти("DELIVEREDQUANTITY", "Элемент", Ложь)  = Неопределено Тогда
			//КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "DESCRIPTION" Тогда	  //Описание товара(опциональное поле)
		xmlОписание = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlОписание = Неопределено Тогда
			Строка.НоменклатураНаименование = xmlОписание;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRICE"  Тогда        //Цена товара(опциональное поле)
		xmlЦена = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlЦена = Неопределено Тогда
			Попытка 
				Строка.PRICE = Число(xmlЦена);
			Исключение
				Строка.PRICE = 0;
			КонецПопытки;
		Иначе
			Строка.PRICE = 0;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRICEWITHVAT" ИЛИ Имя = "UnitGrossPrice" Тогда   //Цена товара с НДС (опциональное поле)
		
		xmlЦенаСНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlЦенаСНДС = Неопределено Тогда
			Попытка 
				Строка.PRICEWITHVAT = Число(xmlЦенаСНДС);
				Строка.ЦенаСНДС = Число(xmlЦенаСНДС);
			Исключение
				Строка.PRICEWITHVAT = 0;
				Строка.ЦенаСНДС = 0;
			КонецПопытки;
			
		Иначе
			Строка.PRICEWITHVAT =0;
		КонецЕсли;
 
	ИначеЕсли Имя = "VAT" Тогда            //Ставка НДС  (опциональное поле)
		
		xmlНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlНДС = Неопределено Тогда
			Строка.TAXRATE = xmlНДС;
			Попытка 
				Строка.TAXRATE = Число(xmlНДС);
				Строка.СтавкаНДС = ПолучитьСтавкуНДС(Строка.TAXRATE);
			Исключение
				Строка.TAXRATE = 1000;
			КонецПопытки;
		Иначе 
			Строка.TAXRATE = 1000;
		КонецЕсли;
		
	ИначеЕсли Имя = "PRODUCTTYPE" Тогда        //Статусы   1 — товар будет поставлен без изменений, 2 — изменение заказанного количества, 3 — отказано в поставке   
			
		xmlДействия = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlДействия = Неопределено Тогда
			Строка.Действия = xmlДействия;
		КонецЕсли;

	ИначеЕсли Имя = "ORDEREDQUANTITY" ИЛИ Имя = "QuantityOrdered" Тогда    // Заказанное количество
		
		xmlКоличествоЗаказанное = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		ПолеТаблицы = "КоличествоВЗаказе";
		Если ТипДокумента = "ORDRSP" Тогда
			ПолеТаблицы = "КоличествоЗаказанное";
		ИначеЕсли ТипДокумента = "ORDER" Тогда
			ПолеТаблицы = "Количество";
		КонецЕсли;
		
		Если НЕ xmlКоличествоЗаказанное = Неопределено Тогда
			Попытка
				Строка[ПолеТаблицы] = Число(xmlКоличествоЗаказанное);
			Исключение
				Строка[ПолеТаблицы] = 0;
			КонецПопытки;
		Иначе
			Строка[ПолеТаблицы] = 0;
		КонецЕсли;
		
	ИначеЕсли Имя = "ACCEPTEDQUANTITY" Тогда   //Имеющееся количество
		
		xmlКоличествоИмеющееся = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlКоличествоИмеющееся = Неопределено Тогда
			Попытка
				Строка.КоличествоИмеющееся = Число(xmlКоличествоИмеющееся);
				Строка.Количество = Строка.КоличествоИмеющееся;
			Исключение
				Строка.КоличествоИмеющееся = 0;
			КонецПопытки
		КонецЕсли;
		
	ИначеЕсли Имя = "COUNTRYORIGIN" Тогда  // Страна производитель(опциональное поле)
		
		xmlСтранаПроизводитель = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "COUNTRYORIGIN", Ложь);
		Если НЕ xmlСтранаПроизводитель = Неопределено Тогда
			Строка.СтранаПроизводитель = СокрЛП(xmlСтранаПроизводитель);
		КонецЕсли;
		
	ИначеЕсли Имя = "CUSTOMSTARIFFNUMBER" Тогда  // Номер ГТД (опциональное поле)
		
		xmlНомерГТД = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, "CUSTOMSTARIFFNUMBER", Ложь);
		Если НЕ xmlНомерГТД = Неопределено Тогда
			Строка.НомерГТД = СокрЛП(xmlНомерГТД);
		КонецЕсли;
		
	ИначеЕсли Имя = "INFO" Тогда
		
		xmlПримечание = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		
		Если НЕ xmlПримечание = Неопределено Тогда
			Строка.Примечание = xmlПримечание;
		КонецЕсли;

	ИначеЕсли Имя = "CONDITIONSTATUS" Тогда   //Статус кондиции
		
	ИначеЕсли Имя = "PACKAGEID" Тогда         //Идентификатор упаковки 
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

Функция ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, ИмяПоля, Обязательное)
    
    xmlЗначение = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
    
    Если xmlЗначение = Неопределено Тогда
        
        
        Возврат Неопределено;
        
    Иначе
        
        ТекстовоеЗначение = xmlЗначение.Текст;
        
        Если Не ЗначениеЗаполнено(ТекстовоеЗначение) Тогда
            
            Возврат Неопределено;
            
        Иначе
            
            Возврат ТекстовоеЗначение;
            
        КонецЕсли;
        
    КонецЕсли;
    
КонецФункции

Функция ПолучитьТаблицуТоваров(ТипДокумента)
	
	ДокументТЧ=Новый ТаблицаЗначений;
	ДокументТЧ.Колонки.Добавить("НомерСтрокиТЧ");
	ДокументТЧ.Колонки.Добавить("ШтрихКод");
	ДокументТЧ.Колонки.Добавить("АртикулПоставщика");
	ДокументТЧ.Колонки.Добавить("АртикулПокупателя");
	ДокументТЧ.Колонки.Добавить("НоменклатураНаименование");
	ДокументТЧ.Колонки.Добавить("Номенклатура");
	ДокументТЧ.Колонки.Добавить("ЕденицаПоКлассификатору");
	ДокументТЧ.Колонки.Добавить("ЕдиницаИзмерения");
	ДокументТЧ.Колонки.Добавить("Коэффициент");
	ДокументТЧ.Колонки.Добавить("Количество");
	ДокументТЧ.Колонки.Добавить("КоличествоБазовое");
	ДокументТЧ.Колонки.Добавить("Цена");
	ДокументТЧ.Колонки.Добавить("ЦенаСНДС");
	ДокументТЧ.Колонки.Добавить("Сумма");
	ДокументТЧ.Колонки.Добавить("СуммаВсего");
	ДокументТЧ.Колонки.Добавить("PRICE");
	ДокументТЧ.Колонки.Добавить("PRICEWITHVAT");
	ДокументТЧ.Колонки.Добавить("TAXRATE");
	ДокументТЧ.Колонки.Добавить("СтавкаНДС");
	ДокументТЧ.Колонки.Добавить("СуммаНДС");
	ДокументТЧ.Колонки.Добавить("НоменклатураОшибки");
	
	Если ТипДокумента = "ORDRSP" Тогда
		ДокументТЧ.Колонки.Добавить("КоличествоЗаказанное");
		ДокументТЧ.Колонки.Добавить("КоличествоИмеющееся");
		ДокументТЧ.Колонки.Добавить("Действия");
		ДокументТЧ.Колонки.Добавить("Примечание");
	ИначеЕсли ТипДокумента ="DESADV" Тогда
		ДокументТЧ.Колонки.Добавить("НомерСтрокиДокументаПоставщика");
		ДокументТЧ.Колонки.Добавить("КоличествоВЗаказе");
		ДокументТЧ.Колонки.Добавить("КоличествоРасхождение");
		ДокументТЧ.Колонки.Добавить("СтранаПроизводитель");
		ДокументТЧ.Колонки.Добавить("НомерГТД");
	ИначеЕсли ТипДокумента ="ORDER" Тогда
		 ДокументТЧ.Колонки.Добавить("ORDERUNIT");
	КонецЕсли;
	
	Возврат ДокументТЧ;
	
КонецФункции

Процедура ДобавитьОшибкуВСтруктуруДокумента(ТекстОшибки,СтруктураДокумента)
	
	Ошибки = Неопределено;
	СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);
	СтруктураДокумента.Вставить("ДокументКорректен",0);
	
	Если Ошибки = Неопределено Тогда
		СтруктураДокумента.Вставить("ОшибкиДокумента",ТекстОшибки);	
	Иначе
		Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ТекстОшибки;
		СтруктураДокумента.ОшибкиДокумента = Ошибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипДокумента(СтруктураДокумента);
	
	ТипДокумента = "ПоступлениеТоваров";
	
	СтруктураДокумента.Вставить("ТипДокумента", ТипДокумента);
	
	Возврат ТипДокумента;
	 
	//БазаДанных = "АттикаРозница";
	//ТипДокумента = "ПоступлениеТоваров";
	//
	////ДопПараметровЗагрузки.Свойство("DESADV",ТипДокумента);
	////ДопПараметровЗагрузки.Свойство("База",БазаДанных);
	//
	//Если ТипДокумента = Неопределено Тогда
	//	СтруктураДокумента.Вставить("ТипДокумента","ПредварительноеПоступлениеТоваров");
	//	Возврат "ПредварительноеПоступлениеТоваров";
	//ИначеЕсли БазаДанных = "АтикаКиоски" Тогда
	//	СтруктураДокумента.Вставить("ТипДокумента","ПоступлениеТоваров");
	//	Возврат "ПоступлениеТоваров";
	//ИначеЕсли БазаДанных = "АтикаРозница" Тогда
	//	Если СтруктураДокумента.ДокументКорректен = 1 Тогда 
	//		Запрос = Новый  Запрос;
	//		Запрос.Текст = 	"ВЫБРАТЬ
	//		|	СоответствиеОбъектов.Объект
	//		|ИЗ
	//		|	РегистрСведений.СоответствиеОбъектов КАК СоответствиеОбъектов
	//		|ГДЕ
	//		|	СоответствиеОбъектов.Источник = ""ОС_Активные""
	//		|	И СоответствиеОбъектов.ТипОбъекта = ""СкладыКомпании""
	//		|	И СоответствиеОбъектов.Объект.Подразделение.ИнформационнаяБаза = &ИнформационнаяБаза
	//		|	И СоответствиеОбъектов.Объект = &Склад";
	//		Запрос.УстановитьПараметр("ИнформационнаяБаза",ДопПараметровЗагрузки.ТекущаяБаза);
	//		Запрос.УстановитьПараметр("Склад",СтруктураДокумента.СкладКомпании);
	//		
	//		Рез = Запрос.Выполнить();
	//		
	//		Если Рез.Пустой() Тогда
	//			ттипДок = "ПредварительноеПоступлениеТоваров";
	//		Иначе
	//			ттипДок = "ПоступлениеТоваров";
	//		КонецЕсли;
	//		СтруктураДокумента.Вставить("ТипДокумента",ттипДок);
	//		Возврат ттипДок;
	//	Иначе
	//		СтруктураДокумента.Вставить("ТипДокумента","ПредварительноеПоступлениеТоваров");
	//		Возврат "ПредварительноеПоступлениеТоваров";
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	СтруктураДокумента.Вставить("ТипДокумента","ПредварительноеПоступлениеТоваров");
	//	Возврат "ПредварительноеПоступлениеТоваров";
	//КонецЕсли;
	//
	
КонецФункции

Функция ПроверитьПринадлежностьДокументаИБ(СтруктураДокумента)
	//
	//текЗаказ = Неопределено;
	//СтруктураДокумента.Свойство("ЗаказПоставщику",текЗаказ);
	//Если  ЗначениеЗаполнено(текЗаказ) Тогда
	//	Возврат Истина;
	//Иначе
	//	СтруктураДокумента.Вставить("ДокументИБ",Ложь);	
	//	Возврат Ложь;
	//КонецЕсли
	Возврат Истина;
КонецФункции

Функция ОбработатьПоле(Имя,СтруктураДокумента,СтрокаДерева,ТипДокумента)
	ВсеОк = Истина;	
	
	Если Имя ="NUMBER" ИЛИ Имя ="DespatchAdviceNumber" Тогда
		
		xmlНомерДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерДокумента = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерДокумента", СокрЛП(xmlНомерДокумента));
			Если Имя ="DespatchAdviceNumber" Тогда
				 СтруктураДокумента.Вставить("НомерНакладной", СокрЛП(xmlНомерДокумента));
			КонецЕсли;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""NUMBER / Номер документа",СтруктураДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "DATE" ИЛИ Имя ="DespatchAdviceDate" Тогда
		xmlДатаДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатаДокумента = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаДокумента", Дата(Прав(СокрЛП(xmlДатаДокумента),2)+"."+Сред(СокрЛП(xmlДатаДокумента),6,2)+"."+Лев(СокрЛП(xmlДатаДокумента),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DATE / Дата"" "+xmlДатаДокумента,СтруктураДокумента);
			КонецПопытки
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DATE / Дата"" ",СтруктураДокумента);
		КонецЕсли;
	ИначеЕсли Имя ="ORDERDATE" ИЛИ Имя ="OrderDate" Тогда
		
		xmlДатаЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатаЗаказа = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаЗаказа", Дата(Прав(СокрЛП(xmlДатаЗаказа),2)+"."+Сред(СокрЛП(xmlДатаЗаказа),6,2)+"."+Лев(СокрЛП(xmlДатаЗаказа),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""ORDERDATE / Дата заказа"" "+xmlДатаЗаказа,СтруктураДокумента);
			КонецПопытки;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""ORDERDATE / Дата заказа"" ",СтруктураДокумента);
		КонецЕсли;
	ИначеЕсли Имя = "DELIVERYDATE" ИЛИ Имя ="EstimatedDeliveryDate" Тогда  	// Дата поставки(обязательное поле)
		xmlДатапоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатапоставки = Неопределено Тогда
			Попытка
				тДатаПоставки = Дата(Прав(СокрЛП(xmlДатапоставки),2)+"."+Сред(СокрЛП(xmlДатапоставки),6,2)+"."+Лев(СокрЛП(xmlДатапоставки),4)+" 0:00:00");
				СтруктураДокумента.Вставить("ДатаПоставки", тДатаПоставки);
				Если  Имя ="EstimatedDeliveryDate" Тогда
					СтруктураДокумента.Вставить("ДатаНакладной", тДатаПоставки);
				КонецЕсли;
				
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DELIVERYDATE / Дата поставки"" "+xmlДатапоставки,СтруктураДокумента);
				
			КонецПопытки;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYDATE / Дата поставки""",СтруктураДокумента);
		КонецЕсли;
	ИначеЕсли Имя = "DELIVERYNOTEDATE"  Тогда  	// Дата поставки(обязательное поле)
		xmlДатапоставки = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlДатапоставки = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("ДатаНакладной", Дата(Прав(СокрЛП(xmlДатапоставки),2)+"."+Сред(СокрЛП(xmlДатапоставки),6,2)+"."+Лев(СокрЛП(xmlДатапоставки),4)+" 0:00:00"));
			Исключение
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не корректное обязательное поле ""DELIVERYNOTEDATE / Дата накладной"" "+xmlДатапоставки,СтруктураДокумента);
			КонецПопытки;
		Иначе
			ВсеОк = Ложь;
			Если СтруктураДокумента.Свойство("ДатаПоставки") Тогда
				СтруктураДокумента.Вставить("ДатаНакладной",СтруктураДокумента.Датапоставки);
			Иначе
				ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYNOTEDATE / Дата накладной""",СтруктураДокумента);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли  Имя = "TIME"  Тогда
		
		xmlВремяСозданияДокумента = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlВремяСозданияДокумента = Неопределено Тогда
			СтруктураДокумента.Вставить("ВремяСозданияДокумента", СокрЛП(xmlВремяСозданияДокумента));
		КонецЕсли;
		
	ИначеЕсли Имя = "ORDERNUMBER" ИЛИ Имя = "BuyerOrderNumber" Тогда
		xmlНомерЗаказа = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерЗаказа = Неопределено Тогда
			
			Если Найти(xmlНомерЗаказа,":")>0 Тогда
				тxmlНомерЗаказа = СокрЛП(Лев(xmlНомерЗаказа,12));
			Иначе
				тxmlНомерЗаказа = СокрЛП(xmlНомерЗаказа);
			КонецЕсли;
			
			
			СтруктураДокумента.Вставить("НомерЗаказа", тxmlНомерЗаказа);
			
			ДатаЗаказа = Неопределено;
			СтруктураДокумента.Свойство("ДатаЗаказа",ДатаЗаказа);
			
			Если НЕ ДатаЗаказа = Неопределено Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЗаказПоставщику.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
				|ГДЕ
				|	ЗаказПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|	И ЗаказПоставщику.Номер = &Номер";
				
				Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаЗаказа));
				Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаЗаказа - 86400*3));
				Запрос.УстановитьПараметр("Номер", тxmlНомерЗаказа);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найден заказ поставщику по номеру: "+СокрЛП(xmlНомерЗаказа)+Символы.ПС+"Дата заказа: "+ДатаЗаказа,СтруктураДокумента);
				Иначе
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					ВыборкаДетальныеЗаписи.Следующий();	
					СтруктураДокумента.Вставить("ЗаказПоставщику", ВыборкаДетальныеЗаписи.Ссылка);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""ORDERNUMBER / Номер заказа""",СтруктураДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "DELIVERYNOTENUMBER" Тогда  // Номер накладной(обязательное поле)
		
		xmlНомерНакладной = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlНомерНакладной = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерНакладной", СокрЛП(xmlНомерНакладной));
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""DELIVERYNOTENUMBER / Номер накладной""",СтруктураДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя = "CURRENCY"  Тогда //Валюта  (опциональное поле)
		
		xmlВалюта = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlВалюта = Неопределено Тогда
			тВалюта = ПолучитьВалюты(xmlВалюта);
			Если тВалюта = Неопределено Тогда
				тВалюта = ПолучитьВалюты("UAH");
			КонецЕсли;
			
			СтруктураДокумента.Вставить("Валюта", тВалюта);
		КонецЕсли;
		
	ИначеЕсли Имя = "VAT" Тогда		// Ставка НДС(%)(опциональное поле)
		
		xmlСтавкаНДС = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		Если НЕ xmlСтавкаНДС = Неопределено Тогда
			Попытка
				СтруктураДокумента.Вставить("СтавкаНДС", Число(xmlСтавкаНДС));
			Исключение
				СтруктураДокумента.Вставить("СтавкаНДС", 20);
			КонецПопытки;       
		КонецЕсли;
	ИначеЕсли Имя = "BUYER" ИЛИ  Имя ="Buyer" Тогда 	// Поставщик(организация)(обязательное поле)

		Если Имя ="Buyer" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlОрганизацияGLN = Неопределено;
			Иначе
				
			xmlОрганизацияGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		 	
		Иначе
			xmlОрганизацияGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		КонецЕсли;
		
		текОрганизация = Неопределено;
		
		Если НЕ xmlОрганизацияGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("BUYER", xmlОрганизацияGLN);
			Если ТипДокумента = "ORDER" Тогда
				текКонтрагент =	КонтрагентПоGLN(xmlОрганизацияGLN,СтруктураДокумента.Провайдер);
				Если текКонтрагент <> Неопределено Тогда
					СтруктураДокумента.Вставить("Контрагент", текКонтрагент.Контрагент);
					СтруктураДокумента.Вставить("АдресОтгрузки", текКонтрагент.АдресОтгрузки);

				Иначе
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найдена покупатель с GLN " + xmlОрганизацияGLN,СтруктураДокумента);
				КонецЕсли;
				
			Иначе
				текОрганизация = ПолучитьОрганизациюПоGLN(xmlОрганизацияGLN);
				Если текОрганизация  <> Неопределено   Тогда
					СтруктураДокумента.Вставить("Организация", текОрганизация);
				Иначе
					Если ТипДокумента = "ТипДокумента" Тогда
						Если ЗначениеЗаполнено(СтруктураДокумента.ЗаказПоставщику) Тогда
							СтруктураДокумента.Вставить("Организация", СтруктураДокумента.ЗаказПоставщику.ДоговорВзаиморасчетов.Организация);
						Иначе
							ВсеОк = Ложь;
							ДобавитьОшибкуВСтруктуруДокумента("Не найдена организация с GLN " + xmlОрганизацияGLN,СтруктураДокумента);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""BUYER / Покупатель""",СтруктураДокумента);
		КонецЕсли;

	ИначеЕсли Имя ="SUPPLIER" ИЛИ Имя = "Seller" Тогда   // Покупатель(контрагент)(обязательное поле)
		
		Если Имя ="Seller" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlПоставщикGLN = Неопределено;
			Иначе
				xmlПоставщикGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlПоставщикGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		КонецЕсли;
		
		Если НЕ xmlПоставщикGLN = Неопределено Тогда
			Если ТипДокумента = "ORDER" Тогда
				текОрганизация = ПолучитьОрганизациюПоGLN(xmlПоставщикGLN);
				Если текОрганизация  <> Неопределено   Тогда
					СтруктураДокумента.Вставить("Организация", текОрганизация);
				Иначе
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найдена организация с GLN " + xmlПоставщикGLN,СтруктураДокумента);
				КонецЕсли;
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПараметрыЭлектронногоОбмена.Контрагент КАК Контрагент
				|ИЗ
				|	РегистрСведений.ТК_ПараметрыОбменаEDI КАК ПараметрыЭлектронногоОбмена
				|ГДЕ
				|	ПараметрыЭлектронногоОбмена.GLN = &КонтрагентGLN
				|	И ПараметрыЭлектронногоОбмена.УчетнаяЗаписьEDI.ПоставщикEDI = &ПоставщикEDI";
				
				Запрос.УстановитьПараметр("КонтрагентGLN", xmlПоставщикGLN);
				Запрос.УстановитьПараметр("ПоставщикEDI", СтруктураДокумента.Провайдер);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Выборка.Следующий();
				КонтрагентСсылка = Выборка.Контрагент;
				Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найден поставщик с GLN " + xmlПоставщикGLN,СтруктураДокумента);
				Иначе		
					СтруктураДокумента.Вставить("Контрагент", КонтрагентСсылка);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""SUPPLIER / Контрагент""",СтруктураДокумента);
		КонецЕсли;
		
	ИначеЕсли Имя ="DELIVERYPLACE" ИЛИ Имя = "DeliveryPoint" Тогда   // Место доставки
		
		Если Имя ="DeliveryPoint" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlТорговаяПлощадкаGLN = Неопределено;
			Иначе
				xmlТорговаяПлощадкаGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlТорговаяПлощадкаGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		КонецЕсли;
		
		ТекЗаказ = Неопределено;
		Если ТипДокумента <> "ORDER" И СтруктураДокумента.Свойство("ЗаказПоставщику", ТекЗаказ)
			И ТекЗаказ.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПоставщикуКонсолидированный") Тогда 
			
			СтруктураДокумента.Вставить("ТорговаяПлощадка", ТекЗаказ.ТорговаяПлощадка);
			Если ТекЗаказ.СкладыКомпании.Количество() > 0 Тогда
				СтруктураДокумента.Вставить("СкладКомпании", ТекЗаказ.СкладыКомпании[0].СкладКомпании);
			Иначе
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не удалось получить склад из заказа: " + ТекЗаказ, СтруктураДокумента);
			КонецЕсли;
			
		ИначеЕсли xmlТорговаяПлощадкаGLN <> Неопределено Тогда 
			
			ТорговаяПлощадка = ТорговаяПлощадкаПоGLN(xmlТорговаяПлощадкаGLN);
			Если ТорговаяПлощадка <> Неопределено Тогда 			
				СтруктураДокумента.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);				
				
				СкладКомпании = СкладКомпанииПоТорговойПлощадке(ТорговаяПлощадка);
				Если СкладКомпании <> Неопределено Тогда 								
					СтруктураДокумента.Вставить("СкладКомпании", СкладКомпании);
				Иначе
					ВсеОк = Ложь;
					ДобавитьОшибкуВСтруктуруДокумента("Не найден Склад компании по Торговой площадке " + ТорговаяПлощадка, СтруктураДокумента);
				КонецЕсли;
			Иначе
				ВсеОк = Ложь;
				ДобавитьОшибкуВСтруктуруДокумента("Не найдена Торговая площадка с GLN " + xmlТорговаяПлощадкаGLN, СтруктураДокумента);
			КонецЕсли;
			
		Иначе
			
			ВсеОк = Ложь;
			ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Торговая площадка", СтруктураДокумента);	
			
		КонецЕсли;
		
		
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		//Если Имя ="DeliveryPoint" Тогда
		//	тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
		//	Если тУзел = Неопределено Тогда
		//		xmlАдресДоставкиGLN = Неопределено;
		//	Иначе
		//		xmlАдресДоставкиGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
		//	КонецЕсли;
		//Иначе
		//	xmlАдресДоставкиGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Ложь);
		//КонецЕсли;
		//
		//Если ТипДокумента = "ORDER" Тогда
		//	текПокупатель = Неопределено; 
		//	СтруктураДокумента.Свойство("Контрагент",текПокупатель);
		//
		//	Если xmlАдресДоставкиGLN <> Неопределено Тогда
		//		
		//		Если текПокупатель <> Неопределено Тогда
		//			текАдресДоставки = АдресДоставкиПоGLN(xmlАдресДоставкиGLN,текПокупатель);
		//			Если текАдресДоставки <> Неопределено Тогда 
		//				СтруктураДокумента.Вставить("АдресДоставки", текАдресДоставки);
		//			Иначе
		//				ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для контрагента: " + Строка(текПокупатель),СтруктураДокумента);
		//			КонецЕсли;
		//		Иначе
		//			ВсеОк = Ложь;
		//		КонецЕсли;
		//		
		//	Иначе
		//		ВсеОк = Ложь;
		//		ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки""",СтруктураДокумента);
		//	КонецЕсли;
		//	
		//Иначе
		//	
		//	текЗаказ = Неопределено;
		//	СтруктураДокумента.Свойство("ЗаказПоставщику",текЗаказ);
		//	
		//	Если  xmlАдресДоставкиGLN = Неопределено  Тогда
		//		
		//		Если текЗаказ <> Неопределено  Тогда
		//			АдресДоставкиСсылка = текЗаказ.СкладКомпании.ТочкаДоставки;
		//			Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//				СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//				СтруктураДокумента.Вставить("СкладКомпании", текЗаказ.СкладКомпании);
		//			Иначе
		//				ВсеОк = Ложь;
		//				ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки, не определен адрес доставки по заказу: " + Строка(текЗаказ),СтруктураДокумента);
		//			КонецЕсли;
		//		Иначе
		//			ВсеОк = Ложь;
		//			ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки""",СтруктураДокумента);
		//		КонецЕсли;
		//	Иначе
		//		Если текЗаказ <> Неопределено  Тогда
		//			Если текЗаказ.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПоставщикуКонсолидированный") Тогда
		//				текОрганизация = Неопределено;
		//				СтруктураДокумента.Свойство("Организация",текОрганизация);
		//				
		//				Если текОрганизация <> Неопределено Тогда
		//					КонтрагентОрганизации   = текОрганизация.Контрагент;
		//					
		//					АдресДоставкиСсылка = ПолучитьАдресДоставки(КонтрагентОрганизации, xmlАдресДоставкиGLN);
		//					
		//					Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//						СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//						СкладДоставки = ПолучитьСкладДоставки(АдресДоставкиСсылка,текОрганизация);
		//						СтруктураДокумента.Вставить("СкладКомпании",СкладДоставки);
		//					Иначе
		//						ВсеОк = Ложь;
		//						ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для организации: " + Строка(текОрганизация),СтруктураДокумента);
		//					КонецЕсли;
		//				КонецЕсли;
		//			Иначе
		//				АдресДоставкиСсылка = текЗаказ.СкладКомпании.ТочкаДоставки;
		//				Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//					СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//					СтруктураДокумента.Вставить("СкладКомпании", текЗаказ.СкладКомпании);
		//				Иначе
		//					ВсеОк = Ложь;
		//					ДобавитьОшибкуВСтруктуруДокумента("Не указано поле ""DELIVERYPLACE / Адрес доставки, не определен адрес доставки по заказу: " + Строка(текЗаказ),СтруктураДокумента);
		//				КонецЕсли;
		//				
		//			КонецЕсли;
		//		Иначе
		//			текОрганизация = Неопределено;
		//			СтруктураДокумента.Свойство("Организация",текОрганизация);
		//			
		//			Если текОрганизация <> Неопределено Тогда
		//				КонтрагентОрганизации   = текОрганизация.Контрагент;
		//				
		//				АдресДоставкиСсылка = ПолучитьАдресДоставки(КонтрагентОрганизации, xmlАдресДоставкиGLN);
		//				
		//				Если НЕ АдресДоставкиСсылка.Пустая() Тогда
		//					СтруктураДокумента.Вставить("АдресДоставки", АдресДоставкиСсылка);
		//				Иначе
		//					ВсеОк = Ложь;
		//					ДобавитьОшибкуВСтруктуруДокумента("Не найден адрес доставки с GLN " + xmlАдресДоставкиGLN + " для организации: " + Строка(текОрганизация),СтруктураДокумента);
		//				КонецЕсли;
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//КонецЕсли;		
		
	ИначеЕсли Имя = "SENDER" Тогда //отправителя (обязательное поле)
		
		xmlОтправительGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlОтправительGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("Отправитель", xmlОтправительGLN);
		КонецЕсли;
		
	ИначеЕсли Имя = "RECIPIENT" ИЛИ Имя = "UltimateConsignee" Тогда   //Получатель(обязательное поле)
		
		Если Имя ="UltimateConsignee" Тогда
			тУзел = ПолучитьУзелДерева(СтрокаДерева,"Строка",Имя);
			Если тУзел = Неопределено Тогда
				xmlПолучательGLN = Неопределено;
			Иначе
				xmlПолучательGLN = ПолучитьЗначениеВСтрокеДерева(тУзел.Строки, "ILN", Истина);
			КонецЕсли;
		Иначе
			xmlПолучательGLN = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева,Имя, Истина);
		КонецЕсли;
		
		Если НЕ xmlПолучательGLN = Неопределено Тогда
			СтруктураДокумента.Вставить("Получатель", xmlПолучательGLN);
		КонецЕсли;
		
	ИначеЕсли  Имя = "EDIINTERCHANGEID" Тогда	// Номер транзакции
		
		xmlEDIINTERCHANGEID = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlEDIINTERCHANGEID = Неопределено Тогда
			СтруктураДокумента.Вставить("НомерТранзакции", xmlEDIINTERCHANGEID);
		КонецЕсли;
	ИначеЕсли  Имя = "ACTION" Тогда	
		
		xmlACTION = ПолучитьЗначениеВСтрокеДерева(СтрокаДерева, Имя, Истина);
		Если НЕ xmlEDIINTERCHANGEID = Неопределено Тогда
			СтруктураДокумента.Вставить("Действия", xmlEDIINTERCHANGEID);
		КонецЕсли;
		
	
		
	КонецЕсли;
	
	Возврат ВсеОк;
	
КонецФункции

Функция ПолучитьСкладДоставки(АдресДоставки, Организация)
    
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладыКомпании.Ссылка
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	СкладыКомпании.ТочкаДоставки = &ТочкаДоставки
	|	И СкладыКомпании.Организация = &Организация";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТочкаДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.Ссылка;
    
КонецФункции

Функция ПолучитьАдресДоставки(Владелец, GLNDELIVERYPLACE)
    
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка КАК АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.GLN = &GLNDELIVERYPLACE
	|	И ТочкиДоставки.Действует
	|	И ТочкиДоставки.Владелец = &Владелец";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("GLNDELIVERYPLACE", GLNDELIVERYPLACE);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		Возврат Выборка.АдресДоставки;
		
	ИначеЕсли Выборка.Количество() = 0 Тогда
		
		Возврат Справочники.ТочкиДоставки.ПустаяСсылка();
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Найдено несколько адресов доставки с одинаковым GLN!'; uk = 'Знайдено декілька адрес доставки з однаковими GLN!'"));
		Возврат Справочники.ТочкиДоставки.ПустаяСсылка();
		
	КонецЕсли;
    
КонецФункции

Функция КонтрагентПоGLN(xmlПоставщикGLN,Провайдер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыЭлектронногоОбмена.Контрагент,
	|	ПараметрыЭлектронногоОбмена.ТочкаДоставки Как АдресОтгрузки
	|ИЗ
	|	РегистрСведений.ПараметрыЭлектронногоОбмена КАК ПараметрыЭлектронногоОбмена
	|ГДЕ
	|	ПараметрыЭлектронногоОбмена.GLN = &КонтрагентGLN
	|	И ПараметрыЭлектронногоОбмена.УчетнаяЗаписьЭлектронногоОбмена.ПоставщикEDI = &ПоставщикEDI";
	
	Запрос.УстановитьПараметр("КонтрагентGLN", xmlПоставщикGLN);
	Запрос.УстановитьПараметр("ПоставщикEDI", Провайдер);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	СтруктураВозврат = Новый Структура("Контрагент, АдресОтгрузки", Выборка.Контрагент,Выборка.АдресОтгрузки);
	
	Возврат СтруктураВозврат;
	
КонецФункции

Функция АдресДоставкиПоGLN(xmlАдресДоставкиGLN,Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТочкиДоставки.Ссылка Как АдресДоставки
	|ИЗ
	|	Справочник.ТочкиДоставки КАК ТочкиДоставки
	|ГДЕ
	|	ТочкиДоставки.Владелец = &Контрагент
	|	И ТочкиДоставки.GLN = &GLN";
	
	Запрос.УстановитьПараметр("GLN", xmlАдресДоставкиGLN);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресДоставки;
	
КонецФункции

Функция ТорговаяПлощадкаПоGLN(xmlТорговаяПлощадкаGLN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ТорговыеПлощадки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
	               |ГДЕ
	               |	ТорговыеПлощадки.GLN = &GLN";
	
	Запрос.УстановитьПараметр("GLN", xmlТорговаяПлощадкаGLN);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда 
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьУзелДерева(СтрокаДерева, ТипУзла, ИмяПоля)
    
    Если ТипУзла = "Строка" Тогда
        xmlУзел = СтрокаДерева.Найти(ИмяПоля, "Элемент", Ложь);
    ИначеЕсли ТипУзла = "Массив" Тогда
        xmlУзел = СтрокаДерева.НайтиСтроки(Новый Структура("Элемент", ИмяПоля), Ложь);
    Иначе
        xmlУзел = Неопределено;
    КонецЕсли;
    
    Возврат xmlУзел;
    
КонецФункции


//DESADV
Функция СоздатьЗаписьУведомленияОбОтгрузке(ТекИмяФайла, СтруктураДокумента,ПараметрыПодключения) 
	
	
	//Пропустим загруженные документы
	Если ЗначениеЗаполнено(СтруктураДокумента.ПредварительныйДокумент) Тогда
		Возврат 1 
	КонецЕсли;
	
	ТипДок = СтруктураДокумента.ТипДокумента;	
	
	
	ДокППТ = Документы[ТипДок].СоздатьДокумент();	
	
	ДокППТ = Документы.ПоступлениеТоваров.СоздатьДокумент();
	
	ДокППТ.Дата = ТекущаяДата();
	ДокППТ.Автор = Пользователи.ТекущийПользователь();
	ДокППТ.ВалютаДокумента = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	//ДокППТ.КурсВалютыУпр = 1;
	ДокППТ.КурсДокумента = 1;
	ДокППТ.РегламентированныйУчет = Истина;
	Если ТипДок = "ПоступлениеТоваров" Тогда
		ДокППТ.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваров");
	Иначе
		ДокППТ.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.НакладнаяПоставщика");
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("СкладКомпании") Тогда 
		ДокППТ.СкладКомпании = СтруктураДокумента.СкладКомпании;			
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("ТорговаяПлощадка") Тогда 
		ДокППТ.ТорговаяПлощадка = СтруктураДокумента.ТорговаяПлощадка;
	КонецЕсли;
	
	ДокППТ.Организация = Справочники.СкладыКомпании.ОрганизацияСклада(ДокППТ.СкладКомпании);			
	ДокППТ.ПодразделениеКомпании = ДокППТ.СкладКомпании.Подразделение;
	ДокППТ.Контрагент = СтруктураДокумента.Контрагент;
	//ДокППТ.ОбработкаРеквизита("Контрагент",,);
	ДокППТ.ДоговорВзаиморасчетов = СтруктураДокумента.ЗаказПоставщику.ДоговорВзаиморасчетов;
	
	Если НЕ ЗначениеЗаполнено(ДокППТ.ДоговорВзаиморасчетов) Тогда
		ПараметрыОтбора = Новый Структура("Контрагент,Организация,Подразделение,Дата,Валюта", ДокППТ.Контрагент,ДокППТ.Организация,ДокППТ.ПодразделениеКомпании,ДокППТ.Дата,ДокППТ.ВалютаДокумента); // by 4ok  21.01.2010 12:29:11
		
		сзПараметры = Новый СписокЗначений;
		сзПараметры.ЗагрузитьЗначения(Справочники.ДоговорыКонтрагентов.ПолучитьДоступныеДоговоры(ПараметрыОтбора).ВыгрузитьКолонку("Ссылка"));
		
		Попытка
			ДокППТ.ДоговорВзаиморасчетов = сзПараметры[0].Значение;
			Если ДокППТ.ДоговорВзаиморасчетов.Пустая() тогда
				ПараметрыОтбора = Новый Структура("Контрагент,Организация,Подразделение,Дата,Валюта", ДокППТ.Контрагент,Справочники.Организации.НайтиПоКоду("D61"),Справочники.ПодразделенияКомпании.НайтиПоКоду("GL000001"),ДокППТ.Дата,ДокППТ.ВалютаДокумента); // by 4ok  21.01.2010 12:29:11
				
				сзПараметры = Новый СписокЗначений;
				сзПараметры.ЗагрузитьЗначения(Справочники.ДоговорыКонтрагентов.ПолучитьДоступныеДоговоры(ПараметрыОтбора));			
				ДокППТ.ДоговорВзаиморасчетов = сзПараметры[0].Значение;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ДокППТ.ТипЦен = ДокППТ.СкладКомпании.ТипЦенСебестоимости;
	//Если НЕ ЗначениеЗаполнено(ДокППТ.ТипЦен) тогда
	//	ДокППТ.ТипЦен = ДокППТ.ПодразделениеКомпании.ТипЦенЗакупки;
	//КонецЕсли;
	ДокППТ.УстановитьНовыйНомер();
	ДокППТ.ВхДокДата = СтруктураДокумента.ДатаНакладной; 
	ДокППТ.ВхДокНомер = СтруктураДокумента.НомерНакладной;
	
	Если  ТипДок ="ПредварительноеПоступлениеТоваров" Тогда
		ДокППТ.ДатаВходящегоДокумента = СтруктураДокумента.ДатаНакладной;
		ДокППТ.НомерВходящегоДокумента = СтруктураДокумента.НомерДокумента;
		ДокППТ.ДанныеОбмена = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ТекИмяФайла),Новый СжатиеДанных(9));
		СтрокаЗаказ = ДокППТ.Заказы.Добавить();
	Иначе
		ДокППТ.ЗакрытиеЗаказовПоставщикам = 2;
		СтрокаЗаказ = ДокППТ.РаспределениеПоставки.Добавить();
	КонецЕсли;
	
	СтрокаЗаказ .ЗаказПоставщику = СтруктураДокумента.ЗаказПоставщику;
	ДокППТ.ДокументОснование = СтруктураДокумента.ЗаказПоставщику;
	ДокППТ.Комментарий = "Загружен из EDI";
	ТоварыДокумента = ДокППТ.Товары;
	
	Для Каждого СтрТабТовары Из  СтруктураДокумента.ДокументТЧ Цикл 
		НоваяСтрока = ТоварыДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТабТовары);
		
	КонецЦикла;
	
	Если ТипДок = "ПоступлениеТоваров" Тогда
		Если ДокППТ.СкладКомпании.Розничный Тогда
			ОбработатьРозничныеЦены(ДокППТ,ТоварыДокумента);
		КонецЕсли;
		МассивДляУдаления = Новый Массив;
		Для Каждого сТД Из ТоварыДокумента Цикл 
			Если стД.КоличествоБазовое = 0 Тогда
				МассивДляУдаления.Добавить(сТД);
			КонецЕсли;
			//ДокППТ.ОбработкаРеквизита("Товары.Сумма",сТД);
		КонецЦикла;
		
		Если МассивДляУдаления.Количество()>0 Тогда
			Для Каждого Уд Из МассивДляУдаления Цикл 
				ТоварыДокумента.Удалить(Уд);
			КонецЦикла;
			
		КонецЕсли;			
	КонецЕсли;
		
	Попытка
		ДокППТ.Записать(РежимЗаписиДокумента.Запись);
	Исключение 
		ЗаписьЖурналаРегистрации("ОбменСEDI.ЗаписьПредварительноеПоступлениеТоваров",УровеньЖурналаРегистрации.Ошибка,ДокППТ,,ОписаниеОшибки());
	КонецПопытки;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл %1 загружен!'; uk = 'Файл %1 завантажений!'"),
			СтрЗаменить(ТекИмяФайла, КаталогВременныхФайлов(), "")));
		
	Возврат 1;
КонецФункции

//ORDER
Функция СоздатьЗаписьВходящееЗаказПокупателя(ТекИмяФайла, СтруктураДокумента,ПараметрыПодключения) 
	
	
	//Пропустим загруженные документы
	Если ЗначениеЗаполнено(СтруктураДокумента.ВходящийДокумент) Тогда
		Возврат 1 
	КонецЕсли;
	
	//
	Док = Документы.ЗаказПокупателя.СоздатьДокумент();	
	Док.РегламентированныйУчет = Истина;
	Док.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	Док.Дата = ТекущаяДата();
	Док.ДатаСоздания = НачалоДня(СтруктураДокумента.ДатаДокумента);
	Док.ИДДокументаОтгрузки = СтруктураДокумента.НомерДокумента;
	//Док.УчетныйДокумент =   СтруктураДокумента.ЗаказПоставщику;
	Если СтруктураДокумента.Свойство("Валюта") Тогда
		Док.ВалютаДокумента = СтруктураДокумента.Валюта;
	Иначе
		Док.ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	КонецЕсли;
	Док.КурсВалютыУпр = 1;
	Док.КурсДокумента = 1;
	Если СтруктураДокумента.Свойство("Организация") Тогда
		Док.Организация = СтруктураДокумента.Организация;
	Иначе
		Док.Организация = СтруктураДокумента.Организация.Организация;
	КонецЕсли;
	Док.ПодразделениеКомпании = СтруктураДокумента.Подразделение;
	Док.ТипЦен = Док.ПодразделениеКомпании.ТипЦенРеализации;
	Док.СкладКомпании = СтруктураДокумента.СкладКомпании;
	Док.Контрагент = СтруктураДокумента.Контрагент;
	Док.ОбработкаРеквизита("Контрагент");	
	Док.ТочкаДоставки = СтруктураДокумента.АдресДоставки;
	Если СтруктураДокумента.Свойство("ДатаПоставки") Тогда
		Док.СрокПоставки = СтруктураДокумента.ДатаПоставки;
	КонецЕсли;
	
	//Если СтруктураДокумента.Свойство("Действия") Тогда
	//	 Док.Действия = СтруктураДокумента.Действия;
	// Иначе
	//	 Док.Действия = 0 ;
	// КонецЕсли;
	 
	 Док.ДанныеОбмена = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ТекИмяФайла),Новый СжатиеДанных(9));
	 ТоварыДокумента = Док.Товары;
	 тОшибкиТоваров = "";
	Для Каждого СтрТабТовары Из  СтруктураДокумента.ДокументТЧ Цикл 
		НоваяСтрока = ТоварыДокумента.Добавить();
		НоваяСтрока.Номенклатура = СтрТабТовары.Номенклатура;
		Док.ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
		НоваяСтрока.ЕдиницаИзмерения = СтрТабТовары.ЕдиницаИзмерения;
		Док.ОбработкаРеквизита("Товары.ЕдиницаИзмерения",НоваяСтрока);
		НоваяСтрока.КоличествоБазовое = СтрТабТовары.Количество;
		Док.ОбработкаРеквизита("Товары.КоличествоБазовое",НоваяСтрока);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			тОшибкиТоваров = тОшибкиТоваров + "Товар не найден: " + СтрТабТовары.НоменклатураНаименование+" артикул покупателя "+СтрТабТовары.АртикулПокупателя+" артикул поставщика "+СтрТабТовары.АртикулПоставщика+" штрих код "+СтрТабТовары.ШтрихКод+Символы.ПС;
		КонецЕсли;
		
		
	КонецЦикла;
	Док.Комментарий = тОшибкиТоваров;
	
	
	Если ПустаяСтрока(тОшибкиТоваров) Тогда
		РежимЗап = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗап = РежимЗаписиДокумента.Запись;

	КонецЕсли;
	
	Попытка
		Док.Записать(РежимЗап);
	Исключение 
		ЗаписьЖурналаРегистрации("ОбменСEDI.ЗаписьЗаказПокупателя",УровеньЖурналаРегистрации.Ошибка,Док,,ОписаниеОшибки());
		Возврат 0;
	КонецПопытки;
	//
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл %1 загружен'; uk = 'Файл %1 завантажений'"),
			СтрЗаменить(ТекИмяФайла, ПараметрыПодключения.КаталогВременныхФайлов, "")));
		
	Возврат 1;
КонецФункции
 

Функция ПолучитьСтруктуруДокумента_ORDRSP(Дерево,Параметры)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен",1);
	СтруктураДокумента.Вставить("Провайдер",Параметры.Провайдер);
	СтруктураДокумента.Вставить("ДокументИБ",Истина);	

	
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "ORDRSP");
	
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ОшибкиДокумента = "Файл не является ORDRSP-файлом!";
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);		
		
		Возврат СтруктураДокумента;
		
	КонецЕсли;
	
	Рез =  ОбработатьПоле("DATE",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("NUMBER",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("ORDERDATE",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("ORDERNUMBER",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("CURRENCY",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("VAT",СтруктураДокумента,СтрокаДерева,"ORDRSP");


	
	
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""HEAD""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;

	
	Рез =  ОбработатьПоле("BUYER",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("SUPPLIER",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("DELIVERYPLACE",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("SENDER",СтруктураДокумента,СтрокаДерева,"ORDRSP");
	Рез =  ОбработатьПоле("RECIPIENT",СтруктураДокумента,СтрокаДерева,"ORDRSP");	
	Рез =  ОбработатьПоле("EDIINTERCHANGEID",СтруктураДокумента,СтрокаДерева,"ORDRSP");	
	Рез =  ОбработатьПоле("ACTION",СтруктураДокумента,СтрокаДерева,"ORDRSP");		
	
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION");
	Если ТабличнаяЧасть = Неопределено Тогда
		Ошибки = Неопределено;
		СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		
		Если Ошибки = Неопределено Тогда
			СтруктураДокумента.Вставить("ОшибкиДокумента","Нет табличной части поле ""POSITION""");	
		Иначе
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + "Нет табличной части поле ""POSITION""";
			СтруктураДокумента.ОшибкиДокумента = Ошибки;
		КонецЕсли;
		
		Возврат СтруктураДокумента;
		
	КонецЕсли;
	
	
	
	Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВходящееПодтверждениеЗаказа.Ссылка КАК ВходящийДокумент
		|ИЗ
		|	Документ.ВходящееПодтверждениеЗаказа КАК ВходящееПодтверждениеЗаказа
		|ГДЕ
		|	ВходящееПодтверждениеЗаказа.ПометкаУдаления = ЛОЖЬ
		|	И ВходящееПодтверждениеЗаказа.ДатаВходящегоДокумента МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВходящееПодтверждениеЗаказа.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ВходящееПодтверждениеЗаказа.Контрагент = &Контрагент
		|	И ВходящееПодтверждениеЗаказа.УчетныйДокумент = &Заказ";
		
		Запрос.УстановитьПараметр("НомерВходящегоДокумента", СтруктураДокумента.НомерДокумента);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(СтруктураДокумента.ДатаДокумента));
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(СтруктураДокумента.ДатаДокумента));
		Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);
		Запрос.УстановитьПараметр("Заказ", СтруктураДокумента.ЗаказПоставщику);

		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ВходящееПодтверждениеЗаказа.ПустаяСсылка());
		Иначе
			Выборка =РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("ВходящийДокумент", Выборка.ВходящийДокумент);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ВходящееПодтверждениеЗаказа.ПустаяСсылка());
	КонецЕсли;
	
	
	
	ДокументТЧ = ПолучитьТаблицуТоваров("ORDRSP");	
	
	СписокШтрихКодов = Новый СписокЗначений;
	
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
		СтрокаДерева = Узел.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		Рез =  ОбработатьПолеТабличнойЧасти("POSITIONNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCT",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDBUYER",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDSUPPLIER",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDRSPUNIT",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("DESCRIPTION",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTTYPE",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("ACCEPTEDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		Рез =  ОбработатьПолеТабличнойЧасти("INFO",НоваяСтрокаТЧ,СтрокаДерева,"ORDRSP");
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
			СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
		КонецЕсли;
		
	КонецЦикла;

	Если СтруктураДокумента.ДокументКорректен = 1 Тогда
	   ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов);
	   СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	КонецЕсли;	
			
	Возврат СтруктураДокумента;	
КонецФункции

Функция ПолучитьСтруктуруДокумента_ORDER(Дерево,Параметры)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ДокументКорректен",1);
	СтруктураДокумента.Вставить("Провайдер",Параметры.Провайдер);
	СтруктураДокумента.Вставить("ДокументИБ",Истина);	

	
	Узел = ПолучитьУзелДерева(Дерево.Строки, "Строка", "ORDER");
	
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ОшибкиДокумента = "Файл не является ORDER-файлом!";
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		СтруктураДокумента.Вставить("ОшибкиДокумента",ОшибкиДокумента);		
		
		Возврат СтруктураДокумента;
		
	КонецЕсли;
	
	Рез =  ОбработатьПоле("DATE",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("NUMBER",СтруктураДокумента,СтрокаДерева,"ORDER");
//	Рез =  ОбработатьПоле("ORDERDATE",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("DELIVERYDATE",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("CURRENCY",СтруктураДокумента,СтрокаДерева,"ORDER");
//	Рез =  ОбработатьПоле("VAT",СтруктураДокумента,СтрокаДерева,"ORDER");


	
	
	Узел = ПолучитьУзелДерева(СтрокаДерева, "Строка", "HEAD");
	Если НЕ Узел = Неопределено Тогда
		СтрокаДерева = Узел.Строки;
	Иначе
		ДобавитьОшибкуВСтруктуруДокумента("Не указано обязательное поле ""HEAD""",СтруктураДокумента);
		Возврат СтруктураДокумента;
	КонецЕсли;

	
	Рез =  ОбработатьПоле("BUYER",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("SUPPLIER",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("DELIVERYPLACE",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("SENDER",СтруктураДокумента,СтрокаДерева,"ORDER");
	Рез =  ОбработатьПоле("RECIPIENT",СтруктураДокумента,СтрокаДерева,"ORDER");	
	Рез =  ОбработатьПоле("EDIINTERCHANGEID",СтруктураДокумента,СтрокаДерева,"ORDER");	
//	Рез =  ОбработатьПоле("ACTION",СтруктураДокумента,СтрокаДерева,"ORDER");		
	
	// Табличная часть
	ТабличнаяЧасть = ПолучитьУзелДерева(СтрокаДерева, "Массив", "POSITION");
	Если ТабличнаяЧасть = Неопределено Тогда
		Ошибки = Неопределено;
		СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		
		Если Ошибки = Неопределено Тогда
			СтруктураДокумента.Вставить("ОшибкиДокумента","Нет табличной части поле ""POSITION""");	
		Иначе
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + "Нет табличной части поле ""POSITION""";
			СтруктураДокумента.ОшибкиДокумента = Ошибки;
		КонецЕсли;
		
		Возврат СтруктураДокумента;
		
	КонецЕсли;
	
	
	
	Если СтруктураДокумента.ДокументКорректен <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК ВходящийДокумент
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЗаказПокупателя.ИДДокументаОтгрузки = &ИДДокументаОтгрузки
		|	И ЗаказПокупателя.ДатаСоздания = &ДатаСоздания";
		
		Запрос.УстановитьПараметр("ИДДокументаОтгрузки", СтруктураДокумента.НомерДокумента);
		Запрос.УстановитьПараметр("ДатаСоздания", НачалоДня(СтруктураДокумента.ДатаДокумента));
		Запрос.УстановитьПараметр("Контрагент", СтруктураДокумента.Контрагент);

		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ЗаказПокупателя.ПустаяСсылка());
		Иначе
			Выборка =РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("ВходящийДокумент", Выборка.ВходящийДокумент);
		КонецЕсли;
	Иначе
		СтруктураДокумента.Вставить("ВходящийДокумент", Документы.ЗаказПокупателя.ПустаяСсылка());
	КонецЕсли;

	
	Если СтруктураДокумента.Свойство("АдресОтгрузки") и ЗначениеЗаполнено(СтруктураДокумента.АдресОтгрузки)Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 			
			 "ВЫБРАТЬ
			 |	СкладыКомпании.Ссылка КАК СкладСсылка,
			 |	СкладыКомпании.Подразделение КАК ПодразделениеСсылка
			 |ИЗ
			 |	Справочник.СкладыКомпании КАК СкладыКомпании
			 |ГДЕ
			 |	СкладыКомпании.ТочкаДоставки = &ТочкаДоставки
			 |	И НЕ СкладыКомпании.Подразделение.Закрыт
			 |	И СкладыКомпании.Организация = &Организация";
		Запрос.УстановитьПараметр("ТочкаДоставки",СтруктураДокумента.АдресОтгрузки);
		Запрос.УстановитьПараметр("Организация",СтруктураДокумента.Организация);
		Рез = Запрос.Выполнить();
		Если Рез.Пустой() Тогда
			СтруктураДокумента.Вставить("ДокументКорректен",0);
			Ошибки = Неопределено;
			СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);
			
			Если Ошибки = Неопределено Тогда
				СтруктураДокумента.Вставить("ОшибкиДокумента","Не определен склад заказа");	
			Иначе
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + "Не определен склад заказа";
				СтруктураДокумента.ОшибкиДокумента = Ошибки;
			КонецЕсли;

		Иначе
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			СтруктураДокумента.Вставить("СкладКомпании",Выборка.СкладСсылка);
			СтруктураДокумента.Вставить("Подразделение",Выборка.ПодразделениеСсылка);
		КонецЕсли;
		
	Иначе
		СтруктураДокумента.Вставить("ДокументКорректен",0);
		Ошибки = Неопределено;
		СтруктураДокумента.Свойство("ОшибкиДокумента",Ошибки);

		Если Ошибки = Неопределено Тогда
			СтруктураДокумента.Вставить("ОшибкиДокумента","Не определен склад заказа");	
		Иначе
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + "Не определен склад заказа";
			СтруктураДокумента.ОшибкиДокумента = Ошибки;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	//
	ДокументТЧ = ПолучитьТаблицуТоваров("ORDER");	
	//
	СписокШтрихКодов = Новый СписокЗначений;
	
	Для Каждого Узел ИЗ ТабличнаяЧасть Цикл
		СтрокаДерева = Узел.Строки;
		
		НоваяСтрокаТЧ = ДокументТЧ.Добавить();
		Рез =  ОбработатьПолеТабличнойЧасти("POSITIONNUMBER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDBUYER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTIDSUPPLIER",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDERUNIT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("DESCRIPTION",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRICE",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRICEWITHVAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("VAT",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("PRODUCTTYPE",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		Рез =  ОбработатьПолеТабличнойЧасти("ORDEREDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("ACCEPTEDQUANTITY",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
	//	Рез =  ОбработатьПолеТабличнойЧасти("INFO",НоваяСтрокаТЧ,СтрокаДерева,"ORDER");
		
		Если ЗначениеЗаполнено(НоваяСтрокаТЧ.ШтрихКод) Тогда
			СписокШтрихКодов.Добавить(НоваяСтрокаТЧ.ШтрихКод);
		КонецЕсли;
		
	КонецЦикла;

	Если СтруктураДокумента.ДокументКорректен = 1 Тогда
	   ДозаполнитьТаблицуТоваров(ДокументТЧ,СписокШтрихКодов,"ORDER");
	   СтруктураДокумента.Вставить("ДокументТЧ", ДокументТЧ);
	КонецЕсли;	
			
	Возврат СтруктураДокумента;	
КонецФункции

Функция ПроверитьЗагруженЛиФайл(ТекущееКоличествоСозданныхДокументов, ТекФайл, СписокФайловСОшибками)
    
    Если ТекущееКоличествоСозданныхДокументов = 0 Тогда
        //Нет структуры
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Файл %1 не загружен!'; uk = 'Файл %1 не завантажений!'"),
				ТекФайл.Имя));
		
        СписокФайловСОшибками.Добавить(ТекФайл.Имя);
        Возврат Ложь;
    КонецЕсли;
    
    Возврат Истина;
КонецФункции

Функция СтруктураДокументаВерна(СтруктураДокумента, ТекФайл, СписокФайловСОшибками)
    
    Если СтруктураДокумента.ДокументКорректен = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Файл %1 не загружен!'; uk = 'Файл %1 не завантажений!'"),
				ТекФайл.Имя));
				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДокумента.ОшибкиДокумента);		
						
		СписокФайловСОшибками.Добавить(ТекФайл.Имя);
		
		Возврат Ложь;
    КонецЕсли;
    
    Возврат Истина;
КонецФункции

Функция ПолучитьОрганизациюПоGLN(GLN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	Организации.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Организации КАК Организации
	                |ГДЕ
	                |	Организации.GLN = &GLN";
	 
	Запрос.УстановитьПараметр("GLN", GLN);
	 
	Выборка = Запрос.Выполнить().Выбрать();
	 
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;		 
	
КонецФункции

Процедура ОбработатьРозничныеЦены(ДокОбъект, тчТовары)
	 
	СтруктураДействий = Новый Структура;
	СтруктураПолейДляЗаполненияЦен = Новый Структура;	
	
	Если ДокОбъект.ПодразделениеКомпании.ИспользоватьПротоколыСогласованныхЦен Тогда
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокОбъект, "СогласованиеЦен"));
	Иначе
		СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(ДокОбъект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", "СуммаВсего");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");	
	
	Для Каждого тчСтрока Из тчТовары Цикл 
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(тчСтрока, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВалюты(ИмяВалюты)
	
	Валюта = Неопределено;
	Если ИмяВалюты = "UAH" Тогда 
		Валюта = Справочники.Валюты.НайтиПоКоду("980");	
	ИначеЕсли ИмяВалюты = "RUB" Тогда 
		Валюта = Справочники.Валюты.НайтиПоКоду("643");
	ИначеЕсли ИмяВалюты = "USD" Тогда 
		Валюта = Справочники.Валюты.НайтиПоКоду("840");	
	ИначеЕсли ИмяВалюты = "EUR" Тогда 
		Валюта = Справочники.Валюты.НайтиПоКоду("978");	
	КонецЕсли;
	
	Возврат Валюта;
	
КонецФункции

Функция ПолучитьСтавкуНДС(РазмерСтавки);
	
	Если РазмерСтавки = 20 Тогда 
		СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ОсновнаяСтавкаНДС");
	ИначеЕсли РазмерСтавки = 7 Тогда 
		СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.НДС7");
	ИначеЕсли РазмерСтавки = 0 Тогда 
		СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС");
	Иначе		
		СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка");
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция СкладКомпанииПоТорговойПлощадке(ТорговаяПлощадка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СкладыКомпании.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА СкладыКомпании.ВидСклада.Код = ""000000001""
	               |			ТОГДА 1
	               |		КОГДА СкладыКомпании.ВидСклада.Код = ""000000011""
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	Справочник.СкладыКомпании КАК СкладыКомпании
	               |ГДЕ
	               |	СкладыКомпании.ТорговаяПлощадка = &ТорговаяПлощадка
	               |	И (СкладыКомпании.ВидСклада.Код = ""000000001""
	               |			ИЛИ СкладыКомпании.ВидСклада.Код = ""000000011"")
	               |	И НЕ СкладыКомпании.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


#КонецОбласти



#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
