&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
 	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		Если ЗначениеЗаполнено(Объект.СкладыКомпании)Тогда
			ЗаполнитьТаблицуЗаказовИзТЧТовары(Ложь);
		КонецЕсли;	
	КонецЕсли;	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ЗаказПоставщику"));
	РасчетКонец = ТекущаяДата();
	РасчетНачало = РасчетКонец-2*86400;
	
	УстановитьСвязиПараметровВыбораДоговора();
	
	Элементы.СтраницаПрочее.Видимость = Ложь;
	Элементы.ТабДокШтрих.Видимость = Ложь;
	
	//ЭтаФорма.ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь() И Объект.СтатусЗаказаВеб <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовВеб.НеОтправлен");
	ЭтаФорма.ТолькоПросмотр = НЕ Пользователи.ЭтоПолноправныйПользователь() И (Объект.Проведен ИЛИ Объект.СтатусЗаказаВеб <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовВеб.НеОтправлен"));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	Элементы.ДатаОстатковРЦ.Видимость = ЗначениеЗаполнено(Объект.ДатаОстатковРЦ);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	//ОбновитьЗаполнитьСоответствиеИменПолейСкладов();
	
	ПриЧтенииСозданииНаСервере();
	
	ЗаполнитьТаблицуЗаказовИзТЧТовары();
	
	УстановитьСостояниеДокумента();
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Товары.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства			
	
	ЗаписатьДанныеЗаказаВТЧТовары(ТекущийОбъект);
	
	ТекущийОбъект.СуммаДокумента = СуммаДокумента;
	
	Если ТекущийОбъект.ПодразделениеКомпании.Код = "000000008" И ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И ЕстьНеАссортимент(ТекущийОбъект.Дата,ТекущийОбъект.Товары.Выгрузить()) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заказывается товар не из ассортимента!!!",ТекущийОбъект,"Товары");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);			
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	//СтруктураНаименованийТабличныхЧастей = Новый Структура("ТаблицаЗаказов");
	//ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ХозОперацияПриИзменении(Элемент)
	УстановитьСвязиПараметровВыбораДоговора();	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	Объект.СкладКомпании = ДоговорВзаиморасчетовПриИзмененииНаСервере(Объект.ДоговорВзаиморасчетов);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗаказов

&НаКлиенте
Процедура ТаблицаЗаказовКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	ПересчитатьКоличествоПоСтроке(ТекущаяСтрока, СоответствиеИменПолейСкладов);
	
	СтруктураДействий = Новый Структура;	
	ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);	
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;	
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", ТекущаяСтрока.ЕдиницаИзмерения);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
	СтруктураДействий.Вставить("ЦеныБезХарактеристики",Истина);		
	
	СтруктураПолейДляЗаполненияЦен = Новый Структура;	
	СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));
	
	СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
	
	ПересчитатьКоличествоПоСтроке(ТекущаяСтрока, СоответствиеИменПолейСкладов);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	АналогичныйРотируемый =	АналогичныйРотируемыйТовар(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.Аналогичный =	АналогичныйРотируемый.Аналогичный;
	ТекущаяСтрока.Ротируемый =	АналогичныйРотируемый.Ротируемый;
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовЕдиницаИзмеренияПриИзменении(Элемент)		
	ТекущаяСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ЗаполнитьКоэффициентЕдиницыИзмерения", ТекущаяСтрока.ЕдиницаИзмерения);
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);	
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПриАктивизацииЯчейки(Элемент)			
	ПодключитьОбработчикОжидания("ПолучитьИнформациюПоЯчейке", 0.4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнформациюПоЯчейке()
	Перем Номенклатура, СкладКомпании, ТекЗначение;
	
	ТекСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;		
	
	Если ТекСтрока = Неопределено Тогда 
		Элементы.ГруппаПоказателиТекущейЯчейки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Номенклатура = ТекСтрока.Номенклатура;
	
	Если ТипЗнч(СоответствиеИменПолейСкладов) = Тип("Структура") Тогда 
		СоответствиеИменПолейСкладов.Свойство(Элементы.ТаблицаЗаказов.ТекущийЭлемент.Имя, СкладКомпании);
	КонецЕсли;	
	
	ЕстьНоменклатура 	= ЗначениеЗаполнено(Номенклатура);
	ЕстьСклад 			= ЗначениеЗаполнено(СкладКомпании);
	ЕстьДатаНачало		= ЗначениеЗаполнено(РасчетНачало);
	ЕстьДатаКонец 		= ЗначениеЗаполнено(РасчетКонец);	
	
	Элементы.ГруппаПоказателиТекущейЯчейки.Видимость = ЕстьНоменклатура;	
	
	СтруктураДанныхЯчейки = Новый Структура;
	
	Если ЕстьНоменклатура Тогда
		ПараметрыДанныхЯчейки = Новый Структура;							
		
		Если ЕстьДатаНачало Тогда 
			ПараметрыДанныхЯчейки.Вставить("РасчетНачало", РасчетНачало);			
		КонецЕсли;			
		
		Если ЕстьДатаКонец Тогда 
			ПараметрыДанныхЯчейки.Вставить("РасчетКонец", РасчетКонец);
		КонецЕсли;
		
		Если ЕстьСклад Тогда 
			ПараметрыДанныхЯчейки.Вставить("Номенклатура", Номенклатура);
			ПараметрыДанныхЯчейки.Вставить("СкладКомпании", СкладКомпании);
			ПараметрыДанныхЯчейки.Вставить("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
			
			СтруктураДанныхЯчейки = ПолучитьИнформациюПоЯчейкеНаСервере(ПараметрыДанныхЯчейки);
		КонецЕсли;								
	КонецЕсли;	
	
	Если ЕстьНоменклатура И ЕстьСклад Тогда 
		ТекЗначение = ТекСтрока[Элементы.ТаблицаЗаказов.ТекущийЭлемент.Имя];
	КонецЕсли;	
	
	//видимость элементов	
	Элементы.ТекНоменклатура.Видимость = ЕстьНоменклатура;
	Если Элементы.ТекНоменклатура.Видимость Тогда 
		ТекНоменклатура = Номенклатура;
	КонецЕсли;
	
	Элементы.ТекСклад.Видимость = ЕстьСклад;
	Если Элементы.ТекСклад.Видимость Тогда 
		ТекСклад = СкладКомпании;
	КонецЕсли;
	
	Элементы.ТекЗаказано.Видимость = ЕстьНоменклатура И ЕстьСклад;
	Если Элементы.ТекЗаказано.Видимость Тогда 
		ТекЗаказано = ТекЗначение;
	КонецЕсли;
	
	Элементы.ТекОстаток.Видимость = СтруктураДанныхЯчейки.Свойство("ТекОстаток");
	Если Элементы.ТекОстаток.Видимость Тогда 
		ТекОстаток = СтруктураДанныхЯчейки.ТекОстаток;
	КонецЕсли;
	
	Элементы.ТекВитрина.Видимость = СтруктураДанныхЯчейки.Свойство("ТекВитрина");
	Если Элементы.ТекВитрина.Видимость Тогда 
		ТекВитрина = СтруктураДанныхЯчейки.ТекВитрина;
	КонецЕсли;
	
	Элементы.ТекРеализовано.Видимость = СтруктураДанныхЯчейки.Свойство("ТекРеализовано");
	Если Элементы.ТекРеализовано.Видимость Тогда 
		ТекРеализовано = СтруктураДанныхЯчейки.ТекРеализовано;
	КонецЕсли;
	
	Элементы.ТекТоварВПути.Видимость = СтруктураДанныхЯчейки.Свойство("ТекТоварВПути");
	Если Элементы.ТекТоварВПути.Видимость Тогда 
		ТекТоварВПути = СтруктураДанныхЯчейки.ТекТоварВПути;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюПоЯчейкеНаСервере(Параметры)	
	Перем Номенклатура, СкладКомпании, РасчетНачало, РасчетКонец;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Объект = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Значение = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","НовыйРотируемыйТовар_f085cd3431834786996f9196256452a8"));
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если РезультатЗапроса.Пустой() Тогда
		Номенклатура 	= Параметры.Номенклатура;
	Иначе
		Номенклатура 	= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	//Номенклатура 	= Параметры.Номенклатура;
	СкладКомпании 	= Параметры.СкладКомпании;
	ДатаЗапроса 	= Параметры.ДатаДокумента;
	
	ЕстьДатаНачало	= Параметры.Свойство("РасчетНачало", РасчетНачало);
	ЕстьДатаКонец	= Параметры.Свойство("РасчетКонец", РасчетКонец);
	
	ТекущиеДанные 	= Новый Структура;
	Запрос 			= Новый Запрос;			
	
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Номенклатура1", 	Параметры.Номенклатура);
	Запрос.УстановитьПараметр("СкладКомпании", 	СкладКомпании);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", 	СкладКомпании.ТорговаяПлощадка);
	Запрос.УстановитьПараметр("Дата", 			ДатаЗапроса);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	""ТекОстаток"" КАК Параметр,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Значение
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Дата,
	|			СкладКомпании = &СкладКомпании
	|				И Номенклатура В (&Номенклатура)) КАК ОстаткиТоваровКомпанииОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ТекВитрина"",
	|	ЕСТЬNULL(ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВитринаОстаток, 0)
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура1
	|				И ТорговаяПлощадка = &ТорговаяПлощадка) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Если ЕстьДатаНачало И ЕстьДатаКонец Тогда 		
		Запрос.УстановитьПараметр("НачалоПериода", РасчетНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(РасчетКонец));
		
		ТекстПродажи = "ВЫБРАТЬ
		|	""ТекРеализовано"",
		|	ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И СкладКомпании = &СкладКомпании) КАК ПродажиОбороты";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстПродажи;
		//КонецЕсли;
		
		
		ПлощадкаВПути = Новый СписокЗначений;
		ПлощадкаВПути.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("DaL005"));		//	Распределительный центр - Харьков Аттика
		ПлощадкаВПути.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("GL000160 "));	//	РЦ Харьков ТАБАК
		ПлощадкаВПути.Добавить(Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000113"));	//	Суздальские ряды  - Харьков
		
		Запрос.УстановитьПараметр("КонтрагентВПути", Справочники.Контрагенты.НайтиПоКоду("42919413"));	//	Люксопт ООО
		Запрос.УстановитьПараметр("ПлощадкаВПути", ПлощадкаВПути);
		
		ТекстВПути = "ВЫБРАТЬ
		             |	""ТекТоварВПути"" КАК Параметр,
		             |	СУММА(ВложенныйЗапрос.Значение) КАК Значение
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ЕСТЬNULL(СУММА(ПоступлениеТоваровТовары.КоличествоБазовое), 0) КАК Значение
		             |	ИЗ
		             |		Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		             |	ГДЕ
		             |		НЕ ПоступлениеТоваровТовары.Ссылка.Проведен
		             |		И НЕ ПоступлениеТоваровТовары.Ссылка.ПометкаУдаления
		             |		И ПоступлениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		             |		И ПоступлениеТоваровТовары.Ссылка.Контрагент <> &КонтрагентВПути
		             |		И ПоступлениеТоваровТовары.Номенклатура = &Номенклатура1
		             |		И ПоступлениеТоваровТовары.Ссылка.СкладКомпании = &СкладКомпании
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		ЕСТЬNULL(СУММА(ПеремещениеТоваровТовары.КоличествоБазовое), 0)
		             |	ИЗ
		             |		Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		             |	ГДЕ
		             |		НЕ ПеремещениеТоваровТовары.Ссылка.Проведен
		             |		И НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления
		             |		И ПеремещениеТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		             |		И ПеремещениеТоваровТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
		             |		И ПеремещениеТоваровТовары.Ссылка.ТорговаяПлощадка В(&ПлощадкаВПути)
		             |		И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура1
		             |		И ПеремещениеТоваровТовары.Ссылка.СкладКомпанииПолучатель = &СкладКомпании) КАК ВложенныйЗапрос";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстВПути;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		ТекущиеДанные.Вставить(Выборка.Параметр, Выборка.Значение);
	КонецЦикла;
	
	Возврат ТекущиеДанные;
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСкладыКомпании

&НаСервере
Процедура СкладыКомпанииПриИзмененииНаСервере()
	УстановитьСоставКолонокТаблицыЗаказовПоОтбору();
	ОбновитьЗаполнитьСоответствиеИменПолейСкладов();
КонецПроцедуры

&НаКлиенте
Процедура СкладыКомпанииПриИзменении(Элемент)
	СкладыКомпанииПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкладКомпанииПриИзмененииНаСервере(Склад, СтруктураСтроки) Экспорт 	
	СтруктураСтроки = Новый Структура;
	
	УИД = НРег(Строка(Склад.УникальныйИдентификатор()));;
	УИД = СтрЗаменить(УИД, "-", "");		
	
	СтруктураСтроки.Вставить("ИмяПоля", "скл" + УИД);
	СтруктураСтроки.Вставить("НаименованиеСклада", СокрЛП(Склад.Наименование));		
КонецПроцедуры

&НаКлиенте
Процедура СкладКомпанииПриИзменении(Элемент)	
	ТекущаяСтрока = Элементы.СкладыКомпании.ТекущиеДанные;
	
	СтруктураСтроки = Новый Структура;	
	СкладКомпанииПриИзмененииНаСервере(ТекущаяСтрока.СкладКомпании, СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураСтроки);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОтгрузитьПеремещениеВФилиал(Команда)
	Если Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда 
		ПоказатьПредупреждение(,НСтр("ru = 'Для создания отгрузки необходимо записать документ!'; uk = 'Для створення відвантаження необхідно записати документ!'"));
		Возврат;
	КонецЕсли;
	
	ОтгрузитьПеремещениеВФилиалНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьПеремещениеВФилиалНаСервере()
	
	Документы.ЗаказПоставщику.СформироватьОтгрузку(Объект.Ссылка, "ПеремещениеВФилал");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПеремещений(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивПеремещений = ПолучитьСписокПодчиненныхПеремещений(Параметры.Ключ);	
	Если МассивПеремещений.Количество() > 0 Тогда 	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПеремещениеТоваров", "ПеремещениеТоваровПорядокСигаретный", МассивПеремещений, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПеремещенийДвойная(Команда)
	Если Параметры.Ключ.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивПеремещений = ПолучитьСписокПодчиненныхПеремещений(Параметры.Ключ);	
	Если МассивПеремещений.Количество() > 0 Тогда 	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПеремещениеТоваров", "ПеремещениеТоваровДвойная", МассивПеремещений, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПодчиненныхПеремещений(Знач ЗаказСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Заказ) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	|	И ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ.ПеремещениеТоваров).Проведен";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	
	Массив = Новый Массив;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Массив.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьСводныйЗаказНаСервере(ДанныеЗаполнения)
	НовыйДокумент = Документы.ЗаказПоставщику.СоздатьСводныйЗаказ(ДанныеЗаполнения);
	НовыйДокумент.Записать();
	Возврат НовыйДокумент.ССылка;
КонецФункции

&НаСервереБезКонтекста
Функция ПустойЗаказ(Знач ТаблицаЗаказов)
	Возврат НЕ ТаблицаЗаказов.Выгрузить(,"Номенклатура, КоличествоБазовое").Итог("КоличествоБазовое") > 0;
КонецФункции

&НаКлиенте
Процедура СоздатьСводныйЗаказ(Команда)
	
	Если ПустойЗаказ(ЭтотОбъект.ТаблицаЗаказов) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Заказ пустой!!!'; uk = 'Замовлення порожнє!!!'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СкладКомпании) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Заполните склад и повторите попытку.'; uk = 'Заповніть склад та спробуйте ще раз.'"));
		Возврат;
	КонецЕсли;
	
	//	Создаем структуру с отбором и добавляем значения
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Подразделение", получитьЗначениеРеквизита(Объект.СкладКомпании,"Подразделение"));
	ПараметрыОтбора.Вставить("ВидДоговора",ПредопределенноеЗначение("Справочник.ВидыДоговоров.Поставка"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); //	Добавляем отбор в параметры формы
	
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Ложь);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйДоговор = Значение;
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Заказ",Строка(Объект.Ссылка));
	ДанныеЗаполнения.Вставить("Договор",ВыбранныйДоговор);
	ДанныеЗаполнения.Вставить("Склад",Объект.СкладКомпании);
	ДанныеЗаполнения.Вставить("Товары",ЭтотОбъект.ТаблицаЗаказов);
	
	СсылкаНаДокумент = СоздатьСводныйЗаказНаСервере(ДанныеЗаполнения);
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаНаДокумент));
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция АналогичныйРотируемыйТовар(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК Аналогичный
	|ПОМЕСТИТЬ АналогичныеТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.ОсновнойАртикул,
	|	ИСТИНА
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительныеСведения.Объект КАК Номенклатура,
	|	ИСТИНА КАК Ротируемый
	|ПОМЕСТИТЬ РотируемыеТовары
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение,
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВложенныйЗапрос.Аналогичный) КАК Аналогичный,
	|	МАКСИМУМ(ВложенныйЗапрос.Ротируемый) КАК Ротируемый
	|ИЗ
	|	(ВЫБРАТЬ
	|		АналогичныеТовары.Номенклатура КАК Номенклатура,
	|		АналогичныеТовары.Аналогичный КАК Аналогичный,
	|		ЛОЖЬ КАК Ротируемый
	|	ИЗ
	|		АналогичныеТовары КАК АналогичныеТовары
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РотируемыеТовары.Номенклатура,
	|		ЛОЖЬ,
	|		РотируемыеТовары.Ротируемый
	|	ИЗ
	|		РотируемыеТовары КАК РотируемыеТовары) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","НовыйРотируемыйТовар_f085cd3431834786996f9196256452a8"));
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Структура("Номенклатура,Аналогичный,Ротируемый",Номенклатура,Ложь,Ложь);
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = Новый Структура("Номенклатура,Аналогичный,Ротируемый");
		ЗаполнитьЗначенияСвойств(Результат,ВыборкаДетальныеЗаписи);
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция РасчитатьАнализАБЦ(Дата,Склады)
	
	НачалоДатаАнализа = НачалоДня(Дата)-28*86400;
	КонецДатаАнализа = НачалоДня(Дата)-1;
	
	//Заполнение фильтра по ХозОперациям
	СписокХозОперацийСеть = Новый СписокЗначений;
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.РеализацияТоваров, "Реализация товаров", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.РеализацияТоваровКомиссия, "Реализация товаров комиссия", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница, "Реализация товаров (розница)", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя, "Возврат товаров от покупателя", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия, "Возврат товаров от покупателя комиссия", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.ЗакрытиеСмены, "Закрытие смены", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат, "Закрытие смены (возврат)", Истина);
	СписокХозОперацийСеть.Добавить(Справочники.ХозОперации.Чек, "Чек ККМ", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпании.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|			ТОГДА ОстаткиТоваровКомпании.Номенклатура
	|		ИНАЧЕ ОстаткиТоваровКомпании.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ОстаткиТоваровКомпании.СуммаУпр) КАК ОборотВесь
	|ПОМЕСТИТЬ ПродажиЗаПериод
	|ИЗ
	|	РегистрНакопления.Продажи КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	ОстаткиТоваровКомпании.Период МЕЖДУ &НачалоАнализа И &КонецАнализа
	|	И ОстаткиТоваровКомпании.ХозОперация В(&ХозОперация)
	|	И ОстаткиТоваровКомпании.СкладКомпании В ИЕРАРХИИ(&СкладКомпании)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ОстаткиТоваровКомпании.Номенклатура.ОсновнойАртикул = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
	|			ТОГДА ОстаткиТоваровКомпании.Номенклатура
	|		ИНАЧЕ ОстаткиТоваровКомпании.Номенклатура.ОсновнойАртикул
	|	КОНЕЦ,
	|	ОстаткиТоваровКомпании.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиЗаПериод.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель
	|		ИНАЧЕ ПродажиЗаПериод.Номенклатура.Родитель
	|	КОНЕЦ КАК Группа,
	|	СУММА(ПродажиЗаПериод.ОборотВесь) КАК Показатель,
	|	ПродажиЗаПериод.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаВыборки
	|ИЗ
	|	ПродажиЗаПериод КАК ПродажиЗаПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиЗаПериод.ТорговаяПлощадка,
	|	ПродажиЗаПериод.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.номенклатура.ПустаяСсылка)
	|			ТОГДА ПродажиЗаПериод.Номенклатура.Родитель.Родитель
	|		ИНАЧЕ ПродажиЗаПериод.Номенклатура.Родитель
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПродажиЗаПериод.ОборотВесь) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗначенияПоказателяПоГруппировкам.Группа КАК Группа,
	|	ЗначенияПоказателяПоГруппировкам.Номенклатура КАК Номенклатура,
	|	ЗначенияПоказателяПоГруппировкам.Показатель КАК Показатель,
	|	ВЫБОР
	|		КОГДА ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка = ВыборкаОбщегоПоказателя.ТорговаяПлощадка
	|				И ЗначенияПоказателяПоГруппировкамДляСоединения.Группа = ВыборкаОбщегоПоказателя.Группа
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.Показатель) <= ВыборкаОбщегоПоказателя.Показатель * &ОбъемКласса_C / 100
	|						ТОГДА ""C""
	|					КОГДА СУММА(ЗначенияПоказателяПоГруппировкамДляСоединения.Показатель) <= ВыборкаОбщегоПоказателя.Показатель * (&ОбъемКласса_C + &ОбъемКласса_B) / 100
	|						ТОГДА ""B""
	|					ИНАЧЕ ""A""
	|				КОНЕЦ
	|		ИНАЧЕ ""нет""
	|	КОНЕЦ КАК ГруппаАБЦ
	|ПОМЕСТИТЬ ВсеГруппы
	|ИЗ
	|	ТаблицаВыборки КАК ЗначенияПоказателяПоГруппировкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВыборки КАК ЗначенияПоказателяПоГруппировкамДляСоединения
	|		ПО ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка = ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка
	|			И ЗначенияПоказателяПоГруппировкам.Показатель >= ЗначенияПоказателяПоГруппировкамДляСоединения.Показатель
	|			И ЗначенияПоказателяПоГруппировкам.Группа = ЗначенияПоказателяПоГруппировкамДляСоединения.Группа
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ТаблицаВыборки.Показатель) КАК Показатель,
	|			ТаблицаВыборки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|			ТаблицаВыборки.Группа КАК Группа
	|		ИЗ
	|			ТаблицаВыборки КАК ТаблицаВыборки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаВыборки.ТорговаяПлощадка,
	|			ТаблицаВыборки.Группа) КАК ВыборкаОбщегоПоказателя
	|		ПО ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка = ВыборкаОбщегоПоказателя.ТорговаяПлощадка
	|			И ЗначенияПоказателяПоГруппировкам.Группа = ВыборкаОбщегоПоказателя.Группа
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияПоказателяПоГруппировкам.Группа,
	|	ЗначенияПоказателяПоГруппировкам.Номенклатура,
	|	ЗначенияПоказателяПоГруппировкам.ТорговаяПлощадка,
	|	ЗначенияПоказателяПоГруппировкам.Показатель,
	|	ЗначенияПоказателяПоГруппировкамДляСоединения.ТорговаяПлощадка,
	|	ВыборкаОбщегоПоказателя.ТорговаяПлощадка,
	|	ВыборкаОбщегоПоказателя.Показатель,
	|	ЗначенияПоказателяПоГруппировкамДляСоединения.Группа,
	|	ВыборкаОбщегоПоказателя.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеГруппы.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВсеГруппы.Группа КАК Группа,
	|	ВсеГруппы.Номенклатура КАК Номенклатура,
	|	ВсеГруппы.Показатель КАК Показатель,
	|	ВсеГруппы.ГруппаАБЦ КАК ГруппаАБЦ
	|ИЗ
	|	ВсеГруппы КАК ВсеГруппы
	|ГДЕ
	|	(ВсеГруппы.ГруппаАБЦ = ""A""
	|			ИЛИ ВсеГруппы.ГруппаАБЦ = ""B"")";
	
	Запрос.УстановитьПараметр("НачалоАнализа", НачалоДатаАнализа);
	Запрос.УстановитьПараметр("КонецАнализа", КонецДатаАнализа);
	Запрос.УстановитьПараметр("ХозОперация", СписокХозОперацийСеть);
	Запрос.УстановитьПараметр("СкладКомпании", Склады);
	Запрос.УстановитьПараметр("ОбъемКласса_B", 15);
	Запрос.УстановитьПараметр("ОбъемКласса_C", 5);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		тз = Новый ТаблицаЗначений;
		тз.Колонки.Добавить("ТорговаяПлощадка",Новый ОписаниеТипов("СправочникСсылка.ТорговыеПлощадки"));
		тз.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тз.Колонки.Добавить("ГруппаАБЦ",Новый ОписаниеТипов("Строка"));
		тз.Колонки.Добавить("ВремяРасчета",Новый ОписаниеТипов("Дата"));
		Возврат тз;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАнализАБЦ(Дата,Склады,Товар)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТК_РасcчитанныеПотребностиТовара.Номенклатура КАК Номенклатура,
	|	ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка КАК ТорговаяТочка,
	|	ТК_РасcчитанныеПотребностиТовара.ГруппаАБЦ КАК ГруппаАБЦ
	|ИЗ
	|	РегистрСведений.ТК_РасcчитанныеПотребностиТовара КАК ТК_РасcчитанныеПотребностиТовара
	|ГДЕ
	|	ТК_РасcчитанныеПотребностиТовара.День = &День
	|	И ТК_РасcчитанныеПотребностиТовара.Номенклатура В(&Номенклатура)
	|	И ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка В(&СкладКомпании)
	|	И (ТК_РасcчитанныеПотребностиТовара.ГруппаАБЦ = ""A""
	|			ИЛИ ТК_РасcчитанныеПотребностиТовара.ГруппаАБЦ = ""B"")";
	
	Запрос.УстановитьПараметр("День", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Запрос.УстановитьПараметр("СкладКомпании", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапроса.Пустой() Тогда
	//	тз = Новый ТаблицаЗначений;
	//	тз.Колонки.Добавить("ТорговаяПлощадка",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	//	тз.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//	тз.Колонки.Добавить("ГруппаАБЦ",Новый ОписаниеТипов("Строка"));
	//	Возврат тз;
	//Иначе
	Возврат РезультатЗапроса.Выгрузить();
	//КонецЕсли;
КонецФункции

// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий, Форма = Неопределено)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьКоличествоПоСтроке(ТекущаяСтрока, Знач ИменаСкладов)
	Если ТекущаяСтрока = Неопределено ИЛИ ИменаСкладов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоПоСтроке = 0;
	
	Для Каждого ИмяПоля Из ИменаСкладов Цикл 
		ТекЗначение = 0;
		Если ТекущаяСтрока.Свойство(ИмяПоля.Ключ, ТекЗначение) Тогда 
			КоличествоПоСтроке = КоличествоПоСтроке + ТекЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ТекущаяСтрока.Количество = КоличествоПоСтроке;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	//УсловноеОформление.Элементы.Очистить();	
	//спСправочники.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, "ТаблицаЗаказовХарактеристикиИспользуются", "ТаблицаЗаказов.ХарактеристикиИспользуются");
КонецПроцедуры

&НаСервере
Процедура УстановитьСоставКолонокТаблицыЗаказовПоОтбору() Экспорт 
	
	СтруктураПолей			= Новый Структура;
	ДобавляемыеРеквизиты 	= Новый Массив;
	УдаляемыеРеквизиты		= Новый Массив;
	УдаляемыеПоляФормы 		= Новый Массив;
	
	КолонкиСклады 			= Элементы.ТаблицаЗаказовГруппаСклады.ПодчиненныеЭлементы;
	
	Если КолонкиСклады.Количество() > 0 Тогда 
		МассивУдаляемыхПолей = Новый Массив;
		
		Для Каждого Элемент Из КолонкиСклады Цикл
			СтруктураПоля = Новый Структура;
			СтруктураПоля.Вставить("Элемент", Элемент);
			СтруктураПоля.Вставить("ПутьКДанным", Элемент.ПутьКДанным);
			
			СтруктураПолей.Вставить(Элемент.Имя, СтруктураПоля);
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.СкладыКомпании.Количество() > 0 Тогда 
		СписокСкладов = Объект.СкладыКомпании.Выгрузить();	
		СписокСкладов.Свернуть("СкладКомпании, НаименованиеСклада, ИмяПоля");
		
		ТипыРеквизита = Новый Массив;
		ТипыРеквизита.Добавить(Тип("Число"));
		ОписаниеТиповРеквизита = Новый ОписаниеТипов(ТипыРеквизита,,,Новый КвалификаторыЧисла(15, 3));						
		
		Для Каждого стрСклад Из СписокСкладов Цикл 						
			Если стрСклад.СкладКомпании.Пустая() Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтруктураПолей.Свойство(стрСклад.ИмяПоля) Тогда 
				СтруктураПолей.Удалить(стрСклад.ИмяПоля);
			Иначе				
				НовыйРеквизит = Новый РеквизитФормы(стрСклад.ИмяПоля, 
				ОписаниеТиповРеквизита,
				"ТаблицаЗаказов",
				стрСклад.НаименованиеСклада,
				Истина);
				
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
			КонецЕсли;
		КонецЦикла;							
	КонецЕсли;
	
	Если СтруктураПолей.Количество() > 0 Тогда 
		Для Каждого Поле Из СтруктураПолей Цикл 
			УдаляемыеРеквизиты.Добавить(Поле.Значение.ПутьКДанным);
			Элементы.Удалить(Поле.Значение.Элемент);
		КонецЦикла;
	КонецЕсли;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 ИЛИ УдаляемыеРеквизиты.Количество() > 0 Тогда 		
		ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	КонецЕсли;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда 
		Для Каждого НовыйРеквизит Из ДобавляемыеРеквизиты Цикл
			ИмяРеквизита = НовыйРеквизит.Имя;
			ЗаголовокРеквизита = НовыйРеквизит.Заголовок;
			
			НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Элементы.ТаблицаЗаказовГруппаСклады);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;			
			НовыйЭлемент.ПутьКДанным = "ТаблицаЗаказов." + ИмяРеквизита;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "ТаблицаЗаказовКоличествоПриИзменении");
			НовыйЭлемент.Заголовок = Лев(ЗаголовокРеквизита, 14);
			НовыйЭлемент.Подсказка = НСтр("ru = '"+ ЗаголовокРеквизита +"'; uk = '"+ ЗаголовокРеквизита +"'");
			//НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			НовыйЭлемент.Ширина = 10;
			//НовыйЭлемент.МаксимальнаяШирина = 10;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			//НовыйЭлемент.АвтоВысотаЯчейки = Истина;
			НовыйЭлемент.ВыделятьОтрицательные = Истина;
			НовыйЭлемент.ВысотаЗаголовка = 3;
			НовыйЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗаказовИзТЧТовары(ИзСохраненныхДанных = Истина)	
	ТаблицаЗаказов.Очистить();
	
	УстановитьСоставКолонокТаблицыЗаказовПоОтбору();	
	
	Если ЗначениеЗаполнено(Параметры.Ключ) И ИзСохраненныхДанных Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Параметры.Ключ);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","НовыйРотируемыйТовар_f085cd3431834786996f9196256452a8"));
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ИСТИНА КАК Аналогичный
		|ПОМЕСТИТЬ АналогичныеТовары
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
		|			ИЗ
		|				Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ГДЕ
		|				ЗаказПоставщикуТовары.Ссылка = &Ссылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Номенклатура.ОсновнойАртикул,
		|	ИСТИНА
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
		|	И Номенклатура.ОсновнойАртикул В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
		|			ИЗ
		|				Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ГДЕ
		|				ЗаказПоставщикуТовары.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеСведения.Объект КАК Номенклатура,
		|	ИСТИНА КАК Ротируемый
		|ПОМЕСТИТЬ РотируемыеТовары
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
		|			ИЗ
		|				Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ГДЕ
		|				ЗаказПоставщикуТовары.Ссылка = &Ссылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Значение,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
		|			ИЗ
		|				Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ГДЕ
		|				ЗаказПоставщикуТовары.Ссылка = &Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
		|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
		|	СУММА(ТаблицаТоваров.КоличествоБазовое) КАК КоличествоБазовое,
		|	ТаблицаТоваров.Цена КАК Цена,
		|	ТаблицаТоваров.ЦенаБезНалогов КАК ЦенаБезНалогов,
		|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТоваров.СкладКомпании КАК СкладКомпании,
		|	ТаблицаСкладов.ИмяПоля КАК ИмяПоля,
		|	СУММА(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ТаблицаТоваров.Сумма) КАК Сумма,
		|	СУММА(ТаблицаТоваров.СуммаБезНалогов) КАК СуммаБезНалогов,
		|	ЕСТЬNULL(АналогичныеТовары.Аналогичный, ЛОЖЬ) КАК Аналогичный,
		|	ЕСТЬNULL(РотируемыеТовары.Ротируемый, ЛОЖЬ) КАК Ротируемый
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.СкладыКомпании КАК ТаблицаСкладов
		|		ПО ТаблицаТоваров.Ссылка = ТаблицаСкладов.Ссылка
		|			И ТаблицаТоваров.СкладКомпании = ТаблицаСкладов.СкладКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ АналогичныеТовары КАК АналогичныеТовары
		|		ПО ТаблицаТоваров.Номенклатура = АналогичныеТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РотируемыеТовары КАК РотируемыеТовары
		|		ПО ТаблицаТоваров.Номенклатура = РотируемыеТовары.Номенклатура
		|ГДЕ
		|	ТаблицаТоваров.Ссылка = &Ссылка
		|	И ТаблицаТоваров.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваров.Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ЕдиницаИзмерения,
		|	ТаблицаТоваров.Коэффициент,
		|	ТаблицаТоваров.СкладКомпании,
		|	ТаблицаСкладов.ИмяПоля,
		|	ТаблицаТоваров.Цена,
		|	ТаблицаТоваров.ЦенаБезНалогов,
		|	ТаблицаТоваров.СтавкаНДС,
		|	ЕСТЬNULL(АналогичныеТовары.Аналогичный, ЛОЖЬ),
		|	ЕСТЬNULL(РотируемыеТовары.Ротируемый, ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ ПО
		|	Номенклатура,
		|	ЕдиницаИзмерения
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	//	Запрос.Выполнить().Выгрузить()
		
	Иначе
		
		ТаблицаТоваров = Объект.Товары.Выгрузить();
		ТаблицаСкладов = Объект.СкладыКомпании.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		Запрос.УстановитьПараметр("ТаблицаСкладов", ТаблицаСкладов);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","НовыйРотируемыйТовар_f085cd3431834786996f9196256452a8"));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТовары.Коэффициент КАК Коэффициент,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.КоличествоБазовое КАК КоличествоБазовое,
		|	ТаблицаТовары.Цена КАК Цена,
		|	ТаблицаТовары.ЦенаБезНалогов КАК ЦенаБезНалогов,
		|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	ТаблицаТовары.Сумма КАК Сумма,
		|	ТаблицаТовары.СуммаБезНалогов КАК СуммаБезНалогов,
		|	ТаблицаТовары.СкладКомпании КАК СкладКомпании
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСкладов.СкладКомпании КАК СкладКомпании,
		|	ТаблицаСкладов.НаименованиеСклада КАК НаименованиеСклада,
		|	ТаблицаСкладов.ИмяПоля КАК ИмяПоля
		|ПОМЕСТИТЬ ТаблицаСкладов
		|ИЗ
		|	&ТаблицаСкладов КАК ТаблицаСкладов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ИСТИНА КАК Аналогичный
		|ПОМЕСТИТЬ АналогичныеТовары
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТаблицаТоваров.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ТаблицаТоваров КАК ТаблицаТоваров)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Номенклатура.ОсновнойАртикул,
		|	ИСТИНА
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ОсновнойАртикул <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)
		|	И Номенклатура.ОсновнойАртикул В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТаблицаТоваров.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ТаблицаТоваров КАК ТаблицаТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеСведения.Объект КАК Номенклатура,
		|	ИСТИНА КАК Ротируемый
		|ПОМЕСТИТЬ РотируемыеТовары
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Объект В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТаблицаТоваров.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ТаблицаТоваров КАК ТаблицаТоваров)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Значение,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТаблицаТоваров.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ТаблицаТоваров КАК ТаблицаТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
		|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
		|	СУММА(ТаблицаТоваров.КоличествоБазовое) КАК КоличествоБазовое,
		|	ТаблицаТоваров.Цена КАК Цена,
		|	ТаблицаТоваров.ЦенаБезНалогов КАК ЦенаБезНалогов,
		|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТоваров.СкладКомпании КАК СкладКомпании,
		|	ТаблицаСкладов.ИмяПоля КАК ИмяПоля,
		|	СУММА(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ТаблицаТоваров.Сумма) КАК Сумма,
		|	СУММА(ТаблицаТоваров.СуммаБезНалогов) КАК СуммаБезНалогов,
		|	ЕСТЬNULL(АналогичныеТовары.Аналогичный, ЛОЖЬ) КАК Аналогичный,
		|	ЕСТЬNULL(РотируемыеТовары.Ротируемый, ЛОЖЬ) КАК Ротируемый
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСкладов КАК ТаблицаСкладов
		|		ПО ТаблицаТоваров.СкладКомпании = ТаблицаСкладов.СкладКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ АналогичныеТовары КАК АналогичныеТовары
		|		ПО ТаблицаТоваров.Номенклатура = АналогичныеТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РотируемыеТовары КАК РотируемыеТовары
		|		ПО ТаблицаТоваров.Номенклатура = РотируемыеТовары.Номенклатура
		|ГДЕ
		|	ТаблицаТоваров.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТоваров.Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ЕдиницаИзмерения,
		|	ТаблицаТоваров.Коэффициент,
		|	ТаблицаТоваров.СкладКомпании,
		|	ТаблицаСкладов.ИмяПоля,
		|	ТаблицаТоваров.Цена,
		|	ТаблицаТоваров.ЦенаБезНалогов,
		|	ТаблицаТоваров.СтавкаНДС,
		|	ЕСТЬNULL(АналогичныеТовары.Аналогичный, ЛОЖЬ),
		|	ЕСТЬNULL(РотируемыеТовары.Ротируемый, ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ ПО
		|	Номенклатура,
		|	ЕдиницаИзмерения
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	КонецЕсли;
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 									
		ВыборкаЕдИзмерения = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);						
		
		Пока ВыборкаЕдИзмерения.Следующий() Цикл 																		
			СтруктураСтроки = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Количество, КоличествоБазовое, Цена, ЦенаБезНалогов, СтавкаНДС, СуммаНДС, Сумма, СуммаБезНалогов, Аналогичный, Ротируемый");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаЕдИзмерения);
			
			КоэффициентЗаполнен = Ложь;
			
			ВыборкаДетальныеЗаписи = ВыборкаЕдИзмерения.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				СтруктураСтроки.Аналогичный 		= ВыборкаДетальныеЗаписи.Аналогичный;
				СтруктураСтроки.Ротируемый 			= ВыборкаДетальныеЗаписи.Ротируемый;
				
				Если Не КоэффициентЗаполнен Тогда 
					СтруктураСтроки.Коэффициент 	= ВыборкаДетальныеЗаписи.Коэффициент;
					СтруктураСтроки.Цена 			= ВыборкаДетальныеЗаписи.Цена;
					СтруктураСтроки.ЦенаБезНалогов 	= ВыборкаДетальныеЗаписи.ЦенаБезНалогов;
					СтруктураСтроки.СтавкаНДС		= ВыборкаДетальныеЗаписи.СтавкаНДС;
					
					КоэффициентЗаполнен = Истина;
				КонецЕсли;
				
				СтруктураСтроки.Вставить(ВыборкаДетальныеЗаписи.ИмяПоля, ВыборкаДетальныеЗаписи.Количество);
			КонецЦикла;
			
			НоваяСтрока = ТаблицаЗаказов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		КонецЦикла;
	КонецЦикла;		
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеЗаказаВТЧТовары(ТекОбъект) Экспорт 
	
	ТекОбъект.Товары.Очистить();	
	
	Для Каждого стрТовары Из ТаблицаЗаказов Цикл 
		Для Каждого стрСклады Из Объект.СкладыКомпании Цикл 
			ТекСклад = стрСклады.СкладКомпании;			
			Если ТекСклад.Пустая() Тогда 
				Продолжить;
			КонецЕсли;
			
			Попытка
				КоличествоЗаказано = стрТовары[стрСклады.ИмяПоля];
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если КоличествоЗаказано <> 0 Тогда 
				НоваяСтрока = ТекОбъект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрТовары, "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ЦенаБезНалогов, СтавкаНДС");
				
				НоваяСтрока.Количество 			= КоличествоЗаказано;
				НоваяСтрока.КоличествоБазовое 	= НоваяСтрока.Коэффициент * НоваяСтрока.Количество;				
				НоваяСтрока.Сумма 				= НоваяСтрока.Цена * НоваяСтрока.КоличествоБазовое;
				
				ТекПроцентНДС = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(НоваяСтрока.СтавкаНДС);
				
				НоваяСтрока.СуммаНДС 			= ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, ТекПроцентНДС);
				НоваяСтрока.СуммаБезНалогов		= НоваяСтрока.Сумма - НоваяСтрока.СуммаНДС;
				НоваяСтрока.СкладКомпании 		= ТекСклад;
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаполнитьСоответствиеИменПолейСкладов() Экспорт 
	
	СоответствиеИменПолейСкладов = Новый Структура;  
	
	Для Каждого Стр Из Объект.СкладыКомпании Цикл 
		Если Стр.СкладКомпании.Пустая() Тогда 
			Продолжить;
		КонецЕсли;
		
		СоответствиеИменПолейСкладов.Вставить(Стр.ИмяПоля, Стр.СкладКомпании);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
функция получитьЗначениеРеквизита (эл,имяРеквизита)
	возврат эл[имяРеквизита];
КонецФункции

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДоговора()
	
	МассивСвязей = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");	
	МассивСвязей.Добавить(НоваяСвязь);
	
	Если Объект.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПоставщикуТранзиты") Тогда 
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация");		
		МассивСвязей.Добавить(НоваяСвязь);
	КонецЕсли;
	
	Элементы.ДоговорВзаиморасчетов.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ДоговорВзаиморасчетовПриИзмененииНаСервере(Договор)
	Возврат УправлениеСвойствами.ЗначениеСвойства(Договор,"СкладРЦДляЗаказа");
КонецФункции


#КонецОбласти

#Область РаботаСБуферомОбмена

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	//СтруктураНаименованийТабличныхЧастей = Новый Структура("ТаблицаЗаказов");
	//ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	ОбновитьЗаполнитьСоответствиеИменПолейСкладов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей)
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	
	Если СтруктураНаименованийТабличныхЧастей.Свойство("ТаблицаЗаказов") Тогда
		спСправочники.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(ТаблицаЗаказов, ПараметрыЗаполненияРеквизитов);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(Форма)
	Форма.ЭтаФорма.СуммаДокумента = Форма.ЭтотОбъект.ТаблицаЗаказов.Итог("Сумма");
	Форма.ЭтаФорма.СуммаНДС = Форма.ЭтотОбъект.ТаблицаЗаказов.Итог("СуммаНДС");
КонецПроцедуры

&НаСервере
Функция ЕстьНеАссортимент(Дата, тзТовары)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.СкладКомпании КАК СкладКомпании,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КоличествоБазовое КАК КоличествоБазовое
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.КоличествоБазовое > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(втТовары.СкладКомпании КАК Справочник.СкладыКомпании).ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	втТовары.КоличествоБазовое КАК КоличествоБазовое
	|ПОМЕСТИТЬ вт_Товары
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Товары.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	вт_Товары.Номенклатура КАК Номенклатура,
	|	вт_Товары.КоличествоБазовое КАК КоличествоБазовое,
	|	ОграничениеАссортиментаСрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	вт_Товары КАК вт_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ) КАК ОграничениеАссортиментаСрезПоследних
	|		ПО вт_Товары.Номенклатура = ОграничениеАссортиментаСрезПоследних.Номенклатура
	|			И вт_Товары.ТорговаяПлощадка = ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка
	|ГДЕ
	|	ЕСТЬNULL(ОграничениеАссортиментаСрезПоследних.Состояние, 0) <> 1";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Товары", тзТовары);
	
	РезультатЗапроса = Запрос.Выполнить();				//		РезультатЗапроса.Выгрузить()
	
	ЕстьНеАссортимент = НЕ РезультатЗапроса.Пустой();
	
	Возврат ЕстьНеАссортимент;
	
КонецФункции

#КонецОбласти


#Область АвтоматическийЗаказ

&НаКлиенте
Процедура РасчетЗаказаСнековНаКлиенте(Команда)
	Отказ = Ложь;
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Объект.КоэффициентДней");
	ПроверяемыеРеквизиты.Добавить("ОтборНоменклатура");
	ПроверяемыеРеквизиты.Добавить("Объект.СкладыКомпании");
	
	ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты);
	
	Если Не Отказ Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("РасчетЗаказаСнековНаКлиентеПродолжение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Будут очищены строки таблиы ""Товары"". Продолжить?'; uk = 'Будуть очищені строки таблиці ""Товари"". Продовжити?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗаказаСнековНаКлиентеПродолжение(Результат, ДополнительныеПараметры) Экспорт 	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		РасчетЗаказаСнековНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РасчетЗаказаСнековНаСервере()	
	Объект.Товары.Очистить();
	
	КоличествоДней = (НачалоДня(РасчетКонец) - НачалоДня(РасчетНачало))/86400 + 1;
	
	ТаблицаПродаж = Новый ТаблицаЗначений;
	ТаблицаПродаж.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаПродаж.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПродаж.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	ТаблицаРезервов = Новый ТаблицаЗначений;
	ТаблицаРезервов.Колонки.Добавить("СкладКомпании", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаРезервов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезервов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	СписокТоваров = ОтборНоменклатура.Выгрузить();	
	СписокСкладов = Объект.СкладыКомпании.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата", РасчетНачало);
	Запрос.УстановитьПараметр("КонДата", КонецДня(РасчетКонец));
	Запрос.УстановитьПараметр("КоличествоДнейОстатка", Объект.КоэффициентДней);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокТоваров);
	Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов);
	Запрос.УстановитьПараметр("ТаблицаПродаж", ТаблицаПродаж);
	Запрос.УстановитьПараметр("ТаблицаРезервов", ТаблицаРезервов);
	Запрос.УстановитьПараметр("ПериодПродаж", КоличествоДней);	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&СписокНоменклатуры КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСкладов.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ Склады
	|ИЗ
	|	&СписокСкладов КАК СписокСкладов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзПродажи.СкладКомпании КАК СкладКомпании,
	|	тзПродажи.Номенклатура КАК Номенклатура,
	|	тзПродажи.Количество КАК Количество
	|ПОМЕСТИТЬ тзПродажи
	|ИЗ
	|	&ТаблицаПродаж КАК тзПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзРезервы.СкладКомпании КАК СкладКомпании,
	|	тзРезервы.Номенклатура КАК Номенклатура,
	|	тзРезервы.Количество КАК Количество
	|ПОМЕСТИТЬ тзРезервы
	|ИЗ
	|	&ТаблицаРезервов КАК тзРезервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.СкладКомпании КАК СкладКомпании,
	|	Склады.СкладКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
	|ПОМЕСТИТЬ ТоварыПоСкладам
	|ИЗ
	|	Товары КАК Товары,
	|	Склады КАК Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоСкладам.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТоварыПоСкладам.СкладКомпании КАК СкладКомпании,
	|	ТоварыПоСкладам.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ПараметрыСистемыЗаказов.ОстатокВитрина, 0) КАК ОстатокВитрина,
	|	ЕСТЬNULL(ПараметрыСистемыЗаказов.ОстатокПоДоговору, 0) КАК ОстатокПоДоговору,
	|	ВЫБОР
	|		КОГДА ПараметрыСистемыЗаказов.ЕдиницаЗаказа ЕСТЬ NULL
	|				ИЛИ ПараметрыСистемыЗаказов.ЕдиницаЗаказа = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ТоварыПоСкладам.ОсновнаяЕдиницаИзмерения
	|		ИНАЧЕ ПараметрыСистемыЗаказов.ЕдиницаЗаказа
	|	КОНЕЦ КАК ЕдиницаЗаказа,
	|	ЕСТЬNULL(ПараметрыСистемыЗаказов.МинимальныйОстаток, 0) КАК МинимальныйОстаток,
	|	ЕСТЬNULL(ПараметрыСистемыЗаказов.КвантПоставки, 0) КАК КвантПоставки,
	|	ЕСТЬNULL(ПараметрыСистемыЗаказов.МаксимальныйЗапас, 0) КАК МаксимальныйЗапас,
	|	ТоварыПоСкладам.ОсновнаяЕдиницаИзмерения КАК ЕдиницаПродаж
	|ПОМЕСТИТЬ ДопПараметры
	|ИЗ
	|	ТоварыПоСкладам КАК ТоварыПоСкладам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыСистемыЗаказов КАК ПараметрыСистемыЗаказов
	|		ПО ТоварыПоСкладам.СкладКомпании = ПараметрыСистемыЗаказов.ПодразделениеНазначения
	|			И ТоварыПоСкладам.Номенклатура = ПараметрыСистемыЗаказов.Номенклатура
	|			И (ПараметрыСистемыЗаказов.Порядок В
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(ПараметрыСистемыЗаказов.Порядок) КАК Порядок
	|				ИЗ
	|					РегистрСведений.ПараметрыСистемыЗаказов КАК ПараметрыСистемыЗаказов
	|				ГДЕ
	|					ПараметрыСистемыЗаказов.ПодразделениеНазначения = ТоварыПоСкладам.СкладКомпании
	|					И ПараметрыСистемыЗаказов.Номенклатура = ТоварыПоСкладам.Номенклатура
	|					И &КонДата МЕЖДУ ПараметрыСистемыЗаказов.НачалоДействия И ПараметрыСистемыЗаказов.КонецДействия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.СкладКомпании КАК СкладКомпании,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Остаток - ВложенныйЗапрос.Резерв - ВложенныйЗапрос.ОперПродажи КАК ОстаткоРеальный,
	|	ВложенныйЗапрос.Продажи + ВложенныйЗапрос.ОперПродажи КАК Продажи,
	|	ВложенныйЗапрос.КвоТриДня + ВложенныйЗапрос.ОперПродажи КАК КвоТриДня,
	|	ВложенныйЗапрос.ОперПродажи КАК ОперПродажи
	|ПОМЕСТИТЬ ОстаткиПродажи
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыПоСкладам.СкладКомпании КАК СкладКомпании,
	|		ТоварыПоСкладам.Номенклатура КАК Номенклатура,
	|		ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Остаток,
	|		ЕСТЬNULL(ПродажиОбороты1.КоличествоОборот, 0) КАК Продажи,
	|		ЕСТЬNULL(ПродажиОбороты2.КоличествоОборот, 0) КАК КвоТриДня,
	|		ЕСТЬNULL(тзПродажи.Количество, 0) КАК ОперПродажи,
	|		ЕСТЬNULL(тзРезервы.Количество, 0) КАК Резерв
	|	ИЗ
	|		ТоварыПоСкладам КАК ТоварыПоСкладам
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&КонДата, ) КАК ОстаткиТоваровКомпанииОстатки
	|			ПО ТоварыПоСкладам.СкладКомпании = ОстаткиТоваровКомпанииОстатки.СкладКомпании
	|				И ТоварыПоСкладам.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачДата, &КонДата, , ) КАК ПродажиОбороты1
	|			ПО ТоварыПоСкладам.СкладКомпании = ПродажиОбороты1.СкладКомпании
	|				И ТоварыПоСкладам.Номенклатура = ПродажиОбороты1.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(ДОБАВИТЬКДАТЕ(&КонДата, ДЕНЬ, -3), &КонДата, , ) КАК ПродажиОбороты2
	|			ПО ТоварыПоСкладам.СкладКомпании = ПродажиОбороты2.СкладКомпании
	|				И ТоварыПоСкладам.Номенклатура = ПродажиОбороты2.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ тзПродажи КАК тзПродажи
	|			ПО ТоварыПоСкладам.СкладКомпании = тзПродажи.СкладКомпании
	|				И ТоварыПоСкладам.Номенклатура = тзПродажи.Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ тзРезервы КАК тзРезервы
	|			ПО ТоварыПоСкладам.СкладКомпании = тзРезервы.СкладКомпании
	|				И ТоварыПоСкладам.Номенклатура = тзРезервы.Номенклатура) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоСкладам.Номенклатура КАК Номенклатура,
	|	ТоварыПоСкладам.СкладКомпании КАК СкладКомпании,
	|	ДопПараметры.ЕдиницаЗаказа КАК ЕдиницаЗаказа,
	|	ДопПараметры.ЕдиницаЗаказа.Коэффициент КАК КоэффициентЗаказа,
	|	ЕСТЬNULL(ОстаткиПродажи.Продажи, 0) КАК Продажи,
	|	ЕСТЬNULL(ДопПараметры.ОстатокПоДоговору, 0) КАК ОстатокПоДоговору,
	|	ЕСТЬNULL(ДопПараметры.ОстатокВитрина, 0) КАК ОстатокВитрина,
	|	&КоличествоДнейОстатка КАК КоличествоДнейОстатка,
	|	ЕСТЬNULL(ОстаткиПродажи.ОстаткоРеальный, 0) КАК ОстатокРеальный,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиПродажи.Продажи, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиПродажи.Продажи / &ПериодПродаж
	|	КОНЕЦ КАК срПродажи,
	|	ЕСТЬNULL(ДопПараметры.МинимальныйОстаток, 0) КАК МинимальныйОстаток,
	|	ЕСТЬNULL(ДопПараметры.КвантПоставки, 0) КАК КвантПоставки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиПродажи.КвоТриДня, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОстаткиПродажи.КвоТриДня / 3
	|	КОНЕЦ КАК ПродажиТриДня,
	|	ДопПараметры.ЕдиницаПродаж КАК ЕдиницаПродаж,
	|	ОграничениеАссортиментаСрезПоследних.ВидАссортимента КАК ВидАссортимента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиПродажи.ОстаткоРеальный, 0) = 0
	|				И ЕСТЬNULL(ОстаткиПродажи.Продажи, 0) = 0
	|			ТОГДА ЕСТЬNULL(ДопПараметры.МинимальныйОстаток, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОстаткиПродажи.КвоТриДня, 0) <> 0
	|						И ОстаткиПродажи.КвоТриДня / 3 > ОстаткиПродажи.Продажи / &ПериодПродаж
	|					ТОГДА ВЫБОР
	|							КОГДА ОстаткиПродажи.ОстаткоРеальный - ЕСТЬNULL(ДопПараметры.ОстатокПоДоговору, 0) - ЕСТЬNULL(ДопПараметры.ОстатокВитрина, 0) - &КоличествоДнейОстатка * (ОстаткиПродажи.КвоТриДня / 3) < 0
	|								ТОГДА ОстаткиПродажи.ОстаткоРеальный - ЕСТЬNULL(ДопПараметры.ОстатокПоДоговору, 0) - ЕСТЬNULL(ДопПараметры.ОстатокВитрина, 0) - &КоличествоДнейОстатка * ОстаткиПродажи.КвоТриДня / 3 * -1
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ОстаткиПродажи.ОстаткоРеальный - ЕСТЬNULL(ДопПараметры.ОстатокПоДоговору, 0) - ЕСТЬNULL(ДопПараметры.ОстатокВитрина, 0) - &КоличествоДнейОстатка * (ОстаткиПродажи.Продажи / &ПериодПродаж) < 0
	|							ТОГДА ОстаткиПродажи.ОстаткоРеальный - ЕСТЬNULL(ДопПараметры.ОстатокПоДоговору, 0) - ЕСТЬNULL(ДопПараметры.ОстатокВитрина, 0) - &КоличествоДнейОстатка * ОстаткиПродажи.Продажи / &ПериодПродаж * -1
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	ТоварыПоСкладам КАК ТоварыПоСкладам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПродажи КАК ОстаткиПродажи
	|		ПО ТоварыПоСкладам.Номенклатура = ОстаткиПродажи.Номенклатура
	|			И ТоварыПоСкладам.СкладКомпании = ОстаткиПродажи.СкладКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопПараметры КАК ДопПараметры
	|		ПО ТоварыПоСкладам.Номенклатура = ДопПараметры.Номенклатура
	|			И ТоварыПоСкладам.СкладКомпании = ДопПараметры.СкладКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграничениеАссортимента.СрезПоследних(&КонДата, ) КАК ОграничениеАссортиментаСрезПоследних
	|		ПО ТоварыПоСкладам.Номенклатура = ОграничениеАссортиментаСрезПоследних.Номенклатура
	|			И ТоварыПоСкладам.ТорговаяПлощадка = ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка
	|			И (ОграничениеАссортиментаСрезПоследних.Состояние = 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	СкладКомпании";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Количество < Выборка.МинимальныйОстаток / 2 И Выборка.ОстатокРеальный < (Выборка.ОстатокВитрина + Выборка.ОстатокПоДоговору + 1) Тогда 
			Заказать = Выборка.МинимальныйОстаток;
		ИначеЕсли (Выборка.ОстатокРеальный - Выборка.ОстатокВитрина - Выборка.ОстатокПоДоговору)<=1 И Выборка.срПродажи >= Выборка.МинимальныйОстаток И Выборка.Количество <= Выборка.МинимальныйОстаток Тогда 
			Заказать = Выборка.МинимальныйОстаток * 2;
		Иначе
			Если Выборка.МинимальныйОстаток > 0 Тогда 
				Заказать = Окр(Выборка.Количество / Выборка.МинимальныйОстаток + 0.49999999) * Выборка.МинимальныйОстаток;
			Иначе				
				Заказать = Окр(Выборка.Количество + 0.49999999);
			КонецЕсли;
		КонецЕсли;
		
		Если Выборка.ОстатокРеальный <> 0 И Выборка.Продажи <> 0 И Выборка.ВидАссортимента = ПредопределенноеЗначение("Справочник.ВидыАссортимента.НовыйТовар") Тогда 			
			Заказать = Заказать * 1.5
		КонецЕсли;
		
		Заказать = ОкруглитьЗаказываемоеЗначение(Заказать, Выборка.КоэффициентЗаказа);
		
		Если Заказать = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаЗаказа = Объект.Товары.Добавить();
		НоваяСтрокаЗаказа.Номенклатура 		= Выборка.Номенклатура;
		НоваяСтрокаЗаказа.ЕдиницаИзмерения 	= Выборка.ЕденицаЗаказа;
		НоваяСтрокаЗаказа.Коэффициент 		= Выборка.КоэффициентЗаказа;
		НоваяСтрокаЗаказа.Количество 		= Заказать;
		НоваяСтрокаЗаказа.СкладКомпании 	= Выборка.СкладКомпании;
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
	ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
	
	СтруктураПолейДляЗаполненияЦен = Новый Структура;	
	СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));	
	СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);
	
	ЗаполнитьТаблицуЗаказовИзТЧТовары(Ложь);
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);	
КонецПроцедуры

&НаСервере
Функция ОкруглитьЗаказываемоеЗначение(Количество, КвантПоставки)
	Если Не ЗначениеЗаполнено(ПараметрыОкругления) ИЛИ ПараметрыОкругления = "НеОкруглять" Тогда 
		Возврат Количество;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Количество) Тогда 
		Количество = 0;
	КонецЕсли;
	
	Если ПараметрыОкругления = "ДробноеКоличествоВМеньшуюСторону" Тогда 
		Количество = Цел(Количество);
	ИначеЕсли ПараметрыОкругления = "ДробноеКоличествоВБольшуюСторону" Тогда 
		Количество = ?(Цел(Количество) = Количество, Количество, Цел(Количество) + 1);
	ИначеЕсли ПараметрыОкругления = "КвантПоставкиВМеньшуюСторону" И ЗначениеЗаполнено(КвантПоставки) Тогда
		Количество = Цел(Количество / КвантПоставки) * КвантПоставки;
	ИначеЕсли ПараметрыОкругления = "КвантПоставкиВБольшуюСторону" И ЗначениеЗаполнено(КвантПоставки) Тогда 
		Кол = (Количество / КвантПоставки);
		Количество = ?(Кол <> Цел(Кол), Цел(Кол) + 1, Кол) * КвантПоставки;
	КонецЕсли;
	
	Возврат Количество;
КонецФункции

&НаКлиенте
Процедура КомандаОчистить(Команда)
	ТаблицаЗаказов.Очистить();
	//Объект.Товары.Очистить();
	//Объект.СкладыКомпании.Очистить();
	СуммаДокумента = ТаблицаЗаказов.Итог("Сумма");
	СуммаНДС = ТаблицаЗаказов.Итог("СуммаНДС");
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьТовар(Команда)
	ЗаполнитьПоСписку("Номенклатура");
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСкладПоСписку(Команда)
	ЗаполнитьПоСписку("СкладКомпании");
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСкладПоМатрице(Команда)
	СписокМатриц = ПолучитьСписокМатриц();
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);	
	СписокМатриц.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов,"Выберите нужные матрицы");
КонецПроцедуры

&НаСервере
Процедура ДобавитьСкладПоМаршруту(Маршрут)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпании.Ссылка КАК Склад,
	|	СкладыКомпании.Подразделение КАК Подразделение,
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	|ГДЕ
	|	СкладыКомпании.Маршрут = &Маршрут
	|	И НЕ СкладыКомпании.ПометкаУдаления
	|	И СкладыКомпании.Подразделение = &Подразделение
	|	И ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация = &Организация
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если Маршрут = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"= &Маршрут","> 0");
	Иначе
		Запрос.УстановитьПараметр("Маршрут", Маршрут);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Объект.СкладыКомпании.НайтиСтроки(Новый Структура("СкладКомпании",ВыборкаДетальныеЗаписи.Склад)).Количество() = 0 Тогда
				СтрокаТЧ = Объект.СкладыКомпании.Добавить();
				СтрокаТЧ.СкладКомпании = ВыборкаДетальныеЗаписи.Склад;
				СтрокаТЧ.НаименованиеСклада =  СокрЛП(ВыборкаДетальныеЗаписи.Склад.Наименование);		
				СтрокаТЧ.ИмяПоля = "скл" + СтрЗаменить(НРег(Строка(ВыборкаДетальныеЗаписи.Склад.УникальныйИдентификатор())), "-", "");
			КонецЕсли;
		КонецЦикла;
		СкладыКомпанииПриИзмененииНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такие склады не найдены!!!");
	КонецЕсли;
	СкладыКомпанииПриИзмененииНаСервере();
	//Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСкладПоМаршруту(Команда)
	Подсказка = "Введите маршрут, если 0, то всеми";
	Число = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧисла", ЭтаФорма,"СкладКомпании");
	ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбъединитьЗаказы(Команда)
	Если Модифицированность Тогда
		Сообщить("Необходимо записать документ!",СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыПодбора,,,,,Новый ОписаниеОповещения("ОбъединениеЗаказов",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Заголовок="Выберите заказ для объединения";
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьТекущийДляВсех(Команда)
	ТекущаяСтрока=Элементы.ТаблицаЗаказов.ТекущиеДанные;
	ИмяКолонки = Элементы.ТаблицаЗаказов.ТекущийЭлемент.Имя;
	ТекущееЗначение=ТекущаяСтрока[ИмяКолонки];
	Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
		ТекущаяСтрока[СтрокаТЧ.ИмяПоля] = ТекущееЗначение;
	КонецЦикла;
	
	ТаблицаЗаказовКоличествоПриИзменении(Неопределено);
	
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСписку(Данные,Коэффициент=0)
	Подсказка = "Введите новый код с новой строки";
	Строка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма,Новый Структура("Справочник,Коэффициент",Данные,Коэффициент));
	ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка,,Истина);
КонецПроцедуры

&НаСервере
Процедура ВводСтроки(ПолученноеЗначение, Данные) Экспорт
	
	Если Данные.Справочник = "Номенклатура" Или Данные.Справочник = "коэффициент_А" Тогда	
		Если Данные.Справочник = "коэффициент_А" Тогда
			СпТовара = Новый СписокЗначений;
		КонецЕсли;
		
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",зн);
			Если Элем = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
				Сообщить("Номенклатура не найдена, артикул: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа номенклатуры '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			
			Если Данные.Справочник = "Номенклатура" И ТаблицаЗаказов.НайтиСтроки(Новый Структура(Данные.Справочник,Элем)).Количество() = 0 Тогда
				СтрокаТЧ = ТаблицаЗаказов.Добавить();
				СтрокаТЧ.Номенклатура = Элем;
				СтруктураДействий = Новый Структура;	
				СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", СтрокаТЧ.ЕдиницаИзмерения);
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
				
				СтруктураПолейДляЗаполненияЦен = Новый Структура;	
				СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));
				
				СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
				
				ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
				
				ПересчитатьКоличествоПоСтроке(СтрокаТЧ, СоответствиеИменПолейСкладов);
				
				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);	
				
				АналогичныйРотируемый =	АналогичныйРотируемыйТовар(Элем);
				СтрокаТЧ.Аналогичный =	АналогичныйРотируемый.Аналогичный;
				СтрокаТЧ.Ротируемый =	АналогичныйРотируемый.Ротируемый;
				
			ИначеЕсли Данные.Справочник = "коэффициент_А" И СпТовара.НайтиПоЗначению(Элем) = Неопределено Тогда
				СпТовара.Добавить(Элем);	
			КонецЕсли;
		КонецЦикла;
		Если Данные.Справочник = "коэффициент_А" Тогда
			ПересчитатьТоварПоКоэффициенту(Данные.Коэффициент,СпТовара);
		КонецЕсли;
		
	ИначеЕсли Данные.Справочник = "СкладКомпании" Тогда
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.СкладыКомпании.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа склада '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			//Если Элем.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
			//	Сообщить("Торговая площадка не заполнена у склада: " +Элем);
			//	Продолжить;
			//КонецЕсли;
			
			Если Элем.Подразделение <> Объект.ПодразделениеКомпании Тогда
				Сообщить("Подразделение склада /"+Элем+"/ отличается от подразделения документа!!!");
				Продолжить;
			КонецЕсли;
			
			Если РегистрыСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ТорговаяПлощадка",Элем.ТорговаяПлощадка)).Организация <> Объект.Организация Тогда
				Сообщить("Организация склада /"+Элем+"/ отличается от организации документа!!!");
				Продолжить;
			КонецЕсли;
			
			Если Объект.СкладыКомпании.НайтиСтроки(Новый Структура(Данные.Справочник,Элем)).Количество() = 0 Тогда
				СтрокаТЧ = Объект.СкладыКомпании.Добавить();
				СтрокаТЧ.СкладКомпании = Элем;
				СтрокаТЧ.НаименованиеСклада =  СокрЛП(Элем.Наименование);		
				СтрокаТЧ.ИмяПоля = "скл" + СтрЗаменить(НРег(Строка(Элем.УникальныйИдентификатор())), "-", "");
			КонецЕсли;
		КонецЦикла;
		СкладыКомпанииПриИзмененииНаСервере();
		
	ИначеЕсли Данные.Справочник = "коэффициент_М" Тогда
		
		СпМарок = Новый СписокЗначений;
		
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.ТоварныеМарки.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.ТоварныеМарки.ПустаяСсылка") Тогда
				Сообщить("Товарная марка не найдена, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа товарной маки '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			
			Если СпМарок.НайтиПоЗначению(Элем) = Неопределено Тогда
				СпМарок.Добавить(Элем);	
			КонецЕсли;
		КонецЦикла;
		
		ПересчитатьМаркиПоКоэффициенту(Данные.Коэффициент,СпМарок);
		
	ИначеЕсли Данные.Справочник = "коэффициент_С" Тогда
		
		СпСкладов = Новый СписокЗначений;
		
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.СкладыКомпании.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа складов '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			
			Если СпСкладов.НайтиПоЗначению(Элем) = Неопределено Тогда
				СпСкладов.Добавить(Элем);	
			КонецЕсли;
		КонецЦикла;
		
		ПересчитатьСкладыПоКоэффициенту(Данные.Коэффициент,СпСкладов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЧисла(ПолученноеЗначение, Справочник) Экспорт
	
	Если Справочник = "СкладКомпании" Тогда
		ДобавитьСкладПоМаршруту(ПолученноеЗначение);
	ИначеЕсли Справочник = "коэффициент" Тогда
		Если ПолученноеЗначение = 0 Или ПолученноеЗначение = 1 Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьПоКоэффициенту(ПолученноеЗначение);
	ИначеЕсли Справочник = "коэффициент_А" Или Справочник = "коэффициент_М" Или Справочник = "коэффициент_С" Тогда
		Если ПолученноеЗначение = 0 Или ПолученноеЗначение = 1 Тогда
			Возврат;
		КонецЕсли;
		ЗаполнитьПоСписку(Справочник,ПолученноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкладыИзМатрицыНаСервере(ВыбранныеМатрицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКомпании.Ссылка КАК Склад,
	|	СкладыКомпании.Подразделение КАК Подразделение,
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация КАК Организация
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.СрезПоследних КАК ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних
	|		ПО СкладыКомпании.ТорговаяПлощадка = ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.ТорговаяПлощадка
	|ГДЕ
	|	СкладыКомпании.АссортиментнаяМатрица В(&АссортиментнаяМатрица)
	|	И НЕ СкладыКомпании.ПометкаУдаления
	|	И СкладыКомпании.Маршрут > 0
	|	И СкладыКомпании.Подразделение = &Подразделение
	|	И ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ТК_УчетнаяПолитикаТорговыхПлощадокСрезПоследних.Организация,
	|	СкладыКомпании.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("АссортиментнаяМатрица", ВыбранныеМатрицы);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Объект.СкладыКомпании.НайтиСтроки(Новый Структура("СкладКомпании",ВыборкаДетальныеЗаписи.Склад)).Количество() = 0 Тогда
				СтрокаТЧ = Объект.СкладыКомпании.Добавить();
				СтрокаТЧ.СкладКомпании = ВыборкаДетальныеЗаписи.Склад;
				СтрокаТЧ.НаименованиеСклада =  СокрЛП(ВыборкаДетальныеЗаписи.Склад.Наименование);		
				СтрокаТЧ.ИмяПоля = "скл" + СтрЗаменить(НРег(Строка(ВыборкаДетальныеЗаписи.Склад.УникальныйИдентификатор())), "-", "");
			КонецЕсли;
		КонецЦикла;
		СкладыКомпанииПриИзмененииНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такие склады не найдены!!!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМатриц()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АссортиментнаяМатрица.Ссылка КАК Матрица
	|ИЗ
	|	Справочник.АссортиментнаяМатрица КАК АссортиментнаяМатрица
	|ГДЕ
	|	НЕ АссортиментнаяМатрица.ПометкаУдаления
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//создадим список значений
	СписокМатриц = Новый СписокЗначений;
	//загрузим значения колонки
	СписокМатриц.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Матрица"));
	Возврат СписокМатриц;
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
	
	Если Элементы <> Неопределено Тогда
		ВыбранныеМатрицы = Новый СписокЗначений;
		Для Каждого Элемент из Элементы Цикл
			Если Элемент.Пометка Тогда
				ВыбранныеМатрицы.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыбранныеМатрицы) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Надо было выбрать хоть что-то!!!");
		Возврат;
	КонецЕсли;
	
	СкладыИзМатрицыНаСервере(ВыбранныеМатрицы);	
	
КонецПроцедуры

&НаСервере
Процедура ОбъединениеЗаказов(Заказы,Параметр) Экспорт
	Если НЕ ЗначениеЗаполнено(Заказы) Тогда 
		Возврат;
	КонецЕсли;
	
	Заказы.Добавить(Объект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.СкладКомпании КАК СкладКомпании,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоБазовое) КАК Количество,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоБазовое) КАК КоличествоБазовое
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПоставщикуТовары.СкладКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладКомпании,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Заказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаТоваров = РезультатЗапроса.Выгрузить();
	
	Объект.Товары.Загрузить(ТаблицаТоваров);
	
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуБезНДС");
	
	СтруктураПолейДляЗаполненияЦен = Новый Структура;	
	СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));
	
	СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.СкладыКомпании.Очистить();
	
	Пока Выборка.СледующийПоЗначениюПоля("СкладКомпании") Цикл
		строка = Объект.СкладыКомпании.Добавить();	
		строка.СкладКомпании = Выборка.СкладКомпании;
		строка.НаименованиеСклада =  СокрЛП(Выборка.СкладКомпании.Наименование);		
		строка.ИмяПоля = "скл" + СтрЗаменить(НРег(Строка(Выборка.СкладКомпании.УникальныйИдентификатор())), "-", "");
	КонецЦикла;	
	
	ОбновитьЗаполнитьСоответствиеИменПолейСкладов();
	
	ЗаполнитьТаблицуЗаказовИзТЧТовары(Ложь);
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьОстаткиРЦНаСервере()
	Объект.ДатаОстатковРЦ = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|	
	|ПОМЕСТИТЬ втТаблицаЗаказов
	|ИЗ
	|	&ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Остаток) КАК Остаток
	|ПОМЕСТИТЬ втОстаткиРЦ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|				&НаДату,
	|				СкладКомпании В (&СкладКомпании)
	|					И Номенклатура В (&Номенклатура)) КАК ОстаткиТоваровКомпанииОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОстаткиТоваровКомпанииОстатки.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыТоваровОстатки.Номенклатура,
	|		СУММА(-РезервыТоваровОстатки.РезервОстаток)
	|	ИЗ
	|		РегистрНакопления.РезервыТоваров.Остатки(
	|				&НаДату,
	|				Склад В (&СкладКомпании)
	|					И Номенклатура В (&Номенклатура)) КАК РезервыТоваровОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РезервыТоваровОстатки.Номенклатура) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаЗаказов.*,
	|	втОстаткиРЦ.Остаток КАК ОстатокРЦ
	|ИЗ
	|	втТаблицаЗаказов КАК втТаблицаЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиРЦ КАК втОстаткиРЦ
	|		ПО втТаблицаЗаказов.Номенклатура = втОстаткиРЦ.Номенклатура";
	
	
	
	Запрос.УстановитьПараметр("НаДату", Объект.ДатаОстатковРЦ);
	Запрос.УстановитьПараметр("СкладКомпании", СкладРЦ);
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов.Выгрузить());
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТаблицаЗаказов.Загрузить(РезультатЗапроса.Выгрузить());	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьОстаткиРЦ(Команда)
	КомандаПолучитьОстаткиРЦНаСервере();
	Элементы.ДатаОстатковРЦ.Видимость = ЗначениеЗаполнено(Объект.ДатаОстатковРЦ);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкладРЦПриИзменении(Элемент)
	Элементы.КомандаПолучитьОстаткиРЦ.Видимость = ЗначениеЗаполнено(СкладРЦ);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номенклатура",ВыбранноеЗначение)).Количество()>0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура "+ВыбранноеЗначение+" уже есть в табличной части");
		ТаблицаЗаказов.Удалить(ТаблицаЗаказов.Количество()-1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладыКомпанииСкладКомпанииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.СкладыКомпании.НайтиСтроки(Новый Структура("СкладКомпании",ВыбранноеЗначение)).Количество()>0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Склад "+ВыбранноеЗначение+" уже есть в табличной части");
		Объект.СкладыКомпании.Удалить(Объект.СкладыКомпании.Количество()-1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЕдиницаИзмерения) Тогда
		Сообщить("Установите единицу измерения!!!"); 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры               

&НаСервере
// округляет рассчитанные значения в соответствии с параметрами округления
Функция ОкруглитьЗаказываемоеЗначениеНовое(Знач Заказать,КвантПоставки,ВариантОкругления,Упаковка)
	
	Если НЕ ЗначениеЗаполнено(ВариантОкругления)
		ИЛИ ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.НеОкруглять Тогда
		Возврат Заказать;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Заказать) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.ДробноеКоличествоВМеньшуюСторону Тогда
		Заказать = Цел(Заказать);
	ИначеЕсли ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.ДробноеКоличествоВБольшуюСторону Тогда
		Заказать = ?(Цел(Заказать) = Заказать,Заказать,Цел(Заказать)+1);
	ИначеЕсли ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВМеньшуюСторону И ЗначениеЗаполнено(КвантПоставки) Тогда
		Заказать = Цел(Заказать/КвантПоставки)*КвантПоставки;
	ИначеЕсли ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону И ЗначениеЗаполнено(КвантПоставки) Тогда
		Кол = (Заказать/КвантПоставки);
		Заказать = ?(Кол<>Цел(Кол),Цел(Кол)+1,Кол)*КвантПоставки;
	ИначеЕсли ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.БольшеПоловиныУпаковкиВБольшуюСторону Тогда
		КвантПоставкиВБольшуюСторону = Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону;
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Если Заказать > Цел(Упаковка / 2) Тогда
				Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,Упаковка,КвантПоставкиВБольшуюСторону,Упаковка);
			Иначе
				Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,КвантПоставки,КвантПоставкиВБольшуюСторону,Упаковка);
			КонецЕсли;
		Иначе
			Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,КвантПоставки,КвантПоставкиВБольшуюСторону,Упаковка);
		КонецЕсли;
		//ИначеЕсли ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.БольшеПоловиныУпаковкиВБольшуюСторону Тогда
		//	Если ЗначениеЗаполнено(Упаковка) Тогда
		//		//Если КвантПоставки > 1 Тогда
		//		//	Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,КвантПоставки,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,Упаковка);
		//		//КонецЕсли;
		//		КУпаковки = Заказать/Упаковка;
		//		КПачки = Окр(Упаковка * (КУпаковки - Цел(КУпаковки)),3,1);
		//		Если КПачки > Цел(Упаковка / 2) Тогда
		//			Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,Упаковка,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,Упаковка)
		//		Иначе
		//			//Заказать = Упаковка * Цел(КУпаковки) + ?(КвантПоставки = 1,ОкруглитьЗаказываемоеЗначениеНовое(КПачки,КвантПоставки,Перечисления.ВариантыОкругленияКоличества.ДробноеКоличествоВБольшуюСторону,Упаковка),0);
		//			Заказать = Упаковка * Цел(КУпаковки) + ОкруглитьЗаказываемоеЗначениеНовое(КПачки,КвантПоставки,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,Упаковка);
		//		КонецЕсли;
		//	Иначе
		//		Заказать = ОкруглитьЗаказываемоеЗначениеНовое(Заказать,КвантПоставки,Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону,Упаковка)
		//	КонецЕсли;
	КонецЕсли;
	
	Возврат Заказать;
	
КонецФункции

&НаСервере
Процедура ПересчитатьПоКоэффициенту(Коэффициент)
	
	//ТаблицаГруппыАБЦ = РасчитатьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	ТаблицаГруппыАБЦ = ПолучитьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"),ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ВЫБОР
	|		КОГДА ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВариантОкругления = ЗНАЧЕНИЕ(Перечисление.ВариантыОкругленияКоличества.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону)
	|		ИНАЧЕ ЕСТЬNULL(ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВариантОкругления, ЗНАЧЕНИЕ(Перечисление.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону))
	|	КОНЕЦ КАК ВариантОкругления,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.КвантПоставки КАК КвантПоставки
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В (&Номенклатура)
	|				И ТорговаяПлощадка В
	|					(ВЫБРАТЬ
	|						СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|					ИЗ
	|						Справочник.СкладыКомпании КАК СкладыКомпании
	|					ГДЕ
	|						СкладыКомпании.Ссылка В (&Склады))) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату",Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("Склады", Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзКванты = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаЗаказов Цикл
		Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
			Если Строка[СтрокаТЧ.ИмяПоля] > 0 Тогда
				//мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнойАртикул),Строка.Номенклатура.ОсновнойАртикул,Строка.Номенклатура),СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
				мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяТочка,ГруппаАБЦ",Строка.Номенклатура,СтрокаТЧ.СкладКомпании,"A"));
				Если мГруппыАБЦ.Количество()>0 Тогда
					КвантПоставки = 1;
					ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону;
					мКванты = тзКванты.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",Строка.Номенклатура,СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
					Если мКванты.Количество()>0 Тогда
						КвантПоставки = мКванты[0].КвантПоставки;
						ВариантОкругления = мКванты[0].ВариантОкругления;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(КвантПоставки) Тогда
						КвантПоставки = 1;
					КонецЕсли;
					//Если Не ЗначениеЗаполнено(ВариантОкругления) Тогда
					//	ВариантОкругления = Перечисления.ВариантыОкругленияКоличества.КвантПоставкиВБольшуюСторону;
					//КонецЕсли;
					Количество = Строка[СтрокаТЧ.ИмяПоля] * Коэффициент;
					//КоличествоОкругленное = ОкруглитьЗаказываемоеЗначениеНовое(Количество,КвантПоставки,ВариантОкругления,?(КвантПоставки = 1,Строка.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент,КвантПоставки));
					КоличествоОкругленное = ОкруглитьЗаказываемоеЗначениеНовое(Количество,КвантПоставки,ВариантОкругления,Строка.Номенклатура.ЕдиницаИзмеренияУпаковки.Коэффициент);
					Строка[СтрокаТЧ.ИмяПоля] = КоличествоОкругленное;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ПересчитатьКоличествоПоСтроке(Строка, СоответствиеИменПолейСкладов);
		
		СтруктураДействий = Новый Структура;	
		ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);	
		
	КонецЦикла;
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТоварПоКоэффициенту(Коэффициент,Товар)
	
	//ТаблицаГруппыАБЦ = РасчитатьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	//ТаблицаГруппыАБЦ = ПолучитьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"),ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.КвантПоставки КАК КвантПоставки
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В (&Номенклатура)
	|				И ТорговаяПлощадка В
	|					(ВЫБРАТЬ
	|						СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|					ИЗ
	|						Справочник.СкладыКомпании КАК СкладыКомпании
	|					ГДЕ
	|						СкладыКомпании.Ссылка В (&Склады))) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату",Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Запрос.УстановитьПараметр("Склады", Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзКванты = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка ИЗ Товар Цикл
		Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
			//мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнойАртикул),Строка.Номенклатура.ОсновнойАртикул,Строка.Номенклатура),СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
			//мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяТочка,ГруппаАБЦ",Строка.Номенклатура,СтрокаТЧ.СкладКомпании,"A"));
			//Если мГруппыАБЦ.Количество()>0 Тогда
			мСтрока = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номенклатура",Строка.Значение));
			Если мСтрока.Количество()>0 Тогда
				Если мСтрока[0][СтрокаТЧ.ИмяПоля] > 0 Тогда
					КвантПоставки = 1;
					мКванты = тзКванты.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",Строка.Значение,СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
					Если мКванты.Количество()>0 Тогда
						КвантПоставки = мКванты[0].КвантПоставки;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(КвантПоставки) Тогда
						КвантПоставки = 1;
					КонецЕсли;
					мСтрока[0][СтрокаТЧ.ИмяПоля] = Окр(мСтрока[0][СтрокаТЧ.ИмяПоля] * Коэффициент / КвантПоставки) * КвантПоставки;
				КонецЕсли;
				//КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ПересчитатьКоличествоПоСтроке(мСтрока[0], СоответствиеИменПолейСкладов);
		
		СтруктураДействий = Новый Структура;	
		ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(мСтрока[0], СтруктураДействий, Неопределено);	
		
	КонецЦикла;
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьМаркиПоКоэффициенту(Коэффициент,Марки)
	
	//ТаблицаГруппыАБЦ = РасчитатьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	ТаблицаГруппыАБЦ = ПолучитьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"),ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.КвантПоставки КАК КвантПоставки
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В (&Номенклатура)
	|			и Номенклатура.ТоварнаяМарка В (&ТоварнаяМарка)
	|				И ТорговаяПлощадка В
	|					(ВЫБРАТЬ
	|						СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|					ИЗ
	|						Справочник.СкладыКомпании КАК СкладыКомпании
	|					ГДЕ
	|						СкладыКомпании.Ссылка В (&Склады))) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату",Объект.Дата);
	Запрос.УстановитьПараметр("ТоварнаяМарка", Марки);
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("Склады", Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	
	РезультатЗапроса = Запрос.Выполнить();
	тзКванты = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаЗаказов Цикл
		Если Марки.НайтиПоЗначению(Строка.Номенклатура.ТоварнаяМарка)<> Неопределено Тогда
			Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
				Если Строка[СтрокаТЧ.ИмяПоля] > 0 Тогда
					//мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнойАртикул),Строка.Номенклатура.ОсновнойАртикул,Строка.Номенклатура),СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
					мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяТочка,ГруппаАБЦ",Строка.Номенклатура,СтрокаТЧ.СкладКомпании,"A"));
					Если мГруппыАБЦ.Количество()>0 Тогда
						КвантПоставки = 1;
						мКванты = тзКванты.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",Строка.Номенклатура,СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
						Если мКванты.Количество()>0 Тогда
							КвантПоставки = мКванты[0].КвантПоставки;
							//Иначе
							//	КвантПоставки = 1;
						КонецЕсли;
						Если Не ЗначениеЗаполнено(КвантПоставки) Тогда
							КвантПоставки = 1;
						КонецЕсли;
						
						Строка[СтрокаТЧ.ИмяПоля] = Окр(Строка[СтрокаТЧ.ИмяПоля] * Коэффициент / КвантПоставки) * КвантПоставки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПересчитатьКоличествоПоСтроке(Строка, СоответствиеИменПолейСкладов);
		
		СтруктураДействий = Новый Структура;	
		ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);	
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСкладыПоКоэффициенту(Коэффициент,Склады)
	
	//ТаблицаГруппыАБЦ = РасчитатьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	ТаблицаГруппыАБЦ = ПолучитьАнализАБЦ(Объект.Дата,Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"),ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.КвантПоставки КАК КвантПоставки
	|ИЗ
	|	РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Номенклатура В (&Номенклатура)
	|				И ТорговаяПлощадка В
	|					(ВЫБРАТЬ
	|						СкладыКомпании.ТорговаяПлощадка КАК ТорговаяПлощадка
	|					ИЗ
	|						Справочник.СкладыКомпании КАК СкладыКомпании
	|					ГДЕ
	|						СкладыКомпании.Ссылка В (&Склады))) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату",Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("Склады", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	тзКванты = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаЗаказов Цикл
		Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
			Если Склады.НайтиПоЗначению(СтрокаТЧ.СкладКомпании)<> Неопределено Тогда
				Если Строка[СтрокаТЧ.ИмяПоля] > 0 Тогда
					//мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",?(ЗначениеЗаполнено(Строка.Номенклатура.ОсновнойАртикул),Строка.Номенклатура.ОсновнойАртикул,Строка.Номенклатура),СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
					мГруппыАБЦ = ТаблицаГруппыАБЦ.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяТочка,ГруппаАБЦ",Строка.Номенклатура,СтрокаТЧ.СкладКомпании,"A"));
					Если мГруппыАБЦ.Количество()>0 Тогда
						КвантПоставки = 1;
						мКванты = тзКванты.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяПлощадка",Строка.Номенклатура,СтрокаТЧ.СкладКомпании.ТорговаяПлощадка));
						Если мКванты.Количество()>0 Тогда
							КвантПоставки = мКванты[0].КвантПоставки;
							//Иначе
							//	КвантПоставки = 1;
						КонецЕсли;
						Если Не ЗначениеЗаполнено(КвантПоставки) Тогда
							КвантПоставки = 1;
						КонецЕсли;
						
						Строка[СтрокаТЧ.ИмяПоля] = Окр(Строка[СтрокаТЧ.ИмяПоля] * Коэффициент / КвантПоставки) * КвантПоставки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПересчитатьКоличествоПоСтроке(Строка, СоответствиеИменПолейСкладов);
		
		СтруктураДействий = Новый Структура;	
		ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);	
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность=Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьПоКоэффициенту(Команда)
	Подсказка = "Коэффициент сезонности";
	Число = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧисла", ЭтаФорма,"коэффициент");
	ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьТоварПоКоэффициенту(Команда)
	Подсказка = "Коэффициент акции";
	Число = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧисла", ЭтаФорма,"коэффициент_А");
	ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьМаркиПоКоэффициенту(Команда)
	Подсказка = "Коэффициент";
	Число = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧисла", ЭтаФорма,"коэффициент_М");
	ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьСкладыПоКоэффициенту(Команда)
	Подсказка = "Коэффициент";
	Число = 0;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводЧисла", ЭтаФорма,"коэффициент_С");
	ПоказатьВводЧисла(ОписаниеОповещения, Число, Подсказка);
КонецПроцедуры

&НаСервере
Функция ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент) 
	ПоследняяСтрока = ТабДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабДокумент.ШиринаТаблицы;
	ОбластьЯчеек = ТабДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка); 
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	// Создаем объект для интеллектуального построения отчетов,
	// указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	// Результат выгружаем в таблицу значений.
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	Возврат ТабЗначений
КонецФункции

&НаСервере
Функция ПолучитьЗначение(ИмяКолонки, Значение) 
	
	Если ИмяКолонки = "Номенклатура" тогда
		ПолученноеЗначение = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Значение);
	ИначеЕсли ИмяКолонки = "СкладКомпании" тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Значение);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если  РезультатЗапроса.Пустой() Тогда
			ПолученноеЗначение = Справочники.СкладыКомпании.ПустаяСсылка();
		Иначе	
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ПолученноеЗначение  = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
	Иначе
		ПолученноеЗначение = Значение;
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
КонецФункции	

&НаСервере
Процедура КомандаЗагрузитьИзТаблицыНаСервере()
	Если ПоШтрихкоду Тогда
		ТзТп = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокШтрих);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ШтрихКод КАК ШтрихКод,
		|	ТЗ.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Наименование КАК Наименование,
		|	ВТ.ШтрихКод КАК ШтрихКод,
		|	ВТ.Количество КАК Количество,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Номенклатура ЕСТЬ NULL КАК НеНайдено
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ.ШтрихКод = ШтрихкодыНоменклатуры.Штрихкод";
		
		Запрос.УстановитьПараметр("ТЗ", ТзТп);
		РезультатЗапроса = Запрос.Выполнить();
		РезультатЗапроса.Выгрузить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.НеНайдено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У "+Выборка.Наименование+" по штрихкоду "+Выборка.ШтрихКод+" номенклатура не найдена!!!");
			Иначе
				Если ТаблицаЗаказов.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура)).Количество() = 0 Тогда
					СтрокаТЧ = ТаблицаЗаказов.Добавить();
					СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
					Для Каждого СтрокаСклады ИЗ Объект.СкладыКомпании Цикл
						СтрокаТЧ[СтрокаСклады.ИмяПоля] = Выборка.Количество;
					КонецЦикла;
					СтруктураДействий = Новый Структура;	
					СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", СтрокаТЧ.ЕдиницаИзмерения);
					СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
					
					СтруктураПолейДляЗаполненияЦен = Новый Структура;	
					СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));
					
					СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
					
					ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
					
					ПересчитатьКоличествоПоСтроке(СтрокаТЧ, СоответствиеИменПолейСкладов);
					
					ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);	
					
					АналогичныйРотируемый =	АналогичныйРотируемыйТовар(Выборка.Номенклатура);
					СтрокаТЧ.Аналогичный =	АналогичныйРотируемый.Аналогичный;
					СтрокаТЧ.Ротируемый =	АналогичныйРотируемый.Ротируемый;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ТзТп = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДок);
		Для каждого ТекСтрока из ТзТп Цикл
			
			СкладКомпании = ПолучитьЗначение("СкладКомпании",ТекСтрока.Код);
			Если СкладКомпании = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +ТекСтрока.Код);
				Продолжить;
			КонецЕсли;
			
			Если СкладКомпании.ЭтоГруппа Тогда
				Сообщить("Введена группа склада '"+СкладКомпании+"'");
				Продолжить;
			КонецЕсли;
			
			Если СкладКомпании.Подразделение <> Объект.ПодразделениеКомпании Тогда
				Сообщить("Подразделение склада /"+СкладКомпании+"/ отличается от подразделения документа!!!");
				Продолжить;
			КонецЕсли;
			
			Если РегистрыСведений.ТК_УчетнаяПолитикаТорговыхПлощадок.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ТорговаяПлощадка",СкладКомпании.ТорговаяПлощадка)).Организация <> Объект.Организация Тогда
				Сообщить("Организация склада /"+СкладКомпании+"/ отличается от организации документа!!!");
				Продолжить;
			КонецЕсли;
			
			Номенклатура = ПолучитьЗначение("Номенклатура",ТекСтрока.Артикул);
			
			Если Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
				Сообщить("Номенклатура не найдена, артикул: " +ТекСтрока.Артикул);
				Продолжить;
			КонецЕсли;
			
			Если Номенклатура.ЭтоГруппа Тогда
				Сообщить("Введена группа номенклатуры '"+Номенклатура+"'");
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.СкладКомпании = СкладКомпании;
			НоваяСтрока.Количество = ПолучитьЗначение("Переместить",ТекСтрока.Переместить);
			
			СтруктураДействий = Новый Структура;	
			СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", НоваяСтрока.ЕдиницаИзмерения);
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
			
			СтруктураПолейДляЗаполненияЦен = Новый Структура;	
			СтруктураПолейДляЗаполненияЦен.Вставить("Цена", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПараметровЗаполненияЦен(Объект, "СогласованиеЦен"));
			
			СтруктураДействий.Вставить("ЗаполнитьЦены", СтруктураПолейДляЗаполненияЦен);		
			
			ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);	
			
			Если Объект.СкладыКомпании.НайтиСтроки(Новый Структура("СкладКомпании",СкладКомпании)).Количество() = 0 Тогда
				СкладСтрока = Объект.СкладыКомпании.Добавить();
				СкладСтрока.СкладКомпании = СкладКомпании;
				СкладСтрока.НаименованиеСклада =  СокрЛП(СкладКомпании.Наименование);		
				СкладСтрока.ИмяПоля = "скл" + СтрЗаменить(НРег(Строка(СкладКомпании.УникальныйИдентификатор())), "-", "");
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьТаблицуЗаказовИзТЧТовары(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьИзТаблицы(Команда)
	Если Элементы.СтраницаПрочее.Видимость Тогда
		КомандаЗагрузитьИзТаблицыНаСервере();
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		Модифицированность = Истина;
	Иначе
		Элементы.СтраницаПрочее.Видимость = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПрочее;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоШтрихкодуПриИзменении(Элемент)
	Элементы.ТабДок.Видимость = НЕ ПоШтрихкоду;
	Элементы.ТабДокШтрих.Видимость = ПоШтрихкоду;
КонецПроцедуры

&НаСервере
Процедура КомандаОчиститьГруппуАВСНаСервере(ГруппыАВС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТК_РасcчитанныеПотребностиТовара.День КАК День,
	|	ТК_РасcчитанныеПотребностиТовара.Номенклатура КАК Номенклатура,
	|	ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка КАК ТорговаяТочка,
	|	ТК_РасcчитанныеПотребностиТовара.ГруппаАБЦ КАК ГруппаАБЦ,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВитринаОстаток КАК ВитринаОстаток,
	|	ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ПоДоговоруОстаток КАК ПоДоговоруОстаток,
	|	НЕ ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) <= ЕСТЬNULL(ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ПоДоговоруОстаток, 0) + ЕСТЬNULL(ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ВитринаОстаток, 0) КАК Очищать
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(ТК_РасcчитанныеПотребностиТовара.День) КАК День,
	|		ТК_РасcчитанныеПотребностиТовара.Номенклатура КАК Номенклатура,
	|		ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка КАК ТорговаяТочка
	|	ИЗ
	|		РегистрСведений.ТК_РасcчитанныеПотребностиТовара КАК ТК_РасcчитанныеПотребностиТовара
	|	ГДЕ
	|		ТК_РасcчитанныеПотребностиТовара.День <= &День
	|		И ТК_РасcчитанныеПотребностиТовара.Номенклатура В(&Номенклатура)
	|		И ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка В(&СкладКомпании)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТК_РасcчитанныеПотребностиТовара.Номенклатура,
	|		ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_РасcчитанныеПотребностиТовара КАК ТК_РасcчитанныеПотребностиТовара
	|		ПО ВложенныйЗапрос.День = ТК_РасcчитанныеПотребностиТовара.День
	|			И ВложенныйЗапрос.Номенклатура = ТК_РасcчитанныеПотребностиТовара.Номенклатура
	|			И ВложенныйЗапрос.ТорговаяТочка = ТК_РасcчитанныеПотребностиТовара.ТорговаяТочка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&День, ) КАК ОстаткиТоваровКомпанииОстатки
	|		ПО ВложенныйЗапрос.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
	|			И ВложенныйЗапрос.ТорговаяТочка = ОстаткиТоваровКомпанииОстатки.СкладКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ОптимальноеКоличествоНоменклатуры.СрезПоследних(&День, ) КАК ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних
	|		ПО ВложенныйЗапрос.Номенклатура = ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.Номенклатура
	|			И ВложенныйЗапрос.ТорговаяТочка.ТорговаяПлощадка = ТК_ОптимальноеКоличествоНоменклатурыСрезПоследних.ТорговаяПлощадка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.День КАК День,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ.ГруппаАБЦ КАК ГруппаАБЦ,
	|	ВТ.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ.ВитринаОстаток КАК ВитринаОстаток,
	|	ВТ.ПоДоговоруОстаток КАК ПоДоговоруОстаток,
	|	ВТ.Очищать КАК Очищать
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Очищать
	|	И ВТ.ГруппаАБЦ В(&ГруппаАБЦ)";
	
	Запрос.УстановитьПараметр("День", Объект.Дата);
	Запрос.УстановитьПараметр("ГруппаАБЦ", ГруппыАВС);
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("СкладКомпании", Объект.СкладыКомпании.Выгрузить(,"СкладКомпании"));
	
	ТаблицаОчищать = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка ИЗ ТаблицаЗаказов Цикл
		Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
			Если Строка[СтрокаТЧ.ИмяПоля] > 0 Тогда
				мОчищать = ТаблицаОчищать.НайтиСтроки(Новый Структура("Номенклатура,ТорговаяТочка",Строка.Номенклатура,СтрокаТЧ.СкладКомпании));
				Если мОчищать.Количество()>0 Тогда
					Строка[СтрокаТЧ.ИмяПоля] = 0;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ПересчитатьКоличествоПоСтроке(Строка, СоответствиеИменПолейСкладов);
		
		СтруктураДействий = Новый Структура;	
		ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);	
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиГруппАВС(Список, Параметры) Экспорт
	Если Список = Неопределено Тогда
		Сообщить("Отказ от выбора групп АВС.");
	Иначе
		ГруппыАВС = Новый СписокЗначений();
		Для каждого Элемент из Список Цикл
			Если Элемент.Пометка Тогда
				ГруппыАВС.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ГруппыАВС) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Надо было выбрать хоть что-то!!!");
			Возврат;
		Иначе
			КомандаОчиститьГруппуАВСНаСервере(ГруппыАВС);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьГруппуАВС(Команда)
	СписокВыбора = Новый СписокЗначений();     
	СписокВыбора.Добавить("A");
	СписокВыбора.Добавить("B");
	СписокВыбора.Добавить("C");
	СписокВыбора.Добавить("C1");
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиГруппАВС", ЭтаФорма); 
	СписокВыбора.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов,"Выберите группы АВС");
КонецПроцедуры

&НаСервере
Процедура КомандаПересчитатьВЯщикиНаСервере()
	Для Каждого Строка ИЗ ТаблицаЗаказов Цикл
		ЕдиницаИзмеренияЯщиков = Строка.Номенклатура.ЕдиницаИзмеренияЯщиков;
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияЯщиков) Тогда
			ТекКоэффициент = Строка.Коэффициент;
			КоэффициентЯщиков = Строка.Номенклатура.ЕдиницаИзмеренияЯщиков.Коэффициент;
			
			Строка.ЕдиницаИзмерения = ЕдиницаИзмеренияЯщиков;
			Строка.Коэффициент = КоэффициентЯщиков;
			
			Для Каждого СтрокаТЧ ИЗ Объект.СкладыКомпании Цикл
				ТекЗаказано = Строка[СтрокаТЧ.ИмяПоля];
				Если ТекЗаказано > 0 Тогда
					КоличествоВЯщиках = ТекЗаказано * ТекКоэффициент / КоэффициентЯщиков;
					Строка[СтрокаТЧ.ИмяПоля] = КоличествоВЯщиках;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
		ПересчитатьКоличествоПоСтроке(Строка, СоответствиеИменПолейСкладов);
		
		//СтруктураДействий = Новый Структура;	
		//ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
		//
		//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);	
	КонецЦикла;
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьВЯщики(Команда)
	КомандаПересчитатьВЯщикиНаСервере();
КонецПроцедуры








#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
